{"title":"SNAPTAIN SP310 Mini Drone for Kids, Throw’n Go RC Quadcopter for Beginners w/ 3D Flips, Altitude Hold, Headless Mode, Speed Adjustment, One Key Return and Portable Controller Box","manufacturer":"SNAPTAIN","currentPrice":false,"rating":"4.6 out of 5 stars","totalRatings":"113 ratings","features":["\n         Make sure this fits\n                by entering your model number.\n        \n","🛩️YOUR DRONE YOUR WAY - SNAPTAIN SP310 portable mini drone for kids and beginners fulfills few ways to take off. The Newest Way - Throw the drone into the air to take off. The Ordinary Operations - One key take off on the controller box, or joystick take off. More choices to start your flight tour!","🛩️LIMITLESS CHARMING ADVENTURE - Two detachable batteries make a great longer journey up to 14 minutes extend flight time. No confusion in identifying directions under headless mode. Three levels variable speed cater to all flyers, no matter kids, beginners or skilled users.","🛩️EXCELLENT FLIGHT SHOW - SNAPTAIN SP310 RC quadcopter do stunts with 3D flips function deliver impressive air flight shows. Just one button and assign a direction with right joystick to make the performance on. 360° rolling function add more fun that do not limit the direction of forward.","🛩️STABLE FLIGHT PERFORMANCE - Altitude hold function enables to auto-hovering at a fixed height. Subtle adjustment with trimming buttons make flight more controllable. Enhanced stable performance lets kids and beginners easier to enjoy the fun of flight with SNAPTAIN SP310 mini drone.","🛩️ALL IN ONE PORTABLE BOX - SNAPTAIN SP310 portable pocket drone with simple appearance design and all in one portable box. Customized drone cabin and accessories storehouse save more space that you can put into your pocket or bag. Popular little item to complete your fashion."],"reviewsAspects":["mini drone","flight time","little drone","controller box","easy to use","easy to control","highly recommend","battery life","landing gear","around the house","old son","altitude hold","remote control","easy to operate","son loves","battery lasts","easy to fly","much better","exceeded my expectations","comes with 2 batteries"],"productInformation":[{"Product Dimensions":"3.5 x 3.5 x 1 inches"},{"Item Weight":"0.96 ounces"},{"Shipping Weight":"14.4 ounces (View shipping rates and policies)"},{"ASIN":"B07T11J2VW"},{"Manufacturer recommended age":"14 years and up"},{"Batteries":"2 Lithium ion batteries required. (included)"},{"Best Sellers Rank":"#49,114 in Toys & Games (See Top 100 in Toys & Games)\n#269 in Hobby RC Quadcopters & Multirotors\n"},{"Customer Reviews":"4.6 out of 5 stars\n    113 ratings\n4.6 out of 5 stars"}],"productDescription":["Ideal Entertainment with Kids, Families and Friends.","Throw the drone up with the power of arm gently into the air to take off. Make sure there is enough space while throwing the drone up.","\n            Altitude hold function enables to auto-hovering at a fixed height. Subtle adjustment with trimming buttons make flight more controllable.\n        ","\n            Just press the Headless button to active the funtion. No confusion in identifying directions under headless mode. Enjoy the fun of flight!\n        ","\n            Press the return button and the SNAPTAIN SP310 mini drone will fly towards its back following a path that parallels with its original take-off path.\n        ","\n","\n","\n","Four anti-collision protective guards protect the propellers from damage. Do not touch the drone with hand directly while the drone is flying.","The LED indicator allows you to accurately capture your drone in the dark, and blink continuously when the drone is running out of power.","With simple appearance design. Customized drone cabin and accessories storehouse save more space that you can put into your pocket or bag.","1）Read the User Manual Carefully before Use.","2）Do not Launch the Drone at People or Animals.","3）Recommend to Fly Indoors or Windless Weather."],"reviews":[{"reviewerName":"John","rating":"5.0 out of 5 stars","reviewTitle":"fun little beginner drone","reviewDate":"July 15, 2019","reviewText":"The drone came in a well packaged box with manual/controller/ and accessories such as landing gear, prop guards, extra blades, 2 drone batteries, USB charger for the batteries, and a small screwdriver. The controller will require 2 AA batteries which is not provided. Drone body is about 2 inches side to side and about 1 inch tall without the prop guards and landing gear installed. Everything is fairly easy to put together. Accessories pop into little notches on the frame. Drone battery takes a little effort to get into the frame if you have large fingers but it's manageable.\n\nDrone batteries took about 40 minutes to charge. Once charged up, I got about 10 minutes of flight time per battery. If you've ever flown any toy drones before, you will be able to fly this really easily. If not, no big deal. The little drone is so light weight that if you crash it, it'll probably not take much damage.\n\nThe controller has a place to store the drone and accessories. Also fits well in the hands and easy to operate. Button on the top left of controller controls how fast the drone can fly. Button on top right is for doing flips. All four trim controls are underneath the right control stick and the take-off/land buttons are underneath the left controls stick.\n\nOverall, I like this little drone. Fun toy to play around with in the house and will likely give it to my little nephew before letting him touch my DJI drone."},{"reviewerName":"Kelly","rating":"5.0 out of 5 stars","reviewTitle":"I was pleasantly surprised with the quality of this drone.","reviewDate":"August 1, 2019","reviewText":" Got this drone for my 7 year old boy.\n\nAfter much research I decided on this one because of its size, features and simplicity for kids.\nIt came nicely packaged and set up was simple.\nIt does require a little calibration to get it to hover in one place, but that is to be expected.He was delighted with it and was soon flying it around the house like a pro.\n\nHe really loves it! Never seen him so excited this much about a toy before.\nI have to say I enjoy using it in the yard with him also. Best buy, excellent product and good price for the product.\n\nWould definitely recommend."},{"reviewerName":"Kate","rating":"5.0 out of 5 stars","reviewTitle":"Great little cheap drone for kids.  ","reviewDate":"July 11, 2019","reviewText":" It's easy to use and surprisingly good quality for the price. The one touch take off and landing makes it really easy for him to get it in the air. He likes the new take-off way that called \"throw to go\", just throw the drone into the air with your wrist power and the drone will take off automatically. Headless mode is also great and removes confusion over which way to move the steering stick depending on the orientation of the drone. With a little practice he was able to confidently fly it in and around the house.\nSome tips: Be safety, accompany your young children to playing the drone and give them right guidance. Outside is obviously more fun, but the mini drone does get easily carried by the wind so be careful and make sure you have plenty of space."},{"reviewerName":"Emma","rating":"5.0 out of 5 stars","reviewTitle":"Awesomeness incarnate. The SNAPTAIN mini drone for kids!","reviewDate":"July 14, 2019","reviewText":" My child is into drones now so I invested in one more drone and so far this is my favourite! This SNAPTAIN SP310 mini drone is a inexpensive toy, and a wonderful gift for kids. With beautiful simple appearance and easy to control, and the instruction is easy to understand. I would not really recommend this for outdoor flying in anything but the lightest of breezes or calm days, or you can adjust to the third speed for better control. Well, it depends you, lol. My 7 year old is mastering the flight of the drone which is a testament to the ease of use after getting accustomed to the controls. This RC quadcopter is very stable and is ideal for indoor flying particularly with the integral, prop guards. These prove very effective at protecting the props and you are unlikely to need the spare ones that they provide. Despite the abuse it still flying fine and nothing broken off. It comes with 2 batteries means it is easier to recharge one while using the other, and longer flying time. Kids love it and have so much fun. It is small, so perfect for little ones. A lot of stunts make kids happy, throw'n go is the most special and is our favourite. 3D flip also makes it much more fun. Uh... i have taken a short video at my frontdoor and want to show you guys something about this SNAPTAIN SP310 mini 4-axis drone, hope you will like it as i do. That's all, a definitely wonderful mini drone for kids! Just get one and catch happy."},{"reviewerName":"Customer","rating":"5.0 out of 5 stars","reviewTitle":"This is a tiny drone","reviewDate":"August 16, 2019","reviewText":" Bought DJI mavic and kid want to try it... you know that is too expensive to crash, then I bought this tiny one.\nVideo is the “3D flip” which is pretty cool."},{"reviewerName":"J","rating":"5.0 out of 5 stars","reviewTitle":"Great mini drone for kids and beginners. Love this beautiful and fun little gadget so much!","reviewDate":"July 24, 2019","reviewText":"I have been wanting one drone for months and finally got one. It's so much more fun than I thought. I have been playing this SNAPTAIN SP310 mini drone with my 10 years old little boy, he loves it and controls it really well after playing with it several times.\n\nThis mini drone looks quite small but exquisite, and comes with a controller box in simple design, easy to operate and also very responsive. It took us few goes to learn to fly this, as it says that designed for kids and beginners.\n\nWhat surprised me most is throw to fly. I just need throw the little drone up into the air that it will automatic fly and hovering at a fixed height, but i tried several times to find the proper strength to throw it. Of course you need to pair and calibrate the drone with your remote before you throw it. I would recommend you guys to horizontal put the drone on your hand and then throw the drone vertical upward gently at begins until that you are familiar with it.\n\nYou can also use the supplied remote box to control the drone. This drone is more suitable for kids and beginners which has the one-key that beginners need, one key take off and one key landing. Or you can take off by using the joystick as well. It's your choice, lol.\n\nThe battery is very easy to slip in and out and charge, you simply plug in the supplied micro-USB cable. SNAPTAIN supplies 2 batteries to extend the flying tour time. It took me about 32minutes to full recharge the battery. I have not confirmed the longest flying time yet, but I will.\n\nBy the way, I would recommend to try indoor for first fly, especially not great to fly this mini drone in a windy weather, I put this down to it being so tiny, but it's amazing when the weather it's good, controls are easy. My little boy has used it indoor so far and can control it very well, so did I. Quality is good as I crashed it few times and no damage was done. It’s worth ago.\n\nI will suggest you to read the instruction clearly before you first flying. A detailed instruction manual is included, but I found the best way to learn is by doing. There are still many skills that require me to practice more, such as 3D flips, headless mode, on key return and so on.\n\nSo to sum up, a really good mini drone to start you off in this fascinating hobby."},{"reviewerName":"Hass A.","rating":"5.0 out of 5 stars","reviewTitle":"Love this little beast! Nice drone with awesome features!","reviewDate":"July 8, 2019","reviewText":"It arrives packaged well in a small box containing a mini drone in a remote controller box, two rechargeable batteries, USB charger, instruction, spare set of accessories. With two rechargeable batteries that you can enjoy a longer flight tour!\nSome may say that the drone is super light, but all drones are light to save power consumption and weight giving you more flight time. The build quality is excellent and although I've had a few accidents bumping and crashing its not fallen to bits which is a testament to the build quality. It can bring a lot of fun not only to children but also some adults, maybe it is difficult to operate at the beginning, but if you read the instruction carefully and practise more, it will be easy to control then. Since the drone is kept in the controller box, it is convenient to take everywhere. It took me about 15-20 minutes to master the controls and having this little guy zipping around the room, performing flips, zipping it through doorways and harassing the dog(be safe, don't hurt pets or people). I tried tens of drones and most of them can be put into the bin. But this little thing for this ridiculous price is really good. Of course it is not a comparison to a professional drone, but it brings me much great fun!"},{"reviewerName":"Jackie Peng","rating":"5.0 out of 5 stars","reviewTitle":"Brilliant little RC quadcopter. A great kid for my son! He absolutely loves it!","reviewDate":"July 5, 2019","reviewText":" Before I gave it to him, I had to test it (of course). To my surprise, it flew very well and now I'm thinking of ordering one for myself!!\n\nThe drone is essentially quite stable and responds well to the controller. Headless mode is also available and I think this is what makes it so easy to fly, no worries about direction, just push the stick the way you want the drone to go. There is a LED indicator the front which is quite bright make for easy orientation.\n\nThe SP310 mini drone has three speed rates. I started at the low speed, and once I had got the hang of balancing the throttle at the same time as changing direction I moved in to the higher rate mode, where it really comes in to its own. If you need it to, it will literally whip round on the spot and really pick up some impressive speed.\n\nWe have used it outside to learn more skills and it goes really well. It does take time to learn to fly but as I say it really is good fun for me and my children to have some time flying. My boy loves the 3D flip most, it just needs one button pressed and assign a direction with the joystick to complete the show. The performance is stable and smooth, better than the drone I bought for myself last month, much better!\n\nOnce the battery is low, the LED indicator will slowly flash giving you sufficient warning to bring the quadcopter back down again. The two rechargeable batteries could extend the flight, but you would be advised to buy a couple of spare batteries as the charging time for each battery will feel like an eternity when you are waiting to fly.\n\nThis drone is perfect for those who just want to play, which is exactly what we required. Great for kids and great value for the money. Got a kid interested in flight or RC? GET THIS!"},{"reviewerName":"Tom Choi","rating":"5.0 out of 5 stars","reviewTitle":"Great drone for kids.","reviewDate":"July 24, 2019","reviewText":"I had been looking for a suitable indoor drone for my 6 year old son until meet SNAPTAIN sp310.Really good build quality.Diverse Way to take off,that makes the start more funny.It flies smoothly but will take some practice if this is you first drone.This mini drone has a great flight time with two batteries,and most importantly charging quickly.the remote control is nice and responsive. THe controls are easy and intuitive. some drones are very complicated with loads of buttons,options and settings The SP310 is simple to use and easy to operate perfect for a small child.My son like the 3D flip function most .the drone came included with some spare parts should there be any bad crashes. all in all my son loves it and I would definitely recommend this mini drone for kids."},{"reviewerName":"qifang","rating":"5.0 out of 5 stars","reviewTitle":"Absolute stunner and best experience with the box.","reviewDate":"August 3, 2019","reviewText":"I am personally very much into drones. This time, a compact drone, SNAPTAIN SP310 mini drone has caught my eye.\nThe little drone surprised me with the \"throw'n go\". I think it is interesting to toss this mini drone into the air to start a flight. Another thing that made me happy is the controller box. My previous drones had bulky controllers which were nice, but this looks and feels so much better. Additionally, the portable controller box provides much better portability. I can almost fit it in my looser trousers pocket. Overall, the remote feels pleasant to hold and responds well to action which in my opinion is most important about a controller.\nThis drone is easy to use and set up. It is recommended for kids and beginners, but I think everyone would be able to start using it quickly. The battery lasts rather long, exactly as long as described by the seller in this matter, which is quite impressive for a drone of this size. Overall, I think it is a very nice drone for a decent price and I am happy with my purchase."},{"reviewerName":"KEVLAR","rating":"5.0 out of 5 stars","reviewTitle":"A great INDOOR drone. You CAN switch/ use multiple batteries!!","reviewDate":"September 19, 2019","reviewText":"TLDR: You can switch out multiple batteries to extend flight time in between charging times. Comes with 2 batteries and a charger that charges both simultaneously, an accessories kit, and screwdriver.\n\nWhen I decide to write reviews, I try to focus them on issues or concerns a may have had personally. When I viewed (And read other reviews about) this drone, I didn’t see anything about using batteries - other than that the battery life was great! Well, that’s all well and good, but I don’t want to HAVE to wait 40 minutes for an internal (Non-switchable) battery to charge in between EVERY 12-15 minutes of use. I want a drone where I can buy 4-5 batteries, charge them all, then switch one out after another as they are discharged. This way, I can get closer to 60 minutes of flight time when I go out to fly the drone. This IS that kind of drone!! Don’t get me wrong - You still need to use certain batteries in this drone (Connectors, voltage), but at least using multiple batteries is an option.\nSo... Is this drone as great as they say, or does the company harass and bribe you into leaving a positive review (Like others I’ve dealt with!)? Absolutely not!! Do they want you to leave an honest review? Absolutely - After all, that’s how sellers promote the credibility of their products! Nowhere in the “Extra” literature does it ask you to leave a “Positive” review. It merely asks to “Share your experience by leaving an honest review” (Verbatim).\nIs this drone going to be everything to all people? Unlikely. After all, that’s simply an impossibility! Does it do what it claims to do, when you want it to do it? Yes!! This is NOT an “Outdoor” drone! No drone this size is. They’re simply too light! They will drift in ANY wind.\nHowever... If you’re new to the hobby, and want a reliable drone that has switchable batteries (GREAT flight times in between charges), is highly mobile, has some easy to implement tricks, and is backed by a company that realizes the impact of a happy consumer, this drone will definitely fit the bill. The remote control even has a space on the underside where you can store some extra props and an extra battery!\nI own several drones, ranging in price from $20.00 to over $3,000.00 and I’ve found this to be a lot of fun indoors and very useful to help raise my kids’ experience with drones without concern over cost or damage potential."},{"reviewerName":"wei chen","rating":"5.0 out of 5 stars","reviewTitle":"Great compact and lightweight mini drone!","reviewDate":"August 6, 2019","reviewText":"I got this for my nephew as a starter drone. Picking up the drone for the first time it is amazing how small it is. It comes with two batteries, controller box, USB charging cable, propeller protector, additional propellers and user manual. The controller box is nice and sleek. After charging the battery, setting up to fly is simple. Turn drone on first, then the controller box. It is an easy to fly drone with good altitude hold and responds to changes. There is a button to choose three modes on the remote: slow, medium and fast. Fly indoors in slow mode and fast in open outdoor spaces. Flight time is around 10-15 minutes depending how aggressively you fly it. It actually flies very fast once you get a bit of practice. Overall very happy with the mini quadcopter! I would recommend this drone as a good starter."},{"reviewerName":"Steve","rating":"5.0 out of 5 stars","reviewTitle":"Gerat Little Mini Quad!","reviewDate":"July 30, 2019","reviewText":"This little mini drone is a lot of fun. For the size and price it performs great. It has three speeds so it handles very well indoors or outdoors. The drone also has altitude hold so it is easy for beginners to operate. I also like the compact size which make it easy to transport and fly almost anywhere."},{"reviewerName":"Yayama","rating":"5.0 out of 5 stars","reviewTitle":"I am happy with the quality of this drone.","reviewDate":"August 15, 2019","reviewText":"Got this drone for my 9 year old girl. After much research I decided on this one because of its size, features and simplicity for kids. It came nicely packaged and set up was simple. It does require a little calibration to get it to hover in one place, but that is to be expected.She was delighted with it and was soon flying it around the house like a pro. Never seen her so excited this much about a toy before. I have to say I enjoy using it in the yard with her also. Best buy, excellent product and good price for the product. Would definitely recommend."},{"reviewerName":"John","rating":"5.0 out of 5 stars","reviewTitle":"Highly recommend for beginners.","reviewDate":"August 24, 2019","reviewText":"This is a great drone for the money. It is easy to fly for a beginner and still interesting enough for more accomplished users to have some fun.\nI was surprised at how robust the drone was, particularly in the early days whilst my son was learning how to fly and crashed multiple times. It took a real beating and survived with no problems whatsoever, so clearly it's well built. Highly recommend this for someone exploring drones, casual users or for kids. It's the ideal drone for beginners, kids or families."},{"reviewerName":"Cheng-Hsin Lu","rating":"5.0 out of 5 stars","reviewTitle":"3D Flips Mini Drone for Kids","reviewDate":"September 7, 2019","reviewText":"This is the first 3D Flips Mini Drone I have. I did have a mini RC helicopter before. The 3D Flips function of this 4-axis flyer definitely makes it more fun to play with compared to traditional RC helicopter. It comes with all the accessories you need like extra Li-ion battery, screw driver, spare rotor blades, spare protective blade guards and spare landing skids. All of these accessories can actually fit in the back compartments of the controller. The drone itself can fit in the controller as well (but need to remove the protective blade guards and landing skids). One thing worth noting is that it is a bit difficult to get the Li-ion battery in/out the drone because the battery and the drone are both so tiny. Prepare a pair of tweezers with you may save you a lot of time taking the battery out or putting it in. Just like any other RC helicopters, a little bit practice is required if you want to play it in a tiny confined area without collision. You can first play it outdoor to avoid crashing it into your wall. Once you learn how to play it is a lot of fun, not difficult to master it at all for beginners like me."},{"reviewerName":"Denno Jaramillo","rating":"5.0 out of 5 stars","reviewTitle":"Love this drone!!","reviewDate":"October 8, 2019","reviewText":"Blades are constantly flying off, as well as the blade guards and even the landing gear. Other than that this is a awesome little drone. Quick responsive and you get decent flight time. Would be my favorite mini drone if the blade's would stay on.\nUpdate: after reading my review snaptain customer service reached out to me and offered to send me another drone. The second drone they sent performs a whole lot better! In fact the blades haven't flown off at all. This thing is so fast and agile, I LOVE it! Snaptain customer service is stellar as well.."},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"really cool and useful gadget","reviewDate":"August 3, 2019","reviewText":"I've bought another mini drone in the past and I much prefer this one. It came in a box that's easy to carry the remote, spare blades and drone itself. It flies high and is easy to control with the remote provided. The controls are reasonably responsive, especially since I had to adjust for drifting. Fortunately the controller has trim-adjuster buttons. A portable remote box & a set of replacement blades is really nice. Good price point and battery length I’d say is good as well."},{"reviewerName":"Desmond","rating":"5.0 out of 5 stars","reviewTitle":"It is fun and easy to handle","reviewDate":"July 15, 2019","reviewText":"I am surprised that's how easy to control and fun. I am flying this in my office Warehouse , I have crushed couple time , because I don't know where is the front . However , I found out the front is the LED side ( maybe you guys already know) , it come with 2 packs of battery , approx 8-12 mins for each battery. Not bad with this price , good for buying one to practice before you are buying a expensive one."},{"reviewerName":"AnatoliiK","rating":"5.0 out of 5 stars","reviewTitle":"Great drone for beginner!","reviewDate":"November 10, 2019","reviewText":"My kid received this drone for his 9th birthday and was very happy with it. He mastered controls pretty fast and was able to play with it quite soon. Drone crashed several times our walls and floor - but it sturdy and survived falls without an issue. Sometimes vents off and had to be reattached - but that it. He loved it and played each day before drone was lost on the roof of a community center.\nHighly recommended!"},{"reviewerName":"Cj","rating":"5.0 out of 5 stars","reviewTitle":"Perfect drone for young beginners","reviewDate":"October 6, 2019","reviewText":"I purchased this drone for my 7 year old son. With my help he was able to learn how to fly it in on his own after a few tries and crashes. Now he is flying it around house like a real pro. His favorite part is doing flips with the easy to use 3D flip button. He is even able to change and charge the batteries on his own. I have never seen him so happy and excited about a toy before. Mastering this drone has given him a real sense of accomplishment.\n\nThis drone is very robust. We have had some good crashes that have caused the blades to pop off. However, all we had to do was snap the blades back on and we were ready to go again.\n\nWe are very happy with this drone. It has far exceeded our expectations. A great product for a great price."},{"reviewerName":"golivenkata","rating":"5.0 out of 5 stars","reviewTitle":"Fun thing to play for a reasonable price.","reviewDate":"July 26, 2019","reviewText":"This is my first drone. I enjoyed a lot while using it. I thought of using it directly without using the manual but I ended up using the manual to operate. The instructions are very clear. It came with extra blades and landing gear and also with extra battery. You can charge both the batteries at the same time. Flight time is around 10 min. One key to takeoff is awesome. It’s really good for kids."},{"reviewerName":"Ke Nan","rating":"5.0 out of 5 stars","reviewTitle":"Great little drone for beginners. Happy with my purchase.","reviewDate":"August 6, 2019","reviewText":"Easy enough to fly and a good size so you can still see it in the air but doesn’t take up loads of space in the house. The controls are very is to master. I managed to learn to fly it indoors in a matter of minutes. It also comes with a spare set of propellers which is great incase you manage to damage any of them. It comes with 2 batteries which is great because you can have twice the fun between recharging.\nOverall I'd say it's a good entry purchase into drones for learning to fly one. A forgiving one and honestly don't feel too troubled at the prospect of losing/destroying it like I would with a more expensive one."},{"reviewerName":"David","rating":"4.0 out of 5 stars","reviewTitle":"Not for beginners","reviewDate":"October 14, 2019","reviewText":"I ordered this to have on vacation and unfortunately the one I received was defective. Received a new one quickly and this one actually works. Has a lot of power for a tiny little drone but I’d say it’s definitely not for beginners. It’s got quite a few buttons and tricks it can do once you get it down but not for newbies. Overall it’s a cool product."},{"reviewerName":"Mike F.","rating":"5.0 out of 5 stars","reviewTitle":"Sweet flyin' little drone.","reviewDate":"August 16, 2019","reviewText":"UPDATE: The seller read my review (below) and contacted me asking for a chance to make things right. They offered to send me a replacement drone. I was very surprised and pleased that a company would go to this extent to stand behind their product! Of course I accepted their offer. The brand new replacement drone arrived today. I have already taken it for a test flight. This is a sweet flyin' little drone! I'm glad I get to continue enjoying it.\n\nInitially I liked this little drone. It flew well with decent battery life. However, I would not recommend it for beginners. A couple of minor crashes and one of the prop shafts broke rendering it useless. These were not full speed crashes, but rather low speed bumps against the wall. It didn't even last me 24 hours."},{"reviewerName":"li_rapo","rating":"5.0 out of 5 stars","reviewTitle":"Cute and works well","reviewDate":"September 5, 2019","reviewText":"This is a great pocket size drone. It’s easy to maneuver and fun for kids and adults alike. The drone is very sleek looking and I like that it has the propeller guards just in case I bump to the wall. The remote control is very sensitive and easy to control. Lots of fun and awesome. It won't get in much trouble for kids and beginners."},{"reviewerName":"Linda Staten","rating":"5.0 out of 5 stars","reviewTitle":"The product is well packaged and comes with easy to follow instructions. A great buy.","reviewDate":"July 29, 2019","reviewText":"I bought this for the use of a complete beginner, I wasn't expecting much because it was rather cheap, and it really surprised me, it was rather easy to use so I could handle it well, however it completely exceeded my expectations, the battery lasts for a reasonable amount of time and the remote control was easy to use and comfortable to handle. The portable controller box is really a brilliant design that i can take this drone with me, over all I highly recommend and will also be buying another as a gift for my brother."},{"reviewerName":"jennie scott","rating":"4.0 out of 5 stars","reviewTitle":"Great drone for the price","reviewDate":"July 23, 2019","reviewText":"I really like how small it is, it’s a fun little drone to fly around the house, the functions all work pretty well, the altitude hold is really nice for new learners or just stable flying."},{"reviewerName":"jerry","rating":"5.0 out of 5 stars","reviewTitle":"An interesting drone","reviewDate":"July 19, 2019","reviewText":"I like this drone, but it make some noise. It can fly very high, flip 360, and fly very smoothly. It can fly for five minutes at a time with one battery. So I parallelled two batteries, which added drone weight but increased the flight time to 10 minutes."},{"reviewerName":"Sweet83","rating":"5.0 out of 5 stars","reviewTitle":"Snaptain drones","reviewDate":"August 13, 2019","reviewText":"Easy to fly with nice features like auto takeoff and landing. So far has been durable. Once the propellers get knocked off they don’t seem to spin correctly any more, but it does come with a few spares. I bought 2 and they both fly and charge correctly. Would recommend."},{"reviewerName":"Dennis","rating":"5.0 out of 5 stars","reviewTitle":"I love it.","reviewDate":"August 5, 2019","reviewText":"Such a small thing can be made so delicate. The handle is designed to be comfortable and powerful. Easy to operate, only 30 minutes of charging can be used for a long time. And the instructions are in many languages."},{"reviewerName":"Jennifer Cummins","rating":"5.0 out of 5 stars","reviewTitle":"Great for beginners!","reviewDate":"August 6, 2019","reviewText":"We love this drone. My almost 7 year old son has been begging for one for a long time now. We let him pick out the one he wanted, he decided on this one. He liked the battery life, it was longer than other we have looked at. After using it for a few days, I notice it is easy for him to 'fix' if it has run into a wall or had a crash landing. Great beginner drone."},{"reviewerName":"T. Reid","rating":"5.0 out of 5 stars","reviewTitle":"A fantastic drone for kids and beginners.","reviewDate":"September 20, 2019","reviewText":"This drone is packed with features and I would highly recommend it for beginners or kids. The battery life is good and the drone is very maneuverable with the controller. My kids like to fly this drone over our more expensive drones we own. That says a lot!"},{"reviewerName":"Jessica Weaver","rating":"5.0 out of 5 stars","reviewTitle":"Fantastic drone for beginners!","reviewDate":"August 13, 2019","reviewText":"Amazing mini drone. This was my first time flying a drone, and the pairing/calibration was very easy. Had it up and flying in no time. So cool that it does flips! And very easy to handle. Love that the drone fits inside the control.\n\nDrone is also surprisingly durable. Had a couple of rough landings, and the drone held up just fine. Also, very nice that two batteries are include.\n\nHighly recommend for a starter drone. So much fun!!"},{"reviewerName":"Sean Gaddy","rating":"5.0 out of 5 stars","reviewTitle":"Fun indoor drone frame design with good flight time. Safe around kids with prop gards.","reviewDate":"October 9, 2019","reviewText":"awesome little drone that will give you your moneys worth. would be nice to have the controller charge the extra battery while stored in remote but dont take long to charge with the multi battery usb charger."},{"reviewerName":"Jen","rating":"5.0 out of 5 stars","reviewTitle":"Amazing drone for beginner","reviewDate":"September 11, 2019","reviewText":"Super awesome drone for beginner. I bought this drone for my 6 years old son. It’s easy for him to learn and control. Price is reasonable. It comes with spare blades, battery and screwdriver."},{"reviewerName":":)","rating":"5.0 out of 5 stars","reviewTitle":"Compact and easy","reviewDate":"August 4, 2019","reviewText":"Item came quickly and upon opening, setup was easy and includes an extra battery. Item is very compact and drone fits into remote for easy storage. Easy to handle just don’t lose it out if your sight. Kid loves it"},{"reviewerName":"Chang Z.","rating":"5.0 out of 5 stars","reviewTitle":"Like it","reviewDate":"September 8, 2019","reviewText":"Let the children experience the feeling of the remote control plane in the yard. The children and dads are more happy than the children. Adults and children like it."},{"reviewerName":"moriaty","rating":"5.0 out of 5 stars","reviewTitle":"it's funny","reviewDate":"July 12, 2019","reviewText":"It's a fresh and funny toy for my daughter, she always wants me to fly the drone, although sometimes she will be scared by the strong wind when the drone takes off, but she loves to see the drone flying in the sky. but it's a little difficult for me to control the direction of the drone, maybe I need practice more!"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"A very good product","reviewDate":"August 7, 2019","reviewText":"I bought this drone for my friend's kid as a gift. It can easily take off in the windless day and can be easily controlled by the controller box. He told me that he likes this toy very much."},{"reviewerName":"Lucas L Rief","rating":"4.0 out of 5 stars","reviewTitle":"Bigger than I expected","reviewDate":"October 2, 2019","reviewText":"I've bought a mini drone before, but this drone is much larger. This was a good surprise and it is much faster and more fun to play with than our last drone. My kids are 5 and 7, and this drone will be a lot of fun for them, but the small battery connections and detachable propeller guards and landing feet are hard for them to connect by themselves so they will always need help when playing with it."},{"reviewerName":"Yan L","rating":"5.0 out of 5 stars","reviewTitle":"fun toy for adult as well","reviewDate":"September 7, 2019","reviewText":"Do not want to spend thousand on those pro drones. This is very fun toy for my husband and kids."},{"reviewerName":"Tam","rating":"5.0 out of 5 stars","reviewTitle":"Very good product.","reviewDate":"August 6, 2019","reviewText":" It is really nice, the control is easy to set up, hight speed on propeller, and it fly fast too, my son really love it, control take off and landing is easy.just press button and it do by itself."},{"reviewerName":"Ran Niu","rating":"5.0 out of 5 stars","reviewTitle":"funny toy","reviewDate":"July 16, 2019","reviewText":"It is a nice and interesting toy to play with both for the kid and the adult. I like to play with it."},{"reviewerName":"Robert Dunaway","rating":"5.0 out of 5 stars","reviewTitle":"Great Buy, perfect to learn","reviewDate":"September 17, 2019","reviewText":"My nephew wanted to fly my DJI, I love him but he's 7 years old, he was really upset so I told him I would get him his own. This would be the 3rd drone he's had, so I went cheap this time. Best choice ever this drone is awesome. It is very stable in hover mode as long as there is no wind. Even if you hit something as long as you can find the props they still work."},{"reviewerName":"Peng","rating":"5.0 out of 5 stars","reviewTitle":"Suitable for beginners","reviewDate":"August 11, 2019","reviewText":"This mini drone is suitable for beginners. It is easy to operate and it can fly very smoothly. Flight speed and direction can be easily controlled."},{"reviewerName":"Brandon","rating":"4.0 out of 5 stars","reviewTitle":"For first time drone user","reviewDate":"September 10, 2019","reviewText":"I like this lil drone to a point...fun to operate but the attachments landing gear and wing guards fall off constantly...should be able to insert small screw and tighten to bade of drone...fun for my boy once I learn it a little more...so company sent me another drone more kid safe still. Working to learn to fly it but way more durable for the boy...thankyou"},{"reviewerName":"Steve","rating":"5.0 out of 5 stars","reviewTitle":"Awesome drone!","reviewDate":"October 26, 2019","reviewText":"Really easy to learn and everything fits into the remote control.\nBetter than the Snaptain H823!\nRan into a few walls and it still works great! Sometimes the propellers come off when it crashes, but it's easy to re-install. Highly recommended!\nNote: this is from an 11 year old."},{"reviewerName":"Clayderman","rating":"5.0 out of 5 stars","reviewTitle":"Easy to handle","reviewDate":"July 30, 2019","reviewText":"The drone is pocket size and easy to carry. Meanwhile it is very easy to handle and there is a headlight on the upper side of it to help you find it at night or swirl it."},{"reviewerName":"Kuntai Kim","rating":"4.0 out of 5 stars","reviewTitle":"Great gift for kids","reviewDate":"August 18, 2019","reviewText":"I bought this as a present for my child. It seems pretty easy to use and she seems to get the hang of it fairly quickly. She even did a 360 degree flip on the first try! We had to charge it after we first opened it but it finished charging in about 10 minutes. Would definitely recommend for kids."},{"reviewerName":"Vinod Bhagchandani","rating":"5.0 out of 5 stars","reviewTitle":"Fun to play for both Kids and Adults","reviewDate":"October 6, 2019","reviewText":"This drone is really a fun to play indoor for both Kids and adults. Its very stable and maneuverability is pretty cool with its remote. The additional battery comes very handy when you want to extend the play time and the drone storage in remote is very useful to carry it around. A great drone for an indoor play."},{"reviewerName":"Kathryn","rating":"5.0 out of 5 stars","reviewTitle":"Good little drone for the money","reviewDate":"August 18, 2019","reviewText":"good drone, liked the fact that it was ready to go right out of the box and that it came with 2 batteries. pretty good battery life as well. It was a little tricky at first, but once you get used to the controls it was pretty easy for my 8 yr old son to fly! Would recommend!"},{"reviewerName":"Carrie","rating":"2.0 out of 5 stars","reviewTitle":"Fun for a few hours","reviewDate":"October 22, 2019","reviewText":"They are basically very disposable. Mine was quite fun at first however it died very quickly. I would say the truth of the matter is many of these reviews are artificially inflated the company will offer you free items and such."},{"reviewerName":"Joel Flores Batista","rating":"1.0 out of 5 stars","reviewTitle":"Bad","reviewDate":"October 30, 2019","reviewText":"Bad"},{"reviewerName":"Thurman Frazier","rating":"5.0 out of 5 stars","reviewTitle":"satisfied","reviewDate":"September 19, 2019","reviewText":"Very nice"},{"reviewerName":"Adilya","rating":"5.0 out of 5 stars","reviewTitle":"Best value for price, easy to operate","reviewDate":"August 7, 2019","reviewText":"I like how easy it is to get the sense of control and the initial setup is pretty straightforward as well. The drone is very light and compact. 3D flip and return home come espicically handy for the drone beginners. Plus, color was important for me too - and I enjoy it a lot."},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"perfect item","reviewDate":"September 15, 2019","reviewText":"this is a perfect toy for younger kids. I just bought this compact drone for my son. It is pretty easy to control and he has zoomed this drone up and down around the apartment."},{"reviewerName":"Paul Waln","rating":"5.0 out of 5 stars","reviewTitle":"Fun to fly","reviewDate":"September 18, 2019","reviewText":"This is a great drone to learn on. It is very durable and fun to fly."},{"reviewerName":"Jeff Fiedler","rating":"5.0 out of 5 stars","reviewTitle":"Great to take along anywhere !","reviewDate":"July 21, 2019","reviewText":"This SP310 is a sweet little quad whith everything fitting in the remote and two batteries ! Another great Snaptain product !"},{"reviewerName":"Maya","rating":"4.0 out of 5 stars","reviewTitle":"Very fun","reviewDate":"September 24, 2019","reviewText":"My son loves this toy very much. It is really easy for him to control and play it. We had lots of fun."},{"reviewerName":"Jupiter","rating":"5.0 out of 5 stars","reviewTitle":"Good mini drone, easy to fly!","reviewDate":"September 4, 2019","reviewText":"I bought this mini drone for my daughter. Nice design and good material. It fell on the floor a few times but no damage. My daughter really likes it! Happy with this purchase!"},{"reviewerName":"cba","rating":"5.0 out of 5 stars","reviewTitle":"Fun little drone","reviewDate":"November 10, 2019","reviewText":"Great little drone. Easy to fly and easy to control. However, it crashed after a few weeks and the rotor shat bent and now it won't fly. Other than that it was fun while it lasted."},{"reviewerName":"Hoiam A","rating":"5.0 out of 5 stars","reviewTitle":"Nice","reviewDate":"August 5, 2019","reviewText":"Really nice product! I bought this for my son and he absolutely loved it. I even found myself playing with it! I would highly recommend this. It's tons of fun (even for adults :) )."},{"reviewerName":"Ronnie","rating":"5.0 out of 5 stars","reviewTitle":"Fun; good for kids","reviewDate":"October 3, 2019","reviewText":"My grandson (and his dad) really enjoy this drone. It works well, and is a bit challenging at first to control, but they figured it out pretty quickly. It works inside and out!"},{"reviewerName":"Nicole","rating":"5.0 out of 5 stars","reviewTitle":"Good drone for the price, happy!","reviewDate":"August 23, 2019","reviewText":"The drone is simple to control and is a good quality for the price. The actual flight time is as listed about 6 minutes but the 2 batteries keep you up and running"},{"reviewerName":"Corey bates","rating":"4.0 out of 5 stars","reviewTitle":"Good drone for price","reviewDate":"August 12, 2019","reviewText":"This is a pretty nice little drone. Flies well. Note for begginners be sure to hit to calibrate and hit the headless button. Does alright outside in little to no wind as well."},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Very good drone for my kids","reviewDate":"October 20, 2019","reviewText":"Drone is honestly amazing. The only thing I don’t like very much is the little bit of unstableness but you really can’t do anything it’s a tiny drone."},{"reviewerName":"Twins","rating":"5.0 out of 5 stars","reviewTitle":"Read instruction booklet","reviewDate":"September 5, 2019","reviewText":"7yo birthday gift"},{"reviewerName":"jimmy barreiro","rating":"2.0 out of 5 stars","reviewTitle":"Not for beginners","reviewDate":"September 28, 2019","reviewText":"Even for beginners it takes off way to fast to adjust the trim on the take off."},{"reviewerName":"marla reyes","rating":"5.0 out of 5 stars","reviewTitle":"Great gift for a child, and so fun for adults too!😊","reviewDate":"October 25, 2019","reviewText":"I lovveeeddd this! My son is 4 and he’s able to use it like a little pro! Instructions are easy, and it’s a lot of fun!"},{"reviewerName":"Arman Antonyan","rating":"5.0 out of 5 stars","reviewTitle":"Good drone for beginners","reviewDate":"August 29, 2019","reviewText":"I like it so much, its so funny but for beginners the control is a little bit hard.....but I like it....thank you"},{"reviewerName":"MariG","rating":"5.0 out of 5 stars","reviewTitle":"Amazing little drone","reviewDate":"September 9, 2019","reviewText":"I like this drone because it was very easy to fly and it was very stable also it’s very portable."},{"reviewerName":"Zuzu Rosario","rating":"5.0 out of 5 stars","reviewTitle":"Awesome","reviewDate":"August 17, 2019","reviewText":"my son really liked this mini drone, I recommend it."},{"reviewerName":"Jonathan Shealey","rating":"5.0 out of 5 stars","reviewTitle":"Great beginner drone for the money","reviewDate":"July 19, 2019","reviewText":"I really love flying this little drone. Thinking of getting another one for my wife 👍🏾"},{"reviewerName":"Tamar Nibladze","rating":"5.0 out of 5 stars","reviewTitle":"snaptain mini-drone","reviewDate":"August 25, 2019","reviewText":"it's very nice mini drone for children and beginners, I advice to buy it, great gift !"},{"reviewerName":"Mary","rating":"5.0 out of 5 stars","reviewTitle":"I love this drone","reviewDate":"August 2, 2019","reviewText":"its a great drone I love it but its remote control is a bit tricky"},{"reviewerName":"Benjamin Howe","rating":"5.0 out of 5 stars","reviewTitle":"It's really awesome!","reviewDate":"November 2, 2019","reviewText":"Review by my son: It's really awesome! It's kind of easy to learn. I love it!"},{"reviewerName":"Susan Cruse","rating":"1.0 out of 5 stars","reviewTitle":"JUNK. GIVE ME A REfund","reviewDate":"September 4, 2019","reviewText":"TERRIBLE!! I want. Refund. Piece of junk."},{"reviewerName":"Blake Garcia","rating":"5.0 out of 5 stars","reviewTitle":"Awesome drone","reviewDate":"July 22, 2019","reviewText":"I love this drone as it certainly brings a smile to my face and is a great bit of fun.\n\nThis drone is a lot of fun and is perfect for beginners. It’s very easy to set up and once you get a hang of the controls and how to properly fly it you can have a lot of fun with it so it’s perfect for both kids and adults. The altitude hold is a great feature and ideal for beginners. One key take off could help you easy to start your first flight. The self landing function is very handy and gets you out of trouble. It is also easy to trim the flight. Three speeds are great for beginners that you can practice in a low speed and change to the higher speeds when you used to it. The fast speed is rather fast and you need quick reactions. A great drone for beginners."},{"reviewerName":"Steven Elfant","rating":"5.0 out of 5 stars","reviewTitle":"Excellent little drone! Especially good for kids.","reviewDate":"September 28, 2019","reviewText":"My kids really enjoyed this drone. It took them a little while to learn how to use it, because it needs to be trimmed periodically, but it is very fast, and has a decent battery life. Does fun tricks. Great for kids."},{"reviewerName":"Melissa Calhoon","rating":"5.0 out of 5 stars","reviewTitle":"totally amazing!","reviewDate":"August 8, 2019","reviewText":"this drone is amazing! i got this from my Aunt and Uncle for my birthday, i totally love it! i loved the 3d flips, everything worked well and did what it was supposed to do great drone for beginners"},{"reviewerName":"nick p","rating":"5.0 out of 5 stars","reviewTitle":"It was good quality for the price","reviewDate":"September 19, 2019","reviewText":"It was easy to use and good for beginners"},{"reviewerName":"Zhengjuan Xi","rating":"5.0 out of 5 stars","reviewTitle":"Very good","reviewDate":"September 11, 2019","reviewText":"The children like it very much, go to the park every day, the operation is very convenient, the quality is very good."},{"reviewerName":"Monika","rating":"5.0 out of 5 stars","reviewTitle":"Quality Product for Price","reviewDate":"September 25, 2019","reviewText":"I never thought you can get such good quality drone for this price. I am amazed by its stability and easiness to control. My nephew loved it, probably his best gift so far :)"},{"reviewerName":"CharlesA","rating":"5.0 out of 5 stars","reviewTitle":"The product is well packaged and comes with easy to follow instructions. A great buy.","reviewDate":"August 14, 2019","reviewText":" I bought this for the use of a complete beginner, I wasn't expecting much because it was rather cheap, and it really surprised me, it was rather easy to use so I could handle it well, however it completely exceeded my expectations, the battery lasts for a reasonable amount of time and the remote control was easy to use and comfortable to handle. The portable controller box is really a brilliant design that i can take this drone with me, over all I highly recommend and will also be buying another as a gift for my brother."},{"reviewerName":"LititzDweller","rating":"5.0 out of 5 stars","reviewTitle":"Fun, easy to fly, inexpensive mini-drone for kids","reviewDate":"July 27, 2019","reviewText":" This small drone is a great toy for children! It's very easy to fly and control. The flips are fun and can be done in tight quarters in the house or in small areas. Flight time is around six minutes as advertised. With two batteries, you can have 12 minutes of fun and recharge them again in a short amount of time to fly again. Overall this mini drone is a great option for the low price."},{"reviewerName":"Smity","rating":"5.0 out of 5 stars","reviewTitle":"A zippy little drone and great fun! Amazing game for kids.","reviewDate":"July 8, 2019","reviewText":"This is a cheap, tiny drone that is great fun. I brought it for my nephew and he loved it. Stability in the air is good and responds quickly to the controller.\nWhilst the controls does takes some time getting use to, once you are familiar, you can easily control the drone and how it flies. My nephew found bit difficult to operate at the first time, but he can handle this mini drone much better after few practice. The remote is also very sensitive and smooth. I am most impressed it's a key feature - It's easily take off by throwing with hands. Really easy to operate. It's made with good quality materials as if it's falling it won't damage it's blades. Comes with 2 batteries for the drone so whilst one is in-flight the other can be on charge. Two 1.5V AA batteries are required for the hand-held remote so make sure you have some handy else you will have to pause the pilot mode until you get some.\nKids flew it everywhere fast into walls and ceiling. This mini drone can take a lot of crashes. The sensitivity is amazing, not a single bump into a wall or furniture. What's more, this drone has LED lights which makes it wonderful to play outside in the garden when it is dark. Make sure that there are no pets around when you play as they may chasing for it and get hurt. Super cool, I hope it will last as it is so great. Highly recommended and so much fun, a great gift as well!"},{"reviewerName":"Max","rating":"5.0 out of 5 stars","reviewTitle":"Awesome 3D flip","reviewDate":"July 8, 2019","reviewText":"It is really nice. Unlike other drones, this one is easy to control. The speed is can be adjustable which I really like. The 3D flip is fun to play with. It is a great toy for playing around."},{"reviewerName":"TheTimmy","rating":"5.0 out of 5 stars","reviewTitle":"Perfect to learn on - all parts fit in controller","reviewDate":"July 14, 2019","reviewText":" I bought this drone to use indoors as my other much more expensive drone is far too large. The Drone is surprisingly very easy to control within something as small as a recreational vehicle. Outdoors the Drone also move quite fast and can really withstand some serious abuse. The majority of my Landings were crash landing at full speed into a wall and never did any of the plastic cases break. There are extra propellers and landing gear and blade protectors that fit in a little compartment on the bottom that is absolutely an amazing idea. There is a center compartment that will fit the USB battery charger and two batteries. This allows everything you need to fit within the remote controller case, including all of the parts necessary to fix it after a crash. The trim controls work well as I found it necessary to adjust the trim controls after pretty much every crash or whenever the battery was replaced however wants to trim controls are properly set the Drone does pretty much hover in space without any movement. I would suggest that you keep this away from people and pets as if you crash into them the spinning blades tend to sting but I highly doubt they would ever cause a cut. I did get about seven minutes of total flight time with the Drone and I found this the fly just as good as my hundred-dollar fpv drone."},{"reviewerName":"jarred","rating":"5.0 out of 5 stars","reviewTitle":"Great Long lasting little drone with everything you need","reviewDate":"July 19, 2019","reviewText":"Such an awesome little drone. I have a lot and this is one of my favorites. The battery lasts for about 15 minutes. Plus it comes with a backup so you have plenty of fly time. The all in one controls and storage is so useful. It’s easy operation for take off and landing make it a breeze and also has added benefits like speed control and tricks."},{"reviewerName":"Vyk","rating":"5.0 out of 5 stars","reviewTitle":"A really fun drone that has been extremely popular with my kids.","reviewDate":"August 6, 2019","reviewText":"When the drone arrived I was a little surprised at how compact it was but actually it's perfect for flying about in the house and our back garden. The controls are really easy to use and the one-press button to take off and land make flying this particular drone really easy. And i really like what they called \"throw'n go\", just toss the mini drone into the air to take off. It's pretty cool! Very impressed. Battery life is OK considering the size of the drone but don't expect hours of flying time. On a full charge it probably lasts 10-15 minutes with two batteries. It's well worth the money!"},{"reviewerName":"Long","rating":"5.0 out of 5 stars","reviewTitle":"I like it","reviewDate":"July 22, 2019","reviewText":"Pretty good. It has 2 batteries. And it's small to carry anywhere. I like this interesting product although I'm not a kid any more."},{"reviewerName":"Chanel","rating":"5.0 out of 5 stars","reviewTitle":"unbelievable for the price, and quality","reviewDate":"July 21, 2019","reviewText":"really clean gadget I have seen in awhile for such a low price. Flies with great accuracy.My little brother and 13 year niece absolutely love it, so it is great for all ages!!! Kudos , and thank you to whoever made this. the light makes it really good."},{"reviewerName":"Xin","rating":"5.0 out of 5 stars","reviewTitle":"love this drone!","reviewDate":"July 23, 2019","reviewText":"My 8-year-old son loves it! I wanted something for the kids to learn with. This little drone is a great learning tool for him. It is not too simple to fly, not too difficult but you have to stay focused. If you can master this I am sure you will be much better prepared for flying the larger more complex drones. This little drone is also pretty durable. We dropped it many times but it still works.\nIf you have kids that have a little patience and would really like to learn the ins and outs of controlling an aircraft this is a perfect drone to start off with."},{"reviewerName":"Ryan Lewis","rating":"5.0 out of 5 stars","reviewTitle":"Very fun!","reviewDate":"July 29, 2019","reviewText":"Instructions were easy to follow once I actually read them. I am not cordinated at all and after a few flights i got the hang of it. Its small but is a blast to play with. I just have to figure out how to get it off my 2 story roof after i crashed it lol"},{"reviewerName":"iheartplumerias","rating":"5.0 out of 5 stars","reviewTitle":"My son loves it!","reviewDate":"August 13, 2019","reviewText":"This is our first drone. My son loves playing with it. He so excited to get home from school so he can play with the drone. If you following the instruction it really easy to fly. Its comes with spare parts and a spare battery."},{"reviewerName":"Lorett R.","rating":"5.0 out of 5 stars","reviewTitle":"easy to use","reviewDate":"July 16, 2019","reviewText":"this mini dron is so funny, It is so easy to use and set Up ready ( most of mini drons are so difficult to fly due to the size). The design is so beautiful and It is not heavy at all. It arrived on time and well packed."},{"reviewerName":"Mohammad Mustafa","rating":"5.0 out of 5 stars","reviewTitle":"Easy to Learn","reviewDate":"July 28, 2019","reviewText":"Sorry, this video is unsupported on this browser.\n This thing is amazing. Lots of fun and easy to learn how to control. Parts are super easy to exchange. Great gift or just an adult toy. Does AWASOME flips"},{"reviewerName":"Becky Taylor","rating":"5.0 out of 5 stars","reviewTitle":"The perfect drone for beginners to get into the hobby.","reviewDate":"September 10, 2019","reviewText":"The drone is a great value. It's easy to assemble, and operate right out of the box. I bought a different brand of drone for my daughter and it broke the next day. That drone would constantly fly erratically, and crash into the floor where hair would get wrapped in the propellers. This drone by Snaptain is much more stable in the air, and just easier to get back into the air that the other drone that I had purchased. I would definitely purchase more products from Snaptain."},{"reviewerName":"Sophia","rating":"5.0 out of 5 stars","reviewTitle":"great drone，like it！","reviewDate":"July 29, 2019","reviewText":"This drone is very fun, it is easy to control the flight, and it can fly very high. I bought my 5 year old son and he was very happy. This product comes with two lithium batteries that can be played for a long time, and some accessories can be used for replacement."},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Perfect!","reviewDate":"July 7, 2019","reviewText":"This drone is just what I wanted. It is easy to control and set up. The drone and control is light d small, but the quality is great."},{"reviewerName":"D","rating":"5.0 out of 5 stars","reviewTitle":"good deal!","reviewDate":"August 8, 2019","reviewText":"It is fast and packed very well. I bought it for my nephew. It is so easy to learn and control, he is so excited, I have to say it brings him great fun. Especially it’s low price, let me happy, good deal!"},{"reviewerName":"ahmed nsr","rating":"5.0 out of 5 stars","reviewTitle":"it makes gladness for me","reviewDate":"August 7, 2019","reviewText":"This is the first time I own something like this. I love this so much. it makes gladness for me. it is very good."},{"reviewerName":"Sora","rating":"5.0 out of 5 stars","reviewTitle":"Best gift for kids","reviewDate":"July 27, 2019","reviewText":"I gave to this drone my little brothers birthday gift. He's really happy and play all the time."},{"reviewerName":"lin quan","rating":"5.0 out of 5 stars","reviewTitle":"convenient","reviewDate":"July 26, 2019","reviewText":"This product is very good to see, and durable, is a very easy to use, and very convenient product, very recommended"},{"reviewerName":"Osama Tarkhan","rating":"5.0 out of 5 stars","reviewTitle":"Very good stability","reviewDate":"July 13, 2019","reviewText":"Perfect for kids and beginners. No issues with stability."},{"reviewerName":"fang","rating":"5.0 out of 5 stars","reviewTitle":"Wonderfull!!!","reviewDate":"September 15, 2019","reviewText":"It is very easy to play and control. I bought it for my son a week ago, he likes it very much. The speed is adjusted. We love it very much."},{"reviewerName":"Xiaoyan Gao","rating":"5.0 out of 5 stars","reviewTitle":"Would recommend!","reviewDate":"July 25, 2019","reviewText":"Perfect! The quality is great and is totally worth it! The battery lasts a long time after one charge! It is also easy to set up and control. This is just what I wanted!"},{"reviewerName":"pandaman","rating":"5.0 out of 5 stars","reviewTitle":"Mini drone","reviewDate":"July 13, 2019","reviewText":"This drone is perfect for kids and beginners. Good price!"},{"reviewerName":"Josh","rating":"5.0 out of 5 stars","reviewTitle":"Easy to fly","reviewDate":"November 12, 2019","reviewText":"Easy to use. My 8 year old figured it out in seconds."}],"qAndA":[{"question":"Spare part like blades?","answer":"Hi there,\nThanks for reaching out to us!\nSNAPTAIN SP310 mini drone comes with four spare rotor blades(Ax2,Bx2), six protective guards and four landing skids. … see more"},{"question":"how many batteries come with it ?","answer":"Hi there,\nThanks for reaching out to us!\nSNAPTAIN SP310 mini drone for kids and beginners comes with two rechargeable drone batteries. … see more"},{"question":"How to throw the drone fly?","answer":"Hi there,\nThanks for reaching out to us!\nPlease pair the drone with remote and calibrate the drone before throw it. … see more"},{"question":"Would this be an appropriate toy for a 7 year girl??","answer":"Hi there,\nThanks for reaching out to us!\nSNAPTAIN SP310 drone is a mini RC drone designed for kids and beginners, a 7 years old boy could be a flyer under the correctly and safely guidance of their parents. … see more"},{"question":"does the app works well with the drone ? any delays?","answer":"i do not think so... it's a mini drone and can not work with a app, but it's ok, it works good!"},{"question":"how fast does it fly?","answer":"there are three levels speed for this mini drone, and i prefer the fastest, lol. great drone!"},{"question":"What are the flying and charge times?","answer":"Hi there,\nThanks for contacting us with your inquiry!\nSNAPTAIN SP310 mini drone is ready to fly for 14 minutes with two detachable batteries after 30-40 minutes full charged. … see more"},{"question":"Looks pretty small, how durable it is?","answer":"Well. I just play it few times and not sure how durable it is."},{"question":"Can you use your hand to flight it up?","answer":"Hi there,\nThanks for reaching out to us!\nYou can use your hand to make the drone take off. … see more"},{"question":"Do you sell additional batteries?","answer":"Hi there,\nThanks for getting in touch!\nSNAPTAIN SP310 mini drone comes with two batteries to extend the flight time up to 14 mins, and we will sell the additional batteries on Amazon soon. … see more"},{"question":"Can you buy replacement propellers for these?","answer":"Hi there,\nThe spare parts kit of SNAPTAIN SP310 drone is coming online, please wait for a while and we will let you know when it is on sale.\nTSNAPTAIN thanks for your patient and support! … see more"},{"question":"How long should it take for the drone to get a full battery charge?","answer":"About 35 minutes, i think, but comes with a USB cable that can charging 2 batteries at the same time. bravo!"},{"question":"Can I add an SD card to the camera?","answer":"Hi there,\nThanks for posting this inquiry!\nSNAPTAIN SP310 mini drone is a micro quadcopter for kids and beginners with no camera, so there is no SD slot for a SD card. … see more"},{"question":"Is this waterproof?","answer":"Hi there,\nThanks for posting this inquiry.\nSNAPTAIN SP310 mini drone is not a waterproof drone, and is a micro RC quadcopter desinged for kids and beginners. … see more"},{"question":"How long do the batteries last?","answer":"Hi there,\nThanks for getting in touch!\nSANPTAIN SP310 mini drone comes with two detachable batteries and 6-7 minutes flight time for every single battery. … see more"},{"question":"does the drone come with batteries?","answer":"Hi there,\nThanks for reaching out to us!\nSNAPTAIN SP310 mini drone for kids and beginners provides two rechargeable drone batteries. … see more"},{"question":"is this good for outside or inside?","answer":"Hi there,\nThanks for posting this inquiry.\nNormally, we recommend flying SANPTAIN SP310 mini drone indoors. … see more"},{"question":"what should i do if the flight is not stable?","answer":"Hi there,\nThanks for posting this inquiry.\nHere are some tips for you if the flight is not stable: … see more"},{"question":"How do you calibrate it?","answer":"Calibrate with the joysticks. quite easy. you can learn the steps through the instructions."},{"question":"Do these have any lights?","answer":"There is no lights."}]}