{"title":"KitchenAid KEK1222PT 1.25-Liter Electric Kettle - Pistachio","manufacturer":"KitchenAid","currentPrice":"$79.95","rating":"4.3 out of 5 stars","totalRatings":"666 ratings","features":["\n         Make sure this fits\n                by entering your model number.\n        \n","1.25 L capacity","Led on/off switch","Removable base","Smooth, aluminum handle with stainless steel body","Lime scale filter"],"reviewsAspects":["stainless steel","heats water","kitchenaid","plastic inside","heats quickly","looks great","hot water","water quickly","electric kettles","plastic parts","tea kettle","easy to use","french press","works well","stopped working","well made","water level","boiling water","times a day","every day"],"productInformation":[{"Product Dimensions":"7 x 8.9 x 10.3 inches"},{"Item Weight":"2.5 pounds"},{"Shipping Weight":"3.85 pounds (View shipping rates and policies)"},{"Manufacturer":"KitchenAid"},{"ASIN":"B012WF88QS"},{"California residents":"Click here for Proposition 65 warning"},{"Item model number":"KEK1222PT"},{"Customer Reviews":"4.3 out of 5 stars\n    666 ratings\n4.3 out of 5 stars"},{"Best Sellers Rank":"#8,817 in Kitchen & Dining (See Top 100 in Kitchen & Dining)\n#57 in Electric Kettles\n"},{"Date first listed on Amazon":"July 23, 2015"}],"productDescription":["The KitchenAid Electric Kettle is simple to use and offers a stylish compact footprint for your countertop.","Empire Red","\n            Onyx Black\n        ","\n            Brushed Stainless Steel\n        ","\n            2015 Consumer Vote Winner: Pistachio\n        ","Empire Red","Onyx Black","Brushed Stainless Steel","Pistachio","1500-Watts","With 'On' indicator light to quickly and quietly boil water in minutes.","With 360 degree rotation for easy transfer of the kettle.","With smooth, aluminum handle.","\n","\n","\n","located in the pouring spout and removable.","to easily fill kettle with just the right amount of water.","1-year hassle-free replacement warranty.","\t\t\n\t1.25-Liter Electric Kettle\t1.7-Liter Electric Kettle with LED Display\nCapacity\t1.25-Liter\t1.7-Liter\nRemovable Base\t✓\t✓\nRemovable Lid\t✓\t-\nRemovable Filter\t✓\t✓\nStainless Steel Body\t✓\t✓\nPower Base with Cord Storage\t✓\t✓\nHandle\tSmooth aluminum\tSoft grip\nAvailable Colors\tEmpire Red, Onyx Black, Pistachio, Brushed Stainless Steel\tEmpire Red, Onyx Black, Brushed Stainless Steel, White\nWarranty\t1 Year Hassle-Free Replacement Warranty\t1 Year Hassle-Free Replacement Warranty\n\t\t"],"reviews":[{"reviewerName":"S. G. A.","rating":"1.0 out of 5 stars","reviewTitle":"Don't buy, will rust in a year.","reviewDate":"September 15, 2017","reviewText":" I boil water about 2 times a week for tea. We got this kettle, and dry it out the best we can after every use. It traps a little bit of water in it that is hard to get out. After a while the cracks in the bottom started to rust. 1 year and a few weeks after buying the kettle I called KitchenAid to see what to do because I was worried about drinking water out of a rusty kettle. All they told me is to throw it away and then they tried to sell me a new one. If you buy a kettle from KitchenAid you will be having to buy a new one every year. Then when I said I didn't want to buy a new one if it will just rust on me, they just said sorry and ended to chat on me."},{"reviewerName":"EwaT","rating":"5.0 out of 5 stars","reviewTitle":"Great kettle","reviewDate":"September 23, 2017","reviewText":"I have had this kettle for about 9 month now and I am very satisfied with my purchase. A few reviews were not as great and I was very hesitant to order. It seemed that some people had rust problems after a few month. I leave the lid open to ensure that the moisture can escape after boiling water and I never leave any water in it. The hot kettle dries that way pretty quick and it prevents the rust.\nIt is a smaller kettle and I would say it works perfect for 1-2 people servings. The size is definitely to small for a whole family of tea drinkers :)\n\nUpdate: I am still satisfied with my purchase. The kettle still works and looks like on day one after three years of use. The second picture of the inside is the most recent picture taken. I use it at least once a day."},{"reviewerName":"Victoria Reinhardt","rating":"1.0 out of 5 stars","reviewTitle":"One Star","reviewDate":"November 22, 2017","reviewText":"Terrible! Had it for 5 months and the lid has rusted! Looks awful!"},{"reviewerName":"Hanna","rating":"3.0 out of 5 stars","reviewTitle":"I wish it's plastic free","reviewDate":"February 23, 2015","reviewText":"I usually do not write reviews on Amazon but I was compelled to write this one because there are so many confusing reviews about this product out there. If you are looking for a plastic free electric kettle like me, this is not for you. There are 4 plastic parts inside the pot. ( see pics )\n1. Filter - removable\n2. Bigger plastic piece that holds the filter - NOT removable and it comes in contact with water. I live-chatted with customer service and this is their response.\n\"Thank you for waiting. That plastic piece that holds the filter is not removable.\"\n3. Rivet from handle - above the max water level\n4. 2 rivets inside of lid\nI gave 3 stars because it is very stylish and I am sure it works really well, I know because I own several KitchenAid appliances as you can see the built-in KitchenAid oven on my picture background. But sorry I am disappointed and returning this one."},{"reviewerName":"Amazon Customer","rating":"1.0 out of 5 stars","reviewTitle":"Purchased this product in Nov 2016, and it's no ...","reviewDate":"April 14, 2017","reviewText":"Purchased this product in Nov 2016, and it's no longer working after 5 months. I have to push down the kettle to make it connect with the base, and that only works sometimes..."},{"reviewerName":"Silvester Percival","rating":"5.0 out of 5 stars","reviewTitle":"Excellent ergonomics and no-frills, classic design","reviewDate":"April 26, 2015","reviewText":"I previously reviewed a different kettle made by Kitchenaid (KitchenAid KEK1722SX 1.7-Liter Electric Kettle with LED Display - Brushed Stainless Steel) and find that this one is equally nice, but for different reasons. This model is slightly smaller, has fewer features (like electronic temp display, stay-warm function, etc), but it also boils water faster, has a nicer spout and handle, and has a unique, old-fashioned design that will look great on any counter. Below I will go into slightly more depth about its features, always trying to compare it to the other Kitchenaid kettle, which is now at about the same price point. BE SURE TO CHECK OUT MY PICS FOR MORE EXPLANATION OF FEATURES.\n\n►' When I first opened the package, my very first thought is that this kettle looks better than the 1.7 liter KitchenAid. But the design is functional as well as pretty. The curved handle is made of very thick, well formed stainless steel and does not cut into fingers; it actually feels really nice in the hand. The spout, too, pours better than the 1.7L owing to the full cylindrical design. The lid is very solidly made, but also comes off without too much struggle (unlike some others of this design that I've used). The on/off switch is beautiful (see my pic) if that is possible. And the shape of the kettle itself is very nice and ensures maximum capacity despite taking up little space. Overall I give ergonomics the highest possible rating for this kettle. Outstanding!\n\n'► This kettle can heat a full pot of 1.25L in just under 5 minutes, making it slightly faster than the 1.7L KitchenAid (which took about 8 minutes to boil 1.7L). Obviously the time will vary depending on the temp of your tap water and inside air temperature. I think the faster boil time of the 1.25L is a result of the heating unit design (exposed instead of under bottom), which maximizes contact with the water. This does make it a bit louder, however (although not too bad).\n\n'► The top opening of the 1.25L is super big and can probably fit all but the very biggest hands. This makes it very easy to clean. Well done, Kitchenaid!\n\n►' I have months and months of hard use with the removable scale filter and I'm a big fan. Yes, it does contain plastic, but it's a minimal amount, and the scale filter really does work. It also lasts a long time. Where we live, given the high lime content of tap water, I would much rather have a scale filter with a tiny bit of plastic than be drinking huge amounts of lime flakes every time I make a cup of tea. If you don't like it, you could probably remove the whole thing from the inside (even if that meant damaging the filter parts beyond repair).\n\n'► The cord is nice. It's actually designed to wrap/unwrap around the bottom, so you can let out lots of cord for a long reach, or wrap it up once or twice to keep the cord from cluttering your counter. Nice touch.\n\n'► Be warned that the kettle is NOT insulated and will get very hot to the touch. This is pretty standard for kettles and not a complaint of mine, but if you were looking for an insulated one, keep looking.\n\nOverall this is a very nice kettle and wins big points for having great ergonomics and a solid, no-frills design. It lacks the features of the 1.7L KitchenAid kettle I already owned, such as the ability to heat to certain temperatures, the temp readout, and the stay-warm feature. But it makes up for this with a very good design. Because it has so few electronics, I expect this to be the kind of kettle that lasts forever and just keeps on working and working and working. It will be the new kettle in my office. I'm sure my college students will comment on how cool it is!"},{"reviewerName":"Dog lover","rating":"1.0 out of 5 stars","reviewTitle":"One Star","reviewDate":"June 30, 2017","reviewText":"kettle went rusty inside after 2 weeks of use"},{"reviewerName":"Amazon Customer","rating":"2.0 out of 5 stars","reviewTitle":"Got rusty soon.","reviewDate":"September 19, 2016","reviewText":"It got rusty inside only after one week."},{"reviewerName":"Dawei Wu","rating":"1.0 out of 5 stars","reviewTitle":"Buyer Beware","reviewDate":"November 26, 2016","reviewText":"I bought it because I love the KitchenAid brand. This was a great little kettle for the two months that it was operational. When it randomly broke, I requested a refund from KitchenAid but they have yet to get back to me. Poor customer service and the fact that the kettle isn't durable are why I give this a 1-star review."},{"reviewerName":"Tuan Ma","rating":"1.0 out of 5 stars","reviewTitle":"After about a year and a half of light use ...","reviewDate":"November 18, 2017","reviewText":"After about a year and a half of light use this already stop working... disappointing I have a cheap Chinese made one at 1/4 of the price at work that still work. I bought this one to replace that one at home... and of course the warranty only last one year..."},{"reviewerName":"Pono","rating":"1.0 out of 5 stars","reviewTitle":"plastic inside, too bad","reviewDate":"August 12, 2018","reviewText":"thought I was buying an all stainless product, for clean water; nope, they put plastic inside. bummer"},{"reviewerName":"C Spratt","rating":"1.0 out of 5 stars","reviewTitle":"Broke in less than 4 months of very infrequent use","reviewDate":"July 24, 2018","reviewText":"I bought this in March 2018. The on switch is already broken and the unit no longer working. Really surprised at the shoddy quality. I have not contacted KitchenAid to see about a replacement, but I don't think stellar customer service is going to make me likely to purchase a similar product from them again. I used this one evening just fine and the next day it stopped working. Was not dropped or potentially damaged in any way. I probably used this 2-3 times a week in my home, so wasn't normal wear and tear."},{"reviewerName":"Brian","rating":"4.0 out of 5 stars","reviewTitle":"Decent","reviewDate":"January 22, 2019","reviewText":"I was looking for a kettle with no plastic and this was nearly it. Its definitely the best I could find so far.\n\nThere is a peice of plastic inside that holds a filter. I don't care about the filter, so I just broke it and pulled it out. So now my water is not boiling with plastic in it all the time.\n\nI wish it was a little easier to clean. I may end up just getting an induction burner and a normal iron kettle in the future. Not sure why so many companies are putting out cancer plastic and non stick in all their products. I'd pay more money for something simple and safe."},{"reviewerName":"Mrs. P","rating":"2.0 out of 5 stars","reviewTitle":"The worst thing about this kettle though is that now after ...","reviewDate":"January 7, 2017","reviewText":"It heated up water quickly, but the other brand kettle we had before this one did too. The lid on this kettle is a major drawback, I prefer the flip style lid on our old kettle. The worst thing about this kettle though is that now after only 6 months of use I'm needing to replace it. We've been smelling something electrical the last two days when using it and today the pin in the center of the plug on the bottom of the kettle broke off. It looks like it bubbled and melted. Love my KitchenAid mixer that I've had for 24 years but this kettle is history!"},{"reviewerName":"lovemama","rating":"1.0 out of 5 stars","reviewTitle":"This kettle creates a horrible chemical smell and taste in the water","reviewDate":"May 30, 2018","reviewText":"This kettle creates a horrible chemical smell and taste in the water, even after washing and many weeks of use. The smell and tase have not gone away; in fact, they seem to have gotten worse over time. When I smell the bottom of the kettle, the odor is particularly strong. It seems to be coming from the plastic part in the middle of the kettle. I normally love KitchenAid products but for this one, I am hoping to get my money back."},{"reviewerName":"RKS/jc","rating":"5.0 out of 5 stars","reviewTitle":"GOT CAUGHT BY THE DESIGN FIRST","reviewDate":"May 7, 2017","reviewText":"This is a simple but elegant design, with technical details that are very appealing. Base allows the cord to be stored so it's an appropriate length, kettle can sit down any way within the circle of the base without fumbling around. On switch is nice and simple, and auto-off is a big help - I have melted the last two kettles on my gas stove due to lack of attention. And, the color choice seemed especially lovely."},{"reviewerName":"Andrea Beshuk","rating":"5.0 out of 5 stars","reviewTitle":"Love this Kettle like a Hobbit Loves Second Breakfast.","reviewDate":"October 19, 2017","reviewText":"uhh... seriously this is one of the cutest, awesome working, easy kettles i've ever had, hands down my absolute fav of all time... and I'm nearly 50:)\nI don't have anything really technical to say about it. its a qualtiy product. use is intuitive. I could easily keep this one for the rest of my days. and barring any unforseen weird malfunction, I would buy another one to replace...just a great all around product.\nI would definitely recommend as a gift. there is a wide color assortment too."},{"reviewerName":"Amazon Customer","rating":"2.0 out of 5 stars","reviewTitle":"Not a good kettle. Bad features.","reviewDate":"November 16, 2018","reviewText":"We are frequent kettle users - for daily tea, making soups and sauces, oatmeal, etc. After our long time (not fancy) kettle broke we looked for an upgrade. This was not it! There are just a couple really badly designed features about this kettle that are deal breakers for me. I wish I would have done more research or thought about why I loved the old kettle, before I made a decision for a new one.\n\nSpecifically:\n1. The top comes off completely, it does not \"pop up.\" So, to fill it up you need to take the lid off entirely. this is itself isn't a deal breaker but it's not a good user experience, particularly because the handle goes across the opening which makes it even harder to fill up.\n2. There is no water line to indicate how much water is in there. You have no idea how full or empty it is unless you look inside (and estimate) or until you pour it out at the end and realize you boiled too little.\n3. Probably the worst, it gets VERY hot. This is not a good kettle to be around children. It feels like a hot pan on a stove as soon as it's boiled. I have not had this experience with other kettles.\n\nBasically, it may look cute, but this kettle is not well designed or practical, at least for a frequent water boiler. Returning and going to get my old model (although not as cute)."},{"reviewerName":"laurelissa","rating":"5.0 out of 5 stars","reviewTitle":"Adorable","reviewDate":"November 17, 2018","reviewText":"This kettle is compact, but holds plenty of water. It looks to be high quality and is very attractive on my countertop. I'm so glad that I got this kettle. I wrestled with getting the Kitchenaid kettle with temperature control, but that one had plastic in the interior. This kettle has no plastics, except for a removable filter. I expect that this one will not leak, as there's no plastic window or extraneous seams."},{"reviewerName":"linda durdov","rating":"5.0 out of 5 stars","reviewTitle":"I love it! We are tea drinkers","reviewDate":"January 9, 2018","reviewText":"I love it! We are tea drinkers. However in the past I would use the stove top kettle to heat water for instant coffe or other hot water needs. On several instances we would not hear the tea kettle “whistle” and it would boil and boil. One day it boiled down to nothing and the handle started melting. This was a safety issue. Yes we paid more attention to when we turned it on but we realized that it could happen again. We got this electric beautiful (blue to match my kitchen decor) just right size teapot. I chose kitchen aid because of the brand name I trusted for past appliances and because of the reviews, the “automatic shut off” was of most importance. No more worries about a possible kitchen fire. The exterior is easy to clean just by little soap and water. The interior after a few months is just as smooth and shiny with no corrosion I have just rinsed it out. I have no idea what some of the reviews said about plastic parts it looks like only stainless steel and or aluminum. The base has the cord that you plug into the wall in the center is a raised plug that fits into a hole in the bottom of the kettle when you place it there. If you want hot water you press a button (on side of kettle) which turns green indicating its on and within a minute you hear water heating up and a few more minutes it shuts itself off. The top pouring handle stays cool and the lid stays firmly on while pouring. It’s perfect. I highly recommend this classy looking and Safe kettle."},{"reviewerName":"Beth Adcock","rating":"5.0 out of 5 stars","reviewTitle":"Lovely Kettle Works Great!","reviewDate":"March 14, 2017","reviewText":"I almost didn't get this kettle because it's not as large as I would prefer, but it's *so* cute that I kept coming back to it. So far I've been quite happy with this. It heats up quite quickly, even when the water is fresh out of the cold tap, in the dead of winter in the northeast; and believe me, that water is COLD. The handle stays cool to the touch, and the kettle is easy to lift because it's easy to find a good balance point on the handle, something which can be a real issue with larger electric kettles we've had. As with any kettle, you need to make sure that you keep your hand back from the mouth of the kettle when you take the lid off, and that you open it away from you (i.e., open the side closest to the spout, with your hand on the other side when holding the kettle to refill it when it's hot). Our last kettle didn't allow us to turn it on right away after emptying and refilling it for some reason, but this one has given us no difficulty with that. If you want to get every last drop out, you do need to tip it way over, which is a little bit of a nuisance.\n\nTime will tell how well this holds up. The original kettle, a GE, lasted a good quarter century; but none of the others has come close to that.\n\nThe cord, BTW, is the same length as that on the one which died, which was just as long as the one before, etc., despite the fact that they were different brands (except that we had two Cuisinarts along the way). You just need to unwind some from under the base. This is set by law as a \"safety\" feature. I agree that it's barely long enough to be useable, but it's meant to keep people from tripping over the cord if you use it somewhere other than a countertop."},{"reviewerName":"Amazon Customer","rating":"1.0 out of 5 stars","reviewTitle":"Dangerous!","reviewDate":"November 6, 2017","reviewText":"After 1 month my kettle totally burnt out and melted on the bottom, very very dangerous"},{"reviewerName":"WhatTheJules","rating":"5.0 out of 5 stars","reviewTitle":"I would buy this pot again. Love it!","reviewDate":"June 24, 2018","reviewText":"I use this kettle a few times a day. It heats faster than my stove kettle and has a small footprint. It has a filter to keep any hard water sediment out of your tea. I rinse the filter every 3-4 days because we have very hard water. Water stays pretty hot if you drink your tea fast or want an immediate warm up. The longest I have waited and poured more water without reheating is about 20 minutes. The button not only lights up, but you can also hear it click off so you don't have to stand there waiting. This pot has made my morning easier, has saved me the occasional splash burn that my Le Creuset pot was causing.\nIf I had my way the max fill level would be easier to see. It is half way up the side of the pot. When you look at this pot from the outside it seems like it would hold more water. It suits close to three cups if you are using a larger mug or cup."},{"reviewerName":"Robert","rating":"5.0 out of 5 stars","reviewTitle":"Nice, quiet, and quick kettle that’s perfect for my coffee brewing needs","reviewDate":"January 13, 2019","reviewText":"I have had other kettles for some time but this is a great kettle worth the extra money that I spent. It heats up the water quickly, is very quiet compared to my older and cheaper kettles, and still allows me to use my smart plug to begin boiling the water just before I get to the kitchen. I use bottled water, so I have not had to clean it all the time I’ve used it. I fill it the night before and then empty it after pouring it over my fresh burr ground coffee beans. The hot kettle dries it out and because I use bottled water, there are no water marks or calcium or lime marks. It still looks brand new.\n\nThis is now my favorite kettle and I would buy it as a gift if I knew someone needed a kettle."},{"reviewerName":"susan murphy","rating":"4.0 out of 5 stars","reviewTitle":"Real nice kettle","reviewDate":"December 29, 2018","reviewText":"Love the appearance and light green color. Heats water fast. Generous capacity, Wish it had a smaller footprint, like my friend's Krups electric kettle, but some time I'll be glad to have the bigger capacity. After we use the hot water we empty it of any residual water, so it dries out inside between uses. (Once I made the mistake of taking the lid off, and almost scalded my hand on the steam.) I hope this will alleviate the problem that some cited, of rust developing inside the kettle (why isn't it rust-proof stainless steel?). We use filtered water, so maybe this won't be a problem. We pulled out the plastic filter, but the plastic frame remains, The cord is very short (16\"), which isn't a problem where I'm keeping it, but it will really limit where you can put the thing on your kitchen counter (I think it should be 3 or 4 inches longer)."},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Holds up well to constant use","reviewDate":"November 23, 2018","reviewText":"I've had this kettle for almost two years and use it several times a day. I don't empty the kettle between uses so it always has water in it but I've never had any issues with rust. I have only had to remove and rinse off the filter once in all that time. I love that the handle never gets hot, water boils quickly, and the kettle takes up very little counter space. All that and it's so cute!"},{"reviewerName":"Eli","rating":"5.0 out of 5 stars","reviewTitle":"Form and function","reviewDate":"February 7, 2019","reviewText":"This tea kettle is perfect! Right size, heats water quickly and quietly, stainless steel with removable filter...and a timeless design. Fits my retro 1940 kitchen perfectly. It's a good size to hold plenty of water with a small footprint too. And as with all Kitchenaid appliances, I'm sure it will be bulletproof. I've had my stand mixer and toaster for over 10 years with no issues and they still look brand new too."},{"reviewerName":"Real Elf","rating":"5.0 out of 5 stars","reviewTitle":"I love Kitchen Aid!","reviewDate":"May 27, 2017","reviewText":"Needed to replace our older Kitchen Aid electric kettle and went with this instead of the digital one we had previously.\nLOVE IT !\nIt's easier to clean and takes up less space than the older digital model .\nWe use this multiple times a day and it's perfect!\nI have all Kitchen Aid 'empire red ' in my kitchen and I have noticed the newer empire red products appear to be a brighter red but they all blend really well and this was no exception ."},{"reviewerName":"Lil Miss","rating":"5.0 out of 5 stars","reviewTitle":"Good buy","reviewDate":"April 10, 2018","reviewText":"Really beautiful and matches my kitchenaid mixer. Slightly smaller than expected but works great. Only one small thing - this kettle seems sturdy and well made. Lots of stainless steel - except for the little lever you push down to start the kettle. Its silver colored plastic. I'm not entirely sure it's going to last long. Seemed odd, since the rest of the kettle is so well made. But I'm overall pleased with my purchase.\nUPDATE: I've had this for 9 months now and the little plastic lever is holding up fine. Also, this is shockingly easy to clean. Just wipe out any hard water residue inside. Comes right off."},{"reviewerName":"Karen@CMS","rating":"2.0 out of 5 stars","reviewTitle":"Pretty, but not a time-saving replacement for a stove-top kettle.","reviewDate":"June 25, 2019","reviewText":"We traveled in England recently, and every Airbnb we stayed in had an electric kettle - they were universally quick to boil water - almost instant, really - so I decided to purchase one when I returned home. After looking at several cheaper options, I went with the KitchenAid: I liked the compact size, design and color, and thought the extra money (x2) for the KitchenAid brand meant a better product. Unfortunately it's not at all quick - even when only 1/2 or 1/3 full, it takes a long time to bring to a boil - I should have kept my stove-top kettle, and regret my expensive choice. Naturally, I'd already recycled the packaging so can't even return it for a better item. It's pretty, but overall very disappointing."},{"reviewerName":"Amazon Customer","rating":"2.0 out of 5 stars","reviewTitle":"Color does not match photos","reviewDate":"April 4, 2019","reviewText":"It seems like a really nice kettle but it was a gift and the color was the most important aspect. I paid a lot of extra money to get the deep navy blue. Even on the box the color was great, but when we pulled the kettle out the actual color is extremely flat and much lighter, almost lavender. It doesn't look so bad in the picture but IRL it's really far off, like flat paint instead of the glossy deep ceramic look of the photos. With so many kettles available the price was just silly ($80 for the blue version), I got a comparable one for myself elsewhere for $30 and it has worked great for years."},{"reviewerName":"Lisa","rating":"5.0 out of 5 stars","reviewTitle":"Heats quickly, Easy to use & clean","reviewDate":"September 19, 2019","reviewText":"We use this all the time for anything requiring boiling water. And, our teenagers use it for water for instant oatmeal or ramen noodles on the go. Heats up super fast. Solid, made of quality materials. At first I was emptying it everyday and making sure it was dry because another reviewer complained of rust. However, what I think they may have mistaken is that the metal darkens when heated. I always leave the water in it and have had it for several months... no rust! Excellent product, highly recommend."},{"reviewerName":"Bissie","rating":"4.0 out of 5 stars","reviewTitle":"Love the kettle","reviewDate":"September 7, 2018","reviewText":"This is a great kettle. The only reason I gave it 4 stars is that the handle is not hinged and putting the top off and on sometimes causes drips on the counter. It also makes it more difficult to clean. Minor, but if the handle could be moved out of the way it would be quite perfect."},{"reviewerName":"Michael","rating":"5.0 out of 5 stars","reviewTitle":"Great product","reviewDate":"August 17, 2019","reviewText":"I had one of these products years ago I was very pleased with it I am also very pleased with this product being very lightweight metal designing and it heats up very quickly and performs exactly as I needed very satisfied I recommend this product if you're looking to make instant ramen soup hot tea hot cocoa anything where you would need just hot water quickly I recommend this product it heats up hot water within three to four minutes to boiling point"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Good buy - long time kettle user.","reviewDate":"March 13, 2017","reviewText":"My husband is the tea drinker and was looking for a kettle that had a larger opening in order to clean inside. This one finally fits the bill.\n\nWe've used electric kettles for ages because of their convenience and speed. This one does not disappoint.\n\nSturdy and good base compared to lighter cheaper models."},{"reviewerName":"C Street","rating":"5.0 out of 5 stars","reviewTitle":"Love it. Too bad the cord / plug is so fat.","reviewDate":"May 1, 2018","reviewText":"Have had this for nearly a year, I think... This gets used multiple times a day, every day. Love it. Good looking and works great.\n\nI do wish that it had a flat plug... since it's going to be on a counter all the time, and it's got this big thick cord and fat plug, it makes it a little ugly and unwieldy looking. But oh well.\n\nJust saw the comments about rusting. Going to check it out now. Ours always has water in it, we've never worried about it. Looked inside, checked it out, no rust."},{"reviewerName":"Clair L. Melton","rating":"3.0 out of 5 stars","reviewTitle":"A bit disappointing, but it does its job","reviewDate":"August 23, 2016","reviewText":"For the price, it didn't even occur to me that this would be single-wall steel. As a result, the exterior gets *very* hot. I saw in other reviews that there some plastic on the inside, but I was willing to accept that it's very difficult to find plastic-free electric kettles. But I really so no reason that a well-designed kettle in this price range should not be double-wall. In addition, my previous kettles heated their full pots in 2 minutes or less, not the 4 minutes this one takes.\n\nAll that to say that while the kettle functions as it should, I'm a little disappointed. It does not measure up to my Hamilton Beach, which cost about the same price."},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Kettle","reviewDate":"July 3, 2019","reviewText":"Fell in love with this, but sadly had to return it as it wasn't quite the right shade of Red that I was looking for to go with everything else in my kitchen, otherwise a beautiful and very stylish kettle, and I love Kitchen Aid's products. So yes, I would most definitely recommend this."},{"reviewerName":"Jordan","rating":"3.0 out of 5 stars","reviewTitle":"Form over function","reviewDate":"August 30, 2019","reviewText":"This is a pretty kettle if you intend to leave it out and like to make a few cups of tea or coffee at a time. It is not as convenient to use as must other electric kettles due to the old-school plug lid, odd pouring angle, and relatively lower water capacity. It does heat up fast and the construction seems mostly solid, KitchenAid quality. You can pick up the kettle after boiling without an oven mitt, but it can get warm. If you use electric kettles for making food, or other high-volume applications, this might not be for you. Otherwise, it's a perfectly functional and aesthetically pleasing kettle."},{"reviewerName":"Portland Amy","rating":"5.0 out of 5 stars","reviewTitle":") We are very happy with it and hope it lasts","reviewDate":"August 27, 2016","reviewText":"This kettle is replacing a Cuisinart that failed after I ran a little of water on the outside of the pot. It seems the lever assembly is very sensitive and a little water seems to cause a little corrosion and disables the on/off switch. This kettle has the same system so I am very careful to turn the water on only after the faucet is over the opening.\n\nThere is no plastic smell as I've had with other kettles (even those which were virtually solid stainless.)\n\nWe are very happy with it and hope it lasts."},{"reviewerName":"avid reader from ATL","rating":"5.0 out of 5 stars","reviewTitle":"Cute and quick electric kettle","reviewDate":"November 27, 2017","reviewText":"I hadn’t ever had an electric kettle before so didn’t know what I was missing! I drink hot tea all winter long, including when working from home. It is great! The water heats up very quickly and the shuts off automatically, a lot better than leaving hot water to boil on the stove and forgetting about it while on a conference call. I love the design and the bright blue color looks great on the countertop and matches my kitchen aid mixer. I thought the price was a bit high, but worth every penny"},{"reviewerName":"Stacy","rating":"1.0 out of 5 stars","reviewTitle":"Rusted after a year and a half of daily use.","reviewDate":"June 25, 2017","reviewText":"Buy this product if you are okay with it rusting in a year and a half after daily use. I contacted the company and received no reply yet."},{"reviewerName":"Rich C","rating":"5.0 out of 5 stars","reviewTitle":"Great little kettle","reviewDate":"September 11, 2016","reviewText":"I think this is a great little kettle. It heats water quickly. There is no alert when it's done, but the little light on the side goes out. I found it much easier than leaving the typical kettle on the stove. The kettle on the stove constantly had to be cleaned because of food splatters from normal cooking. The extra cord wraps neatly in the base. Best of all, the handle is cool enough to pick up with your bare hand. Also, the water doesn't want to splatter when you pour. This kettle is a bit smaller than the usual 2 liter kettle. In other words, it heats 1.3 quarts. If that's enough for you, go for it."},{"reviewerName":"RonT","rating":"4.0 out of 5 stars","reviewTitle":"Excellent Kettle","reviewDate":"April 24, 2016","reviewText":"Purchased this kettle to heat water to brew coffee in a french press. The kettle is well made although the removable top is made of thin aluminum and heats quickly. I like the fact that it has an automatic shut off once the water reaches boiling temperature. The interior of the kettle also has a maximum water level marker that is a nice feature. I have been pleased with how quickly it brings water to boil. Overall, I am very satisfied with this kettle."},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Must have if you're in the market for an electric kettle","reviewDate":"February 23, 2018","reviewText":"I bought this for my wife over a year ago when she got pregnant and she wanted to transition from coffee to herbal, caffeine-fee tea in the morning. This electric kettle is amazing and we both use it daily. I have transitioned to using a french press for coffee in the morning and this is so much quicker than using a drip coffee maker. The water heats up to boiling in about a minute which saves so much time when compared to heating water on the stove as we were doing before. My wife loves the color as it matches her other KitchenAid gadgets and meets the standard high quality you can expect from this brand. It hasn't been scratched or dinged at all and is very easy to clean. 1.25 liter volume is just right for the 2 of us. Also, it seems pretty safe considering neither of us have burned ourselves."},{"reviewerName":"CJB","rating":"4.0 out of 5 stars","reviewTitle":"Happy to have this","reviewDate":"February 19, 2018","reviewText":"Heats up quickly, but noisily - I actually like the noise, because I can tell how close the water is to boiling. It is easy to pour from when it's at least half full. When there is less water, it's a little awkward. I have to hold the handle from the back rather than the middle. The spout filter slips out for easy cleaning. I'm looking forward to many cups of tea!"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"In daily service for almost a year, no problems","reviewDate":"March 27, 2019","reviewText":"This is our second of these kettles - my mother took the first one for her apartment! We've had this kettle since April 2018 (almost a year as of this writing) and we use it at least once a day. No rust, no leaks, no switch failure. It has no manual temperature control, but it shuts off quickly after reaching a rolling boil so the thermostat must be pretty accurate. I cannot evaluate the energy efficiency without measuring the current draw and comparing that to other kettles, which I won't be doing any time soon."},{"reviewerName":"Carolyn Dawson","rating":"5.0 out of 5 stars","reviewTitle":"Tea ready in minutes","reviewDate":"July 19, 2019","reviewText":"This is another gift I bought for my nieces’ wedding. She absolutely loves it. Heats up quick and it beats using the stove or microwave. Plus, the color is a beautiful pistachio. Love the color options."},{"reviewerName":"avery","rating":"4.0 out of 5 stars","reviewTitle":"Looks really nice. 1.5ft power cable though.","reviewDate":"April 2, 2019","reviewText":"This kettle works well and is quick to heat water. Also it is very stylish. My only problem and the reason I'm giving this 4 out of 5 stars instead of the full 5 is due to the very short power cable. For some people they probably prefer a shorter cable if keeping the kettle right next to the plugs, but for my situation, I have cabinets that are above the plugs and the 1.5ft cable is just way too short. Almost worth finding a discrete extension for the cable."},{"reviewerName":"Jane","rating":"1.0 out of 5 stars","reviewTitle":"Boiled water tastes like plastic. Don't buy.","reviewDate":"April 9, 2019","reviewText":"I really want to like this kettle as it looks so cute. The color is beautiful, too. However, none of that matters if the plastic filter inside the kettle is unremovable. The plastic is in contact with, in fact, soaked in the water when there's max amount of water in the kettle. The boiled water has a strong plastic taste that you can't ignore, even days after use. I'm returning it."},{"reviewerName":"MG","rating":"4.0 out of 5 stars","reviewTitle":"sturdy construction. I'd give it a 5","reviewDate":"March 28, 2018","reviewText":"Extremely cute retro styling, sturdy construction. I'd give it a 5, but I think it imparts a bit of a metallic taste to the tea. It's not overwhelming, but it's there. I'm hoping it will diminish with time? It boils water very quickly, and pours well."},{"reviewerName":"runnerjud","rating":"4.0 out of 5 stars","reviewTitle":"Very nice color and quality electric teapot.","reviewDate":"January 22, 2018","reviewText":"Nice teapot. Matches my KitchenAid mixer. I waited until the price came down, but still expensive. It is harder to get water into it because handle doesn't move and gets in the way but has a strong 3 prong safety plug, unlike my coffeemaker."},{"reviewerName":"J. Noble","rating":"3.0 out of 5 stars","reviewTitle":"It sits on my counter and doesn't ever get \"put away\" and I like that it looks like a traditional tea kettle","reviewDate":"May 22, 2018","reviewText":"I admit I mainly bought this because of it's looks. It sits on my counter and doesn't ever get \"put away\" and I like that it looks like a traditional tea kettle. I really wish it held more water though. We can't get a cup of tea and my husband's coffee in his French press out of one kettle full. I guess maybe I should have looked at my water requirements first but the picture is misleading since the max full line is almost half way down."},{"reviewerName":"J. Bird","rating":"4.0 out of 5 stars","reviewTitle":"This kettle is adorable and a good size for me","reviewDate":"July 17, 2017","reviewText":"This kettle is adorable and a good size for me, but beware the handle on the lid which can heat up quite a bit and if you need to remove the lid after boiling the steam will hit you right on the hand (this may seem obvious but it's a danger that other kettle designs correct by making the lid pop open and putting the handle on the side.) That pistachio though? Too cute."},{"reviewerName":"quiltangel","rating":"5.0 out of 5 stars","reviewTitle":"Love this tea kettle","reviewDate":"November 7, 2018","reviewText":"This is the first electric tea kettle I have bought. I love it. The water boils quickly and shuts off automatically. I never have to worry about the water being \"boiled out\". It is made beautifully. I have since bought a second one in the light green color for my daughter. She loves hers too."},{"reviewerName":"christineu","rating":"5.0 out of 5 stars","reviewTitle":"Great electric kettle that looks good too","reviewDate":"August 6, 2018","reviewText":"After a recent trip to China where every hotel room had an electric kettle we really wanted a nice one for the house and this one has definitely not disappointed us. The kids love being able to heat water for noodles, tea, hot chocolate, etc and we even found using the French Press for coffee easier now that water can be quickly and easily heated versus the stovetop kettle we were using."},{"reviewerName":"Vault Dweller","rating":"2.0 out of 5 stars","reviewTitle":"Loved this kettle (For 8 months or so)","reviewDate":"August 15, 2018","reviewText":"Update: After 8 months, the kettle no longer works. I expected better from a KitchenAid product.\n\nLove this kettle. My only qualm (and a very small one at that) is that the on and off switch doesn't completely click up when the kettle is done, but rather 30 min later (so you will hear the noise, though the kettle is and was off)."},{"reviewerName":"Topher C","rating":"5.0 out of 5 stars","reviewTitle":"Easy to use and sturdy.","reviewDate":"May 22, 2019","reviewText":"This kettle is easy to use and sturdy. Not much to say, its not all metal, but it is practically everything i want of a electric kettle (easy to use and sturdy).\n\nThe plastics seem to be non-issue to me in this case and don't touch the water as long as you fill it below the max line."},{"reviewerName":"Hulagirrrl","rating":"2.0 out of 5 stars","reviewTitle":"... the plastic inside was not removable and I don't like to have a side of chemicals with my coffee ...","reviewDate":"January 1, 2018","reviewText":"I bought the item because it looks very functional but the plastic inside was not removable and I don't like to have a side of chemicals with my coffee every day when I heat water."},{"reviewerName":"Noelle","rating":"5.0 out of 5 stars","reviewTitle":"Love i!","reviewDate":"May 29, 2019","reviewText":"I love my new electric kettle. I like that it is not too large and clumsy, but just the right size on my countertop. It is classic looking and fits in with my kitchen's decor. It also seems to boil a little faster than my last one which I had for many years."},{"reviewerName":"jfree99","rating":"5.0 out of 5 stars","reviewTitle":"Great little kettle!","reviewDate":"August 12, 2019","reviewText":"Great looking little kettle! Perfect for 1-2 people and for small kitchens.\nThe handle gets in the way a bit while filling from my filtered water dispenser, but that’s just as much the fault as the dispenser as the kettle design."},{"reviewerName":"Rachel Sum","rating":"2.0 out of 5 stars","reviewTitle":"Has plastic on inside not just steel","reviewDate":"May 30, 2018","reviewText":"This has black plastic on the inside to prevent loose leaf tea from coming through. Not just stainless steel on inside. Returning!"},{"reviewerName":"Postman","rating":"5.0 out of 5 stars","reviewTitle":"Never knew I needed one!","reviewDate":"March 3, 2019","reviewText":"I received this for Christmas to replace an old, busted version that I inherited. I never thought I would “need” an electric kettle, but it has been so useful. When the first one broke, I added this to my Christmas list. It looks nice on the counter and I use it to make tea and speed up the boil time on my pasta for rushed dinner nights. Such a great time saver!"},{"reviewerName":"Lauren","rating":"4.0 out of 5 stars","reviewTitle":"Good if your careful?","reviewDate":"November 2, 2018","reviewText":"So far so good. I’ve had this kettle 2 months. Trying to avoid the rust issues other experience by almost immediately emptying out all the water, wiping out any excess, and then hanging it upside down to dry while it’s stjll hot. It’s slightly difficult since the kettle is still burning hot, but not impossible if your careful. The kettle works great, getting water boiling in a matter of minutes. Looks beautiful. I’m happy so far but will certainly update if issues arise!"},{"reviewerName":"Thomas D Morrison","rating":"5.0 out of 5 stars","reviewTitle":"Sturdy and reliable little pot. Buy it.","reviewDate":"January 13, 2019","reviewText":"Simply put- it does what it is supposed to do, and looks pretty nice as well. Sturdy pot. The water gets plenty hot within a couple minutes with one button press. There is no audible bell or noise when it reaches temp.\n\nRecommended."},{"reviewerName":"Ashley Akins","rating":"5.0 out of 5 stars","reviewTitle":"Great Kettle","reviewDate":"March 10, 2019","reviewText":"If you don't need to heat up a bunch at once (i consider this to be a rather small kettle, maybe 3 cups of tea at the full line) this kettle is perfect. Heats up quickly and looks cute sitting on the counter!"},{"reviewerName":"Picky Picky","rating":"5.0 out of 5 stars","reviewTitle":"Like the all steal design. Looks good.","reviewDate":"September 26, 2019","reviewText":"I most like that the inside has no silicone at the seams.\n\nI steam- burned myself a couple times the first week till I got used to the lid design vs my old one."},{"reviewerName":"Maco","rating":"5.0 out of 5 stars","reviewTitle":"this kettle seems the perfect fit with its style and robust design","reviewDate":"October 1, 2016","reviewText":"our last water kettles were poorly made stainless versions so we wanted to find one that would last and bring a bit more character/color into the kitchen. this kettle seems the perfect fit with its style and robust design.\n\ni will update again after we use it for a while, but we are very happy with this kettle in the first week."},{"reviewerName":"AS","rating":"1.0 out of 5 stars","reviewTitle":"Failed just after one year","reviewDate":"September 2, 2018","reviewText":"It failed just after one year. Do not expect this quality from KitchenAid."},{"reviewerName":"db1981","rating":"5.0 out of 5 stars","reviewTitle":"but I bought it for the design and color (pistachio) and am very happy with it","reviewDate":"May 16, 2018","reviewText":"If you are looking for a kettle with fancy functions this is not it, but I bought it for the design and color (pistachio) and am very happy with it. This is for my office and I use it only to tea. Then I have another KitchenAid Kettle at home (that I also really like) that has a digital display to show the water temperature."},{"reviewerName":"Renetia M.","rating":"5.0 out of 5 stars","reviewTitle":"cute tea pot","reviewDate":"December 18, 2018","reviewText":"very cute on the counter...light and easy to pour...doesn't hold as much water as the old cuisinart but it is so much easier to pour because it is so much lighter. i bought it again in case this one stops working."},{"reviewerName":"othentic","rating":"4.0 out of 5 stars","reviewTitle":"Gorgeous and fast","reviewDate":"June 14, 2017","reviewText":"I love it. This is a beautiful addition to my counter, and seems to work faster than any I've used. I'm only giving it four stars due to the cost. I know it's a KitchenAid, but it was significantly more expensive than others. I just had to have the pistachio, which is why I splurged..."},{"reviewerName":"One Smart Lady","rating":"5.0 out of 5 stars","reviewTitle":"Amazing. Used it multiple times daily since it's arrival ...","reviewDate":"February 6, 2018","reviewText":"Amazing. Used it multiple times daily since it's arrival last week. Boils 1.7liters under 5 minutes! Looks great on the counter. Small profile. It does not keep water warm. Not a problem."},{"reviewerName":"Xerxes777","rating":"4.0 out of 5 stars","reviewTitle":"Great Kettle. I hope the next design removes the ...","reviewDate":"July 19, 2018","reviewText":"Great Kettle. I hope the next design removes the plastic piece in the spout for the filter then its perfect."},{"reviewerName":"Emma","rating":"5.0 out of 5 stars","reviewTitle":"Quick and easy","reviewDate":"September 19, 2019","reviewText":"I have had other electric kettles but I like this one for the smaller counter space required. It heatstroke quickly and is also easy to clean the outside."},{"reviewerName":"LowerAmznCCRatesNow","rating":"5.0 out of 5 stars","reviewTitle":"Works great, not \"cobalt blue\".","reviewDate":"July 16, 2018","reviewText":"This kettle is simple and nice looking design. It is not the KitchenAid \"cobalt blue\" of KitchenAid's other blue products which is strange to me. It is a lighter blue. Works great though! Cuts off automatically so it won't burn down the kitchen!"},{"reviewerName":"Melinda Casado","rating":"5.0 out of 5 stars","reviewTitle":"Must have one of these! Great for making tea, or using our Coffee Gator (or French Press).","reviewDate":"May 10, 2017","reviewText":"Safely put on a kettle to boil! Very fast, and much more convenient than a pot of boiling water. Turns off automatically when you lift it off the base, or when it reaches a full boil."},{"reviewerName":"Lonnie E.","rating":"5.0 out of 5 stars","reviewTitle":"Awesome for small sinks","reviewDate":"July 15, 2019","reviewText":"I bought this cutie to use in my apartment. I have the master bedroom, and don't want to go into the kitchen area to have tea in the morning. Problem is, a lot of kettles are so tall, I can't fill them in my bathroom sink. This kettle was perfect. The over-the-top handle is a great design for my problem. I just thread the spout through the hole and fill it up no problem. Pretty and well-designed, too. Would definitely buy again."},{"reviewerName":"Lizzie16","rating":"5.0 out of 5 stars","reviewTitle":"Absolutely love this!","reviewDate":"November 3, 2019","reviewText":"So - you are asking yourself, why would I need an electric hot water pot? Me too - but it is really nice! Not only does it look great on the counter, but the water is hot in about 3 minutes - amazing! - and it shuts itself off. It may not be a necessity, but you will love it and use it!"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Cute","reviewDate":"December 28, 2018","reviewText":"This is super cute and it looks just like the color pictured. It heats the water is a normal amount of time and looks nice on my countertop. Oddly, the cord came a little sticky - but it was easy to wipe down and hasn't been sticky since."},{"reviewerName":"Kelly H.","rating":"5.0 out of 5 stars","reviewTitle":"Love love love this kettle","reviewDate":"September 3, 2018","reviewText":"Love love love this kettle. I have gone thru many and this one has lasted. Quick boil, holds a good amount of water. I always get compliments on it!"},{"reviewerName":"shopper911","rating":"5.0 out of 5 stars","reviewTitle":"Pretty tea pot","reviewDate":"January 25, 2019","reviewText":"I bought this for my 13 year old granddaughter. She loves to make tea when she comes to my house and was very excited to get her own. Good purchase."},{"reviewerName":"Mariusz Czapla","rating":"1.0 out of 5 stars","reviewTitle":"Electric shock water leaking through on off switch","reviewDate":"October 27, 2019","reviewText":"It started leaking through on off switch after 6 months but i thought it will be ok. Now it just stopped working after 1 year. Only 1 year. This is unacceptable. For the money which is not cheap you get crappy product which is very unsafe water leaking through on switch. People be very careful"},{"reviewerName":"Earthmummy","rating":"2.0 out of 5 stars","reviewTitle":"Not lasting even a year!","reviewDate":"January 22, 2017","reviewText":"I have not had this kettle for a year and it is already making weird noises. Really loud qrackle pop sounds."},{"reviewerName":"Mrs. Jackson","rating":"5.0 out of 5 stars","reviewTitle":"Would definitely recommend!!","reviewDate":"July 1, 2018","reviewText":"Love it! Quickly boils the water, looks stylish, keeps water warm for long periods. Great product!"},{"reviewerName":"Maddie Black","rating":"5.0 out of 5 stars","reviewTitle":"Beautiful","reviewDate":"September 1, 2019","reviewText":"I love this kettle. If it has to live on the counter, I want it to be beautiful and this hits the mark. It could be faster and larger, but those are minor and not worth any other kettle. I bought this one at a great discount because it was refurbished. 100% recommend, wouldn't have ever known it was pre-owned and was half the price."},{"reviewerName":"C. C.","rating":"5.0 out of 5 stars","reviewTitle":"Perfect!","reviewDate":"January 19, 2018","reviewText":"Heats quickly. Stylish. Love that the exterior stays cool even when the water is piping hot. I only wish it had an audible alert when the water is boiling, but if you listen, you can hear the sound \"change.\" It's not a problem, just a \"wish.\""},{"reviewerName":"Joy Thomas Anderson","rating":"5.0 out of 5 stars","reviewTitle":"Durable Kettle","reviewDate":"December 21, 2018","reviewText":"I love this kettle, did not know an electric kettle could be so good. It heats so fast and works wonderfully. A durable kettle indeed."},{"reviewerName":"Niki","rating":"4.0 out of 5 stars","reviewTitle":"Needs some modifications...","reviewDate":"December 25, 2018","reviewText":"The cord is short, it won't reach to my outlet. I need to replace the cord as it states that you are NOT to use an extension cord."},{"reviewerName":"MGS","rating":"5.0 out of 5 stars","reviewTitle":"Perfect kettle","reviewDate":"July 8, 2018","reviewText":"This is a perfect kettle. I love color and the look. It heats the water and automatically turns off. It does exactly what it is supposed to do."},{"reviewerName":"jcshakti","rating":"5.0 out of 5 stars","reviewTitle":"Too cute not to love.","reviewDate":"September 17, 2018","reviewText":"Love this little kettle. It is very efficient and fast. Perfect for me. In fact I’m so happy with it that I bought another one\nfor my friend’s birthday. I also love the color and shape."},{"reviewerName":"Reem a","rating":"1.0 out of 5 stars","reviewTitle":"Ksa","reviewDate":"November 7, 2018","reviewText":"The product does not work please contact"},{"reviewerName":"Blythe Reyes","rating":"5.0 out of 5 stars","reviewTitle":"So Beautiful!","reviewDate":"May 28, 2019","reviewText":"The color is magnificent. I purchased it for my campus apartment and my friends come over to use it sometimes. I wish the price was cheaper though but the quality is amazing."},{"reviewerName":"mom'o 3","rating":"4.0 out of 5 stars","reviewTitle":"Appearance counts","reviewDate":"October 13, 2017","reviewText":"I love this\nI had a much cheaper one that I gave to my daughter\nIf it’s going to sit on your counter you should like the looks of it"},{"reviewerName":"Jared Murray","rating":"4.0 out of 5 stars","reviewTitle":"Good","reviewDate":"December 21, 2018","reviewText":"Love the design. Very easy to use. The only complaint is the lid could be a little bit lower. It’s hard to remove it sometimes."},{"reviewerName":"Amazon Customer","rating":"1.0 out of 5 stars","reviewTitle":"Definitely not recommended unless Kitchen-aid runs rigorous tests on products obtained from ...","reviewDate":"February 25, 2017","reviewText":"The first kettle malfunctioned after first use. The replacement kettle ended up similarly. Definitely not recommended unless Kitchen-aid runs rigorous tests on products obtained from manufacturers prior to putting it up for sale."},{"reviewerName":"Amazon Customer","rating":"1.0 out of 5 stars","reviewTitle":"This kettle comes with a warning it can cause cancer","reviewDate":"November 3, 2019","reviewText":"This kettle comes with a warning it can cause cancer. Do you want to have tea and get cancer?"},{"reviewerName":"David King","rating":"5.0 out of 5 stars","reviewTitle":"Great kettle.","reviewDate":"July 11, 2019","reviewText":"Great tea kettle. Heats up so fast. Haven't had it long enough to experience the rust that I read about. Hoping I don't have that issue. So far I love it."},{"reviewerName":"Mengmeng L.","rating":"1.0 out of 5 stars","reviewTitle":"One Star","reviewDate":"January 9, 2018","reviewText":"It broke after 14 month."},{"reviewerName":"Marjorie W.","rating":"5.0 out of 5 stars","reviewTitle":"It's so great to not have to microwave water","reviewDate":"November 26, 2017","reviewText":"I'm using this as my work kettle. It's so great to not have to microwave water. It's faster than our Hamilton-Beach kettle and the spout doesn't drip.\nIt's also one of the cutest tea kettles I've ever run across."},{"reviewerName":"Marian Garrott","rating":"5.0 out of 5 stars","reviewTitle":"It’s very efficient & boils the water quickly.","reviewDate":"August 9, 2018","reviewText":"Really cute!!!! Love the black color, it matches the decor in my kitchen. My kitchen cupboards are black. I only use an electric tea kettle. Very pleased!!!"},{"reviewerName":"Guy J. Churchward","rating":"5.0 out of 5 stars","reviewTitle":"fantastic little retro kettle","reviewDate":"December 21, 2017","reviewText":"Wifey was skeptical but I dangerously ignored and purchased... fantastic little retro kettle !"},{"reviewerName":"kim U","rating":"5.0 out of 5 stars","reviewTitle":"Great durable reliable","reviewDate":"May 4, 2019","reviewText":"Love it more durable than my ceramic ones I have had in the past which breaks"},{"reviewerName":"maryanne southgate","rating":"5.0 out of 5 stars","reviewTitle":"Great product great service","reviewDate":"March 9, 2019","reviewText":"My husband loves this Xmas present from me😍. He uses it every day and is very happy with its function"},{"reviewerName":"voziavo","rating":"5.0 out of 5 stars","reviewTitle":"you can click the bottom to boil again easily.","reviewDate":"August 6, 2018","reviewText":"takes about 5 minutes. It doesn't keep the water warm. but, you can click the bottom to boil again easily."},{"reviewerName":"garcias","rating":"5.0 out of 5 stars","reviewTitle":"Just a great Electric Kettle.","reviewDate":"December 20, 2015","reviewText":"This is simply a great electric kettle. I would advise readers to ignore the issues people have about the plastic parts. The plastic parts are way up high, to the point where most people will not have issues with the water touching plastic. And the water itself tastes delicious after boiling, no plastic taste whatsoever.\n\nIt looks great, it boils water in about 3-4 minutes if I had to guess, and it's pretty big in size. It looks great in any kitchen. 5 stars! Best electric kettle I've ever used, and probably the nicest one I've ever seen in terms of how it looks in the kitchen. And while it's a bit pricey compared to the cheaper options, it's built like a tank and has a wonderful on/off switch on the side. And it shuts itself off. What's not to love?\n\nThe only real thing missing from this kettle is that it doesn't allow you to specifically set the temperature of the water, but that doesn't bother me at all, and kettles that do have this feature are more expensive, so it's not necessarily something that you would expect in this price bracket either."},{"reviewerName":"Meng Jing","rating":"3.0 out of 5 stars","reviewTitle":"Not sure","reviewDate":"July 20, 2018","reviewText":"I bought 2 of them. One works wells and the other one only work one time"},{"reviewerName":"Brendalee","rating":"5.0 out of 5 stars","reviewTitle":"I love kitchen aide and this lives up to its name","reviewDate":"June 11, 2018","reviewText":"I love kitchen aide and this lives up to its name. It’s very nice looking and sleek and it works just as it says it does and quickly."},{"reviewerName":"cmhcshopper","rating":"5.0 out of 5 stars","reviewTitle":"Such a great new appliance!","reviewDate":"January 7, 2019","reviewText":"Love it! Easy to use... SOOOO fast!!"},{"reviewerName":"Kathleen Walsh","rating":"5.0 out of 5 stars","reviewTitle":"Nice tea kettle","reviewDate":"July 2, 2019","reviewText":"Again I love the color"},{"reviewerName":"Sasa","rating":"5.0 out of 5 stars","reviewTitle":"Great kettle","reviewDate":"March 31, 2019","reviewText":"I love this kettle. It is very good quality and hold the hot water for much longer then my old one."},{"reviewerName":"Valentina","rating":"5.0 out of 5 stars","reviewTitle":"It is my MUST HAVE","reviewDate":"May 6, 2019","reviewText":"I LOVE THIS KETTLE!!! I USED IT EVERY DAY AND LOOOOOOOOOOVE IT"},{"reviewerName":"SA","rating":"5.0 out of 5 stars","reviewTitle":"Easy to use","reviewDate":"April 14, 2019","reviewText":"Love this product easy to use . Great for tea , hot chocolate ...etc."},{"reviewerName":"Artmeliana","rating":"3.0 out of 5 stars","reviewTitle":"Worked less than two years","reviewDate":"October 15, 2016","reviewText":"Beautiful little kettle. We've enjoyed using it for a year and a half, but it has stopped working. This is VERY disappointing, considering the time I put into researching kettles, carefully choosing this one, and taking care of it. The worst thing is I spent more on it than I normally would for a tea kettle...\nOh and then there's the trouble we went through to retrieve it from our old house last month, having forgotten it on moving day. Because we liked it that much.\nWish I'd kept my old stainless Oster which was still going strong after 8 years!\n\nThe switch engages, the LED lights up, but tonight it stopped in mid-boil. Bought April 2015, kaput October 2016."},{"reviewerName":"Steven","rating":"5.0 out of 5 stars","reviewTitle":"Perfect","reviewDate":"January 23, 2019","reviewText":"Works great, seems very durable"},{"reviewerName":"Li Lance","rating":"4.0 out of 5 stars","reviewTitle":"Super cute and works for what it is","reviewDate":"August 25, 2019","reviewText":"It is a great addition to our kitchen, cute color and definitely makes us drink more tea. Would be nice if we could set it to different temperatures, because this gets very hot, but we usually just throw in a couple ice cubes and it does the trick"},{"reviewerName":"Teresa Stempin","rating":"5.0 out of 5 stars","reviewTitle":"Quality product","reviewDate":"March 18, 2019","reviewText":"Fits perfect in the kitchen"},{"reviewerName":"jomarco","rating":"1.0 out of 5 stars","reviewTitle":"7 months old and rusty","reviewDate":"March 22, 2017","reviewText":"Within 6 months of buying this it started getting rust dots on bottom. I regularly cleaned it with white vinegar to remove deposits. Very disappointed in kitchen aid."},{"reviewerName":"JIMDGEM","rating":"5.0 out of 5 stars","reviewTitle":"Great tea kettle","reviewDate":"February 9, 2018","reviewText":"Great tea kettle! Heat the water very fast. The power turns off automatically when it's hot so no chance of burning the pot. Very happy with this purchase."},{"reviewerName":"Ally CHR","rating":"5.0 out of 5 stars","reviewTitle":"thrilled with this purchase - looks fantastic (haven't used yet, but am not expecting any issues from this quality brand)","reviewDate":"June 20, 2018","reviewText":"thrilled with this purchase - looks fantastic (haven't used yet, but am not expecting any issues from this quality brand)"},{"reviewerName":"lorraine larsen","rating":"4.0 out of 5 stars","reviewTitle":"Works well and looks great","reviewDate":"January 30, 2018","reviewText":"I love the color and style; it works well and quickly.\nHowever, I have washed inside numerous times and used frequently and the water has different kind of taste - I hope it goes away over time"},{"reviewerName":"Sam","rating":"5.0 out of 5 stars","reviewTitle":"Quick","reviewDate":"January 27, 2019","reviewText":"Perfect for quick hot water for...tea, instant cereal, whenever needed."},{"reviewerName":"Adrian","rating":"5.0 out of 5 stars","reviewTitle":"Perfect kettle","reviewDate":"June 18, 2019","reviewText":"Love this kettle! It’s not big and bulky and it is the perfect size. It isn’t loud when the water is heating up like my last one was!"},{"reviewerName":"Matt & Savanah","rating":"5.0 out of 5 stars","reviewTitle":"Mama approved","reviewDate":"June 10, 2019","reviewText":"Bought this for my mother for mother’s day this year she loves it!"},{"reviewerName":"Carol WBL","rating":"5.0 out of 5 stars","reviewTitle":"My daughter LOVES her tea kettle!","reviewDate":"January 14, 2019","reviewText":"I bought this for my daughter for Christmas and she began using it immediately. Every time we talk, she repeats how much she likes it and that she uses it every day. She likes the design and how it functions...success!"},{"reviewerName":"Naomi","rating":"5.0 out of 5 stars","reviewTitle":"Excellent","reviewDate":"November 3, 2019","reviewText":"like"},{"reviewerName":"Tom C.","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"October 3, 2017","reviewText":"My wife LOVES this tea kettle and no more melt downs on the stove-top!!!!!"},{"reviewerName":"Concetta Czapla","rating":"5.0 out of 5 stars","reviewTitle":"Efficient and does the job well!","reviewDate":"September 20, 2019","reviewText":"Love the design. It’s efficient and water heats up quickly."},{"reviewerName":"mimi","rating":"5.0 out of 5 stars","reviewTitle":"Best tea kettle","reviewDate":"October 25, 2019","reviewText":"My favorite appliance ever. We cannot live without our electric kettle and this one is my most favorite. It looks pretty on the counter and is very reliable. We boil a lot of water in our home so this kettle is like a trusted friend."},{"reviewerName":"Orbeaguy","rating":"5.0 out of 5 stars","reviewTitle":"Fast","reviewDate":"October 28, 2018","reviewText":"I've had this kettle for three months and it works fast and is easy to fill and clean."},{"reviewerName":"Julia","rating":"3.0 out of 5 stars","reviewTitle":"I like the look of this kettle but it's really hard ...","reviewDate":"May 14, 2018","reviewText":"I like the look of this kettle but it's really hard to clean. The water where I live is very hard and it's difficult to remove all the residue after boiling water."},{"reviewerName":"Nanc","rating":"5.0 out of 5 stars","reviewTitle":"So Far So Good","reviewDate":"December 15, 2018","reviewText":"It's been couple weeks since we purchased this product and we love.\nquick cup of tea and easy to clean."},{"reviewerName":"AB TN","rating":"5.0 out of 5 stars","reviewTitle":"Outstanding!","reviewDate":"April 21, 2016","reviewText":"I researched electric kettles obsessively for 6 weeks before taking the plunge with this one. I wanted one that would be beautiful on my countertop (as it would be there 24/7) and would function for more than just a year. I was convinced that I would buy a competitor's \"goose neck\" version, and even began stalking it for the best price. One day this popped up as an option, and though it cost $30 more than the one I had been shopping for, Kitchen Aid has always performed for me. I haven't regretted this purchase at all- it's sturdy, quick, and beautiful to look out. So very pleased!"},{"reviewerName":"Victoria","rating":"5.0 out of 5 stars","reviewTitle":"Perfect","reviewDate":"January 9, 2019","reviewText":"I love this thing! I use it everyday and it boils water extremly fast."},{"reviewerName":"IER","rating":"1.0 out of 5 stars","reviewTitle":"first one broke after 6 months, replacement broke after 5 months","reviewDate":"July 10, 2019","reviewText":"I had this kettle for half a year and it stopped working from one day to another. Since I like the design - I replaced it 5 months ago. And that one broke, too. I recommend buying a different electric kettle."},{"reviewerName":"A.C","rating":"5.0 out of 5 stars","reviewTitle":"Great look !","reviewDate":"April 20, 2019","reviewText":"Classy, Great buy"},{"reviewerName":"Liz","rating":"5.0 out of 5 stars","reviewTitle":"Love it","reviewDate":"December 12, 2018","reviewText":"Love it"},{"reviewerName":"Sanne","rating":"5.0 out of 5 stars","reviewTitle":"Love it","reviewDate":"July 11, 2019","reviewText":"Love it and cute colour"},{"reviewerName":"Reno Lott","rating":"5.0 out of 5 stars","reviewTitle":"Awesome attractive useful product!","reviewDate":"December 17, 2018","reviewText":"I absolutely love this kettle. I use it every day to make tea and instant breakfast cereal. It’s so easy to use and it looks so great on the counter. We are completely pleased with it"},{"reviewerName":"Sue Williamd","rating":"5.0 out of 5 stars","reviewTitle":"Buy first...worth extra money","reviewDate":"October 18, 2018","reviewText":"This is more than amazing. Classic looking. ..works great"},{"reviewerName":"Burolga","rating":"5.0 out of 5 stars","reviewTitle":"The appearance, quality","reviewDate":"May 6, 2019","reviewText":"Very stylish, beautiful, useful. Love it!"},{"reviewerName":"michael a krokowski","rating":"5.0 out of 5 stars","reviewTitle":"Wife loves it","reviewDate":"December 28, 2018","reviewText":"Heats quick. Very nice looking can leave on counter"},{"reviewerName":"Beverley Fraser","rating":"5.0 out of 5 stars","reviewTitle":"Good product","reviewDate":"February 7, 2019","reviewText":"The Kitchen Aid kerrle was very useful and compact so it fit just where I needed it to"},{"reviewerName":"Amazon Customer","rating":"2.0 out of 5 stars","reviewTitle":"Paint chipping off around lid on first use!","reviewDate":"October 29, 2018","reviewText":"I'm disappointed with the quality of this kettle. It smells like plastic and the paint is already chipping. Also the metal handle above gets very hot, which makes it tricky to pour."},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Great value","reviewDate":"May 19, 2019","reviewText":"Love it"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Quality product","reviewDate":"August 28, 2018","reviewText":"Never have had an electric tea kettle. Heats up the water so fast. There is a filter which I also like since our water is so hard here in Florida."},{"reviewerName":"Evelyn","rating":"5.0 out of 5 stars","reviewTitle":"Perfect for your tea full of charm","reviewDate":"April 10, 2018","reviewText":"I fell in love at first sight and when I used it the first time I was sure of the good buy. Very practical to use, it quickly heats the water, it has an automatic shut off system so I do not need to worry when I turn it on. It gave a charm to the decor of my kitchen. You even want to have 2 at home!"},{"reviewerName":"Andro","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"September 28, 2017","reviewText":"Best quality, still staying true for the brand!"},{"reviewerName":"B_ANGIE_B","rating":"5.0 out of 5 stars","reviewTitle":"great tool when you need to use all your burners to cook with!","reviewDate":"March 1, 2018","reviewText":"free up range space by using this electric kettle"},{"reviewerName":"Amazon Customer","rating":"1.0 out of 5 stars","reviewTitle":"Kitchen Aid brand new kettle rusting","reviewDate":"October 11, 2019","reviewText":"It's already rusting. I've had it for 5 weeks! I had the larger Kitchen Aid Electric for many years with no problems. I had one month to return this to Amazon and one week later it began to rust. Am I stuck with this rusty tea kettle?"},{"reviewerName":"Michelle M","rating":"5.0 out of 5 stars","reviewTitle":"Exactly as described","reviewDate":"March 3, 2019","reviewText":"Beautiful and functional"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Great looking kettle","reviewDate":"December 25, 2018","reviewText":"Amazing looking kettle, for a great price !\nDoesn’t show marks despite loud color. Small-ish reservoir vs competition."},{"reviewerName":"PKMAN","rating":"5.0 out of 5 stars","reviewTitle":"Pretty","reviewDate":"September 3, 2018","reviewText":"Pretty and easy to use"},{"reviewerName":"little old lady","rating":"4.0 out of 5 stars","reviewTitle":"all good but ...","reviewDate":"February 2, 2019","reviewText":"don't do as I did and set a hot frying pan near the base ... it melted a perfect crescent into the edge. looks a little goofy now but it still works great."},{"reviewerName":"Ignacius Merryweather","rating":"4.0 out of 5 stars","reviewTitle":"A stylish and well made kettle, with some minor drawbacks","reviewDate":"January 19, 2016","reviewText":"All in all, a great little kettle, with a couple minor drawbacks to note.\n\nPros:\nFast boiling time\nSmall footprint is great for more crowded counters like mine\nAppealing \"modern but retro\" design\nConvenient cord storage\nWell made and sturdy, in line with typical KitchenAid products in terms of quality\n\nCons:\nSmaller water volume than many other kettles\nNo way to see water level without opening the pot - I thought this wouldn't bother me, but it turns out I've come to rely on that feature\nPricier than many other stainless steel models\nPlastic filter assembly on the interior makes for a stainless steel kettle that is not fully stainless steel\n\nFor those worried about the plastic:\nYou can remove it entirely. To do so, you will need a pair of short-handled pliers, small enough to fit inside the kettle. First, slide out the filter itself by pulling upward. This will take out the filter panel, leaving the plastic filter mounting assembly. In order to remove this, you will need to look inside to locate a small stainless steel protrusion in the center of the assembly. Notice that it has been twisted in order to secure the plastic. Grasp it with your pliers, and turn, straightening out the protrusion, and releasing the plastic assembly frame. You may have to wiggle the frame a bit to get it to release. Please note that you may find that this job requires small hands - the interior of the kettle is not very roomy, and I had a hard time getting operating inside of it with the pliers."},{"reviewerName":"Benjamin R.","rating":"4.0 out of 5 stars","reviewTitle":"Attractive","reviewDate":"March 20, 2019","reviewText":"Very attractive. However the handle gets in the way when you're trying to fill the kettle with water."},{"reviewerName":"Bénédicte","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"April 18, 2018","reviewText":"This kettle is great. Fast, efficient, and looks great."},{"reviewerName":"Jenn819","rating":"5.0 out of 5 stars","reviewTitle":"Nice kettle","reviewDate":"April 22, 2018","reviewText":"Amazing kettle with traditional style. No rusting yet and I keep water in it all the time and use evey morning! Heavy duty and boils quickly. Love Kitchen Aid."},{"reviewerName":"Shay Cunlifffe","rating":"5.0 out of 5 stars","reviewTitle":"Good looking kettle","reviewDate":"January 16, 2019","reviewText":"I just bought this kettle so it's too soon to know how well it lasts. I DO know that it handles very well and looks great in my old fashioned kitchen. So far, very satisfying to fill & pour & look at."},{"reviewerName":"Amazon Customer","rating":"2.0 out of 5 stars","reviewTitle":"poor looking plastic base","reviewDate":"January 11, 2019","reviewText":"It seems that the designer who designed this beautiful kettle was fired before he finished designing the base of this product...otherwise I can't explain this poor, ugly looking, cheap plastic base..."},{"reviewerName":"Michelle W.","rating":"5.0 out of 5 stars","reviewTitle":"I love mine so much I bought one for my parents","reviewDate":"January 12, 2018","reviewText":"This electric teapot is a game changer. Water heats up really fast and it clears up a stove burner that used to be designated to a conventional kettle. Interior is SS and resists rust. I love mine so much I bought one for my parents. They use it daily."},{"reviewerName":"dischmond","rating":"5.0 out of 5 stars","reviewTitle":"Tea time","reviewDate":"November 27, 2018","reviewText":"Good product"},{"reviewerName":"Emily A","rating":"5.0 out of 5 stars","reviewTitle":"Love the look","reviewDate":"July 25, 2016","reviewText":"This is such a smart looking kettle!! I love seeing it sitting on my counter.\nIt works really well too!! Heats really really fast - just 1-2 minutes"},{"reviewerName":"Marcella a Kuhn","rating":"5.0 out of 5 stars","reviewTitle":"my little kettle","reviewDate":"February 17, 2018","reviewText":"my little kettle is wonderful. the only complaint I have is with amazon because they never let me know it was on back order and it took longer to get.\nother wise I LOVE LOVE LOVE my little red kettle"},{"reviewerName":"Lindsey Dedow","rating":"5.0 out of 5 stars","reviewTitle":"Yes it's cute, but also works great!","reviewDate":"May 3, 2018","reviewText":"Very functional, heats up quickly, and the handle doesn't get hot, which I love! Clearly it's super cute as well. Very happy with it."},{"reviewerName":"Dave","rating":"5.0 out of 5 stars","reviewTitle":"Really nice Kettle","reviewDate":"July 29, 2019","reviewText":"Does a great job. Easy to use...."},{"reviewerName":"Travis D Peterson","rating":"5.0 out of 5 stars","reviewTitle":"The unit heats up quickly and looks good on the counter","reviewDate":"February 3, 2018","reviewText":"I bought this as a gift for my girlfriend. She loves it. The unit heats up quickly and looks good on the counter. So far after daily use for month the unit still looks fantastic and does its job of boiling water."},{"reviewerName":"Tony","rating":"3.0 out of 5 stars","reviewTitle":"Quality issue","reviewDate":"November 19, 2016","reviewText":"Bought this after much research to replace my 1.7L Breville Ikon workhorse of many years. The KitchenAide is a no- frills 1.25L kettle, looks well designed and has a sturdy feel, but in just 3 weeks one of the three rubber foot pads fell off. For the same price, the Breville seemed much sturdier with a larger capacity and came with a glass lid, back-lit water level gauge and auto-on feature after removing from the charging pad."},{"reviewerName":"Joseph M Neiberger","rating":"5.0 out of 5 stars","reviewTitle":"Works great","reviewDate":"November 20, 2018","reviewText":"Good electric kettle."},{"reviewerName":"Natalia Rimareva","rating":"5.0 out of 5 stars","reviewTitle":"Great kettle","reviewDate":"November 10, 2018","reviewText":"It looks great and easy to use, I love it! I have been looking for a decent electric kettle for a while and I think I found one."},{"reviewerName":"Netta DE","rating":"2.0 out of 5 stars","reviewTitle":"The Kettle Burned at high voltage","reviewDate":"March 16, 2019","reviewText":"I live in Israel, the voltage here is higher than in the United States\nAfter being activated several times the kettle was burned.\nToo bad it is not mentioned in any way on the site"},{"reviewerName":"R. Arnadottir","rating":"5.0 out of 5 stars","reviewTitle":"😀","reviewDate":"September 30, 2018","reviewText":"😀👍👍👍👍"},{"reviewerName":"Luke Stevens","rating":"5.0 out of 5 stars","reviewTitle":"Fast and cute","reviewDate":"November 9, 2019","reviewText":"I use it all the time, much quicker for a tea drinker than kurig, I just wish the cord was a bit longer"},{"reviewerName":"zeynep","rating":"3.0 out of 5 stars","reviewTitle":"so thats a disappointment but the design is so cute","reviewDate":"December 26, 2017","reviewText":"there a plastic part inside and i can smell it after every use. so thats a disappointment\nbut the design is so cute, i love it!"},{"reviewerName":"COLLEEN TRIBOUT","rating":"5.0 out of 5 stars","reviewTitle":"The best ever","reviewDate":"August 13, 2019","reviewText":"Love, love, love everything about it."},{"reviewerName":"Enjoy Life!","rating":"5.0 out of 5 stars","reviewTitle":"Works well","reviewDate":"September 14, 2019","reviewText":"Purchased over a year ago and it is still going strong. And it is still shiny and pretty."},{"reviewerName":"Prab Brar","rating":"4.0 out of 5 stars","reviewTitle":"Good kettle","reviewDate":"June 20, 2016","reviewText":"Love this kettle, hears up water fast but I wish it had a water meter outside so I can see how much to fill. I use this everyday several times and it's holding up well"},{"reviewerName":"David","rating":"5.0 out of 5 stars","reviewTitle":"Looks Great on the Countertop","reviewDate":"January 16, 2018","reviewText":"I have the pistachio Kitchen-Aid Mixer & this matches it perfectly. It also works great as well. I love it for hot cocoa or tea, and it would be great for instant noodles or soup, too."},{"reviewerName":"ALEKSANDRA POETEK","rating":"5.0 out of 5 stars","reviewTitle":"Looks amazing and works like a charm!","reviewDate":"August 26, 2018","reviewText":"Obsessed! I use this kettle daily to make hot water for tea. It has an auto shut off and works very quickly to heat water."},{"reviewerName":"Fiercefoxie","rating":"4.0 out of 5 stars","reviewTitle":"Bought this for my mom for Mother's Day. It ...","reviewDate":"September 18, 2016","reviewText":"Bought this for my mom for Mother's Day. It heats up water quickly and she absolutely loves it. It sits on the counter and she used it daily."},{"reviewerName":"Fiona Hermiz","rating":"5.0 out of 5 stars","reviewTitle":"Easy to use","reviewDate":"October 29, 2019","reviewText":"I like it, easy to use and it takes only few min to have hot water for my tea and coffee or whatever else I need hot water for."},{"reviewerName":"Nikki Everhart","rating":"5.0 out of 5 stars","reviewTitle":"Simple and Works Great","reviewDate":"January 22, 2019","reviewText":"Love it, I'm an avid tea drinker, but I also use it to cook ramen. Simple to use, not to hard to clean, but I have small hands."},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"November 10, 2017","reviewText":"Great product , exactly as described"},{"reviewerName":"Lee Brett","rating":"5.0 out of 5 stars","reviewTitle":"Mom loves it","reviewDate":"March 15, 2019","reviewText":"Got it as a gift; works perfectly"},{"reviewerName":"Ana tobar","rating":"4.0 out of 5 stars","reviewTitle":"Super facil para mi agua caliente me ago mis test en 2 minutos","reviewDate":"August 13, 2019","reviewText":"Super practica me gusto mucho"},{"reviewerName":"Darril Noel","rating":"5.0 out of 5 stars","reviewTitle":"Top","reviewDate":"November 16, 2018","reviewText":"Super"},{"reviewerName":"irene borja","rating":"5.0 out of 5 stars","reviewTitle":"Good","reviewDate":"September 29, 2018","reviewText":"Nice"},{"reviewerName":"Hightechgenius","rating":"4.0 out of 5 stars","reviewTitle":"Longer cable length is needed, to plug in to the wall.","reviewDate":"April 15, 2018","reviewText":"I like that this product has three prong grounded electrical cable."},{"reviewerName":"Carolla","rating":"5.0 out of 5 stars","reviewTitle":"More beautiful than in the photos.","reviewDate":"January 10, 2019","reviewText":"It is quieter than my last one, and it takes up less room, and the color is even more beautiful than the photos!"},{"reviewerName":"Claire","rating":"5.0 out of 5 stars","reviewTitle":"Works and looks as expected.","reviewDate":"July 9, 2019","reviewText":"Love it! Keep it in my office for tea on demand."},{"reviewerName":"rb","rating":"5.0 out of 5 stars","reviewTitle":"nice","reviewDate":"September 23, 2019","reviewText":"that's a great brand although it's made in CHINA....!!"},{"reviewerName":"darbybv","rating":"5.0 out of 5 stars","reviewTitle":"Great purchase for coffee bar","reviewDate":"December 23, 2018","reviewText":"The product is easy to use. Very durable and boils water quickly."},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"The lid gets hot (obviously) so be careful when removing.","reviewDate":"June 24, 2019","reviewText":"Excellent. Heats up fast. Keeps everything hot. Highly recommend."},{"reviewerName":"Melanie Keely","rating":"1.0 out of 5 stars","reviewTitle":"Useless","reviewDate":"March 20, 2018","reviewText":"Ships to Australia but will not work in Australia"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Perfect little e-kettle","reviewDate":"May 3, 2019","reviewText":"I love how it turns off automatically when it reaches boiling point. I also really love how light it is an the color."},{"reviewerName":"SS","rating":"2.0 out of 5 stars","reviewTitle":"Died at 23 months","reviewDate":"January 16, 2019","reviewText":"Good kettle. Gone too soon. Sigh."},{"reviewerName":"booksupbottomsdown","rating":"5.0 out of 5 stars","reviewTitle":"Pouring accuracy- check. Boils quickly-check. Gorgeous- check!","reviewDate":"June 2, 2016","reviewText":"Pours Great, Looks Great and color is GORGEOUS! It also heats up fast. We use our electric kettles A LOT! With more than 10 people in our household we get to understand very quickly if something is going to work or not work and even hold up to heavy use. So far, 2 months in, this is working out marvelously. There was some \"plastic\" smell the first couple of times we used it, but we simply kept boiling water and dumping it. This was quickly a non issue, and no \"plastic\" smell or tastes at all now. Did I mention the color is Gorgeous, and with a quick wipe down it looks new again (not always the case with stainless products). Has excellent pouring accuracy, which is important when you make your coffee with a cone or you have children using it to make their tea. Most our tea kettles die around the 1 year mark for any number of reasons, this is always a bummer! But we do use things heavily around here, so I have come to except that. I hope this one makes it to that mark, and should I need to buy another I would do so.... mostly cause the color is gorgeous!"},{"reviewerName":"Susan Cannon","rating":"3.0 out of 5 stars","reviewTitle":"It is just ok.","reviewDate":"November 12, 2018","reviewText":"Much smaller than the picture portrays. It does not fill my ice tea picture like the other models I've used."},{"reviewerName":"sss","rating":"5.0 out of 5 stars","reviewTitle":"Pretty enough to leave out","reviewDate":"August 11, 2017","reviewText":"Electric kettles are the best. This one is pretty enough that I can leave it out on the counter (I put the heating element in a drawer)."},{"reviewerName":"edj","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"May 19, 2017","reviewText":"Super cute. Works great! I've had it about a month."},{"reviewerName":"John Tebbutt","rating":"5.0 out of 5 stars","reviewTitle":"Elegant and well made simple kettle.","reviewDate":"June 11, 2016","reviewText":"This is a beautifully designed, well made, back to basics kettle. I feel quite privileged to have something so elegant in my kitchen.\nIt is a no nonsense kettle: you put water in it, return it to its base, push a little lever down, and it boils your water (with a discreet white light near the switch to tell you it's working), clicking when it's done. No Internet connection required, no fancy filters to change, no voice control or annoying beeps. It's a kettle, pure and simple, which is all it needs to be.\nThe only issue I can think of is that it may be a little small for some people. It's only 1.25 liters (just over two and a half U.S. Pints)."},{"reviewerName":"TERESA","rating":"5.0 out of 5 stars","reviewTitle":"beautiful color, works great!","reviewDate":"March 25, 2019","reviewText":"beautiful green as pictured, heats water in a minute or two"},{"reviewerName":"Kim P.","rating":"5.0 out of 5 stars","reviewTitle":"I love this kettle","reviewDate":"April 12, 2018","reviewText":"I love this kettle! Its small, but big enough for two of us. And as an added plus it looks cute on the counter!"},{"reviewerName":"BMY3","rating":"5.0 out of 5 stars","reviewTitle":"Just Love It","reviewDate":"August 2, 2019","reviewText":"I'm very happy with this kettle."},{"reviewerName":"BW","rating":"2.0 out of 5 stars","reviewTitle":"If you line your coffee or tea hot, pass this up","reviewDate":"August 10, 2017","reviewText":"Water is not hot enough after boiling.\nGoing back to conventional Tpot 😕"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Lindisina","reviewDate":"August 23, 2019","reviewText":"Es 120v"},{"reviewerName":"Damond lee","rating":"5.0 out of 5 stars","reviewTitle":"Fast.","reviewDate":"June 17, 2019","reviewText":"Great product , fast , beautiful . I love it"},{"reviewerName":"Holly Stinson","rating":"5.0 out of 5 stars","reviewTitle":"Stylish Kettle","reviewDate":"November 22, 2017","reviewText":"We all love this water kettle, it heats quickly and is stylish. The pistachio color is very pale, if anything it is less green than the photo on Amazon."},{"reviewerName":"Miss O'Toole","rating":"4.0 out of 5 stars","reviewTitle":"Perfect except I wish it were just one cup bigger ...","reviewDate":"December 19, 2017","reviewText":"Perfect except I wish it were just one cup bigger so I could get my entire coffee press filled at one go. otherwise a VERy cheerful color and super quick boil."},{"reviewerName":"Ken","rating":"5.0 out of 5 stars","reviewTitle":"Like it","reviewDate":"August 15, 2019","reviewText":"Like it"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"March 15, 2017","reviewText":"Cute & great price"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"great quality, all for a great price","reviewDate":"February 15, 2017","reviewText":"Fast shipping, great quality, all for a great price, it is exactly what you would expect from a KitchenAid appliance."},{"reviewerName":"jlcrowley7","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"April 18, 2017","reviewText":"wonderful product heats up quickly saving energy"},{"reviewerName":"pokey","rating":"5.0 out of 5 stars","reviewTitle":"Beautiful and high quality!","reviewDate":"September 8, 2017","reviewText":"This kettle is so beautiful! High quality as you would expect from KitchenAid!"},{"reviewerName":"Rachel Spence","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"December 26, 2015","reviewText":"I am in love with this Kettle. Not only does it look great, but it is also very quite."},{"reviewerName":"Sean P. Walton","rating":"5.0 out of 5 stars","reviewTitle":"Fantastic!","reviewDate":"June 10, 2015","reviewText":"Bought it for my wife for Mothers Day, and she loves it. Now she can have tea in half the time it usually took her."},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Love it so much but have purchase several for gifts","reviewDate":"December 13, 2018","reviewText":"Easy to use, heats water up fast and is beautiful to see n my counter"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Heats up fast works great!!","reviewDate":"April 15, 2018","reviewText":"The style I love & color.\nThe cord would be easier if automatically recoiled"},{"reviewerName":"Mary","rating":"5.0 out of 5 stars","reviewTitle":"Love this kettle!!!","reviewDate":"November 27, 2015","reviewText":"Bought two of these last year for Christmas gifts, had to have one for me, we all love it!!!!"},{"reviewerName":"Erin Dailey","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"June 22, 2016","reviewText":"Fabulous kettle that's so bright and pretty I keep it out on my kitchen counter for all to see!"},{"reviewerName":"Elizabeth M","rating":"4.0 out of 5 stars","reviewTitle":"Four Stars","reviewDate":"November 20, 2017","reviewText":"Cute little kettle and it works well"},{"reviewerName":"Jack R Welch III","rating":"5.0 out of 5 stars","reviewTitle":"Very fast, use 2 times a day, no issues.","reviewDate":"July 18, 2019","reviewText":"Just make sure to put the lid on it or you will burn yourself when you pour."},{"reviewerName":"Ann","rating":"5.0 out of 5 stars","reviewTitle":"Love it!","reviewDate":"August 13, 2019","reviewText":"Love it. Excellent contemporary design. Perfect for my decor."},{"reviewerName":"JJohnson716","rating":"5.0 out of 5 stars","reviewTitle":"Love!!","reviewDate":"January 7, 2019","reviewText":"Heats in 30 seconds! Love!!"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"I love it","reviewDate":"January 2, 2019","reviewText":"Can't go wrong with this one. Looks great and does the job."},{"reviewerName":"Katherine","rating":"5.0 out of 5 stars","reviewTitle":"Fastest kettle","reviewDate":"December 18, 2016","reviewText":"This is the fastest kettle out there. Definitely worth the money."},{"reviewerName":"mainediver218","rating":"5.0 out of 5 stars","reviewTitle":"Quality build, stylish look, good design","reviewDate":"January 14, 2016","reviewText":"Just www were looking for. We drink a lot of tea and there is just nothing better than this type of kettle. Have only been using this a couple weeks but so far it's great. Heats quickly, appears very well made, quality look, and really like the color. The powered base design is definitely a plus, have had this on previous kettles and will not likely have another without this design. The only \"niggle\" is lack of a water level indicator but you quickly get used to the weight when filling as an indication of full and the spout design is such that you can fill to the bottom of the spout without water splashing out when it hits the boil. If it lasts as good as it looks we shouldn't be have to buy another any time soon."},{"reviewerName":"Eric C. Allais","rating":"5.0 out of 5 stars","reviewTitle":"Fast boiler, great looking","reviewDate":"November 5, 2017","reviewText":"What do you expect from KitchenAid. Solid, small footprint for counter top. Fast boiling and easy pour spout. Nothing cheap about it."},{"reviewerName":"Mallory","rating":"5.0 out of 5 stars","reviewTitle":"good looking kettle","reviewDate":"December 31, 2018","reviewText":"good quality and looks great in the kitchen. heats water super quickly"},{"reviewerName":"Forcbe Withu","rating":"5.0 out of 5 stars","reviewTitle":"Easy to Use","reviewDate":"December 9, 2018","reviewText":"Great Product! Heats up our water quickly for our hot chocolate and hot tea during this cold frosty weather!"},{"reviewerName":"D","rating":"4.0 out of 5 stars","reviewTitle":"Good!","reviewDate":"July 6, 2019","reviewText":"This is good! Handle gets a bit warm. But never hot. Very happy"},{"reviewerName":"marcy sumoski","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"August 15, 2017","reviewText":"I love this teapot. I got the green, it's beautiful in my kitchen!"},{"reviewerName":"Susan Seden","rating":"5.0 out of 5 stars","reviewTitle":"The best electric tea kettle I've seen","reviewDate":"September 10, 2017","reviewText":"This was fabulous! Heat up fast and it is hot and ready for you tea bag. The best electric tea kettle I've seen."},{"reviewerName":"wildernessheals","rating":"4.0 out of 5 stars","reviewTitle":"Four Stars","reviewDate":"July 16, 2016","reviewText":"I love this kettle! I only gave 4 stars because the cord is too short to reach my outlets."},{"reviewerName":"Misho Herdez","rating":"5.0 out of 5 stars","reviewTitle":"Excelente","reviewDate":"July 14, 2019","reviewText":"Compre el artículo nuevo y llego en perfectas condiciones, excelente precio y calidad"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Color is awesome! Works very well--we use it every morning to ...","reviewDate":"September 6, 2017","reviewText":"Color is awesome! Works very well--we use it every morning to make coffee. Heats it up in about 3-4 mins."},{"reviewerName":"Marya","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"April 26, 2018","reviewText":"love it"},{"reviewerName":"Rachel Cook","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"March 21, 2018","reviewText":"Great product, sturdy, looks good."},{"reviewerName":"Alison","rating":"5.0 out of 5 stars","reviewTitle":"Love!","reviewDate":"March 22, 2016","reviewText":"Beautiful classic color. High quality but purchased insurance as kettles seem to last about a year."},{"reviewerName":"Kindle Customer","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"April 2, 2017","reviewText":"I really love this kettle...it is easy to clean and handle."},{"reviewerName":"Barbara sargent","rating":"5.0 out of 5 stars","reviewTitle":"This kettle is absolutely awesome!! First it was bigger than I thought ...","reviewDate":"May 8, 2015","reviewText":"This kettle is absolutely awesome!! First it was bigger than I thought it was and fast?!! So freaking fast!! I really love it!"},{"reviewerName":"William Butler","rating":"5.0 out of 5 stars","reviewTitle":"Perfect.","reviewDate":"January 3, 2019","reviewText":"This is the one you are looking for. Buy it."},{"reviewerName":"Melissa","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"February 13, 2018","reviewText":"I really like this electric teapot. It turns off after it boils. It boils the water very quickly."},{"reviewerName":"Nefissa Elfiky","rating":"5.0 out of 5 stars","reviewTitle":"Tea kettle","reviewDate":"August 24, 2019","reviewText":"The color and the performance"},{"reviewerName":"John R Gleason","rating":"4.0 out of 5 stars","reviewTitle":"Super good looking on my counter","reviewDate":"June 11, 2016","reviewText":"very fast to boil. Only negative is that there is no view to the water level. Super good looking on my counter."},{"reviewerName":"Brenda Whitmer","rating":"5.0 out of 5 stars","reviewTitle":"Great product","reviewDate":"January 12, 2019","reviewText":"Really enjoy the hot water in demand."},{"reviewerName":"jj","rating":"5.0 out of 5 stars","reviewTitle":"Love the look","reviewDate":"May 28, 2019","reviewText":"Love it"},{"reviewerName":"Huggybear","rating":"5.0 out of 5 stars","reviewTitle":"Fantastic Kettle!","reviewDate":"July 23, 2016","reviewText":"Love, love, love this beautiful kettle! Heats water super fast and looks great on my countertop."},{"reviewerName":"K. Sumner","rating":"5.0 out of 5 stars","reviewTitle":"Had it for 6 months now and all seems good.","reviewDate":"January 21, 2017","reviewText":"So cute! Had it for 6 months now and all seems good."},{"reviewerName":"Ellie Wiley","rating":"1.0 out of 5 stars","reviewTitle":"short circuit","reviewDate":"July 23, 2019","reviewText":"I bought in February andit already has a short circuit"},{"reviewerName":"Samina","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"September 11, 2017","reviewText":"The kettle not only looked very nice but also works really well."},{"reviewerName":"Cathee","rating":"5.0 out of 5 stars","reviewTitle":"Love it.","reviewDate":"August 2, 2016","reviewText":"Love this kettle, boils fast and looks great. Shipping was incredibly fast. Just wish it came a little bit bigger. KitchenAid should make more counter top appliances in this colour."},{"reviewerName":"HS","rating":"5.0 out of 5 stars","reviewTitle":"Kettle shuts off automatically.","reviewDate":"December 7, 2018","reviewText":"Love that this kettle is easy to clean and shuts off automatically."},{"reviewerName":"graymouth","rating":"5.0 out of 5 stars","reviewTitle":"I use it every day and love it.","reviewDate":"November 9, 2017","reviewText":"Cute little kettle that heats up water phenomenally fast. I use it every day and love it."},{"reviewerName":"Elizabeth Busch","rating":"5.0 out of 5 stars","reviewTitle":"Great look","reviewDate":"April 3, 2019","reviewText":"So Far love looks great"},{"reviewerName":"G. Lampley","rating":"5.0 out of 5 stars","reviewTitle":"Be","reviewDate":"July 10, 2018","reviewText":"Love this tea kettle."},{"reviewerName":"Elizabeth Reviewer","rating":"5.0 out of 5 stars","reviewTitle":"Exactly as described.","reviewDate":"December 18, 2018","reviewText":"Pricey - but worth it!"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"I love the fact that I do not need to supervise ...","reviewDate":"January 30, 2018","reviewText":"I love the fact that I do not need to supervise when the water is boiling because turns off automatically"},{"reviewerName":"william simpson jr","rating":"5.0 out of 5 stars","reviewTitle":"Quick works great","reviewDate":"September 15, 2019","reviewText":"Enjoy using the Electric Kettle, Quick and easy to use."},{"reviewerName":"N. Alamer","rating":"1.0 out of 5 stars","reviewTitle":"Missing part of the device","reviewDate":"March 11, 2019","reviewText":"The device is received without a wire and without a base"},{"reviewerName":"SUSAN A LASKO","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"September 6, 2016","reviewText":"works great and quick"},{"reviewerName":"Moonchild","rating":"5.0 out of 5 stars","reviewTitle":"We love it so far","reviewDate":"August 1, 2016","reviewText":"We love it so far! Looks great and the color is wonderful. Heats quickly. Any extra length to the cord that you don't need wraps and stores under the base. Handle does not move and is in a fixed position. Cord is heavy duty. It does make a slight \"rattle\" noise as the water starts to boil, but I don't find it offensive - it just lets me know it is starting to boil. Turns off promptly. Switch has a light so you know at a glance that you turned it on. There is a marker for maximum water level, but if there is a \"minimum\" water level, I missed that then in the instructions. Outside of the kettle does get a bit warm, but the handle stays cool Pours without any spilling or splashing - which is a big, big plus."},{"reviewerName":"Katherine Wooten","rating":"5.0 out of 5 stars","reviewTitle":"Delivered promptly and no problems with product","reviewDate":"November 15, 2018","reviewText":"Great quality. Very attractive. Works great."},{"reviewerName":"James E. Saunders","rating":"5.0 out of 5 stars","reviewTitle":"Excellent Basic Electric Kettle","reviewDate":"July 1, 2016","reviewText":"KitchenAid products are typically excellent. So is this example. It can boil a good bit of water pretty quickly, but if you're only wanting enough to make a cup of instant coffee (don't roll your eyes) it is really fast. The construction seems really first rate and I think it is nice looking, though of course that is purely subjective. The opening is the top is big enough to get your hand in to clean the kettle. The handle gets warm, but not hot. The handle on the lid does get pretty hot, but it's a non-issue if you're not boiling one pot right after another.\n\nIf you're looking for an electric kettle, and if this style appeals to you, you shouldn't be disappointed. It doesn't do anything fancy, KitchenAid has another kettle that has way more features than I have a need for, and which by all accounts beeps every time you look its way. This one only boils water quickly."},{"reviewerName":"Claudia Viveros","rating":"5.0 out of 5 stars","reviewTitle":"Fastest boil ever","reviewDate":"November 17, 2018","reviewText":"Boiling water to make tea and hot chocolate"},{"reviewerName":"Tram Nguyen","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"July 19, 2018","reviewText":"Just love all the kitchen aid products."},{"reviewerName":"djohan","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"December 3, 2016","reviewText":"Very nice! Easy to use, pretty color. The con is wish that the electric cord was a little longer."},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Recommended 100%","reviewDate":"August 2, 2018","reviewText":"Loved it"},{"reviewerName":"margaret Harrington","rating":"5.0 out of 5 stars","reviewTitle":"How cute it looks on counter!!","reviewDate":"February 11, 2018","reviewText":"Love it . I do not know why I never had one. Heats water fast and steaming!"},{"reviewerName":"christine rothbart","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"September 21, 2016","reviewText":"Love the look and small foot print. Only wish there was a filling measure visible from outside"},{"reviewerName":"DK","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"February 7, 2018","reviewText":"Like it"},{"reviewerName":"David M","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"June 12, 2018","reviewText":"Amazing. And works perfect. And very gorgeous"},{"reviewerName":"Frank","rating":"5.0 out of 5 stars","reviewTitle":"Boils quickly. Like a kettle should. Also pretty cute lookin. Win.","reviewDate":"July 13, 2019","reviewText":"See headline."},{"reviewerName":"CaLGaL","rating":"5.0 out of 5 stars","reviewTitle":"Works well and looks good in my kitchen.","reviewDate":"August 8, 2018","reviewText":"Pretty and useful."},{"reviewerName":"Alyson Dallas","rating":"5.0 out of 5 stars","reviewTitle":"Perfect!","reviewDate":"July 17, 2019","reviewText":"Love my kettle"},{"reviewerName":".","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"June 3, 2018","reviewText":"I love this Electric Kettle."},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Some like it hot...","reviewDate":"April 7, 2017","reviewText":"So great! I'm in love with how this kettle heats my water quickly, no loud whistle either!"},{"reviewerName":"Roman","rating":"5.0 out of 5 stars","reviewTitle":"Good surprise","reviewDate":"December 28, 2018","reviewText":"Have Plastik smells"},{"reviewerName":"Jorge R.","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"January 25, 2018","reviewText":"Excelent product, very good quality."},{"reviewerName":"Dominic McCabe","rating":"5.0 out of 5 stars","reviewTitle":"Perfect kettle","reviewDate":"October 6, 2017","reviewText":"Two months later, I'm still marveling at this perfect kettle."},{"reviewerName":"Nancyk","rating":"5.0 out of 5 stars","reviewTitle":"It was a gift for my daughter and she loved it.","reviewDate":"June 20, 2018","reviewText":"It was a gift for my daughter and she loved it."},{"reviewerName":"Benlex","rating":"5.0 out of 5 stars","reviewTitle":"Best kettle you may ever own","reviewDate":"February 15, 2018","reviewText":"it not plastic, cooks water fast, light, easy to use"},{"reviewerName":"HATTIE I. MCCRAE","rating":"5.0 out of 5 stars","reviewTitle":"Very good product","reviewDate":"November 6, 2019","reviewText":"Love it!!"},{"reviewerName":"Hassan A Liban","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"August 25, 2017","reviewText":"I get my tea instantly, and it works perfectly."},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"July 26, 2018","reviewText":"Love it!"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"September 15, 2016","reviewText":"boils quickly, no hassle...."},{"reviewerName":"Paula Venturini Nireki","rating":"5.0 out of 5 stars","reviewTitle":"Fácil e prático","reviewDate":"November 30, 2018","reviewText":"Simplesmente adorei"},{"reviewerName":"girlmama","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"May 19, 2017","reviewText":"Works great after 6 months of daily use, and looks amazing in my kitchen!"},{"reviewerName":"Sandy","rating":"5.0 out of 5 stars","reviewTitle":"Whimiscal teapot","reviewDate":"May 3, 2017","reviewText":"This teapot works perfectly. The color and design are pleasing and adds a nice touch to my kitchen."},{"reviewerName":"Darth Fitch","rating":"4.0 out of 5 stars","reviewTitle":"Four Stars","reviewDate":"January 28, 2016","reviewText":"Nice piece to look at. Does its job well but wish there was an audible indicator when done."},{"reviewerName":"K Blackman","rating":"5.0 out of 5 stars","reviewTitle":"Worth the extra dollars. Best kettle.","reviewDate":"March 13, 2016","reviewText":"This is one of the best kettles i have ever bought. OK so it cost more but trust me it's worth every penny. Pours great, very quiet and looks perfect."},{"reviewerName":"RVAgirlfromSS","rating":"5.0 out of 5 stars","reviewTitle":"Best Kettle I Have Ever Owned","reviewDate":"December 7, 2015","reviewText":"I love this kettle! It has a nice weight to it, and does not feel flimsy or cheaply made like the less expensive kettles. To prevent rust and scaling I dry the lid and leave it off after use. I have found that if I pick it up at the back half of the handle it is easier to pour than the pitcher style kettles, and it takes up less space on my counter than my last kettle did. This kettle is nicer than the Capresso kettle I had previously owned. Like other reviewers have noted there is a small amount of plastic on the inside, this does not bother me. I think this kettle is worth every penny!"},{"reviewerName":"tamara davydova","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"August 2, 2017","reviewText":"Love this kettle. Great design and easy to use. It makes 4 cups at a time."},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Quick kettle!","reviewDate":"January 20, 2017","reviewText":"I love this kettle! It works so fast. Looks very stylish on my counter too!"},{"reviewerName":"Susan Mcneely","rating":"5.0 out of 5 stars","reviewTitle":"Kettle.","reviewDate":"October 11, 2018","reviewText":"Loved it."},{"reviewerName":"Sino ka","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"November 15, 2017","reviewText":"Good"},{"reviewerName":"Kristine Petersen","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"February 21, 2017","reviewText":"Love this little kettle- I also love all the Engine Red KitchenAid products!"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"September 24, 2016","reviewText":"I'm in love with this! It's so cute, the color is adorable and of course - works perfectly."},{"reviewerName":"Mrs. Mary B Starsick","rating":"2.0 out of 5 stars","reviewTitle":"Metallic smell and taste","reviewDate":"October 17, 2016","reviewText":"I gave you his kettle two stars for looks and function. It works well, however it has a metallic smell and taste that transfers to your tea. I tried cleaning with vinegar water to no avail. I debated whether to get a metal or glass kettle and chose this one because I liked the looks. Big mistake."},{"reviewerName":"SkyeBlu","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"March 13, 2017","reviewText":"Tea kettle works GREAT! We use it for staff and faculty meetings as we have several tea drinkers."},{"reviewerName":"Marta T.","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"November 15, 2016","reviewText":"This kettle is easy to fill and pour from. It heats water efficiently while looking great on my counter."},{"reviewerName":"Thais","rating":"5.0 out of 5 stars","reviewTitle":"Great buy","reviewDate":"June 3, 2017","reviewText":"Great size and works really well."},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Great kettle!","reviewDate":"June 5, 2017","reviewText":"Great appliance, have one at home and work!"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"August 12, 2017","reviewText":"NO worries about burning down house using gas stove. 😁"},{"reviewerName":"TexasMom","rating":"5.0 out of 5 stars","reviewTitle":"I love this kettle!","reviewDate":"August 17, 2016","reviewText":"I use this kettle almost every day. It is quick and keeps the water hot. I turn it on in the morning and go about getting ready for work. When I come back the water is hot. It takes about 5 min to boil maybe, I haven't times it but I have fussed around the kitchen until it was done and it isn't long.\n\nIt was also very important to me that the kettle look like a kettle. So many electric kettles on the market look like coffee pots. I think this one is very stylish.\n\nI would buy it again. It's worth the money."},{"reviewerName":"Diego","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"February 1, 2017","reviewText":"Works perfect"},{"reviewerName":"Otis Maximus williams","rating":"3.0 out of 5 stars","reviewTitle":"this is a great kettle! does a fine job","reviewDate":"September 11, 2017","reviewText":"this is a great kettle! does a fine job!\n\nhowever i am having to give it away, because my kitchen circuit also has the refrigerator on it; this thing draws some serious amperage, and it kicks my kitchen circuit breaker every other time\n\nolder house, wiring not quite what it should be\n\nso be forewarned, if you have a problem with appliances kicking breakers in the kitchen, this is not for you\n\notherwise, this is a wonderful product, so well built and so nice to use"},{"reviewerName":"andrew","rating":"4.0 out of 5 stars","reviewTitle":"Four Stars","reviewDate":"March 25, 2017","reviewText":"It's great."},{"reviewerName":"Ragarone","rating":"5.0 out of 5 stars","reviewTitle":"So cute!","reviewDate":"February 22, 2016","reviewText":"Heats quickly and it looks SO cute! I love the style and color of this kettle. I am happy with the speed at which it heats the water. A window to check the water level would be nice, but it's really simple and easy to figure the water level by just picking it up. I love it."},{"reviewerName":"zach","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"February 2, 2017","reviewText":"Best thing when paired with a French Press."},{"reviewerName":"Tassia Stemmer","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"September 11, 2017","reviewText":"I Love it"},{"reviewerName":"ThatsLikeYourOpinionMan","rating":"4.0 out of 5 stars","reviewTitle":"Works wonderfully, but no way to take lid off without ...","reviewDate":"February 5, 2017","reviewText":"Works wonderfully, but no way to take lid off without burning your hand. Unless you wait for quite a while after boiling, as soon as you remove the lid a cruel assault of steam will ruin your hand. There's really no way around this. Again, this kettle definitely works, looks nice, and seems well constructed. Just a bit scary at times because of the design."},{"reviewerName":"Francisco Sens","rating":"4.0 out of 5 stars","reviewTitle":"It is very nice, but I think it's too noisy","reviewDate":"August 17, 2016","reviewText":"Design is everything! It is very nice, but I think it's too noisy."},{"reviewerName":"Justin J.","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"November 6, 2016","reviewText":"cheaper because it's blue? please and thank you"},{"reviewerName":"Amazon Customer","rating":"4.0 out of 5 stars","reviewTitle":"Four Stars","reviewDate":"March 29, 2016","reviewText":"Looks real pretty, doesnt hold a huge amount of water but it works for us."},{"reviewerName":"Elisa","rating":"4.0 out of 5 stars","reviewTitle":"beautiful!","reviewDate":"April 4, 2016","reviewText":"I have to say that I really love this brand, it works very well and the design is attractive and fashionable. This kettle is silent and very quick, the reason I give it four stars is that the handle on the top, even if it is beautiful, doesn't allow you to pour water so easily and I really hope the switch will last because it looks like it's made of plastic and it doesn't seem to be very strong."},{"reviewerName":"Susan D. Stauber","rating":"5.0 out of 5 stars","reviewTitle":"Perfect for my office","reviewDate":"June 16, 2016","reviewText":"Very fast and efficient! Perfect for my office."},{"reviewerName":"KMom","rating":"5.0 out of 5 stars","reviewTitle":"Would buy again!","reviewDate":"August 2, 2016","reviewText":"Love this kettle!!"},{"reviewerName":"Willie Knolmayer","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"July 2, 2016","reviewText":"Daughter loved it"},{"reviewerName":"Cynthia T","rating":"3.0 out of 5 stars","reviewTitle":"Design flaw","reviewDate":"August 31, 2016","reviewText":"While this kettle is nice looking the design is a little off. It's virtually impossible to get all the water out after use. So, of course, that contributes to the rusting effect."},{"reviewerName":"SmW","rating":"5.0 out of 5 stars","reviewTitle":"I love the color and design but it doesn't hold a ...","reviewDate":"November 28, 2016","reviewText":"Total luxury purchase for myself. I love the color and design but it doesn't hold a ton of water at once. There's even a little LED in the switch when it's on. Kind of a shirt cord, but it's meant for a counter. Very cool metal design, little plastic filtration inside and the base is plastic with the metal connector."},{"reviewerName":"ncstorace","rating":"5.0 out of 5 stars","reviewTitle":"Love the style of this one","reviewDate":"June 21, 2017","reviewText":"Love the style of this one ... almost kept it, but decided to go with the cheaper, larger one. I so wanted to have both, though. This one is more stylish and better made. Wasn't sure I'd like the pull-off handle, but the spout is large enough to fill from the tap. If the current one conks out, I'll replace with this one."},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"June 6, 2016","reviewText":"good!"},{"reviewerName":"Dani H.","rating":"5.0 out of 5 stars","reviewTitle":"Everyday essential","reviewDate":"June 6, 2016","reviewText":"This little kettle has become essential in my everyday - works really well, boils just enough water for me to later pour into a pot to make a serving or two of pasta or fill up my big tea pot, heats up quickly, the stainless steel has stayed clean, and it's cute to boot. It took a few boils to get a weird smell out, but only about a week later it was perfectly fine."},{"reviewerName":"SWMBO","rating":"5.0 out of 5 stars","reviewTitle":"This is a great kettle and I love the red color","reviewDate":"April 3, 2016","reviewText":"This is a great kettle and I love the red color. It doesn't hold as much water as others I've used but, as I live alone now, for me it is actually perfect. It's easy to fill, I like the fact the lid comes out rather than just flipping up."},{"reviewerName":"C. Blankenship","rating":"5.0 out of 5 stars","reviewTitle":"You need this kettle.","reviewDate":"March 15, 2016","reviewText":"Love it. This kettle boils a full pot in 5 minutes or less. Very quiet and small enough to leave on your counter. Easy to fill and clean. The handle does not get hot as I thought it might. This kettle should last a long time."},{"reviewerName":"Dav","rating":"5.0 out of 5 stars","reviewTitle":"Simple & Elegant Design, a lovely Appliance","reviewDate":"December 22, 2014","reviewText":"This kettle is perfect for our needs. Quite simple to use and lovely to look at. An excellent design feature is that Kitchen Aid put the electrical connection at the center of the base so the kettle makes a solid connection no matter how it is rotated, no fumbling about setting the kettle on its base. A full kettle takes a little over 5 minutes to boil, not the fastest but not too bad either. No buzzers or beeps either like some other models. It has one switch that you depress to turn in on that will flip itself off when the water's hot. Did I mention it was simple?\n\nIf you are looking for a quality \"uncomplicated\" kettle this may be the one for you. Also be aware this kettle's metal surfaces get HOT except for the handle, so use with care."},{"reviewerName":"Timothy Smith","rating":"5.0 out of 5 stars","reviewTitle":"Family Loves This Item","reviewDate":"November 27, 2016","reviewText":"We use this kettle every day multiple times. My wife and son are making tea or boiling water for hot chocolate all the time. We got the blue one and it is beautiful. Very well made item. Well worth the money."},{"reviewerName":"Lamar","rating":"4.0 out of 5 stars","reviewTitle":"You're going to like the way it looks; I guarantee it","reviewDate":"May 17, 2016","reviewText":"It's short and fat, where most electric kettles are tall and thin. Holds enough water for a pot of tea, boils it faster than a kettle on a gas stove, and turns itself off when it's done. All in all, a good buy."},{"reviewerName":"Hector L.","rating":"5.0 out of 5 stars","reviewTitle":"Sharp. Efficient. Better.","reviewDate":"December 10, 2016","reviewText":"This kettle works very well. Efficient. Not to mention looks very sharp.\nConstruct, design, and functionality are all top notch. Well worth the extra bucks from a generic looking kettle."},{"reviewerName":"Amy","rating":"5.0 out of 5 stars","reviewTitle":"I love this kettle","reviewDate":"May 1, 2016","reviewText":"I love this kettle! I wanted a basic electric kettle and this fit the bill. No bells and whistles, just flip the switch to boil water. It's louder than I expected, but not unbearably so. It's really pretty on my kitchen counter."},{"reviewerName":"DDBlue","rating":"4.0 out of 5 stars","reviewTitle":"Form over Function","reviewDate":"January 3, 2017","reviewText":"Expected better quality from KitchenAid. The critical 'on' lever is plastic. We know how that's going to go. Looks nice, but it's awkward to fill with water. Sharp metal edges."},{"reviewerName":"Sara Smith","rating":"5.0 out of 5 stars","reviewTitle":"... take tea at home what make this one the perfect size. Very well built","reviewDate":"March 29, 2016","reviewText":"I'm the only one that take tea at home what make this one the perfect size. Very well built. Based on reviews I was expeting lots of plastic parts but there are just 2 or 3 tyne ones inside. Cool design looks great in my kitchen"},{"reviewerName":"Kate B.","rating":"5.0 out of 5 stars","reviewTitle":"... really put this to the test and it is awesome! The only thing I would like different would ...","reviewDate":"August 14, 2016","reviewText":"My husband and I have really put this to the test and it is awesome! The only thing I would like different would be the handle. If you re-fill it again shortly after using, you have to watch the steam. If the handle curved down the side more, like some other teakettles, you could avoid this."},{"reviewerName":"Constance","rating":"5.0 out of 5 stars","reviewTitle":"Love it","reviewDate":"February 23, 2017","reviewText":"I didn't realize how much I would use this. It matches my kitchen nicely, and is attractive too. I use it every day for herbal tea; I also use it for making oatmeal. I like that the outside of the kettle does not get hot."},{"reviewerName":"Kathy Kelley","rating":"5.0 out of 5 stars","reviewTitle":"Absolutely love it!","reviewDate":"March 1, 2017","reviewText":"I love my KitchenAid kettle. It's pretty and beats a stove top kettle and microwave for speed, hands down. The cord wraps nicely underneath the base as well, and the base is heavy, so holds it in place which is a huge plus. I've had this kettle for awhile and it still looks bright and shiny and everything works well. It doesn't stain inside or out. This kettle is everything I was hoping for in a kettle. It was also packaged well and arrived in less time than anticipated. As for the plastic, big freaking deal! The water for 1 full cup of tea boils below the plastic, and all one has to do is pour it out. No smells, no taste, no rust, nothing. Rust, by the way, would be from someone's water, because stainless steel doesn't rust. With all the toxins in our air, water, food, and everything else, I don't think I'm going to die because of a bit of plastic in a kettle!"},{"reviewerName":"JAG51","rating":"5.0 out of 5 stars","reviewTitle":"Love it","reviewDate":"January 1, 2016","reviewText":"A very beautifully made water kettle. Heats the water in 5 minutes for the whole pot."},{"reviewerName":"Echo4Sierra","rating":"5.0 out of 5 stars","reviewTitle":"Aesthetics and function","reviewDate":"February 13, 2017","reviewText":"This is much quieter than my previous electric kettle. It's so dang cute too!"},{"reviewerName":"Eliot Sluyter","rating":"4.0 out of 5 stars","reviewTitle":"so I love it. Heats water quickly for tea/coffee","reviewDate":"May 5, 2016","reviewText":"My fiancee loves it, so I love it. Heats water quickly for tea/coffee! Matches our KitchenAid Artisan mixer of the same color, so that's neat too. My only concern is some water goes underneath a panel inside the kettle, so that may prove very hard to clean long-term (or we wouldn't be able to tell when cleaning might be required). Another unexpected thing is the handle doesn't hinge/fold, its permanently fixed upright. Not really a problem, just slightly annoying"},{"reviewerName":"M. Lewis","rating":"3.0 out of 5 stars","reviewTitle":"Thought power cord was only 12 inches, but more is hidden under the base","reviewDate":"February 25, 2015","reviewText":"I'm changing my review because someone here pointed out to me that the cord is wrapped under the base and they are right. Now it is just long enough to be able to use on a table across from my sink. I've only used it a few times, so I am not giving a full review but so far I like it. I bought it to replace my glass electric kettle that has silicone at the base."},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Adorable. Perfect size for me to fill up two ...","reviewDate":"January 18, 2017","reviewText":"Adorable. Perfect size for me to fill up two large to go mugs with tea in the morning. Love the color. Looks so cute on my counter. Heats water incredibly fast. I've never owned an electric kettle before, so I'm super impressed."},{"reviewerName":"Catleya Wizebrowne","rating":"4.0 out of 5 stars","reviewTitle":"Good product.","reviewDate":"May 2, 2017","reviewText":"This is a good product. It works as it is supposed to."},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"our office loves it","reviewDate":"May 25, 2016","reviewText":"great product. This replaced two other lemons that busted within days or weeks. That said we are still in the first month of the product. We truly hope it continues to perform well because we love it. Very little plastic inside. Zero would have been better, but every other one of the market that we checked out has more."},{"reviewerName":"Amazon Customer","rating":"4.0 out of 5 stars","reviewTitle":"but i will still give a 4 star for its beautiful design of the led indicator above the control","reviewDate":"October 18, 2016","reviewText":"The only problem is the noise when boiling water, but i will still give a 4 star for its beautiful design of the led indicator above the control button"},{"reviewerName":"gayle ingram","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"March 9, 2015","reviewText":"love my teapot!!!!!!!!!!!"},{"reviewerName":"Discerning","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"September 9, 2015","reviewText":"Great"},{"reviewerName":"Kyle Minor","rating":"5.0 out of 5 stars","reviewTitle":"A great kettle.","reviewDate":"January 3, 2017","reviewText":"Excellent kettle! You don't even have to fill it to a point above the heating element, because the element is the whole bottom panel. Clever! Very good looking, too. Light, but well made."},{"reviewerName":"Al Strickland","rating":"4.0 out of 5 stars","reviewTitle":"Ideally I would like it a little larger","reviewDate":"December 28, 2016","reviewText":"Ideally I would like it a little larger. When making a full pot of coffee in a french press I have to overfill the pot a little bit."},{"reviewerName":"Wilson","rating":"5.0 out of 5 stars","reviewTitle":"we like it.","reviewDate":"April 7, 2016","reviewText":"cord is a little cumbersome, but at least it's short. we like it."},{"reviewerName":"Andrew","rating":"4.0 out of 5 stars","reviewTitle":"Four Stars","reviewDate":"January 5, 2016","reviewText":"Works great, wish I would have gotten one with some sort of indicator of how full it was."},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"April 23, 2016","reviewText":"Works well, definitely met expectations. Hoping it will last several years."},{"reviewerName":"William O'Shea","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"March 1, 2016","reviewText":"Love this kettle."},{"reviewerName":"Pen Name","rating":"5.0 out of 5 stars","reviewTitle":"Great product!","reviewDate":"February 19, 2016","reviewText":"Love this kettle. Use it every day."},{"reviewerName":"Dimitar N.","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"December 14, 2016","reviewText":"Very nice"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"April 6, 2017","reviewText":"excellent superefficient kettle"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"April 25, 2016","reviewText":"Love it!"},{"reviewerName":"LP","rating":"2.0 out of 5 stars","reviewTitle":"Black chips off","reviewDate":"December 27, 2015","reviewText":"After using daily for 2 months, the black paint is chipping off of the rim of the opening. I should have gotten the stainless steel finish. Other than that, I love the styling and it heats quickly."},{"reviewerName":"TwinMama","rating":"5.0 out of 5 stars","reviewTitle":"Gorgeous, functional kettle.","reviewDate":"January 11, 2017","reviewText":"I am quite the tea enthusiast who probably drinks around 6-8 cups of tea a day. When I'm at home, I am a traditionalist who loves the ritual of preparing tea using a stove top whistling kettle, but I wanted something so that I could set up a tea station in my office at work. So I bought this fantastic electric kettle, and I could not be more pleased. When filled to the max level marker, mine heats to a boil in approx. 3 minutes, and holds enough water to make about 5 cups of tea, so I typically don't even need to refill it during my workday. I also love the auto off feature. The exterior is very shiny and gorgeous - it is so aesthetically pleasing, I get complements on it from all my coworkers. This kettle feels very sturdy and solidly built, and the comfortable handle never gets too hot to touch. Also, I have absolutely no issues with drips from the spout after pouring. I'd recommend it to anyone. I've attached a photo of my lovely, calming tea station. Cheers."},{"reviewerName":"Carol H.","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"February 1, 2015","reviewText":"jest exactly what I wanted"},{"reviewerName":"Sandy K.","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"March 1, 2016","reviewText":"X-mas gifts."},{"reviewerName":"Amazon Customer","rating":"2.0 out of 5 stars","reviewTitle":"Only 120 volts !! Don't purchase for the UK.","reviewDate":"July 17, 2016","reviewText":"Kettle is only 120volts so not much use in the UK without a transformer."},{"reviewerName":"jules2482","rating":"1.0 out of 5 stars","reviewTitle":"Please don't buy this unless you've checked it is compatable. Much smaller then appears. More money spent on delivery.","reviewDate":"May 19, 2016","reviewText":"Very disappointed. Kettle finally arrived. Smaller then thought and described. There had been no information when I ordered that it was not compatable for the uk. Bought a transformer which was even bigger then the kettle. Very disappointed . Cost me £25.00 to send back. Never order from them again. Have emailed them but no response. Wouldn't have given 1 star but wouldn't let me review without it."},{"reviewerName":"Katawampas","rating":"4.0 out of 5 stars","reviewTitle":"Pretty Electric Kettle- 1500 Watts - Some Plastic Inside","reviewDate":"March 18, 2015","reviewText":"This is a pretty electric kettle with some plastic inside.\n\n-It heats water quickly - 1500 watts.\n- Has an easy flipper on/off switch that lights up when it's on.\n-360 degree rotation on its base.\n-Small size 1.25 liter = 1.32 Quart.\n-Has a removable lime scale filter - this is where the plastic problem enters the pot design.\n-Water pours well without making a drippy mess.\n-Has Auto Off - turns itself off when it hits a boil.\n-No keep warm function.\n\nThere is plastic inside. The plastic filter is removable but the attachment piece is plastic & is still there after you remove the filter. It is at the spout so water does pass over it every time you pour. I do not know if the plastic is BPA free - I would hope so. I always get rid of these filters when they come with an electric filter so I see no benefit to even providing them. There are 2 plastic rivets that hold the handle to the lid - they should not pose any problem because they are not in contact with water.\n\nIf you have hard water as I do, you will need to descale this kettle occasionally. I just pour a cup of white vinegar in, let it sit for 15 minutes or so & then use a bottle brush to gently scrub & rinse it away.\n\nThere are no measuring marks or window so you have to guess at the amount of water. That does not work for me because I mainly use this kettle for making pour over coffee in to a stainless carafe & I need a specific amount of water to coffee bean ratio. So I have to get out a measuring cup to do this properly. I will need to make a scratch on the inside to mark the proper water line amount.\n\nAs with many KA products these days, a lot of thought goes in to how pretty the appliance is & not the overall usefulness/quality."},{"reviewerName":"B. Kalpakoff","rating":"2.0 out of 5 stars","reviewTitle":"Can't be healthy and certainly not enjoyable...","reviewDate":"May 30, 2016","reviewText":"One point for appearance, very nice looking. One point off for being made in China (yes, it matters). Bottom line, is tried using mine daily for almost two months. Due to plastic part inside kettle (I suppose), makes tea that tastes like a brand new garden hose...like plastic. Also tastes like burnt metal...as if a pot was left empty on stove to heat up to burning, then water was added, heated, and used to make tea. Tea was dark and murky with film/residue on top. Did several experiments using same (RO Filtered) water, where I made tea from this kettle, and tea from water heated in microwave. Came out the same every time, the tea from the microwave clear, and delicious and tasting only of tea, and from this kettle, as described above. Also, unit smells very strong of burning wire. After two solid months, none of the conditions improved.\nThe cord on the base unit comes out of the box VERY short. Took some days to figure out that the cord is winded inside the base. There is no mention of this in the instructions. Wish I had returned immediately, and definitely do not recommend. This kettle is going to the e-waste pile."},{"reviewerName":"Petlover","rating":"4.0 out of 5 stars","reviewTitle":"Nice electric tea pot, but doesn't hold enough water.","reviewDate":"January 4, 2019","reviewText":"I had not used an electric tea pot before, but I drink a fair amount of tea in the winter and thought I would try one. This is a sturdy pot but only holds about 3 mugs of water at a time, so I am filling it a lot. I also expected the water to stay hot, but it doesn't, don't know if all electric pots are like that. The water does heat very quickly. I haven't cleaned it yet, but looks pretty straight forward."},{"reviewerName":"MichiganTraveler","rating":"4.0 out of 5 stars","reviewTitle":"Very stylish and functional electric kettle; carries the reliable KitchenAid brand","reviewDate":"April 5, 2015","reviewText":"We've had this for a couple of weeks and have found it to be very efficient as well as stylish. It heats quickly which is nice if you make tea - or hot chocolate or even coffee - by the cup. It sits pretty on the counter and we've used it quite regularly with no problems. If you've used one of these, you'll find this instantly familiar. In fact, it's design - and functionality - is pretty similar to others we've used. Which is why I've given it four stars instead of five. It IS the most stylish electric kettle on the market but the price reflects that. If you want stylish, know this is a good one. If you want funcationality, our experience is there are other, less expensive models with the same features. I've seen some complaints about plastic inside. Most of them have that. Not a big deal for us."},{"reviewerName":"LC","rating":"1.0 out of 5 stars","reviewTitle":"I guess paying a higher price does not mean getting a good product. I am very disappointed at KitchenAid and ...","reviewDate":"March 10, 2017","reviewText":"The black plastic gasket that connects the handle to the kettle does not seal properly. The water leaks out from the small gap and runs down to the on/off switch. It is not only unacceptable, but is a major electrical fire hazard. I guess paying a higher price does not mean getting a good product. I am very disappointed at KitchenAid and their poor QC. I am returning it to Amazon."},{"reviewerName":"Sdoherty","rating":"1.0 out of 5 stars","reviewTitle":"Not your best work ?","reviewDate":"June 13, 2018","reviewText":"So I’ve had my kett for 11 months now on my second. The first one started rusting on the lid returned and got a new one. The second one I got also stared to rust on the lid. Will not buy again. Sorry kitchen aid. I have a lot of your products. This one is not your best work."},{"reviewerName":"☮ S.Trasny","rating":"3.0 out of 5 stars","reviewTitle":"Paying A Premium For A Brand Badge, Not A Difference","reviewDate":"April 1, 2015","reviewText":"Compared to other electric water kettles I've owned, I found the KitchenAid kettle the most attractive of all and at least as fast, or faster, boiling water. The only significant difference I found between the KitchenAid kettle and my favorite, the Aroma Hot H20 X-Press 1.5 Liter (6-Cup) Cordless Electric Water Kettle, Stainless Steel, was the price.\n\nI'd recommend the Aroma more. It compares in all the important ways (cordless, 360 degree rotation, mainly stainless interior, heats really fast, auto off), plus it's bigger and has a water level indicator. I find the KitchenAid's retro design and almost-all-stainless exterior more attactive, but I'm more interested in performance and bang for my buck. Plus, there's something I really dislike about that big ol' name badge on the front that screams \"KITCHENAID!\"\n\nThere is less interior plastic in the KitchenAid than in the Aroma, but not much less, and the fact remains that the KitchenAid still has plastic. If the inside was retooled to replace the plastic bits with stainless, I'd rate the improved product 5 stars for the same price.\n\nIf you're buying a gift for a person more concience of brand names than value or performance, get the KitchenAid. Otherwise, buy two Aromas for the price of one KitchenAid and make two people happy."},{"reviewerName":"kwg","rating":"4.0 out of 5 stars","reviewTitle":"A Fine Product with One Flaw","reviewDate":"March 18, 2019","reviewText":"This is a classic-looking kettle that heats water quickly and automatically turns off when the water is hot. One flaw is that the handle at the top of the kettle doesn't swivel out of the way. As a result, it's a little tricky to fill with water and if for some reason you need to remove the lid while the water is hot, you're in danger of getting a steam burn. An unfortunate flaw in an otherwise fine item."},{"reviewerName":"CHammer","rating":"5.0 out of 5 stars","reviewTitle":"The perfect electric kettle.","reviewDate":"July 13, 2018","reviewText":"I bought this kettle in black a couple of years ago. It's still going strong. No rust, heats water fast, auto shut-off that has never failed. And I love the smaller capacity. To me, it's the perfect electric kettle."},{"reviewerName":"Yuri Vovchenko","rating":"1.0 out of 5 stars","reviewTitle":"broke very quickly","reviewDate":"October 30, 2017","reviewText":"It broke after 2 month of use. it would not turn off when water starts boiling..."},{"reviewerName":"Dina O.","rating":"2.0 out of 5 stars","reviewTitle":"Great, for 6 months","reviewDate":"September 20, 2019","reviewText":"This thing worked like a dream. Boiled water about 3-4 times a day. Looks like it is beginning to rust on the bottom. Suddenly stopped working - no connection between base and kettle. Cannot take apart and fix (triangle Robertson screws?). No warranty or replacement option from Kitchenaid. Shame. Not worth $60 for 6 months of service."},{"reviewerName":"Inna Tysoe","rating":"4.0 out of 5 stars","reviewTitle":"Quality Kettle","reviewDate":"April 1, 2015","reviewText":"I am married to a Brit and so know that most countries have been using electric kettles since at least the 70’s while they have only recently become popular in the USA. I remember trying to buy my first electric kettle here in the USA and the lady at Macy’s looking quite appalled and showing me all their coffee machines.\n\nI’ve had about three electric kettles in the 16 years since that episode and now they are as common and easy to find as stove top kettles.\n\nThis KitchenAid kettle has a traditional retro design influence that suits our modernized 50’s style kitchen well. It holds 1.25 liters of water which comes to approximately 10 coffee cups. It sits on a round plastic base that has basic cord management so you can adjust the length so it reaches between 1.5 and 3.5 feet.\n\nIt’s made of a mix of brushed steel with polished steel lid and accents. The heating element is concealed so the inside of the pot is bare clean and smooth and easy to clean. There is minimal plastic inside; just the sliding removable gauze filter and mounting frame are made of plastic.\n\nThis kettle is surprisingly light when empty compared to the Krups I have been using. It weighs almost nothing.\n\nControls are simple, just the single button at the bottom rear of the kettle. You push it down and a LED lights up to tell you it’s on. The thermostat inside turns the kettle off automatically when the water is boiled. There is no water meter, you lift the lid and fill. A small metal prong poked out from the inside rear of the pot about 2/3 of the way up and is the max water limit marker.\n\nI timed the kettle to boil cold tap water filled to the max marker. It took exactly 5 minutes and 45 seconds to boil the 42oz of water. My Krups kettle is slight larger and holds 60oz and takes 7 minutes 15 seconds to boil. So this seems pretty reasonable.\n\nOne thing I did notice is that this KitchenAid kettle is quiet. The initial 3 minutes were silent and I was concerned that it wasn’t working properly and might take a long time. The usual metallic kettle hiss began after 3 minutes as the water began to boil. So this is definitely the quietest kettle I have used.\n\nOverall it’s a simple to use kettle with an attractive design that boils water in good time. Inside there is minimal plastic while a gauze filter prevents any solid matter in your water getting poured into your cup. I recommend it."},{"reviewerName":"Valentina","rating":"5.0 out of 5 stars","reviewTitle":"Good basic kettle for not so basic price","reviewDate":"March 24, 2015","reviewText":"I drink tea a few times a day, so I buy kettles often and very familiar with products out there + best in class features.\n\nI call this kettle basic, because it lacks features of high end kettles, for honestly about same price. It's missing the water temperature setting, the keep warm setting, the water level indicator, the proper whistle when water is boiling. Btw, I hate when these things actually boil water - it's way too hot to drink - I prefer 189 to 193 degrees - not full 200+. Why is the power cord so short? And, as others mentioned, it has plastic inside of it.\n\nOn the plus side, this kettle is gorgeous! I'm proud to have it in my kitchen. It boils water rapidly - love it! Overall, I'd say buy it for looks and fast operation, not for it's features."},{"reviewerName":"Jo","rating":"5.0 out of 5 stars","reviewTitle":"I love this! Perfect size and boils pretty fast","reviewDate":"January 2, 2017","reviewText":"I love this ! Perfect size and boils pretty fast ! Beautiful color. No issues at all for 2 years now. I’ve given them as Christmas presents and the recipients love them !"},{"reviewerName":"AmazonCustomer","rating":"5.0 out of 5 stars","reviewTitle":"Delightful","reviewDate":"August 29, 2017","reviewText":"I've had this for a few years now and it's absolutely perfect. It's just the right size for a few cups. I use it almost daily and it's held up extremely well."},{"reviewerName":"Amazon Customer","rating":"4.0 out of 5 stars","reviewTitle":"Cutest kettle!","reviewDate":"March 30, 2017","reviewText":"Love this kettle. I was on the market for it for over a year as it's impossible to find it for a reasonable price in Canada. I finally made it to the States and picked one up and I am so glad I did. It looks as great as it does in the pictures. The only reason I'm giving 4 stars is because the capacity is quite small so there is only enough water for two cups of tea or so."},{"reviewerName":"Amazon Customer","rating":"2.0 out of 5 stars","reviewTitle":"It really is remarkable how stupid electric kettle manufacturers are","reviewDate":"February 26, 2015","reviewText":"Dear Kitchenaid: It really is remarkable how stupid electric kettle manufacturers are. You take a beautiful functional kettle like you've designed and insert a plastic bracket inside that cannot be removed and that dips into the water as it boils so that plastic can leach into our tea. Has anyone at any electric kettle manufacturer bothered to read the literally hundreds of reviews on Amazon complaining how electric kettles all have plastic inside of them? We want an all stainless kettle at least on the inside. And none of you seem bright enough to recognize the market potential here. At the very least if you are salivating over the idea of having some plastic parts inside the kettle at least make them removable so those of us who dislike toxins in our blood can remove that plastic if we choose. I must now return this gorgeous looking kettle to find another one."},{"reviewerName":"MartinT","rating":"1.0 out of 5 stars","reviewTitle":"Rust!","reviewDate":"June 9, 2019","reviewText":"As per other reviewers, rusted after a year at bottom joint. Never had this issue before on other kettles. Will never buy this brand again. Premium price and it`s just not worth it."},{"reviewerName":"Reshma","rating":"5.0 out of 5 stars","reviewTitle":"Perfect!","reviewDate":"June 21, 2018","reviewText":"Love this Kettle!"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Very quite","reviewDate":"January 4, 2019","reviewText":"It looks stylish and works quiet. The size fits for small family, buy bigger if you need more than 3 cups for a time"},{"reviewerName":"ian","rating":"5.0 out of 5 stars","reviewTitle":"Great kettle.","reviewDate":"April 28, 2019","reviewText":"I love this product. Fab colour. Easy to use."},{"reviewerName":"Sarah Landi","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"March 11, 2017","reviewText":"Love it!!!"},{"reviewerName":"Daniel","rating":"5.0 out of 5 stars","reviewTitle":"Great Kettle","reviewDate":"April 23, 2019","reviewText":"Looks great, and works well."},{"reviewerName":"Abby","rating":"5.0 out of 5 stars","reviewTitle":"It’s great!","reviewDate":"June 23, 2019","reviewText":"Just love it!!!"},{"reviewerName":"AGB","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"January 24, 2018","reviewText":"Perfect!"},{"reviewerName":"ny rinz","rating":"2.0 out of 5 stars","reviewTitle":"Worked very nicely for 15 months and then the flimsy-seeming plastic switch ...","reviewDate":"April 24, 2016","reviewText":"Worked very nicely for 15 months and then the flimsy-seeming plastic switch I always mistrusted stopped working and now the thing won't turn on. Lame."},{"reviewerName":"sptu","rating":"4.0 out of 5 stars","reviewTitle":"Stylish compact kettle, but the switch feels soft","reviewDate":"December 28, 2016","reviewText":"Very nice compact electric kettle. Stylish stainless steel. The handle on top is easier on the wrist than a side mounted handle. My only complaint is the switch is smaller and feels rather soft compared to other electric kettles that I have owned. I am able to fill this kettle from my refrig water dispenser through the spout. There is no external fill indicator. You have to remove the lid and look down to see then the water level touches the MAX fill rod. I would purchase again."},{"reviewerName":"W. Smith","rating":"1.0 out of 5 stars","reviewTitle":"Disappointed that it lasted only a year and half","reviewDate":"November 13, 2017","reviewText":"I purchased this kettle because it looked cute and different from other electric kettle even though it was more expensive. After using this only a year and half, it stopped working recently. I was disappointed that it lasted only such a short time. As I used it daily, I realized it was too small and I wanted to purchase one that holds more water so I bought SECURA Original Stainless Steel Double Wall electric kettle later on because it holds more water, all stainless steel and cheaper and had even better reviews than KitchenAid. I was going to give KitchenAid electric kettle to my daughter who lives in a dorm but she said she didn't need it so when it stopped working, I started using SECURA electric kettle and I am very happy with it so far. I learned the lesson not to be fooled by how it looks."},{"reviewerName":"T. Porter","rating":"2.0 out of 5 stars","reviewTitle":"Plastic inside","reviewDate":"August 22, 2018","reviewText":"Beautiful kettle & I wanted so badly to keep it, but there is a large piece of plastic surrounding the spout on the inside where it would sit in the hot/boiling water. I purchased a different kettle that is 100% stainless steel inside. Not cute like this one but safer."},{"reviewerName":"J","rating":"3.0 out of 5 stars","reviewTitle":"Plastic part inside","reviewDate":"January 3, 2019","reviewText":"since my 10 year old electric kettle needed to be replaced, I looked for another one that would not have any plastic touching the hot water at least on the inside.\n\nThis Kitchen Aid kettle has a pretty design (bought the red) and the interior is made of stainless steel.\nPROS:\n1.Stainless Steel interior (except for the plastic part that also exists inside as well)\n2.pretty, retro design\n3.simple on/off function\n\nHowever, these cons made me to decide to return it even before using it:\nCONS:\n1.big plastic part that cannot be removed on the inside (top to bottom; so the hot water will touch it)\n2.filter can be removed but is made of plastic\n3.the handle on top + the small opening of lid: hard to clean the inside; the handle gets in my way when I want to\npour in water. I wish the handle could be moved to the side or something\n\nI returned it because of the plastic part that would touch hot water;\nI would recommend it to those who like the looks rather than being picky about materials.\nI probably would have kept the kettle if the handle, plastic parts were better placed.\n\noverall: 3/5"},{"reviewerName":"DeepEnd","rating":"2.0 out of 5 stars","reviewTitle":"If fortuitously the replacement does not foul the water","reviewDate":"April 15, 2018","reviewText":"This Kitchenaid has a strong metallic/chemical odor that is imparted to the boiled water. Have boiled two pots of water every day for the past two weeks, and the off odor/taste is still present. Have used stainless electric tea kettles for decades, this is the first one that has a manufactured smell/taste that does not go away quickly. Nothing else has changed in our plumbing or water supply - clean, pure tasting well water. Contacted Amazon support. They are sending a replacement. If fortuitously the replacement does not foul the water, then I will give more stars."},{"reviewerName":"BeHappy","rating":"5.0 out of 5 stars","reviewTitle":"Very nice ... great find after looking for a long time.","reviewDate":"February 27, 2018","reviewText":"Hard to find what we wanted. We have a very contemporary kitchen and most hot water pots are a bit, well, weird looking. We did not want glass as we have one at the office and it loses its heat quickly. Took a chance having never seen the KitchenAid unit and when it arrived I wasn't sure. However after setting up and placing in kitchen it looked perfect and modern enough to fit in.\n\nThe size is perfect for a couple ...\n\nHow it works is like you'd expect. It heats quickly and keep the water warm for some time. My only problem with the unit is I have rather large hands and trying to get the lid on and off is kind of a contortionist trick."},{"reviewerName":"DRS","rating":"1.0 out of 5 stars","reviewTitle":"Plastic filter housing is big and not removable.","reviewDate":"June 28, 2016","reviewText":"Based on reviews I read, I thought the plastic filter n housing would be easily removable. The filter slides out, so no problem. But the filter housing was not easy and was big. In the process of removing it, I ended up breaking the piece. Hence the tea pot is not usable. I ended up buying a different one without any plastic parts. Reviews weren't helpful and were misleading."},{"reviewerName":"Simeon Weinraub","rating":"4.0 out of 5 stars","reviewTitle":"Gets My Water Hot, Looks Good Doing It","reviewDate":"June 30, 2017","reviewText":"I like this kettle, but mostly because it is pretty. It boils water quickly, and it has a pleasant heft to it. I bought it to replace a less expensive model that had a larger capacity, and that you could select tempuratures on. But, it was never pretty. Maybe I am shallow. I can wait a couple minutes for the water to cool to 205° for coffee.\n\nAlso, fewer functions and a sturdier build mean that I expect this kettle to last a long time."},{"reviewerName":"DistantRhythm","rating":"5.0 out of 5 stars","reviewTitle":"Kitchenaid never disappoints!","reviewDate":"January 13, 2018","reviewText":"After going through three Ovente kettles in around two years time, I am thrilled to have purchased a much higher quality product. Yes there's a bit of plastic but it's not where the water boils, and judging from the high quality of the stainless steel I'm sure the plastic they used is safe too. Only one temperature setting and you can't see the water, I don't care I'm thrilled with this product. I even ordered one of their black kitchen timers to match. Kitchenaid has never disappointed me!"},{"reviewerName":"MRG","rating":"1.0 out of 5 stars","reviewTitle":"Second Kettle to Stop Working","reviewDate":"November 17, 2018","reviewText":"I ordinarily do not leave feedback, but in this circumstance, I felt it was warranted. I love this kettle but I have now gone through two of them in a year in a half. Both kettles just stopped working. I took a chance on purchasing a second one after the first one stopped working. Fool me twice, shame on me. Too bad, because I love the style and ordinarily have been successful with Kitchen Aid brand....until now."},{"reviewerName":"George R.","rating":"3.0 out of 5 stars","reviewTitle":"Style over substance","reviewDate":"January 31, 2018","reviewText":"It has no water level indicator. Requires both hands as the lid has to be removed to check the level and/or filling up, then the handle is fixed and in the way of the small opening. Also in real life it's just too shiny and too plastic to look retro, for example the metal lid has a gratitious cutout with a black plastic disc insert in the center.\nWe kept it because my wife loves the green color."},{"reviewerName":"justme","rating":"1.0 out of 5 stars","reviewTitle":"too short of a cord.","reviewDate":"December 14, 2018","reviewText":"I returned immediately after trying to use. The cords only about 12\" long and very stiff. It is so short that it sticks out from the wall before heading downward which is right next to kettle. Stupid design. You cant even pull the kettle off of the element without touching the cord with your hand or kettle. Were they trying to save money on cords cause you would have no choice but to let it sit about 6\" out onto your counter exactly in front of the wall outlet. You cant push it closer because of cord and if you put cord to side, it is unsightly and in way. Defective design in my opinion."},{"reviewerName":"Team Bates","rating":"5.0 out of 5 stars","reviewTitle":"The rare kettle that's not an eye sore","reviewDate":"January 8, 2019","reviewText":"Summary: I was sufficiently in love with this kettle that when our new au pair (who had never encountered an electric kettle) melted the bottom by trying to heat this thing on our gas stove, my husband immediately ordered a replacement because he knew I'd be heart broken.\n\nI bought this kettle because I wanted a stainless steel one that matches my red kitchen aid stand mixer. It's amazing. Easy to use and made with high quality materials. Most kettles are enormous, plastic monstrosities that you'd want to hide in a cupboard. This thing earns a spot on the counter."},{"reviewerName":"BJAZZ","rating":"5.0 out of 5 stars","reviewTitle":"Beautiful green color","reviewDate":"November 10, 2019","reviewText":"I’ve had this kettle for over 2 years and use it 4-5 times a day. I never empty it between uses and most of the time just add more till the next morning when I empty it and put fresh water in. I use vinegar to remove scale inside and on the lid about every 2 weeks because I live in Scottsdale AZ and we have very hard water. It’s simple to use, on/off, so very little to worry about electronically. I’ve never had a problem with it and I think it’s a great kettle and I’d buy it again."},{"reviewerName":"Henry Gewurz","rating":"4.0 out of 5 stars","reviewTitle":"Not a bargain, but sturdy, attractive and worth the price.","reviewDate":"February 21, 2017","reviewText":"KitchenAid KEK1222PT 1.25-Liter Electric Kettle - Pistachio I purchased this to replace a worn out Bodum 1.7L electric kettle. This kettle is smaller and was more expensive, but is a pleasure to use. The kettle is metal, solidly built and attractive. It heats more slowly than the old kettle, but reasonably quickly. It's quieter than the Bodum was; hence, I don't always hear it turn off when the contents have reached boiling point. You're supposed to remove the lid to refill, but being lazy we just pour a stream of water from the faucet into the spout and wipe the pot dry before placing it on the base. The cord from the base to the power supply is intentionally short – only 14\". That wasn't a problem for us, but is important to consider. We're very pleased with it."},{"reviewerName":"Theresa Fisher","rating":"5.0 out of 5 stars","reviewTitle":"Great quality.","reviewDate":"July 29, 2019","reviewText":"This is by far the best teapot I have owned!!! It heats up quickly with not much noise. It is made of high quality materials that probably will last for years. No rust and I don’t empty it after each use but I do use filtered water. And aesthetically it is very nice and the color is great!!! I ordered the pistachio. I’m going to buy the stove top version next."},{"reviewerName":"Matthew M Everett","rating":"1.0 out of 5 stars","reviewTitle":"Fire risk?","reviewDate":"June 17, 2018","reviewText":"This kettle worked well for over two years. I didn’t have any problems with the looks or functionality, and it heats water very quickly.\nYesterday I noticed that my counter was flooded with water and there was a puddle of water on the floor. It looks like the bottom of the kettle melted, and some of the plastic was destroyed. We used this kettle once or twice a week for a couple years, and expected it to last for another ten years. Very disappointed as it was a pricey purchase."},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Great kettle at three years and counting","reviewDate":"October 19, 2019","reviewText":"I read tons of reviews before I bought this and am happy to report that three years later, it still works perfectly. No rust, no weird black residue, the switch is still fine and has not snapped off (even though it does seem like the most \"fragile\" part of the kettle) -- it's been a great kettle. Always love seeing it on my kitchen counter! The red is so cheerful. I've never washed out the inside, although I probably should. I live on the West Coast where our water is \"soft,\" so be sure to check what type of water you have since that may influence what happens with rusting, etc. Would definitely buy again."},{"reviewerName":"Laura","rating":"2.0 out of 5 stars","reviewTitle":"Cord is Too Short","reviewDate":"January 29, 2019","reviewText":"I really trust the KitchenAid brand, and really like the color of this kettle. That's why I bought this overpriced product. However, this product has a glaring flaw: the cord is too short. I think the cord must be maybe 3 feet long. We had to put it on an awkward spot on our counter for this reason. I would suggest to buy another product that has a longer and retractable cord. I am disappointed with this product for that reason.\nAs a hot water heater though, it is sufficient. I like this is completely metal so I don't have to worry about plastic getting into my water."},{"reviewerName":"nick","rating":"5.0 out of 5 stars","reviewTitle":"As easy as microwaving","reviewDate":"January 26, 2017","reviewText":"As easy as microwaving, as effective as a stove top kettle. If your a tea drinker. Make sure you stock up. You'll use this all the time. (my wife still thinks this was her christmas gift lol)"},{"reviewerName":"The Wills","rating":"5.0 out of 5 stars","reviewTitle":"Beautiful and safe kettle!","reviewDate":"January 10, 2018","reviewText":"Bought for my mother. She loves it. Minimal plastic parts inside the boiler, which makes this safer to use than others (this was a key part of us choosing this product over others). The looks are classic and beautiful."},{"reviewerName":"Jeanne","rating":"4.0 out of 5 stars","reviewTitle":"Great product- Only wish spout was designed differently for my uses","reviewDate":"October 27, 2019","reviewText":"I’ve had the kettle in pistachio green for 2 years and it has been serving me well. I use this every single day. Originally, I bought the electric kettle when I was in college since I drink a lot of coffee and tea and didn’t have immediate access to a stove. I’ve kept it since it heats up water much faster than on the stove top. The only reason I gave it 4 stars is I’m starting to wish the spout design was more of a gooseneck shape since I’ve gotten into pour coffee. Other than that, I have no regrets and only positive things to say."},{"reviewerName":"Pops","rating":"4.0 out of 5 stars","reviewTitle":"adorable looking tea kettle","reviewDate":"June 12, 2019","reviewText":"I have always wanted to get a electric tea kettle but really did not like the look of them. This one in pistachio looks beautiful on the counter. Heats quickly and quietly. I am grateful for the automatic shut off. Only complaint I have is I wish they did not have the plastic filter piece inside."},{"reviewerName":"Jawlek","rating":"5.0 out of 5 stars","reviewTitle":"I love this kettle with everything I have","reviewDate":"August 28, 2018","reviewText":"I use this kettle at least twice a day. I use hot water to soften my dog's food in the AM and PM, I drink a fair amount of instant coffee when I don't want to make a pot, and at night I like a cup of tea when I am making my dog's night time meal. I am super happy with this purchase."},{"reviewerName":"Kate Wilhite","rating":"5.0 out of 5 stars","reviewTitle":"Loving it! And it's so cute, unlike most electric kettles on the market...","reviewDate":"June 3, 2017","reviewText":"I've been using this kettle for two months now and am so happy I bought it. It's so much faster than my traditional kettle, allowing me to have properly brewed tea every morning---not just on leisurely mornings. Quickly, I can make a couple mugs of tea plus a quart to chill for later. I should have bought this years ago! I've had no trouble with the kettle: it lives on my counter, and I treat it with care, drying the inside with a paper towel after every use to ward off any rust some of the other reviews are complaining about."},{"reviewerName":"ASK@NWCLIPS","rating":"2.0 out of 5 stars","reviewTitle":"I Am Looking For A Replacement After Three Months.","reviewDate":"July 17, 2016","reviewText":"I'll be shopping for a new electric kettle, I'm sorry to say. I bought this after reading about lots and lots of different kettles. I was looking for one that was as close to 1 litre capacity or less as possible, lacked plastic parts contacting the heated water, and was made from stainless steel.\n1) Some of the answers to questions here stated that although there was plastic in the device, it could be removed: IT CAN NOT!(the handle has to be removed to get the front part out, if it can be done at all).\n2) Although this appears to be stainless steel, after less than three months there is a spot of rust developing between the bottom element and the sides which may explain...\n3) I noticed a chemical smell immediately and assumed/hoped that this was from the enamel finish on the outside of the pot and expected it to go away with time. Unfortunately, the smell has remained, although diminished, and I believe that it affects the flavour of the water and this gives me the heebie jeebies.\nI am looking for a different device.\nI would rate this one star except that it does boil the water well and the size is about right. Very disappointed that this relatively expensive device has so many issues, especially the smell/taste thing."},{"reviewerName":"highflyer100","rating":"5.0 out of 5 stars","reviewTitle":"No complaints here!","reviewDate":"January 18, 2017","reviewText":"Boils water about twice as fast as a kettle on the gas range, and we use a commercial gas range with lots of BTU's.\nAs others reviewers have detailed if water is kept at or below the max fill line, the water does not come in contact with the plastic filter parts.\n4 cups of water will bring you just below the max fill line. Haven't used the range to boil water since we got this!"},{"reviewerName":"Trinette L.","rating":"1.0 out of 5 stars","reviewTitle":"Lasted only about 5 months","reviewDate":"April 16, 2018","reviewText":"Purchased in Dec 2017. Electric tea pot stopped working in April 2018 - no reason, unexplainable. Won’t operate or heat up any longer.\nLasted about 5 months."},{"reviewerName":"X","rating":"4.0 out of 5 stars","reviewTitle":"heavy, sturdy, very little plastic inside","reviewDate":"August 30, 2019","reviewText":"I don't need the water from this to hit a certain temperature so it's never been an issue. probably if I were making specialized teas, I would really care that it can't do that. I love the color and that it's sturdy since my elder care folks tend to drop the kettle from time to time. It can at times be too heavy for them to pickup and lift."},{"reviewerName":"darklake","rating":"2.0 out of 5 stars","reviewTitle":"Metallic Taste Lingers","reviewDate":"May 27, 2018","reviewText":"Metallic taste after several uses. Suggestions? I like this cute pot, though it is easy to get burned on the lid."},{"reviewerName":"Kristina S.","rating":"4.0 out of 5 stars","reviewTitle":"If your main priority is cute + functional this will work","reviewDate":"July 20, 2019","reviewText":"Cute but not as functional as others. I have purchased other electric kettles that heat up the water waaaaay faster. This takes about 5-8 mins to get to boiling. It’s ok, using it in the rv."},{"reviewerName":"P. H.","rating":"2.0 out of 5 stars","reviewTitle":"Cute but PLASTIC (?!?*#%?)","reviewDate":"October 25, 2018","reviewText":"Stainless steel with non removable plastic parts inside touching the water. What’s the point then? It’s widely known that heating plastic is toxic. Pissed off."},{"reviewerName":"Fair Play","rating":"5.0 out of 5 stars","reviewTitle":"Fantastic water boiler, no bells! Just works!! Buy it!","reviewDate":"June 19, 2017","reviewText":"I know there are bad reviews but I love it. No defects. No problems. Better than the new design because it is simpler. Simple is better. Color is perfect. I have one at home and one at the office. Boils water quickly. No alarms no bells, no whistles...just boils water in a big. Fantastic!"},{"reviewerName":"Paulette E.","rating":"1.0 out of 5 stars","reviewTitle":"Don’t want plastic.","reviewDate":"March 15, 2019","reviewText":"Everything “spot on” until viewing inside - big chunk black plastic permanently attached. Leeching when exposed to hot/boiling water a valid concern. Please redesign and I will be happy to order."},{"reviewerName":"Jack Dantes","rating":"3.0 out of 5 stars","reviewTitle":"has a weird smell after 3 month usage","reviewDate":"February 25, 2019","reviewText":"i like how it looks and goes very well in my kitchen. it is a little small, but that is not the reason for my 3 star review. It s small really bad after using is for over 3 month now. I had this problem before but it would go away after a week or so. or I would boil water with baking soda and that will do. But this one is just smells bad."},{"reviewerName":"Sidesaddle","rating":"5.0 out of 5 stars","reviewTitle":"Well made with nice colors to choose from","reviewDate":"February 5, 2019","reviewText":"I received this as a gift 2 years ago. I ABSOLUTELY Love my tea pot as I normally drink 1~2 cups of tea a day. This is an absolute great buy and last a long time~ KitchenAid is the BEST appliances ever!!! I have a older stand 6 qt. mixer that I've had for 25 years and still running strong!!!"},{"reviewerName":"David","rating":"5.0 out of 5 stars","reviewTitle":"Durable and reliable hot water kettle","reviewDate":"November 9, 2019","reviewText":"I’ve been using this kettle daily for almost two years now. Still works well and looks great. Over time (in our area) you start to see hard water buildup on the base, but it looks brand new after pouring in some vinegar and letting it sit for a couple hours."},{"reviewerName":"A. Carter","rating":"5.0 out of 5 stars","reviewTitle":"Excellent kettle!","reviewDate":"February 3, 2017","reviewText":"I absolutely love this electric kettle! It heats the water extremely fast and very quietly, and shuts off automatically when\nthe water boils. The cord is short for safety reasons. It looks lovely on the counter top and matches my KA mixer! I much prefer using it to the\nmicrowave because your mug handle doesn't get hot and in my case, the kettle doesn't knock our computer off line like the microwave does!"},{"reviewerName":"rickv","rating":"5.0 out of 5 stars","reviewTitle":"Stylish-Functional-Compact-Quickly Heats Water","reviewDate":"April 2, 2018","reviewText":"I love this so far. It's compact, stylish, functional, heats up my tea water very quickly and looks great on the counter in my new kitchen. I was happy to find you can extend the cord to the plug a little - additional cord is coiled under the unit. The light kiwi color is very pretty. I love Kitchenaid products and so far this one is as exceptional as the others I own."},{"reviewerName":"L. Storms","rating":"5.0 out of 5 stars","reviewTitle":"Little Red Corvette","reviewDate":"July 14, 2019","reviewText":"Great little teakettle. High quality exterior, heats super fast and is stable on the base."},{"reviewerName":"Jediprincess","rating":"5.0 out of 5 stars","reviewTitle":"Nice and simple. Great for office.","reviewDate":"February 24, 2019","reviewText":"I keep mine in my office at work. Love the simple mechanics (not everything needs screen or flashing lights). Holds more water than I thought it would. Can be pricey, but keep checking online. I got mine on sale after Christmas for 40% off."},{"reviewerName":"R. henry","rating":"3.0 out of 5 stars","reviewTitle":"WAS Very Happy!","reviewDate":"September 5, 2017","reviewText":"My favorite water heater. Stainless steal inside. No hot handle like the stove top kettles and it doesn't get filthy from cooking splatter. Shuts off\nwhen water is boiled so no need to wait around to babysit it.\n***UPDATE, WORKED great until the warranty ran out at one year!"},{"reviewerName":"Kinley Larson","rating":"5.0 out of 5 stars","reviewTitle":"So glad I did","reviewDate":"October 20, 2017","reviewText":"Bought this after buying a cheaper one that came not working. So glad I did. Heats water so quickly, and looks super slick. Only issues I've had is I burned my hand when trying to make multiple pots of hot water in a row, taking the top off and holding it from the top loop at the same time gets tricky."},{"reviewerName":"Amazon Shopper","rating":"5.0 out of 5 stars","reviewTitle":"VERY HAPPY!","reviewDate":"March 8, 2019","reviewText":"I have an electric kettle at work and after years, thought... why don't we have one at home??? looked at the reviews and opted for this one. Love the color and has been working perfectly (knock wood). We use it daily and sometimes 2 x a day. Recommend!"},{"reviewerName":"Jeff W. Woehrle","rating":"5.0 out of 5 stars","reviewTitle":"Great purchase!","reviewDate":"October 27, 2019","reviewText":"What a neat little kettle! Heats up VERY quickly, automatic shutoff works great, simple cleaning.\n\nMakes a few strange noises, but no big deal. Very satisfied and highly recommend."},{"reviewerName":"Marcel Lirot","rating":"5.0 out of 5 stars","reviewTitle":"Looks great on the counter","reviewDate":"December 17, 2017","reviewText":"Looks great on the counter, the base cord folds and stores neatly, which is a big plus. In my opinion, most of the other electric kettles \"look\" like plastic pitchers, and I'm sure they work fine- but this one sort of looks like it belongs in a kitchen."},{"reviewerName":"Inglenook","rating":"2.0 out of 5 stars","reviewTitle":"Disappointment","reviewDate":"March 25, 2019","reviewText":"The kettle lasted just over one year. It seems as though a tiny spring holding the very delicate contacts in place may be fatiguing. Had the manufacturer had put a fraction of the care manufacturing the electrical contacts as they invested in their large logo it may have worked for years. Pretty to look at but not made to last."},{"reviewerName":"Kate and Jack","rating":"5.0 out of 5 stars","reviewTitle":"A terrific little teakettle!","reviewDate":"April 16, 2019","reviewText":"I have had this teakettle about 6 months. I use it several times a day, everyday. I love it. It heats very quickly. It is pretty and stylish. A nice size for a single person to have several cups tea in a day without having to refill the pot."},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Great little kettle for daily tea and coffee","reviewDate":"March 9, 2017","reviewText":"Great little kettle for daily tea and coffee. It is both nice to look at and functional. If you want enough water to fill your China teapot get the larger version, but for quick cups of tea and coffee this one is wonderful and it turns off by itself...no worrying about not hearing a normal pot whistle."},{"reviewerName":"RTapp","rating":"5.0 out of 5 stars","reviewTitle":"Tea pot review","reviewDate":"May 14, 2018","reviewText":"Loved this product but the on off switch is to easy to break off. was totally disappointed that we had it such a short time before it did break off.\nit was so cute and worked great."},{"reviewerName":"NW Friends","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"June 17, 2017","reviewText":"This is the best tea kettle ever. Use it also to make coffee with the aero press."},{"reviewerName":"mia","rating":"5.0 out of 5 stars","reviewTitle":"Fast","reviewDate":"February 5, 2017","reviewText":"Boils water extremely fast compared to stovetop boiling. It's getting much more use than I initial expected due to the speed. Love the simplicity, design, and color, though I'd prefer a handle that rotates."},{"reviewerName":"D.P. Dennis","rating":"5.0 out of 5 stars","reviewTitle":"Sturdy, high quality","reviewDate":"April 24, 2017","reviewText":"Sturdy, high quality. We've had many of these electric kettles, and most of them die way too quickly. Worth the extra few dollars."},{"reviewerName":"Gwenythe b. Harvey","rating":"3.0 out of 5 stars","reviewTitle":"Does not have a guage for the water","reviewDate":"January 31, 2019","reviewText":"Unfortunately, I did not notice that it did not have a gauge for the water so being careful to refill is important. Also the thickness of the structure is not up to the usual Kitchenaid standards. On the positive side it does boil quickly and the color is nice which fits in with my retro kitchen."},{"reviewerName":"K. Klett","rating":"5.0 out of 5 stars","reviewTitle":"Beautiful","reviewDate":"May 21, 2019","reviewText":"I love the look of this kettle! Boils enough water for 2 big cups of tea. Not as big as my old kettle that gave up the ghost but I prefer the vintage look of this."},{"reviewerName":"Two Bears","rating":"2.0 out of 5 stars","reviewTitle":"Noisy!","reviewDate":"April 9, 2018","reviewText":"This is such a pretty kettle and I wanted to love it, but I ended up returning it because it was incredibly noisy. It clanks and bangs and makes a quite extraordinary racket while it heats the water. Quite a to-do for just some hot water . . ."},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"So pretty even more functional!","reviewDate":"October 18, 2018","reviewText":"Absolutely love this product! Such a useful item that also looks beautiful in my kitchen. My husband and I use it every evening for tea and mention nearly every time what a great purchase it was. Hot water in seconds! You won’t be sorry😁"},{"reviewerName":"Lettes Party","rating":"5.0 out of 5 stars","reviewTitle":"It's hold the perfect amount of water and doesn't take up a lot of counter space.","reviewDate":"January 25, 2018","reviewText":"Use it almost everyday. Very clean look. It's hold the perfect amount of water and doesn't take up a lot of counter space. Water heats up much faster than heating a pot of water on the stove. The only thing missing is there's no warning bell or buzzer to let you know when it's done. So pay attention."},{"reviewerName":"kc","rating":"5.0 out of 5 stars","reviewTitle":"Great Gift Item","reviewDate":"December 11, 2018","reviewText":"I bought one of these as a gift. My parents love it. The shape makes it easy to pour the hot liquid without tipping the kettle far over to empty it. It is well constructed."},{"reviewerName":"Kristen M.","rating":"5.0 out of 5 stars","reviewTitle":"Was a gift for my mother who is like the biggest tea junkie ever","reviewDate":"January 29, 2018","reviewText":"Was a gift for my mother who is like the biggest tea junkie ever. She loves it. She turns it on and walks away and its just done in a few!"},{"reviewerName":"heln","rating":"2.0 out of 5 stars","reviewTitle":"It’s really loud","reviewDate":"June 11, 2019","reviewText":"It was really loud. Louder than any other Kettle we’ve had. Really stylish and retro\nLooking. Wished it had worked out."},{"reviewerName":"MichelleShops","rating":"5.0 out of 5 stars","reviewTitle":"Quality, Reliable and Stylish","reviewDate":"June 30, 2018","reviewText":"I had previously owned one plastic kettle and two glass ones (including a Caprese). All 3 broke. This one is very well built, boils water in about 3 minutes and looks great on my countertop. Love. It."},{"reviewerName":"S. Blair","rating":"5.0 out of 5 stars","reviewTitle":"Nice design and looks great on the counter.","reviewDate":"October 25, 2019","reviewText":"We use this for making coffee (French press) and oatmeal in the morning. Extremely easy to use and has held up well!"},{"reviewerName":"Lorraine A Hoercher","rating":"5.0 out of 5 stars","reviewTitle":"Quality !!!","reviewDate":"December 4, 2018","reviewText":"Perfect !!!\nI'm British I grew up with a\nelectric tea kettle I Love It !!!\nThe colour is amazing !! It matches our backsplash perfect !!!\nHighly recommend 👍"},{"reviewerName":"FrancineHibiscus","rating":"5.0 out of 5 stars","reviewTitle":"Worth it!!","reviewDate":"September 16, 2017","reviewText":"I got this as a surprise for my mom, and it is a delightful kettle. Mom says, \"totally awesome, I love it!\". And we do! Easy to use, heats up in a jiffy, and nice safe short cord."},{"reviewerName":"Tiffany L. Rowland","rating":"1.0 out of 5 stars","reviewTitle":"One Star","reviewDate":"February 15, 2018","reviewText":"Stopped working after only a few months"},{"reviewerName":"C. Curry","rating":"5.0 out of 5 stars","reviewTitle":"KITCHENAid makes a GREAT product. The color is RICH and VIVID","reviewDate":"January 30, 2018","reviewText":"KITCHENAid makes a GREAT product. The color is RICH and VIVID. The heating time is short. The operation is clear and easy. Water stays hot for along time once heated. I wish I could find other KITCHENAid products in this color. . . ."},{"reviewerName":"jennifer yuriar","rating":"1.0 out of 5 stars","reviewTitle":"loud wishling noise as water heats up","reviewDate":"August 12, 2019","reviewText":"message to seller, excellent kettle after 1 1/2 hr the kettle makes a really loud whistling noise as the water heats up. what's going on?"},{"reviewerName":"Ramagart","rating":"5.0 out of 5 stars","reviewTitle":"The perfect. thing","reviewDate":"September 13, 2019","reviewText":"My wife loves this, uses it daily and it is dependable, temp controlled, and easy to pour. perfect."},{"reviewerName":"Julianna Pritchett","rating":"5.0 out of 5 stars","reviewTitle":"Just get it it’s a game changer.","reviewDate":"March 2, 2019","reviewText":"Our tenants introduced us to an electric kettle and we got addicted to it. Love it plus the red one looks cute and matches our kitchen."},{"reviewerName":"dbiz","rating":"5.0 out of 5 stars","reviewTitle":"Cute and functional!","reviewDate":"October 24, 2018","reviewText":"Super cute, heats water fast, minimal contact with plastic (but there is a little, not enough that I'm worried about it). Works great and looks cute on the counter!"},{"reviewerName":"SNelson","rating":"5.0 out of 5 stars","reviewTitle":"Heats Water Quickly","reviewDate":"April 23, 2018","reviewText":"I really like this tea kettle. Heats water so much quicker than my glass top stove. Easy to clean and looks great on my counter top. So glad I purchased."},{"reviewerName":"Paula Thom Murphy","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"April 24, 2017","reviewText":"Good product!"},{"reviewerName":"Shannon","rating":"5.0 out of 5 stars","reviewTitle":"LOVE LOVE LOVE This little kettle","reviewDate":"January 21, 2018","reviewText":"LOVE LOVE LOVE This little kettle! It is perfect and I was shocked at how quickly it boiled water and kept it hot!\nVery stylish looking, but then I am partial to KitchenAid would highly recommend."},{"reviewerName":"nm","rating":"5.0 out of 5 stars","reviewTitle":"NOT RUST","reviewDate":"September 30, 2019","reviewText":"The other reviews showing \"rust\" are actually showing scaling. All kettles get scaling, but it is more visible in this kettle because it is easy to see the bottom.\n\nTo remove the scaling, boil vinegar and allow it to cool. Then wipe out any remaining brown spots."},{"reviewerName":"Mac","rating":"5.0 out of 5 stars","reviewTitle":"Always wanted a pot this sexy","reviewDate":"October 7, 2017","reviewText":"Love this! Discovered these in Europe at a hostel and had to have one. Not as quick as the 210 pot over there but great for making French press coffee or tea!"},{"reviewerName":"Nancy G","rating":"5.0 out of 5 stars","reviewTitle":"Beautiful quality, quick boil easy to clean","reviewDate":"July 19, 2017","reviewText":"Kitchen aid has never let me down. This was a gift for my mother who is a tea drinker (afternoon tea at 3). Beautiful quality, quick boil easy to clean."},{"reviewerName":"nancy","rating":"5.0 out of 5 stars","reviewTitle":"Great Value","reviewDate":"April 26, 2019","reviewText":"this is all stainless steel - perfect size - great value could not get any better"},{"reviewerName":"Sheila","rating":"1.0 out of 5 stars","reviewTitle":"Broke after 6 months","reviewDate":"May 10, 2019","reviewText":"This kettle is adorable but stopped working after 6 months of use."},{"reviewerName":"TBev","rating":"5.0 out of 5 stars","reviewTitle":"Love, Love","reviewDate":"February 24, 2018","reviewText":"Love, Love, Love this tea kettle! The color is just as cute in person. It boils water super fast. My tips to those that posted about rusting are: 1) empty the pot completely after each boil 2) leave the top off or tilted after use so the inside may dry."},{"reviewerName":"Sarah Jonas","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"September 12, 2017","reviewText":"This is very efficient and looks so cute on my kitchen counter!!"},{"reviewerName":"Kindle Customer","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"November 17, 2017","reviewText":"Very nice and well made. Just the right sized pot for a couple cups of your favorite hot drink."},{"reviewerName":"sandra b rodriguez","rating":"5.0 out of 5 stars","reviewTitle":"I’m careful to ensure that the bottom of the pot is dry before placing it on the base.","reviewDate":"February 27, 2018","reviewText":"Very attractive appliance, well-made, and easy to clean. I love the automatic shut off feature. I use it three times or more a day. When friends visit they always notice it and ask me about it."},{"reviewerName":"bungeedog","rating":"5.0 out of 5 stars","reviewTitle":"Great, bright red, kettle!","reviewDate":"January 26, 2019","reviewText":"Metal body and lid, this is a bright pop of color in the kitchen. We use it every day - it's great!"},{"reviewerName":"omtz","rating":"5.0 out of 5 stars","reviewTitle":"Boiling water faster and pretty doing it","reviewDate":"March 27, 2019","reviewText":"Great space saving design. Loved the color and the fact that you don't have to see the water. I wished it whistled like the actual kettle."},{"reviewerName":"Sara","rating":"2.0 out of 5 stars","reviewTitle":"Non-removable plastic below the waterline.","reviewDate":"October 16, 2017","reviewText":"People who say there is no plastic below the waterline have clearly not looked inside the kettle. Yes, the plastic filter is removable but the plastic that holds the filter is not and extends well below the waterline. I am very disappointed because it is aesthetically just what I was looking for but who wants to boil plastic? Yuck."},{"reviewerName":"GJ Seattle","rating":"5.0 out of 5 stars","reviewTitle":"Great Electric Kettle","reviewDate":"December 26, 2018","reviewText":"This is a great kettle! I alos know several people who have this kettle and they really like it!"},{"reviewerName":"Schnauzer Mom","rating":"5.0 out of 5 stars","reviewTitle":"Works","reviewDate":"December 30, 2018","reviewText":"Cute kettle and so far it’s been working well without any issues."},{"reviewerName":"Shawn Irish","rating":"5.0 out of 5 stars","reviewTitle":"Such a beautiful color too","reviewDate":"May 23, 2018","reviewText":"I was given one of these for a gift and was so taken with it that I had to buy one for my daughter as a house warming gift. Such a beautiful color too!"},{"reviewerName":"Fran","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"September 14, 2017","reviewText":"The best electric kettle i've owned so far. I love this kettle. The color blue is so beautiful!"},{"reviewerName":"PyrLady","rating":"5.0 out of 5 stars","reviewTitle":"The Perfect Little Countertop Kettle","reviewDate":"May 21, 2018","reviewText":"LOVE THIS! Worth every penny. Heats up quickly and the water stays hot for a good long time.I love the automatic shut-off feature. The pistachio color is almost exactly the same as out KitchenAid Mixer."},{"reviewerName":"Siong Kim Tan","rating":"2.0 out of 5 stars","reviewTitle":"Red paint at the top peels off and mixes into the water","reviewDate":"September 19, 2017","reviewText":"I have used it for a while and while I do like the kettle, the red paint at the top where one puts the cap is peeling off (perhaps from the opening and closing of the cap) and it gets into the water. Sometimes it goes unnoticed and will be consumed. At other times, I will need to try and scoop it out."},{"reviewerName":"Paula Schwan","rating":"5.0 out of 5 stars","reviewTitle":"I love the way this turns itself off when it has ...","reviewDate":"March 29, 2018","reviewText":"I love the way this turns itself off when it has boiled. It clicks off. I'm forgetful and hate whistling kettles so I am happy."},{"reviewerName":"Amazon Customer","rating":"4.0 out of 5 stars","reviewTitle":"Four Stars","reviewDate":"May 19, 2018","reviewText":"Removing the lid to fill with water can be painful because of steam when hot"},{"reviewerName":"Gineraso","rating":"5.0 out of 5 stars","reviewTitle":"t's very sturdy and looks great on our kitchen counter.","reviewDate":"February 18, 2018","reviewText":"Bought this as a gift for my wife and she loves it. It's very sturdy and looks great on our kitchen counter. It heats a full pot in about 3 minutes."},{"reviewerName":"Lit Chick","rating":"5.0 out of 5 stars","reviewTitle":"Best electric kettle I ever owned","reviewDate":"July 25, 2018","reviewText":"Had this for a while. Best electric kettle I ever owned."},{"reviewerName":"KR","rating":"3.0 out of 5 stars","reviewTitle":"ok, but will chose a different product next time.","reviewDate":"February 18, 2018","reviewText":"well, got this one to replace an old kettle. it looks great but here and there you can see rust spots (specifically near the handles and cover)."},{"reviewerName":"Excellent shopper","rating":"2.0 out of 5 stars","reviewTitle":"The kettle is too small. Not big enough for ...","reviewDate":"December 6, 2016","reviewText":"The kettle is too small. Not big enough for any family of more than 2. The plastic filter is positioned so low that it is in contact with boiling water at all times. Defeats the purpose of having a stainless steel kettle if a part of it is bathing in water."},{"reviewerName":"Janet Swenson","rating":"1.0 out of 5 stars","reviewTitle":"Be aware","reviewDate":"August 28, 2019","reviewText":"This is how my product came in the mail! It was missing the electric plate and plug in and it was loose in the box."},{"reviewerName":"Zelfine","rating":"5.0 out of 5 stars","reviewTitle":"I love it!","reviewDate":"December 7, 2018","reviewText":"I love it I had another 25 yrs . Very pretty. Blue too!"},{"reviewerName":"Michael Doyle","rating":"5.0 out of 5 stars","reviewTitle":"Perfect size","reviewDate":"August 1, 2019","reviewText":"Great looking"},{"reviewerName":"elisa aulani","rating":"5.0 out of 5 stars","reviewTitle":"Pretty lil kitchen gadget","reviewDate":"July 11, 2016","reviewText":"Absolutely love it. Everyday I look over at it and it makes me smile. Does it work...yes. It automatically switches off at boiling point which is nice."},{"reviewerName":"Grady Brockley","rating":"4.0 out of 5 stars","reviewTitle":"Heats water fast","reviewDate":"May 2, 2018","reviewText":"Good looking works as promised"},{"reviewerName":"50210","rating":"5.0 out of 5 stars","reviewTitle":"So pretty!","reviewDate":"January 19, 2019","reviewText":"Simply love it! works great and looks good!"},{"reviewerName":"rswayz","rating":"5.0 out of 5 stars","reviewTitle":"Great!","reviewDate":"December 27, 2016","reviewText":"Boils water quickly; doesn't seem to leave calcium residue on the bottom like others do."},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"April 6, 2018","reviewText":"Everyone comments on how cute this is. My girlfriend loves it. Life is great"},{"reviewerName":"MapleFalcon","rating":"4.0 out of 5 stars","reviewTitle":"Works well, no problems.","reviewDate":"January 21, 2018","reviewText":"Works well, no problems. It heats up reasonably quickly and holds enough for ~4 mugs of coffee or tea."},{"reviewerName":"LH","rating":"5.0 out of 5 stars","reviewTitle":"Love this and get compliments on it all the time","reviewDate":"August 3, 2017","reviewText":"Love this and get compliments on it all the time. Had it for six months, no issues so far, nice size."},{"reviewerName":"joan hoeschen","rating":"5.0 out of 5 stars","reviewTitle":"Heats water fast","reviewDate":"May 15, 2019","reviewText":"I like this kettle. I didn’t want temperature control so shuts when boiling but that is just fine with me."},{"reviewerName":"Genna","rating":"4.0 out of 5 stars","reviewTitle":"nice!","reviewDate":"January 15, 2016","reviewText":"I like this a lot. It gets a little hot - it'd be nice if the handle was insulated because the steam from the pot gets it pretty warm. But I love the look, it's quick, and a good size (not to big, not too little."},{"reviewerName":"Ann E. Phillips","rating":"5.0 out of 5 stars","reviewTitle":"Great size, with the added features of a easy ...","reviewDate":"April 1, 2018","reviewText":"Great size, with the added features of a easy to see maximum fill tab and spout filters. The kettle turns off when thee water boils. Very attractive."},{"reviewerName":"Ingrid Gonzalez","rating":"5.0 out of 5 stars","reviewTitle":"I had to buy a second one!!!","reviewDate":"October 30, 2018","reviewText":"My mother just loved it, then I had to buy another one. Easy to use and clean in an amazing color!!!"},{"reviewerName":"Ron Dowden","rating":"5.0 out of 5 stars","reviewTitle":"I bought this for my college bound daughter. She ...","reviewDate":"October 19, 2017","reviewText":"I bought this for my college bound daughter. She loves this! The convenience of fast hot water with her busy schedule is just the ticket. Large enough for three to four cups of hot water."},{"reviewerName":"Karen G. Spisak","rating":"5.0 out of 5 stars","reviewTitle":"Beautiful, quiet, works great","reviewDate":"February 12, 2018","reviewText":"Beautiful tea kettle, works great. Heats up fast, holds plenty of water."},{"reviewerName":"OLGA MAGDALENA LAZIN","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"April 14, 2018","reviewText":"wonderful kettle. As expected, perfect. Thanks,"},{"reviewerName":"B.","rating":"5.0 out of 5 stars","reviewTitle":"Heats very fast.","reviewDate":"May 12, 2018","reviewText":"Feels solid and heats very fast. Looks nice too. Hope it lasts."},{"reviewerName":"TruthSeeker","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"December 9, 2017","reviewText":"Love the color! Also, it is easy to fill and easy to pour and boils the water quickly..."},{"reviewerName":"Lactation RN","rating":"5.0 out of 5 stars","reviewTitle":"Gift","reviewDate":"January 16, 2018","reviewText":"This was a gift, my mom loves it!"},{"reviewerName":"Duncan McLean","rating":"5.0 out of 5 stars","reviewTitle":"High quality, attractive kettle.","reviewDate":"July 18, 2018","reviewText":"Very high quality and nice-looking. My wife loves it, too!"},{"reviewerName":"Alec","rating":"5.0 out of 5 stars","reviewTitle":"Good Product","reviewDate":"June 3, 2018","reviewText":"Heats rapidly. Attractive."},{"reviewerName":"Geri","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"January 31, 2018","reviewText":"This Kitchen Aid teapot is wonderful. It's well made and heats quickly. I would recommend this to my friends."},{"reviewerName":"SAP","rating":"5.0 out of 5 stars","reviewTitle":"my mom LOVED it for her birthday","reviewDate":"October 23, 2017","reviewText":"So cute...my mom LOVED it for her birthday. It is so cute and just the right size."},{"reviewerName":"Alex V.","rating":"4.0 out of 5 stars","reviewTitle":"Good kettle, short cord.","reviewDate":"April 2, 2017","reviewText":"This thing's been a trooper. The cord isn't as long as it should be, given the price, but I love the kettle itself."},{"reviewerName":"Byusmommie","rating":"2.0 out of 5 stars","reviewTitle":"Rest in Peace dear Kettle...","reviewDate":"June 29, 2015","reviewText":"Who doesn't like Kitchen Aid?\nI just love it. Simple design... Yet looks so elegant. No complain whatsoever. The lid is easily open not like my previous owned DeLonghi. Well both are great kettle but I simply love this one for the size and quiet.\n\nUPDATE REVIEW JANUARY 14TH 2017\n===============================\nWell, here I am, a year and half after my purchase, feeling heart broken.. The kettle fails on me!!!!\nIT JUST STOP WORKING!!!!! The LED lights still on and everything. But it just don't want to boil anymore. And it happened so suddenly in a cold cold evening where one was really beat and looking for comfort from a nice cuppa tea!!! Never had I abuse you from over boilings nor dipping you in pool of water!\nKITCHEN AID, I AM UPSET AT YOU!!! Why your life is so short? I was thinking to spend my whole life with you!!! I had treated you ever so gently! And not to mentioned its been a long time since I closed one eye on your chipped paint on your lid! And your noisy sounds while boiling since many months ago???\nAnyway... Goodbye my kettle.. Thank you for stopping by in my life... I hope you find peace elsewhere...\nAnd.. Am I gonna purchase your twin sisters?\nI might need to heal my heart ache first!"},{"reviewerName":"Leigh","rating":"5.0 out of 5 stars","reviewTitle":"Fast and stylish","reviewDate":"January 10, 2018","reviewText":"Best kettle out there. This is not our first, but I love that it has metal everywhere instead of plastic. We also love the color choices."},{"reviewerName":"Tamara","rating":"5.0 out of 5 stars","reviewTitle":"Love it","reviewDate":"May 29, 2017","reviewText":"This is a beautiful cordless electric kettle. It looks gorgeous, I haven't had it long so I don't know how easy it is to keep it looking this pretty. Heating time is a little slower at about 4.5 minutes when it's filled to max (about 5 cups). I would have liked a capacity indicator on the outside but ah well, it's too lovely to complain. It does have a max full line on the inside which is hard to see if you don't have great eyesight (see pic). It does have a light to indicate if it's on."},{"reviewerName":"flying130952","rating":"5.0 out of 5 stars","reviewTitle":"It is the perfect gift for her","reviewDate":"June 14, 2018","reviewText":"My wife loves it. It is the perfect gift for her."},{"reviewerName":"CAROL CHEN","rating":"5.0 out of 5 stars","reviewTitle":"Hot water pot","reviewDate":"November 4, 2018","reviewText":"Love it"},{"reviewerName":"Oh Sang Yoon","rating":"5.0 out of 5 stars","reviewTitle":"Stable handle","reviewDate":"December 28, 2018","reviewText":"Fast boiling, small,easy to use, but fixed handle"},{"reviewerName":"Hanna Thornberg","rating":"5.0 out of 5 stars","reviewTitle":"This is the best purchase I've made as a tea drinker","reviewDate":"April 19, 2018","reviewText":"This is the best purchase I've made as a tea drinker. So much easier than putting a mug in the microwave. And the mint color is beautiful!"},{"reviewerName":"The shopper Han","rating":"5.0 out of 5 stars","reviewTitle":"I highly recommend","reviewDate":"September 16, 2017","reviewText":"Awesome kettle. Love color and well made as expected from kitchen aid. A+"},{"reviewerName":"Renita Davenport","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"September 5, 2017","reviewText":"Great!"},{"reviewerName":"H. Stein","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"December 29, 2017","reviewText":"Perfect size and very cute countertop electric kettle. Heats water as fast as expected!"},{"reviewerName":"Konan","rating":"5.0 out of 5 stars","reviewTitle":"good look","reviewDate":"December 28, 2017","reviewText":"replace my old kettle, this shiny looks great"},{"reviewerName":"Tami Raji","rating":"5.0 out of 5 stars","reviewTitle":"KitchenAid always comes through","reviewDate":"June 10, 2018","reviewText":"Good buy. Easy to warm water and no more microwave or boiling on stove."},{"reviewerName":"jr33","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"February 10, 2018","reviewText":"Pretty. Works well. Fast."},{"reviewerName":"Lucy F. Shipley","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"December 6, 2016","reviewText":"love the shape, love how quick it heats very happy with it."},{"reviewerName":"Elaine M. Daigle","rating":"5.0 out of 5 stars","reviewTitle":"Love","reviewDate":"October 2, 2019","reviewText":"Love it! I use every single day. Highly recommend."},{"reviewerName":"Browncoat","rating":"4.0 out of 5 stars","reviewTitle":"Stylish","reviewDate":"May 11, 2016","reviewText":"Nice lines, heats up quickly, pours easily. Lift out lid is not quite as convenient as pop-up lid models, but that's a detail."},{"reviewerName":"KMcCMedia","rating":"5.0 out of 5 stars","reviewTitle":"Really good","reviewDate":"March 3, 2018","reviewText":"Really good"},{"reviewerName":"4mom","rating":"1.0 out of 5 stars","reviewTitle":"Pick a different electric kettle","reviewDate":"August 26, 2017","reviewText":"This kettle heats the water very slowly and then does not keep it hot very long. I really don't like it at all."},{"reviewerName":"Courtney","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"July 31, 2017","reviewText":"I love this kettle. Holds plenty of water, boils quickly, and the color is great!"},{"reviewerName":"RosieF","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"November 29, 2016","reviewText":"Looks great & functions well"},{"reviewerName":"Kitsy S.","rating":"4.0 out of 5 stars","reviewTitle":"I've wanted one for a long time.","reviewDate":"March 18, 2016","reviewText":"I keep it beside me in the study where I write. I would give it 5 stars if it had a bit of a whistle...a removable one would be ideal."},{"reviewerName":"rufinu","rating":"5.0 out of 5 stars","reviewTitle":"Good kettle","reviewDate":"October 13, 2016","reviewText":"Sturdy, perform as expected, i don't really care much about some plastic part submerged to water."},{"reviewerName":"Tryshann","rating":"5.0 out of 5 stars","reviewTitle":"Like the quickness of heating","reviewDate":"August 22, 2016","reviewText":"Fits my 1926 bungalow kitchen. Like the quickness of heating, ease of use."},{"reviewerName":"Julielou","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"July 25, 2017","reviewText":"This is a lovely kettle."},{"reviewerName":"Ellie","rating":"4.0 out of 5 stars","reviewTitle":"Great for making cups of tea","reviewDate":"October 13, 2016","reviewText":"smaller than I expected.....but thats my fault for not checking properly. functions really well and boils quick. Great for making cups of tea!"},{"reviewerName":"Raven Q","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"October 1, 2016","reviewText":"great color, perfect size! Great gift amazing brand"},{"reviewerName":"P S","rating":"4.0 out of 5 stars","reviewTitle":"Beautiful great quality kettle","reviewDate":"May 11, 2018","reviewText":"love it - looks classy too"},{"reviewerName":"group manager","rating":"5.0 out of 5 stars","reviewTitle":"perfect","reviewDate":"April 22, 2017","reviewText":"love it and its gorgeous"},{"reviewerName":"Amazon Customer","rating":"4.0 out of 5 stars","reviewTitle":"Looks good and works well","reviewDate":"September 18, 2016","reviewText":"Looks good and works well. Picked it to match the colour of my Kitchen Aid mixer. Liked the strainer inside. Would recommend to have a visual for the water level ."},{"reviewerName":"Grady J.","rating":"4.0 out of 5 stars","reviewTitle":"Love It Except for the Ugly Label on the Power Cord.","reviewDate":"July 13, 2016","reviewText":"I love the electric kettle. It looks nice and heats water more quickly than my old electric kettle. I took off a point because of the large, ugly warning label on the power cord, approximately 6\" x 2.5\", warning in 3 languages that there could be a shock hazard if it was not plugged into a 3 prong outlet. Granted, it is probably required by law. But they used the worst, stickiest, glue to attach it to the cable. It took me a good 20 minutes, and several chemicals to clean that goop off of the cable. Goo Gone wouldn't touch it. Gluing something that securely onto an item to be used in the kitchen should be illegal. Most electric cords come with warning labels, but most are less obnoxious and much easier to remove."},{"reviewerName":"Jiang Yujun","rating":"5.0 out of 5 stars","reviewTitle":"This is a really nice product. Gave a second thought because of the ...","reviewDate":"September 3, 2017","reviewText":"This is a really nice product. Gave a second thought because of the price. But very handy to use in my dorm room."},{"reviewerName":"The Pits","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"August 5, 2017","reviewText":"Love this kettle. Easy to use and clean."},{"reviewerName":"Amazon Customer","rating":"2.0 out of 5 stars","reviewTitle":"Two Stars","reviewDate":"March 7, 2017","reviewText":"Broke in 6 months, has a plastic smell from the boiled water"},{"reviewerName":"Mrs. D. Reynolds","rating":"5.0 out of 5 stars","reviewTitle":"Cute - no fuss quick boil kettle","reviewDate":"April 16, 2018","reviewText":"Adorable, safe and easy pot for my tea. Love it!"},{"reviewerName":"Nancy","rating":"4.0 out of 5 stars","reviewTitle":"Good kettle","reviewDate":"December 7, 2017","reviewText":"Originally from the UK, who ever heard of a kettle where the handle doesn't move. Despite that, it boils the water."},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Best Tea Kettle!!","reviewDate":"November 28, 2018","reviewText":"Love this!!!!"},{"reviewerName":"sautry91","rating":"5.0 out of 5 stars","reviewTitle":"Long Cord!","reviewDate":"March 27, 2016","reviewText":"Just arrived in the mail & had to use right away - looks great next to my pistachio stand mixer! I filled about 1/2 to 3/4 of the way up to the max fill line & the water was boiling in ~1-2 mins. I purchased this electric kettle to replace another basic kind i had that would not stay on, I would have to constantly push the lever down again or place a heavy object on the lever to keep it on. The handle has a nice heavy/sturdy feel, overall seems to be pretty good quality.\n\nOne of the reviews i read before purchasing noted that the cord was very short - about a foot in length. The cord is actually quite long, around 3 ft long - it comes partially wrapped around the base with about a foot sticking out so at first glance the cord just appears short. I dont think i would have noticed how long the cord length actually was if i had not read the review on how short it was & investigated once it arrived. Almost didnt buy due to the short cord length but very glad i did! The overall length of the cord is just barely too short to have the entire cord (up to the plug) wrapped around underneath so about a foot will stick out the back."},{"reviewerName":"GF","rating":"3.0 out of 5 stars","reviewTitle":"Three Stars","reviewDate":"June 23, 2017","reviewText":"stylish design, but low power. It takes forever to heat it up"},{"reviewerName":"gerjar","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"July 20, 2017","reviewText":"very good piece of kitchen equipment"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"A luxury, but worth it","reviewDate":"April 26, 2016","reviewText":"A keeper. Heats up fast, handle stays cool, love the spout as it make pouring feel safer, and ooh the color . . ."},{"reviewerName":"Kaitlyn","rating":"5.0 out of 5 stars","reviewTitle":"better than other kettles","reviewDate":"October 8, 2017","reviewText":"The lid could be removed, better than other kettles."},{"reviewerName":"Jeanine","rating":"5.0 out of 5 stars","reviewTitle":"verry happy","reviewDate":"January 19, 2016","reviewText":"Very happy with this kettle. It boils quickly and isn't very loud. It looks perfect to me and I cannot see any scratches. Looks new to me."},{"reviewerName":"AK","rating":"1.0 out of 5 stars","reviewTitle":"Beautiful Electric Kettle with plenty of plastic inside )--:","reviewDate":"February 27, 2015","reviewText":"although it is a beautiful electric kettle it does have plenty of plastic parts inside of it\nwhich caused me to return it\non the description of the product it says no plastic inside , well ....... there is plenty of plastic inside touching the water\n\n---returned---"},{"reviewerName":"jlotwo","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"June 15, 2018","reviewText":"It heats the water quickly and I love the color!"},{"reviewerName":"LadyDallas75243","rating":"5.0 out of 5 stars","reviewTitle":"First Class","reviewDate":"March 11, 2015","reviewText":"Fabulous! This item completed my line of KitchenAid small appliances and it looks amazing on the countertop. I would definitely recommend and buy again..."},{"reviewerName":"Sebastián Osorio","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"July 4, 2017","reviewText":"Best electric kettlle ever"},{"reviewerName":"Bob Kroetsch","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"January 11, 2017","reviewText":"Just what we were looking for. Well made and well designed"},{"reviewerName":"Lisa Kinyon","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"November 21, 2016","reviewText":"Love this tea kettle!"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"November 18, 2016","reviewText":"Great Product, Thanks"},{"reviewerName":"Mark B","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"April 1, 2017","reviewText":"Works and looks great"},{"reviewerName":"g.chan","rating":"5.0 out of 5 stars","reviewTitle":"Colorful, cute, sturdy and convenient kettle.","reviewDate":"September 6, 2016","reviewText":"I was skeptical about getting this electric water kettle because I wasn't sure how convenient it would be compared to my Zojirushi hot water dispenser. I like being able to have hot water available anytime I wanted and I didn't want to wait for the water to boil each time I needed some. My husband insisted that this kettle would be a lot safer because it isn't coated with plastic and hot water isn't just sitting in there for hours or even days. So, reluctantly I gave it a try and now I'm in love with this. If you only need a cup or two or hot water at a time, it takes literally less than a minute for it to start boiling. It takes less space, looks good and comes in bright cheerful colors. It's not a very big pot and is pretty pricey for it's size but it is convenient and a healthier option to the hot water dispensers. I highly recommend this."},{"reviewerName":"Lizzy C.","rating":"4.0 out of 5 stars","reviewTitle":"A little loud, but I love the retro style","reviewDate":"August 11, 2016","reviewText":"Kinda loud when boiling, but the color in the picture is very true to the actual color of the kettle and it matches my rustic kitchen perfectly."},{"reviewerName":"Claire Marie","rating":"5.0 out of 5 stars","reviewTitle":"perfect and cute","reviewDate":"July 3, 2016","reviewText":"love this tea kettle - cute and works great"},{"reviewerName":"Robinwing","rating":"3.0 out of 5 stars","reviewTitle":"Cute but a bit dangerous","reviewDate":"May 12, 2016","reviewText":"This is my third electric tea kettle purchase over the past 30 years. This one is my least favorite. Yes is it very cute. But, it is very very noisy.It can wake up the dead when starting to boil. It is not the fastest when coming to a boil, but adequate. The handle can get very hot at the edges, so I have to be careful on how I pick it up. If you need to refill it when it is hot, you can get burned from the hot steam since the lid is directly under the handle. The whole pot gets very hot. It does boil water well though."},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"January 21, 2017","reviewText":"works great. looks great!"},{"reviewerName":"Jasper","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"April 7, 2018","reviewText":"Love it"},{"reviewerName":"Edmund F.","rating":"5.0 out of 5 stars","reviewTitle":"Elegant","reviewDate":"May 13, 2016","reviewText":"Very elegant and great look in the kitchen."},{"reviewerName":"Colleen","rating":"5.0 out of 5 stars","reviewTitle":"This kettle is really nice looking- that's honestly why I ordered it- it's stylish ...","reviewDate":"February 9, 2015","reviewText":"This kettle is really nice looking- that's honestly why I ordered it- it's stylish and I keep it on my counter all day. Cord length is about 13\"- fine by me. It's nicely made, solid- all steel inside with a bit of plastic around filter. It's true \"KitchenAid Red\". The lid comes completely off, it's easy to fill and the handle is placed comfortably for lifting. It takes a bit over 5 mins to boil from cool water. There isn't a window to measure how much water is left- but it hasn't bothered me yet and I prefer the clean look of the kettle over the buttons/windows. Overall, it's a simple, fast kettle that looks lovely."},{"reviewerName":"Nick","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"September 24, 2016","reviewText":"cute"},{"reviewerName":"Dale R. Beatty","rating":"4.0 out of 5 stars","reviewTitle":"Great kettle.","reviewDate":"April 27, 2016","reviewText":"Very nice kettle. Heats water quickly. Very attractive."},{"reviewerName":"SMW","rating":"5.0 out of 5 stars","reviewTitle":"Use this often and love it. I am sure I will use it ...","reviewDate":"May 22, 2016","reviewText":"Use this often and love it. I am sure I will use it daily in cooler weather to make my tea. Heats water quickly and automatically shuts off."},{"reviewerName":"katwa","rating":"5.0 out of 5 stars","reviewTitle":"looks nice on the","reviewDate":"December 5, 2016","reviewText":"Fast to boil, looks nice on the counter"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"December 19, 2016","reviewText":"I loved it a little something for me"},{"reviewerName":"Brooke Nelson","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"March 18, 2017","reviewText":"Heats up water fast and is easy to the eyes."},{"reviewerName":"Phoebe","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"December 27, 2016","reviewText":"If you want a no frills electric kettle--this is great! Very reliable and looks nice!"},{"reviewerName":"susan","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"March 7, 2017","reviewText":"Everything I ever wanted in an electric kettle!"},{"reviewerName":"ackmom","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"June 14, 2017","reviewText":"Love my new kettle!"},{"reviewerName":"George Patterson","rating":"5.0 out of 5 stars","reviewTitle":"Love the look. Heats up in seconds.","reviewDate":"August 23, 2016","reviewText":"Love the look. Heats up in seconds."},{"reviewerName":"SP","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"January 15, 2017","reviewText":"Love this little guy, super convenient and love the color."},{"reviewerName":"Dexter R","rating":"5.0 out of 5 stars","reviewTitle":"In Love","reviewDate":"May 22, 2016","reviewText":"I'm in love with this functional aesthetically pleasing product. Some reviewers are just plain fussy. I was deliberating between this kettle and others where temperature can be set and maintained. But after careful consideration I realise I don't need those features. This onyx baby is all I need. Does exactly what it says and every visitor oogles over it. I got it on time and it's a breeze to set up and maintain.\n\nI highly recommend this kettle."},{"reviewerName":"Ravi Srivastava","rating":"3.0 out of 5 stars","reviewTitle":"Plastic alert!","reviewDate":"August 18, 2015","reviewText":"This kettle has non-removable plastic inside it. It is the filter holder. This plastic part holds the filter insert. Filter too has plastic in it. You can remove the filter but not the filter holder. Filter holder made of plastic touches water, unless you are making only one cup."},{"reviewerName":"C. Lassiter","rating":"5.0 out of 5 stars","reviewTitle":"Awesome Electric Kettle","reviewDate":"March 1, 2017","reviewText":"I saw an ad for this in a facebook sidebar and fell in love with it. I ordered it and it came a couple of days ago. I love it. It heats water really fast and really hot. I love the color, pistachio. It looks great on the kitchen counter and doesn't take much space. I love my KitchenAid mixer and I knew I'd love this too."},{"reviewerName":"Kat F","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"June 28, 2016","reviewText":"Great hot water kettle."},{"reviewerName":"John","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"October 27, 2016","reviewText":"Great kettle"},{"reviewerName":"Amazonian","rating":"2.0 out of 5 stars","reviewTitle":"BAD SMELL + SO MUCH PLASTIC INSIDE","reviewDate":"June 30, 2016","reviewText":"Super cute but had a bad smell. Also, what I got was defective, the lid popped off while I was pouring and the steam burned my hand. Also, there's much more plastic, actually, soooo much more plastic that touches the water in that design. The customer photos don't represent it well."},{"reviewerName":"JMB","rating":"5.0 out of 5 stars","reviewTitle":"Great, nice looking electric teapot","reviewDate":"February 5, 2016","reviewText":"Love this! I have mixed feelings about the spout. It's very wide which is heat when pouring quickly, but you're more apt to spill. But this is the only electric teapot I could find that looks like a teapot and not an ugly carafe. I had a Cuisinart one that died and was discontinued, so I'm happy to have found this one. The short cord doesn't bother me as I park it on my kitchen countertop permanently (I use it multiple times a day), which is also why I wanted a sleek looking teapot"},{"reviewerName":"grace","rating":"5.0 out of 5 stars","reviewTitle":"Simple and Fast!","reviewDate":"January 31, 2016","reviewText":"Really pleased with this Kettle! I spent days with it in and out of my cart choosing between this model and some more expensive ($99-$150) electric kettles with more bells and whistles and I am happy that I chose this one. It is simple, easy to use, heats up water super fast, and just does the job well without having excess beeping/ buttons that I just don't need. If you are looking for a simple way to boil water without having many options about temperature, etc, then this would be perfect for you.\nAlso, It is really pretty on our countertops and I love the color!"},{"reviewerName":"Henry E. York","rating":"5.0 out of 5 stars","reviewTitle":"We love it!","reviewDate":"September 8, 2016","reviewText":"This is a solid and serviceable electric kettle that makes enough hot water for a pot of tea or two large mugs. It wide lid make for easy de-scaling, that with it short wide design let it fit under most taps. What little plastic used on the kettle itself, is well place: A plastic knuckle guard under the lid handle protect the hand. A plastic spout screen frame, could be metal but would over time mineral lock in place, works well. Held up well so far, a couple of months, and we make a lot of tea."},{"reviewerName":"Dragon","rating":"1.0 out of 5 stars","reviewTitle":"Negative reviews are honest!","reviewDate":"January 16, 2017","reviewText":"I should have listened to other negative reviewers! This kettle is terribly designed for these reasons: the PLASTIC filter is submerged in the water so when the water boils guess what? You are boiling the plastic and everything that leaches from the plastic goes straight into your water! And there is a terrible chemical smell that lingers even when not in use. Next, the stainless steel handle of both the lid and kettle get hot when boiling a couple batches of water in a row. I guess that wasn't important to KitchenAid. This kettle was designed for looks not for function and I was a sucker :-(\nI'm going back to the Breville tea kettle which worked 3 years for me but finally gave out. I thought I could save a few dollars and get a snazzy new look but it definitely wasn't worth it. Can't return it soon enough! Thank you Amazon Prime for great return policy!"},{"reviewerName":"Laurie","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"November 6, 2016","reviewText":"Love it"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Adorable","reviewDate":"August 24, 2016","reviewText":"Great design, functional, and adorable. I love using it."},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"October 15, 2016","reviewText":"Great"},{"reviewerName":"Dorothea Ivanova","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"February 21, 2016","reviewText":"A good kettle"},{"reviewerName":"motheringingrace","rating":"2.0 out of 5 stars","reviewTitle":"Loved it, until a coating started flaking off into the water after only 7 days.","reviewDate":"October 31, 2016","reviewText":"I really wanted to love this kettle. In fact, I do love it aesthetically, that's why I was willing to pay $80 for it when there are perfectly good kettles for much less. I even stuck with it when I realized it gave the water an extremely metallic taste. I boiled pot after pot of water trying to get the metallic taste to go away, and after a week, it was much improved. But then, last night, I realized the entire bottom coating (I didn't realize there was a coating) was flaking off on the inside of the kettle. I hadn't looked into it for a couple of days, so now I'm wondering how many of these big flakes I swallowed. Yuck! I only had this kettle a week before whatever the coating was began flaking off. It's hard and brittle. And the only thing I've boiled in it is water, so I know it's not any kind of film or residue from a liquid. Too bad. The search for a cute kettle is back on."},{"reviewerName":"Mama T","rating":"5.0 out of 5 stars","reviewTitle":"The BEST tea kettle I have ever had","reviewDate":"February 11, 2015","reviewText":"The BEST tea kettle I have ever had! I am a tea drinker and having an electric kettle is a must for me. I ordered three different ones.\nI started with two inexpensive ones on Amazon and had to return them. Then I ordered this kettle and found MY kettle! It's cute (that matters) and so well made and works perfectly. It is worth every penny I spent. I love using it!!"},{"reviewerName":"Jim Stoa","rating":"4.0 out of 5 stars","reviewTitle":"I like that it has an automatic turn-off when the water ...","reviewDate":"February 18, 2016","reviewText":"This is a very sleek-looking kettle. It's good-looking enough that I leave it out on my office shelf rather than stow it away when I'm not using it.\n\nIt has enough capacity for two full mugs with a little extra. I like that it has an automatic turn-off when the water reaches a boil, but I do wish it had a 'keep warm' feature. My only other complaint is that the cord is very short.\n\nI'm happy with my purchase."},{"reviewerName":"ACR452","rating":"4.0 out of 5 stars","reviewTitle":"Attractive small kettle - but metal gets hot","reviewDate":"December 11, 2016","reviewText":"I like the shape of this, which is bit like a stove-top kettle. It is smaller in real life than I anticipated, but it does fine for everyday tasks like tea-making and filling up for saucepans. The only negative is that the body of the kettle gets burning hot (the handle seems to still be touchable). This seems a major design flaw. I went for an electric kettle because I thought it would be safer than having the gas on around a young baby, but now I am reconsidering. However, now that I know this, I am just extra careful, so I think it will be alright."},{"reviewerName":"AW","rating":"5.0 out of 5 stars","reviewTitle":"Love! Finally Pistachio!","reviewDate":"January 5, 2016","reviewText":"Love this kettle! The bottom doesn't get hot, so I can set it on any surface, after its boiled. I'm so happy KitchenAid finally came out with more Pistachio colored products to go with my mixer."},{"reviewerName":"John A","rating":"3.0 out of 5 stars","reviewTitle":"Well Built, but Plastic, Plastic, Plastic...","reviewDate":"August 1, 2016","reviewText":"I found nothing wrong with the construction of the kettle, but I did see way more plastic on the interior than I hoped. I actually hoped on having zero plastic on the interior. That was not the case. At this point, I don't believe there is such a thing as a plastic-free electric kettle. I've spent more hours searching than I can remember."},{"reviewerName":"Artist/teacher","rating":"2.0 out of 5 stars","reviewTitle":"Although I like the size and the style","reviewDate":"January 17, 2017","reviewText":"I bought this to replace my Cuisinart electric kettle, which is not made anymore. I wanted a stainless steel \"kettle-looking\" style. I have had this for about 6 months. Although I like the size and the style, it is far too powerful. I can't walk away from it because if I leave it, it mists the whole underneath of my kitchen cabinets. I should have realized that it was going to be powerful when I saw the cord which is very heavy duty with a three prong plug.\nThe reason I like an electric kettle is so that I can put the water on, walk away and do other things while the water was heating and have it turn off automatically. If you leave this one, half the water boils out. The water comes out scalding hot and impossible to drink if I make tea. I always have to put an ice cube in it. This kettle is overkill. I now have to stand by it while it's heating and take it off the carriage before its starts misting all over the place."},{"reviewerName":"Mona","rating":"5.0 out of 5 stars","reviewTitle":"lives in an apartment with not a lot of counter room and a small stove and this works great for her and her husband","reviewDate":"April 30, 2016","reviewText":"I bought this for my daughter as a birthday gift and she LOVES it! She says it heats water very fast and looks cute on her counter. She is a tea drinker, lives in an apartment with not a lot of counter room and a small stove and this works great for her and her husband. Would she buy again? She says yes!"},{"reviewerName":"american ann","rating":"5.0 out of 5 stars","reviewTitle":"BEST ELECTRICAL KETTLE ON THE MARKET","reviewDate":"November 7, 2016","reviewText":"This is the best electric kettle that I have ever found, and as I live in England for 20 years, I have tried a lot of them.\nIt;s the fastest and the cutest. I have one in our home and ordered this one for our Bend home."},{"reviewerName":"Patti A.","rating":"5.0 out of 5 stars","reviewTitle":"My last kettle had a crappy switch and fake chrome (foil covered plastic) and cost ...","reviewDate":"January 24, 2017","reviewText":"My last kettle had a crappy switch and fake chrome (foil covered plastic) and cost about the same as this one. This kettle seems very sturdy. I like that it has a three prong plug. Switch is solid. Very few plastic pieces AND it's cute!"},{"reviewerName":"R. Petrosso","rating":"5.0 out of 5 stars","reviewTitle":"Compliments French press","reviewDate":"June 5, 2016","reviewText":"I wanted to be more friendly to the environment. So when my Keurig broke, I went with a French Press. This makes the transition easy. Coffee is 100% better and really doesn't take any longer. This kettle boils water quickly and has a great vintage look to it."},{"reviewerName":"Zobee","rating":"4.0 out of 5 stars","reviewTitle":"Not the prettiest but a pretty good kettle.","reviewDate":"February 18, 2016","reviewText":"One issue - if you try to refill the kettle by lifting the lid on a just boiled kettle you will burn you hand on the steam. You will probably have to learn this lesson. Small -- doesn't hold as much as it looks like it should."},{"reviewerName":"missy","rating":"5.0 out of 5 stars","reviewTitle":"Like it","reviewDate":"December 13, 2015","reviewText":"Very nice, tested it out (to be a Christmas gift). Boils in 6 minutes. Has automatic shutoff (essential to me). VERY expensive to me but that's the KitchenAid brand, and it IS nice."},{"reviewerName":"B. Shamir","rating":"5.0 out of 5 stars","reviewTitle":"Great buy!!!","reviewDate":"February 4, 2015","reviewText":"Perfect little kettle. Heats water in a very short time. Central contact post on base allows you to place the kettle back into it very easily (smart design) without trying to match kettle electrical contacts with base contacts. Build quality is very robust and to top it all it's a very handsome stainlees unit that matches every other stainless appliance on ower kitchen counter. I drink tea all day long and used to boil the water in the microwave but no more. I also like to take it with us with English breakfast tea bags and Splenda on our trips and use it at the hotel/motel rooms. This kettle is here to stay. Worth every penny. Couldn't find anything like it on Amazon."},{"reviewerName":"Jeff Johnson","rating":"5.0 out of 5 stars","reviewTitle":"SOOOOOOOOO FAST!","reviewDate":"April 2, 2017","reviewText":"such an awesome appliance. No regrets. I wish I had purchased this years ago"},{"reviewerName":"M&K","rating":"5.0 out of 5 stars","reviewTitle":"Very pleased.","reviewDate":"June 6, 2017","reviewText":"This kettle works great and I love the color. I really like that the kettle comes off of the base. It heats up quickly and holds enough water to make a pot of tea."},{"reviewerName":"lilypadthai","rating":"5.0 out of 5 stars","reviewTitle":"Works well and looks lovely!","reviewDate":"December 8, 2016","reviewText":"This kettle is beautiful and fast. So far it has been worth the high-ish price for both its beauty and functionality. I love it."},{"reviewerName":"Selena","rating":"5.0 out of 5 stars","reviewTitle":"GREAT TEA KETTLE","reviewDate":"April 9, 2016","reviewText":"Awsome Tea Kettle, and great color. Keeps water hot for couple hours . Love it"},{"reviewerName":"Mark","rating":"5.0 out of 5 stars","reviewTitle":"Love it!","reviewDate":"January 19, 2016","reviewText":"Fabulous product. Heats quickly, quietly, and does it in style!"},{"reviewerName":"AZNEIL","rating":"5.0 out of 5 stars","reviewTitle":"and the worst thing that was said about it was that it ...","reviewDate":"March 4, 2017","reviewText":"I bought this a little less than a year ago. I read several of the reviews, and the worst thing that was said about it was that it had some internal plastic parts, which it does. But nearly a year later, and it's still performing very well. This takes about a liter (about 33 oz) of water to fill it up, (you could probably get a little more in the if you wanted, but that's a handy size as I buy bottled water in liter bottles so it works very well for me, and then it takes just about four and a half minutes to to heat the water up to temperature. I very happy with my purchase."},{"reviewerName":"Ash","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"December 13, 2017","reviewText":"It heats water"},{"reviewerName":"Omar","rating":"5.0 out of 5 stars","reviewTitle":"Great product","reviewDate":"April 19, 2016","reviewText":"Great product"},{"reviewerName":"Dawn F.","rating":"5.0 out of 5 stars","reviewTitle":"Love if","reviewDate":"March 18, 2016","reviewText":"Cute, boils water quickly!"},{"reviewerName":"A. Thomas","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"January 12, 2016","reviewText":"Love the design and the lack of plastic parts. Looks nice on my counter as well."},{"reviewerName":"Fashionablylate","rating":"5.0 out of 5 stars","reviewTitle":"Pretty kettle for your counter","reviewDate":"January 8, 2017","reviewText":"This a great electric kettle! Looks great on the counter and has hot water ready in just a few minutes. Bought as a Christmas gift for husband - he loves it and uses it every day!"},{"reviewerName":"Glenys Entwistle","rating":"5.0 out of 5 stars","reviewTitle":"The best kettle I have ever had","reviewDate":"May 4, 2017","reviewText":"The best kettle I have ever had.I love its shape and size.It boils water quickly pores. smoothly and the handle stays cool. Love it!!!!"},{"reviewerName":"Brenda W.","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"December 29, 2016","reviewText":"great product never disappointed in kitchenaid"},{"reviewerName":"Billie","rating":"5.0 out of 5 stars","reviewTitle":"Beautiful Kitchen by Kitchenail","reviewDate":"September 12, 2015","reviewText":"This is so gorgeous, just the right size, and heats water in 4 minutes.\nYou won't burn your hands with steam when you pour and you won't ever want to put it out of sight.\nKitchenaid dresses up the kitchen in deep rich red."},{"reviewerName":"Anastasia","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"March 16, 2016","reviewText":"Very cute little kettle."},{"reviewerName":"Mukti","rating":"3.0 out of 5 stars","reviewTitle":"Good quality but very heavy","reviewDate":"February 21, 2016","reviewText":"This teapot is very heavy. I got it for an elderly person, and she can't lift it."},{"reviewerName":"victoria","rating":"3.0 out of 5 stars","reviewTitle":"PLASTIC PARTS ON INSIDE","reviewDate":"March 2, 2016","reviewText":"This kettle has lots of non removable plastic inside. I am returning for this reason but if you don't care about plastic it is really nice. The color, finish, and design are excellent."},{"reviewerName":"Kathleen A. Costa","rating":"4.0 out of 5 stars","reviewTitle":"OOPS!","reviewDate":"March 16, 2017","reviewText":"I'm sure the kettle did all that it said it could do........but, I had to return it as another member of the family purchased the same item."},{"reviewerName":"word wod","rating":"2.0 out of 5 stars","reviewTitle":"Very nice-looking kettle. Did not work for me, ...","reviewDate":"April 18, 2015","reviewText":"Very nice-looking kettle. Did not work for me, because I was looking for something with NO PLASTIC touching the boiling water. The kettle is all steel on the outside, but KitchenAid just had to attach plastic pieces INSIDE (which do not serve any purpose in my opinion), so I had to return it. I found an electric kettle at Walmart which had NO PLASTIC inside, I will probably get that one."},{"reviewerName":"Anish","rating":"1.0 out of 5 stars","reviewTitle":"Electrical burnout","reviewDate":"June 25, 2017","reviewText":"Power cord burned and caused electrical outage"},{"reviewerName":"ms darko","rating":"1.0 out of 5 stars","reviewTitle":"Big plastic part inside kettle, comes in frequent contact with boiling water.","reviewDate":"February 3, 2018","reviewText":"I just received mine and was disappointed to see the big plastic parts inside the kettle, the plastic comes in contact with the boiling water inside.\nI ran it through with water and the heated water smelled like plastic and chemicals, I ran it through a second time and added vinegar and the smell remained, I filled up the kettle for a third time and let it run through and the plastic chemical smell was still present."},{"reviewerName":"Nicole","rating":"2.0 out of 5 stars","reviewTitle":"Mediocre product with a luxery price tag","reviewDate":"August 16, 2018","reviewText":"This electric kettle does the job but it's way over priced for a basic kettle. There's no temperature control, no beep/alarm/whistle when it's boiled, and it has too much plastic. KitchenAid missed the mark on the quality. The base is all plastic, the handle is plastic, the on switch is plastic, the screen holder on the inside is plastic. It looks nice but feels cheap. Also, the color isn't an exact match with the Pistachio of the mixer. I bought it on sale for $50 and I still feel like I greatly over paid."},{"reviewerName":"Maggie","rating":"2.0 out of 5 stars","reviewTitle":"Seams and plastic parts contacts water and steam (which falls back into the water)","reviewDate":"June 22, 2019","reviewText":"I have a whistling (sort of) Kitchen Aid teakettle. Even though the whistle is anemic if you are in another room, I do like my KA whistling teakettle because NOTHING except seamless enamel coating contacts water or steam. The completely SEAMLESS interior enamel even coats screws & such.\n\nTHIS kettle is NOTHING like that! It has interior seams (which allow water into the seams to contact solder or who knows what).\n\nThis kettle is neither seamless nor coated with enamel inside - it is metal (Chinese \"stainless\" steel - which never is) and PLASTIC.\n\nAfter liking my KA whistling kettle so much (except for the poor excuse for a whistle), I'm extremely disappointed with this kettle. I like the APPEARANCE very much, but cannot use it because of the design of the interior.\n\nI'm wondering WHY the temperature cannot be controlled from inside the base underneath a kettle that has a seamless interior surface (American glass, enamel, aluminum, or 316L STAINLESS steel)? I do NOT trust Chinese metal, glass, or any other material to provide safety from metal toxins. The Chinese have proven that they will NOT stick to specifications (money always before people) and that they have NO regard for life (remember when they sent us contaminated baby products? (among many other things)). Materials like 304 \"stainless\" steel is usually used in these products and is less corrosion resistant and prone to pitting. Contaminants can be introduced into the metal material (not to mention the plastics). Even the glass electric teakettles have a metal bottom intruding INTO the glass interior, with, of course, a seam between the different materials. Below the seam, where the water can go?? Solder and who knows what else can contact the water."},{"reviewerName":"Robert","rating":"3.0 out of 5 stars","reviewTitle":"As every other kettle, full of plastic.","reviewDate":"March 23, 2015","reviewText":"Well, everything about this kettle is superb in terms of quality, looks, and speed of boiling water. But, as with every other electric kettle I've come across it is for some absolutely unknown reason full of plastic inside. Can any company just make a good electric teat kettle with no plastic parts inside? Is it that hard?\n\nAnother review states you can remove the plastic filter. Yeah, and? What do you do with the plastic base where the filter goes solidly attached to the kettle? Break it off? I'm not willing to risk it. You may remove the plastic filter but not the base so it's no good.\n\nIf leeching plastic isn't a big concern for you with respect to the tea kettles this is a great electric kettle, though. I'm sticking within my 100% stainless steel (inside and out with no plastic anywhere) stove top kettle for now."},{"reviewerName":"Angry S","rating":"3.0 out of 5 stars","reviewTitle":"Good for your Fallout Vault. Not great otherwise.","reviewDate":"January 20, 2019","reviewText":"This electric kettle boils water. It does this fairly well, and fairly quickly. What it does not do is make a great deal of sense, from a design perspective.\n\nOthers have noted that it's hard to clean, which is true. Not only do the shape of the kettle, the size and position of the lid (directly beneath the handle), and the unusual internal components make the thing hard to clean; but mine additionally has a constant layer of gritty sediment, despite the fact that I use filtered water exclusively. It may be limescale, it may be something else, but it's constantly sloshing around in there, only kept out of my tea by the cheap plastic strainer attached to the inside of the kettle.\n\nThe kettle is certainly beautiful, and if your only concern is creating a nice mid-century Fallout Vault kitchen, then you can't do much better than this. But it feels cheap, which others have also mentioned. There's a lot of plastic, including inside, where it's in near-constant contact with the watter you boil. The shiny chrome handle is all plastic, and the on/off switch is too. Worst of all, the switch is connected to the unit by the flimsiest of plastic arms. It feels spindly and delicate every time I use it, and I worry that one day I'll absently apply just a little too much pressure with my terrifying Hulk hands and break the switch right off.\n\nI received mine as a gift, and I've had it for about 4 months. Already the paint is starting to chip on the exterior of the kettle, for no apparent reason. Maybe this is a Brave Little Toaster kind of scenario, and my appliances come to life when I'm out of the house and wage gladiatorial combat in the darkened kitchen arena. More likely, this thing is built for looks and looks alone.\n\nEdit: Decided to give it back a star because, at the end of the day, it performs its primary function well. I'm expecting it not to hold up, but for now it's working fine despite my gripes."},{"reviewerName":"Tooncesmom","rating":"4.0 out of 5 stars","reviewTitle":"Stylish and efficient, but interior contains some plastic parts","reviewDate":"March 30, 2015","reviewText":"I received this KitchenAid KEK1222SX electric kettle from Amazon Vine for an honest review. Here’s my take on it.\n\nIt’s a nice size for countertop use and very stylish with its brushed stainless finish. It holds a little over one quart of water and has an LED on/off switch. (The LED lights up when the water is heating.) The kettle moves a full 360 degrees on its heating base unit, lifts completely off the base to fill vessel and to pour water out. The cord is short and heavy duty as a heating cord should be. Water heats in about five minutes with the 1500 watt heating element.\n\nA smooth aluminum handle is attached to the kettle with an insulator between metal parts so the handle gets warm but not hot. A lime scale filter, or shield, traps hard water lime and can be cleaned to maintain good function of the kettle.\n\nI found both looks and performance to be excellent, however, if you want a completely plastic-free electric kettle, this one isn’t for you. While the shield may be removable, the bracket (also plastic) is not, and if this is a problem, water pours over this plastic when pouring out the contents. Finally, there is no window or mark to gauge water level so one must measure the water with a measuring cup. Not a problem for me because I use a Melitta pour-over ceramic cone and have to measure the amount of water anyway.\n\nSeems well made, but as previously mentioned, if you don’t wish to have boiling water poured over plastic that may or may not be BPA-free, you might want to choose another brand."},{"reviewerName":"Debbie","rating":"5.0 out of 5 stars","reviewTitle":"Great Tea Kettle","reviewDate":"December 27, 2018","reviewText":"I asked for and received the stainless steel one for Christmas. What a great gift! It's the perfect size for two people. Doesn't take up much counter space, beautiful design, heats up much faster than a stove top one and I love the auto shut off! I've never had an electric teapot before but we're big tea drinkers, so this is a great addition to our kitchen!"},{"reviewerName":"C. Dedmon","rating":"3.0 out of 5 stars","reviewTitle":"Dead at three years","reviewDate":"May 26, 2019","reviewText":"We purchased this three years ago in blue , and it has formally died now. We have enjoyed it in that time, and it heats water quickly and the only complaint is that the paint scratches off quite easily. But I am definitely feeling nostalgic for my parents generation of small appliances, where items of this cost would last 15 years, not three. Kitchen Aid could improve."},{"reviewerName":"jg","rating":"4.0 out of 5 stars","reviewTitle":"Love it and now need to replace it","reviewDate":"June 4, 2019","reviewText":"I’ve had this kettle for almost 3yrs and going to buy another one. We use it multiple times a day so it gets used a lot and now is peeling and chipped. I love the color as I have other kitchenaid items this color. I only wish they made other electric kettles in this color as I think a bigger size might be good but this one works well."},{"reviewerName":"Kevin C","rating":"4.0 out of 5 stars","reviewTitle":"Easy and fast to use- Boils water!","reviewDate":"March 20, 2015","reviewText":"This KitchenAid kettle is attractive in the brushed stainless, with clean lines. It is very simple to use: you simply lift off the top, insert water, replace the top, place it on its base, and flip the switch to \"ON.\" Roughly 4 minutes later, you'll have boiling water (using 32oz of 74 degree water to start with). Unlike some other kettles, this one clicks off very soon after reaching the boil point, saving a small amount of power. It uses 1500 watts of power, so be careful not to use another high power appliance on the same circuit while heating water. Pouring is easy and drip-less.\n\nPossible drawbacks: There are no water temperature settings, and no external water level indicator (there is an internal MAX level indicator). It does not have a keep warm function, and it doesn't tell you when it is done except for the noise of the \"on\" switch popping up. There is a piece of plastic inside holding a lime scale filter that will be in the hot water if you boil more than 16 oz at a time. Despite its squat design, the kettle is about 10.5\" tall, due to the handle perched on top. It holds a maximum of 42oz of water at a time."},{"reviewerName":"Patti","rating":"5.0 out of 5 stars","reviewTitle":"Love this kettle","reviewDate":"May 5, 2017","reviewText":"I got this as a Christmas gift, so I've been using daily for about 4 months at the time of this review. Love this kettle. There are reviews about plastic being an issue, and unless you boil a very small amount of water it's true that the water will be touching some plastic. For me, it's not a huge concern, as I've eliminated all other plastics from my food storage and it's near impossible to find a kettle that doesn't have any plastic. That issue aside, it's very stylish, simple and works great."},{"reviewerName":"mac01","rating":"3.0 out of 5 stars","reviewTitle":"Get rid of the plastic KitchenAid!","reviewDate":"March 20, 2015","reviewText":"I'll be honest and tell you that I wish that as much effort as they did to make this Kettle look so sleek and high quality with all the stainless steel, I wish they had gotten rid of all the plastic inside. The kettle itself heats fast, rotates perfectly on its base, looks sleek and has a removable filter. You can remove the filter but the plastic piece housing the filter cannot be removed and that really bothers me. KitchenAid has not even offered any assurances that it is BPA free and I'm sincerely hoping it is, but I feel like this would be a 5 star Kettle if not for that plastic. Another gripe I have is that most Kettles have a water marking indicator and this one as you can see has none. Other than that, it works great and looks very sleek!"},{"reviewerName":"Toni H Douglassville PA","rating":"5.0 out of 5 stars","reviewTitle":"Highly recommended kettle","reviewDate":"November 12, 2018","reviewText":"Good electric kettle. Highly recommended and does not take up a lot of space on counter"},{"reviewerName":"booklover","rating":"3.0 out of 5 stars","reviewTitle":"Worked for a year now it leaks","reviewDate":"December 25, 2018","reviewText":"Kettle is attractive and worked great, but started leaking after 1 1/2 years. Compared to my Breville, which lasted 4+ years before having issues."},{"reviewerName":"PJM","rating":"5.0 out of 5 stars","reviewTitle":"Real Hot Water Real Fast","reviewDate":"March 17, 2015","reviewText":"I enjoy drinking tea, and so am always looking for a way to heat water quickly. I have a tea kettle for the stove top, but it takes a while to bring a kettle of tea water to a boil. So, I was excited to get the chance to try this KitchenAid electric kettle.\n\nI am very impressed. The kettle makes a pot of boiling water really fast. I like the fact that the handle remains cool to the touch, so after the water boils, you can directly hold the handle to pour the water. The water pours from the spout nicely, without running back up the spout . . . a problem I have had with other products.\n\nWe have really hard water where I live, and I have found that products like this last longer if you only use RO or bottled water, so I will not be using tap water in this unit. I want it to last.\n\nA great product that looks good on the cabinet."},{"reviewerName":"Ruthie","rating":"5.0 out of 5 stars","reviewTitle":"As with all kitchenaid appliances I\"ve used the quality is there and the speed/ease of use is great!!","reviewDate":"January 7, 2018","reviewText":"This kettle is top notch!!! As with all kitchenaid appliances I\"ve used the quality is there and the speed/ease of use is great!!!"},{"reviewerName":"Jackie Montour","rating":"4.0 out of 5 stars","reviewTitle":"Cute!","reviewDate":"August 13, 2019","reviewText":"So so cute!"},{"reviewerName":"LolasMom","rating":"5.0 out of 5 stars","reviewTitle":"♥it","reviewDate":"January 30, 2017","reviewText":"The perfect kettle for a small kitchen. Easy to operate. Works great. Could not be happier."},{"reviewerName":"L. Crossley","rating":"3.0 out of 5 stars","reviewTitle":"I have had this for over a year and love the look of it","reviewDate":"October 14, 2016","reviewText":"I have had this for over a year and love the look of it. I wish it held more water. I noticed this morning when I opened it to fill with water it had rust inside the bottom. If you buy this make sure you dry it after every use."},{"reviewerName":"JeriOwl","rating":"5.0 out of 5 stars","reviewTitle":"So far so good, lhas internal filter but no exterior water level indicator","reviewDate":"March 22, 2015","reviewText":"This kettle boils FAST, in about 4 minutes over a full quart of water is at a rapid boil. Don't be like McDonald's and pour the hot water in your lap, they aren't going to pay! Serilously though, be careful not to use several high wattage appliances at the same time, say a microwave, a fridge AND this water kettle, it may trip the circuit breaker (been there, done that.) All in all I love this water kettle, I just miss the exterior water indicator."},{"reviewerName":"Anthony","rating":"5.0 out of 5 stars","reviewTitle":"But I really so no reason that a well-designed kettle in this price range should not be double-wall.","reviewDate":"August 10, 2017","reviewText":"But I really so no reason that a well-designed kettle in this price range should not be double-wall. In addition, my previous kettles heated their full pots in 2 minutes or less, not the 4 minutes this one takes."},{"reviewerName":"jessica herrera","rating":"5.0 out of 5 stars","reviewTitle":"Cool design","reviewDate":"May 7, 2017","reviewText":"I thought this was super retro so I got it. It heats up water fast so that i don't have to wait to make my coffee. It is important I get hot water fast and this kettle does the trick."},{"reviewerName":"James Beswick","rating":"3.0 out of 5 stars","reviewTitle":"Great design but plastic interior is a huge downside","reviewDate":"March 24, 2015","reviewText":"I enjoy the retro kettle form and general design but as others have pointed out, the plastic in the boiling container really doesn't need to be there and potentially imparts toxins into the water as it boils. On the plus side, it's relatively fast, pours without dripping and it's easy to clean but is fairly expensive compared with similar alternatives."},{"reviewerName":"A Ma Terrasse","rating":"2.0 out of 5 stars","reviewTitle":"After nine months, still smelling plastic...","reviewDate":"September 17, 2016","reviewText":"I bought this kettle at the end of last year. I loved that the design and it heats up water just fine. My problem is with the large plastic filter holder thing inside. After nine plus months of daily use, the water still smells like plastic. Why would anyone make such a nice thing and ruin it with this ugly plastic part, which could have easily been made by metal? I'm considering performing surgery on this thing."},{"reviewerName":"jill_n","rating":"5.0 out of 5 stars","reviewTitle":"excellent quality","reviewDate":"March 15, 2019","reviewText":"I wanted an electric kettle without plastic inside or out and am very pleased with the quality, length of boiling time and durability of this product."}]}