{"title":"Russell Hobbs Retro Style 1.7L Electric Kettle, Red & Stainless Steel, KE5550RDR","manufacturer":"Russell Hobbs","currentPrice":"$67.99","rating":"4.3 out of 5 stars","totalRatings":"311 ratings","features":["\n         Make sure this fits\n                by entering your model number.\n        \n","Water Temperature Gauge - Achieve the optimal temperature for all varieties of tea, pour overs, and other recipes. The gauge on the front of the kettle shows the temperature of water inside the kettle, making it easy to stop boiling at the perfect moment.","Quick Boil Indicator - Level markings inside the kettle are visible from above, allowing you to accurately fill 1-3 cups of water for fast boiling.","Removable, Washable Filter - The filter attaches behind the pour spout to keep lime scale out of your beverages. Removable for easy cleaning.","Drip-Free Pouring - The pour spout is designed to prevent dripping by creating a single water stream that keeps the boiled water safely contained.","1.7L Capacity with Level Markings - The large capacity makes this kettle ideal for families and for hosting events. Boil up to 1.7L of water, using the rear-facing water level gauge for accurate filling."],"reviewsAspects":["russell hobbs","temperature gauge","heats water","retro style","retro look","boiling water","stainless steel","plastic parts","looks great","easy to use","water level","hot water","temperature gauge","easy to clean","electric kettles","tea kettle","love the retro","gauge on the front","works great","long time"],"productInformation":[{"Product Dimensions":"5.5 x 9.4 x 9.2 inches"},{"Item Weight":"2.6 pounds"},{"Shipping Weight":"5 pounds (View shipping rates and policies)"},{"Manufacturer":"Russell Hobbs"},{"ASIN":"B074XR43G4"},{"California residents":"Click here for Proposition 65 warning"},{"Item model number":"KE5550RDR"},{"Customer Reviews":"4.3 out of 5 stars\n    311 ratings\n4.3 out of 5 stars"},{"Best Sellers Rank":"#10,362 in Kitchen & Dining (See Top 100 in Kitchen & Dining)\n#65 in Electric Kettles\n"},{"Date first listed on Amazon":"August 18, 2017"}],"productDescription":["The gauge on the front of the kettle shows the temperature of water inside the kettle, making it easy to stop boiling at the perfect moment.","Level markings inside the kettle are visible from above, allowing you to accurately fill 1-3 cups of water for fast boiling.","The filter attaches behind the pour spout to keep lime scale out of your beverages. Removable for easy cleaning.","Pick up and set down the kettle at any angle. The swivel base makes for easy transferring of the kettle.","The retro-style design adds timeless beauty to any kitchen, no matter your kitchen style. Features like durable stainless steel construction with a pull-off lid, drip-free spout, and cool-touch handle make it as practical as it is elegant.","The pour spout is designed to prevent dripping by creating a single water stream that keeps the boiled water safely contained.","The RUSSELL HOBBS Retro Style 10-Cup* Coffeemaker joins modern functionality and elegance for a premium coffee experience.","*Cup equals approximately 5 ounces (varies by brewing technique)","\n            The RUSSELL HOBBS Retro Style 2-Slice Toaster joins best-in-class performance and authenticity for a premium toasting experience.\n        ","\n            The RUSSELL HOBBS Retro Style 4-Slice Toaster joins best-in-class performance and authenticity for a premium toasting experience.\n        ","\n            Practical and elegant, the RUSSELL HOBBS Retro Style Electric Kettle is the perfect addition to a style-conscious kitchen.\n        ","Retro Style 10-Cup* Serving Coffeemaker","Retro Style 2-Slice Toaster","Retro Style 4-Slice Toaster","Retro Style 1.7L Electric Kettle","Practical and elegant, this Electric Kettle from Russell Hobbs is the perfect addition to a style-conscious kitchen. The retro design features durable stainless steel construction with a pull-off lid, drip-free spout, and cool-touch handle. The water temperature gauge on the front of the kettle simplifies the process of heating water to precise temperatures for teas, pour overs, and other recipes. The water level gauge on the rear of the kettle shows markings up to 7 cups (1.7L), and the inside of the kettle features level markings for quickly boiling 1-3 cups of water. Additionally, the removable anti-scale filter prevents mineral buildup from passing through the spout so you may enjoy freshly boiled water for tea, hot cocoa, oatmeal, French press coffee, and more."],"reviews":[{"reviewerName":"Lisa JH","rating":"1.0 out of 5 stars","reviewTitle":"Disappointed","reviewDate":"The manufacturer commented on the review below","reviewText":"I have been using a Russell Hobbs kettle for years and years so when it quit last week I ordered another. I just received it today and what a disappointment. The stainless is MUCH thinner than my last kettle and it is a lot louder when heating up. The second HUGE disappointment was the giant plastic bulb that backs up the temperature gauge. What were you thinking?? Who wants to boil water every morning in a stainless tea kettle that has HUGE piece of plastic in it. I mean come on. Why go with stainless then? You obviously don't understand the market. Just a simple stainless backing with a rubber washer would have worked perfectly well. It is easy enough to remove the OTHER pieces of plastic, like the red cup gauge and I never use the filter, I don't put tea in the kettle I use a pot to make the tea. I don't know Russell Hobbs. I am sorry I will be sending this back."},{"reviewerName":"Janeen Wagemans","rating":"1.0 out of 5 stars","reviewTitle":"This beauty leaks!!!","reviewDate":"The manufacturer commented on the review below","reviewText":"Don't be lured by good looks! Mine worked fine for a few weeks. Then it started to leak! Water accumulates in the temperature gauge. Ok. But also out the bottom. Leave water init overnight? The water will be on your counter in the morning!"},{"reviewerName":"Gavin","rating":"2.0 out of 5 stars","reviewTitle":"Awesome aesthetics, poor value","reviewDate":"The manufacturer commented on the review below","reviewText":"Awesome aesthetics, poor value. I expected more for the price.\n\nThe base is the same as you would get on a 30$ E-Kettle. Cheapo handle, lid, and on switch. I’d keep looking if it were a personal purchase."},{"reviewerName":"it878","rating":"2.0 out of 5 stars","reviewTitle":"I've been waiting for this kettle for 3 months and ...","reviewDate":"The manufacturer commented on the review below","reviewText":"I've been waiting for this kettle for 3 months and when opened, realized that I cannot use it... There are plastic parts inside that would be constantly coming in contact with boiling water."},{"reviewerName":"Bastchild","rating":"1.0 out of 5 stars","reviewTitle":"Has plastic inside???","reviewDate":"The manufacturer commented on the review below","reviewText":"The water level guides and the heat gauge backing are all plastic that will be boiled over and over. Was not expecting a premium kettle to have plastic in contact with the boiling water. I, for one, am not happy at the though of drinking leached out plasticizers. What a waste of such a pretty retro look. Will not be using this and would not recommend it to others."},{"reviewerName":"BlueBellBlue","rating":"4.0 out of 5 stars","reviewTitle":"I love the kettle","reviewDate":"November 7, 2017","reviewText":"First of all, I love the kettle. It looks great. It would make an impressive and much appreciated gift, especially for a housewarming or shower. It came well packed. It was bigger than I expected, it's twice the size of the Walmart plastic kettle I had been using.\n\nHere's a few stats. I plugged it into a Kill-a-Watt meter and found that it uses a pretty constant 1330 watts while heating. There is no resting power drain whatsoever when it's off. (I live off-grid so these things are important for me to know. My plastic kettle used 900w but was slower to boil.) It took just over two minutes to boil 2 cups of room temperature water.\n\nI love the temperature gauge. Very handy for stuff like green tea or hot chocolate where you don't want it boiling. Not too thrilled with the interior plastic parts as others have mentioned. The little plastic water level paddles are a cool idea but I just think using a measuring cup is easier. And they'll be difficult to clean around. I'm not tooooo worried about plastic, after all I was using a plastic kettle before, but it seems an odd choice to use plastic parts in a kettle designed to appeal to the stainless steel crowd. The other issue I have is that the kettle is thin metal with no insulation. It gets HOT. I checked the outside temp and it was 192 degrees. It's a small gripe I guess, but be aware of it.\n\nAll in all, it's a really nice kettle."},{"reviewerName":"Amazon Customer","rating":"4.0 out of 5 stars","reviewTitle":"Favorite water kettle - large capacity, works like a charm","reviewDate":"December 11, 2018","reviewText":"Love this kettle. This is my key kitchen shortcut machine. Heats water amazingly fast. Use it for many time-saving shortcuts, including bringing my pasta water to boil quickly, water for cooking lentils, quinoa, rice etc fast to boil. Love the mechanical (simple, non electronic) old fashioned temperature gauge. Love the large capacity (1.7L), easy of operation, great design.\n\nOnly negatives: WHY did they use PLASTIC tabs inside the kettle and WHY is there a PLASTIC measuring gauge to show how full the kettle is? These 2 things mean that I am getting a dose of plastic boogers each time I use my stainless steel kettle. I bought stainless to completely avoid plastic. There must be a better way to do this. Please? I took off one star because of this, perhaps I should have taken off more? But I really love the function of this kettle. Russell Hobbs, can you get rid of the plastic bits in contact with water in your next iteration, pls?"},{"reviewerName":"Tnroses in Oklahoma","rating":"5.0 out of 5 stars","reviewTitle":"ADORABLE!","reviewDate":"September 12, 2018","reviewText":"I found this kettle while replacing my counter top toaster oven. I have a collection of more than 40 vintage coffee pots displayed around my kitchen and so I could not resist. It is wonderful! We use the fast heat option (less water) quite frequently for one or two cups. The temp gauge on the front allows you to pull it off the base a bit early if boiling is not your goal. The lid knob looks very much like a glass percolator when on the counter. I get a TON of comments on it. Don't hesitate. If you are drawn to this vintage look, it should be yours!"},{"reviewerName":"Paula","rating":"1.0 out of 5 stars","reviewTitle":"Reds don’t match","reviewDate":"The manufacturer commented on the review below","reviewText":"Doesn’t match the toaster by the same manufacturer. Very disappointing will be returning hope to exchange as they only offer 1 red on there website. Not sure why this “red” is so different"},{"reviewerName":"Amazon Customer","rating":"2.0 out of 5 stars","reviewTitle":"Meh","reviewDate":"The manufacturer commented on the review below","reviewText":"This item is much noisier than I anticipated, considering the price. Probably should have a temperature hold feature at this price point as well. 2-stars for overall value."},{"reviewerName":"blee","rating":"1.0 out of 5 stars","reviewTitle":"Water Leaks","reviewDate":"The manufacturer commented on the review below","reviewText":"The kettle started to leak after few uses! It really messed up the floor with water."},{"reviewerName":"Hoa N.","rating":"3.0 out of 5 stars","reviewTitle":"The water doesn’t stay hot for making coffee with","reviewDate":"November 26, 2018","reviewText":"I bought this kettle for making my French press coffee every morning. It looks nice. It doesn’t take long to boil the water in full tank. The material is on a thinner side. The biggest problem I have with it that the auto power button turns off too quickly once the boiling water is reached at 212 degrees. Therefore, by the time my French press coffee is done brewing the temperature is cool down dramatically. I have to heat it up in microwave for a minute as I like my coffee hot."},{"reviewerName":"Nece","rating":"2.0 out of 5 stars","reviewTitle":"Hot Look...but also hot to the touch","reviewDate":"The manufacturer commented on the review below","reviewText":"I would like to recommend this product, but I can't. Sure it is easy to clean, easy to use and from what I can tell it should be fairly durable...but that means nothing if you skip some other basic product design elements.\n\nThis is on the higher price point and I feel like the product quality was completely skipped. The visual aesthetics are strong, it is vintage looking and I absolutely love this visual design. Where it fails is in the quality of product: two major factors here, the first being the noise level, this thing is definitely loud, louder than my dishwasher and probably louder than my washer/dryer. The second product oversight is the temperature in which this kettle gets, it WILL burn your hand should you touch anything but the handle of the kettle.\n\nThis product would be a better fit for its price point if it had addressed the noise and temperature which I'm assuming could be achieved as other electric kettles have by insulating the core. Had I known this, I would have purchased a different vintage looking electric kettle."},{"reviewerName":"ReadersinVA","rating":"1.0 out of 5 stars","reviewTitle":"Expensive price for very cheap kettle","reviewDate":"The manufacturer commented on the review below","reviewText":"As soon as I unpacked this kettle I wondered what Russell Hobbs was thinking. Has the company been taken over by someone else? My family in the UK had Russell Hobbs kettles for years and they were always high quality and durable. This is near junk by comparison - the metal is so thin as to conjure up memories of camping cookware. Cheap lid, cheap and flimsy on/off switch, and a body like a large tin can. Really disappointing - went straight back into the box for return."},{"reviewerName":"oRgaNic","rating":"3.0 out of 5 stars","reviewTitle":"Meh","reviewDate":"The manufacturer commented on the review below","reviewText":"This product seems about the same as any other electric kettle as in, it does the job. I do appreciate the temperature gauge feature since I just learned that you should brew different teas at different temps.\n\nGood features~~\n*clean look, not modern clean but clean simple look (shiny, I like shiny)\n*brings the water to a boil quicker than the stove which is fine, not in a big hurry but no complaints and it shuts off automatically. I put refrigerator cold filtered water in to the limit and it took two minutes so it's pretty quick if that matters to you.\n*ergonomically comfortable--it is not heavy even with the water. By the look, I thought it would be heavy but not so. The handle is comfortable and secure feeling.\n*plentiful volume at 1.7 liters (main reason I wanted one since my little gooseneck stove top kettle is barely a liter)\n*doesn't spatter when boiling. Does get hot to touch so beware if you have little people, hairy counter walkers or forgetfuls around.\n*easy as anything to clean (wide opening in the top and easy to remove lid)\n*recommendation is to clean with a good soak of vinegar monthly to keep the hard water from mucking up the works (seems reasonable)\n\nMeh features~~\n* I expected to be more excited about the look and feel but it is just so-so. I would never pay the full price at around $80. This is no better than a $30 Hamilton Beach or similar. I ordered one from amazon warehouse that supposedly had a bit of minor damage to the lid or side but there is no damage--got lucky.\n\nMore good than Meh I guess. If you love the look, the functionality is what you would expect."},{"reviewerName":"Earl Dunbar","rating":"3.0 out of 5 stars","reviewTitle":"Style But Missing Some Substance","reviewDate":"The manufacturer commented on the review below","reviewText":"While I have never owned a Russell Hobbs product in the past, I knew the company had a good reputation for utility and durability. So my expectations were set fairly high.\n\nWith a newly remodelled kitchen with a black and white and some grey colour scheme, this retro style electric kettle looked like it would fit right in. I like retro design and thought that even though the kitchen remodel is pretty modern, the black exterior would fit in as well as provide some visual interest with the retro/modern contrast.\n\nThe construction of this kettle left me disappointed. It just seems light and a bit cheap. The previous kettle, a Cuisinart which was still working without any issue, was much more substantial.\n\nOthers have commented on the water level window's position, but I don't have an issue with that. The Cuisinart's window is also located behind the handle, and I had no problem reading up the water level.\n\n\"Missing\" features is that there is no temperature set and keep warm capabilities. Yes, I know the product description is clear and there is no mention of those features. However I think they would greatly improve this product's usability even if the price was increased. Not all tea types should be brewed with boiling water, and pour over coffee should NEVER be brewed at boiling! Having a temperature control and keep warm is almost essential.\n\nAll this said, this kettle has been performing well, the analog temperature gauge is very cool and the style is a complement to the kitchen. I'd give this 3-½ stars if I could, but I can't give it 4 because I think the manufacturer missed the boat a bit."},{"reviewerName":"kathleen osullivan","rating":"2.0 out of 5 stars","reviewTitle":"NOT worth it! Very cheaply made","reviewDate":"The manufacturer commented on the review below","reviewText":"i was disappointed at how cheaply made this is. all the shining \"metal\" parts are just plastic stuck on with little sticker adhesives, and they had all fallen off by the second time i used it. I was astonished and disappointed that for this price it was such poor quality. Every time i used it another decoration fell off into my tea. I would have been better off getting a$20 kettle - i just got sucked in by the cute design. I strongly suggest you avoid this. I mean, it boils water fine - your tea will be great - but it is WAY WAY WAY overpriced for the lame quality. it actually made me feel sad about the state of the world."},{"reviewerName":"DBF","rating":"3.0 out of 5 stars","reviewTitle":"All looks and no substance","reviewDate":"The manufacturer commented on the review below","reviewText":"I loved the retro look of this kettle but was very disappointed in the quality of the materials and construction. It feels flimsy and cheap - the stainless steel is thin, feels more like tin, and the plastic components on the handle lack heft. The handle design is not ergonomic at all and doesn't give a balanced feel when lifting the kettle. The top is difficult to remove and gets hot so if you need to refill after heating it up it's a problem. The filter in the pour spout restricts inflow too much so that's not an option (I removed it). So far I haven't had any problem with leakage but those issues raised in prior reviews concern me. Also, I agree with other reviewers that the shutoff happens too quickly after reaching the boiling point — my prior kettle kept going for several seconds to assure a lasting hot temperature as I use it to do my pour-over coffee."},{"reviewerName":"Elaine","rating":"1.0 out of 5 stars","reviewTitle":"Faulty Switch","reviewDate":"The manufacturer commented on the review below","reviewText":"you push the \"switch\" down to turn the kettle on. 75% of the time.. it does not start, and you have to \"fiddle\" with the switch to make the light turn on. not at all what I would expect for a kettle at this price point. I would not buy one again.. they look cool for sure, but if it does not just work every time, then its not worth more than 1 star."},{"reviewerName":"Claudia Richards","rating":"2.0 out of 5 stars","reviewTitle":"Kind of Junky","reviewDate":"The manufacturer commented on the review below","reviewText":"I have no idea why this gets so many good reviews. I can't believe I paid $80. for it either. What's good about it is that it's squat, so it sits well under the cabinets. But on the other hand, it's really wide. It kind of reminds me of one of those old-fashioned metal milk jugs. Or a fire hydrant. I can't say that it's especially well made. What I really hate about it is that it's difficult to pull the lid off of it. It sort of clips on and so you have to really pull to get it off the pot and then the water splatters all over. Really annoying. The temperature gauge is a little weird, too. What's the purpose of it? It's not like you can control the water temperature. Admittedly, it does make hot water . . . but then, isn't that what it is supposed to do? I'd return it, but it's just too much time and trouble. More junk from Amazon."},{"reviewerName":"Brook","rating":"3.0 out of 5 stars","reviewTitle":"Good design except the PLASTIC parts","reviewDate":"The manufacturer commented on the review below","reviewText":"Good design. I bought this primarily because the top lid detaches to clean. i haven't seen any other of this capacity with this feature. if someone makes a fully stainless steel one with a removable top without plastic parts submerged in hot water, I would give 5 stars. Russel Hobbs was nearly perfect."},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Perfect for my Chemex!","reviewDate":"April 13, 2019","reviewText":"This kettle was bigger than I expected from the pictures, but this doesn't change the way I love this product! I just made my first cup of coffe with my new kettle and my Chemex (8 cup). The coffee tastes incredible! The temperature boiled to the perfect temp and stayed hot in the kettle for quite some time after. It looks dashing on my countertop and feels sturdy. This is worth the money, I'm so happy I bought this after reviewing many other options beforehand."},{"reviewerName":"Lee S. Thompson","rating":"5.0 out of 5 stars","reviewTitle":"No funny taste in the water you boil.","reviewDate":"June 30, 2019","reviewText":"People have complained about the “taste” of the water boiled in this pot. No Truth to this claim. The pot smell like plastic when it is brand new, but quickly loses that smell after a few boiled pots. I just put water in boiled it and poured out the water. Did this a few times before actual use and no smell. Most of all no funny taste, just the taste of water."},{"reviewerName":"Maddie Blue","rating":"5.0 out of 5 stars","reviewTitle":"Attractive & Functional","reviewDate":"February 23, 2019","reviewText":"I get a lot of compliments on the vintage and kind of coffee shop industrial look of this kettle. But beyond that, I love the easy-to-read temperature gauge and the see-through water level reader. In terms of ease of use, I gave it less stars because it’s a bit heavy to pour. I don’t think this would be a good choice for an elderly person or someone with a condition that weakens their hands."},{"reviewerName":"Kindle Customer","rating":"5.0 out of 5 stars","reviewTitle":"Attractive kettle that is convenient and solidly built.","reviewDate":"September 27, 2019","reviewText":"I've been very pleased with this kettle after using it heavily over the past few weeks. Operation is single-button simple, the kettle heats water quickly and retains the temperature for a decent length of time, and the enamel-like finish is very attractive.\n\nThe kettle is a large vessel, but the weight is balanced in such a way that you can fill and pour without giving yourself carpal tunnel syndrome.\n\nMy favorite feature is the low-profile heating base the kettle rests on. When the water finishes heating you can remove the kettle from the base, but the base itself remains completely cool. This is a nice feature, as you aren't leaving behind a hot element to worry about.\n\nThis kettle is a pleasure to use, and well-worth the price."},{"reviewerName":"CMOS","rating":"4.0 out of 5 stars","reviewTitle":"Great teapot, but could use a bell.","reviewDate":"February 11, 2019","reviewText":"We have had our teapot for several months now and still really like it. My only gripes would be that the lid is rather tight and can be a little hard to remove and there is no bell when the water is done boiling. When it finishes, the little lever simply pops up with a slight well....popping sound. If they had added a bell I'd give this teapot 5 stars. I've had many comments that it is a nice looking teapot. I just wish the company made more appliances. We have the matching toaster, but have no need of the coffee pot."},{"reviewerName":"Virginian","rating":"5.0 out of 5 stars","reviewTitle":"Great product","reviewDate":"June 10, 2018","reviewText":"It's a piece of retro-art in my kitchen and boils water super fast! It replaces an electric kettle that finally quit working after many years. Very pleased with this one."},{"reviewerName":"Valerie R.","rating":"5.0 out of 5 stars","reviewTitle":"CLASSY!! BIG AND BEAUTIFUL!!","reviewDate":"May 17, 2018","reviewText":"Oh my goodness! This kettle is so beautiful I don’t even want to use it! An enhancement to any countertop! Will make sure not to leave water in 24/7 in order to preserve quality. Not concerned about plastic stuff on the inside as I won’t yse kettle that much!! LOVE THIS BESUTY!!!!"},{"reviewerName":"Mrs. Carr","rating":"1.0 out of 5 stars","reviewTitle":"Expensive piece of junk!","reviewDate":"The manufacturer commented on the review below","reviewText":"If you are buying this for French press coffee. Dont! Overpriced and doesnt get hot enough. Highly disappointed! Piece of expensive junk."},{"reviewerName":"TDY Blacksmith","rating":"5.0 out of 5 stars","reviewTitle":"The best one I have found","reviewDate":"July 3, 2019","reviewText":"I have purchased several of these kettles since finding them in Asia many years ago. They always lasted about 6 months and something (usually the lids) would go bad. This one has lasted for over 6 months and is still quieter then all the others and shows no signs of ware. Worth the extra cost without doubt."},{"reviewerName":"M. E. Baney","rating":"4.0 out of 5 stars","reviewTitle":"Wonderful Kettle But..........","reviewDate":"May 24, 2019","reviewText":"I LOVE this electric kettle, which I got as a Christmas present. I love the design and style of this kettle. It works like a charm, very fast. I use it several times a day. However, I just noticed that it is rusting around the top rim and a little bit inside the lid. I didn't think that stainless steel would rust. Quite disappointing."},{"reviewerName":"Keith","rating":"5.0 out of 5 stars","reviewTitle":"Electric Kettle","reviewDate":"January 8, 2019","reviewText":"Like the looks and heats up water quickly. Has a visible temperature gauge on the outside which is nice when boiling water for the kidos."},{"reviewerName":"nancy gagnier","rating":"5.0 out of 5 stars","reviewTitle":"GREAT KETTLE","reviewDate":"January 29, 2019","reviewText":"I have wanted this kettle for a very long time. Thanks to a price reduction I was able to order. Love the vintage look, and the Russell Hobbs name....it is the best.\nThe design is good, as it is not so round and huge. Just very pleased\nthis is in my kitchen."},{"reviewerName":"J. A. Canter","rating":"5.0 out of 5 stars","reviewTitle":"The Perfect Tea Kettle","reviewDate":"June 24, 2019","reviewText":"Absolutely love this tea kettle! It boils 3 cups of ice cold water in approximately three minutes. Perfect retro design with shiny stainless steel. Doesn’t drip or splash. Highly recommend for any tea drinker!"},{"reviewerName":"G. L. Munn","rating":"5.0 out of 5 stars","reviewTitle":"Heats fast!","reviewDate":"August 26, 2019","reviewText":"This is a handy item to have on the kitchen counter! It will heat a full kettle of water to boiling in less than 10 minutes; smaller pots, even quicker, of course! Love it for tea and pre-heating water for canning."},{"reviewerName":"thela clark","rating":"5.0 out of 5 stars","reviewTitle":"With the temperature gauge there you know if the water ...","reviewDate":"February 13, 2018","reviewText":"With the temperature gauge there you know if the water is hot enough for tea, coffee or a second cup of either. i even use it to heat water for jello."},{"reviewerName":"Amazon Customer","rating":"4.0 out of 5 stars","reviewTitle":"Nice produce, but very hard to open the lid without spilling water or condensate.","reviewDate":"July 30, 2018","reviewText":"It's a very cool kettle. The only problem is that the lid is hard to open or close; it's pretty tight and water splashes all over when you finally open it. Other than that, we like it."},{"reviewerName":"Laila","rating":"1.0 out of 5 stars","reviewTitle":"Moldy Container","reviewDate":"The manufacturer commented on the review below","reviewText":"After a few uses, I noticed spots on the inside. After wiping with a paper towel, pink slime mold is growing inside. So gross! I am arranging a return."},{"reviewerName":"john murrah","rating":"5.0 out of 5 stars","reviewTitle":"This is the most awesome tea kettle","reviewDate":"November 27, 2017","reviewText":"This is the most awesome tea kettle! It’s absolutely beautiful, and it heats up the water really fast, and I love it!"},{"reviewerName":"Gary","rating":"1.0 out of 5 stars","reviewTitle":"The unit rusts in a short period of time","reviewDate":"The manufacturer commented on the review below","reviewText":"Having only owned for a short period of time, rust is forming around the lid as it attaches to the pot.\n\nRust gets into the water as it heats ...Uck!!!\n\nIt seems to be a great pot But, it is already becoming useless"},{"reviewerName":"celinda travelstead","rating":"5.0 out of 5 stars","reviewTitle":"Russell Hobbs Electric Kettle","reviewDate":"January 26, 2019","reviewText":"I Love this kettle! It heats up quickly, has a temperature indicator on the exterior, pours cleanly and accurately, and is easy to keep clean. I plan to bring it along when I travel for coffee and tea. My new favorite appliance !!"},{"reviewerName":"Techtao","rating":"5.0 out of 5 stars","reviewTitle":"Looks great and works great.","reviewDate":"June 8, 2019","reviewText":"Went looking for a new hot water kettle, I was looking for something with style. This watercolor kettle fits the bill. Works great. Looks great. I’m glad I bought it."},{"reviewerName":"LMH","rating":"5.0 out of 5 stars","reviewTitle":"Lovely!","reviewDate":"December 18, 2018","reviewText":"Heats water incredibly quickly. Has a water level indicator in the handle so you don't have to open the lid to see how much water is left. Auto shutoff and temperature gauge work as expected. And, it's very aesthetically pleasing."},{"reviewerName":"LTH","rating":"5.0 out of 5 stars","reviewTitle":"Highly recommend","reviewDate":"December 10, 2017","reviewText":"Love this. It is plastic-not enameled metal. Still, looks great, works great."},{"reviewerName":"tmegs","rating":"2.0 out of 5 stars","reviewTitle":"It is nice looking and I really was excited to like this ...","reviewDate":"The manufacturer commented on the review below","reviewText":"It is nice looking and I really was excited to like this but it leaks through the temperature gauge and I didnt realize what was happening until right after the return window. I am going to buy another kettle that I've owned in the past and should of repurchased but was trying to save a few bucks."},{"reviewerName":"Jesus Warrior","rating":"5.0 out of 5 stars","reviewTitle":"Don’t regret purchasing this Kettle","reviewDate":"February 20, 2019","reviewText":"This is a beautiful candy red kettle. Easy to use. I can put my hand in the kettle to clean. However there is a brown scale on the bottom that I cannot get off. I don’t understand why! That’s why I gave it 3 stars on easy to clean."},{"reviewerName":"happygirlgail","rating":"5.0 out of 5 stars","reviewTitle":"Great gift to keep in the office","reviewDate":"February 17, 2019","reviewText":"It looks cool and heats up quick. My daughter-in-law loves it to make a quick cup of hot tea in her freezing cold office without having to go to the cafeteria. Highly recommend."},{"reviewerName":"Jan","rating":"5.0 out of 5 stars","reviewTitle":"I love Not having a tea kettle on the stove that gets greasy!","reviewDate":"February 2, 2019","reviewText":"Nice retro look. Love it!"},{"reviewerName":"Tina G. Mcmillan","rating":"5.0 out of 5 stars","reviewTitle":"Wonderful Counter Kettle!","reviewDate":"August 1, 2019","reviewText":"We really enjoy using the Hobbes Kettle. The water heats up quickly, it holds a large amount and the retro looks are great!"},{"reviewerName":"In Elvis Land","rating":"5.0 out of 5 stars","reviewTitle":"This electric kettle has style!","reviewDate":"May 15, 2019","reviewText":"Didn't know I needed an electric kettle until I used one. This is my second one and it's great. The temperature feature is very helpful."},{"reviewerName":"James E. Frame","rating":"5.0 out of 5 stars","reviewTitle":"IF you are tired of the cheap quick to burn out tea kettles on the market, this will make you happy.","reviewDate":"July 26, 2018","reviewText":"We have burned through 3 cheaper tea kettles in the last year or so. This model is a little more expensive, but worth every cent! The quality is amazing. It is a piece of jewelry compared to the other flimsy tinny models we have used and thrown away. Also, it is great looking and of course works beautifully."},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"I would marry it","reviewDate":"April 11, 2019","reviewText":"I love this kettle, from the retro feel to the capacity to the color! It's perfect. I am a huge fan of electric kettles as I drink loads of tea! I will say the plastic thing that lets you measure the cups - I don't think that was needed but, hey, maybe I'll need it later! I would caution where you touch it - it gets hotter than what I recall other kettles do but, I can stand the heat!"},{"reviewerName":"laq","rating":"5.0 out of 5 stars","reviewTitle":"Wow this heats water up fast","reviewDate":"April 11, 2019","reviewText":"I have used electric kettles for a long time, and this is by far the fastest. I love the BIG opening for cleaning and it looks great."},{"reviewerName":"Michael Wright","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"July 10, 2018","reviewText":"Looks good on the counter and works like a dream!!"},{"reviewerName":"Megan Lokemoen","rating":"5.0 out of 5 stars","reviewTitle":"Cute and practical!","reviewDate":"October 31, 2019","reviewText":"I love the way this looks! It is adorable sitting out on the countertop with its matching toaster. It also heats up the water super fast. I’ve had it for two years now and it’s not showing any signs of slowing down."},{"reviewerName":"LiteraryLady","rating":"3.0 out of 5 stars","reviewTitle":"Might be good for some people","reviewDate":"The manufacturer commented on the review below","reviewText":"When I filled it up it was far too heavy to use conveniently. Had to return."},{"reviewerName":"RCarter","rating":"5.0 out of 5 stars","reviewTitle":"Nice bright white kettle!","reviewDate":"March 10, 2019","reviewText":"I purchased this to go with the matching toaster I also bought. Can't wait to try it out! Love the retro look too!"},{"reviewerName":"JeanneMac","rating":"5.0 out of 5 stars","reviewTitle":"Not just a pretty face","reviewDate":"April 30, 2018","reviewText":"Love it!! I replaced an old kettle with this one. Love the retro look, heats up fast. Very large and holds a lot of water. It's easy to clean."},{"reviewerName":"Jon G","rating":"5.0 out of 5 stars","reviewTitle":"Beautiful Design","reviewDate":"September 7, 2018","reviewText":"Loved it's design unfortunately, it didn't work for 240v power supply. Quite sad about it. Nevertheless I would buy it again but one that is compatible with 240v."},{"reviewerName":"Claire","rating":"1.0 out of 5 stars","reviewTitle":"NO GO!","reviewDate":"The manufacturer commented on the review below","reviewText":"Aweful!!! Do Not buy this! I had to return. The outside becomes burning hot and there is way to much plastic inside."},{"reviewerName":"Watership Down","rating":"5.0 out of 5 stars","reviewTitle":"Adds Beauty to my kitchen","reviewDate":"January 28, 2019","reviewText":"What a fantastic find with the appealing retro design. Everyone goes gaga over this beautiful and functional gadget"},{"reviewerName":"Tina M.","rating":"5.0 out of 5 stars","reviewTitle":"Very cute tea kettle.","reviewDate":"January 5, 2019","reviewText":"I get compliments all the time. I can’t really speak to the durability yet, but it seems solid and with care should last a long time. It’s really pretty simple, so not many things that could break."},{"reviewerName":"SML","rating":"2.0 out of 5 stars","reviewTitle":"Replacement","reviewDate":"The manufacturer commented on the review below","reviewText":"The box was in bad shape and there are scratch marks on the back. Not deadly but would like a replacement. Otherwise, very cute and works great."},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Fantastic Product!","reviewDate":"September 22, 2019","reviewText":"Great look and feel. Works quickly and clean up is a breeze!"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"LOVE","reviewDate":"February 6, 2019","reviewText":"This is a great electric teapot!! I absolutely love it! I use it everyday, sometimes multiple times a day. It works wonderfully!"},{"reviewerName":"Kirk Whiteside","rating":"5.0 out of 5 stars","reviewTitle":"Great purchase!","reviewDate":"February 5, 2019","reviewText":"Enjoy the retro appearance of the pot, how quickly it heats any amount of liquid. Goes well with ou Russell Hobbs toaster, love them both!"},{"reviewerName":"Tami renno","rating":"3.0 out of 5 stars","reviewTitle":"Leaves a flavor in the water","reviewDate":"The manufacturer commented on the review below","reviewText":"There is definitely a taste that seeps into the water. Also, it’s really heavy and awkward"},{"reviewerName":"Pamela G Smith","rating":"5.0 out of 5 stars","reviewTitle":"Wonderful!","reviewDate":"March 21, 2019","reviewText":"Heats very cold water so fast! Drinking tea and cocoa in minutes."},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Great","reviewDate":"January 15, 2019","reviewText":"Great pot heats water super fast love it"},{"reviewerName":"D. Rice","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"March 2, 2018","reviewText":"The only drawback is the lack of a keep-hot timer."},{"reviewerName":"Patricia H. Bailey","rating":"5.0 out of 5 stars","reviewTitle":"Looks Great","reviewDate":"January 21, 2019","reviewText":"Haven't taken it out of the box yet. My old one is still working."},{"reviewerName":"porte8a2","rating":"5.0 out of 5 stars","reviewTitle":"Highly recommend","reviewDate":"September 18, 2019","reviewText":"Looks great works even better."},{"reviewerName":"Alexander P Velto","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"March 19, 2018","reviewText":"Nice looking, works well, bought a second one for our vacation home"},{"reviewerName":"Frances M. Nugent","rating":"5.0 out of 5 stars","reviewTitle":"Love it","reviewDate":"July 19, 2019","reviewText":"Easy to use, brings water to a boil fast."},{"reviewerName":"e-goldmountain","rating":"3.0 out of 5 stars","reviewTitle":"Not very happy with this purchase","reviewDate":"The manufacturer commented on the review below","reviewText":"Rec'd a open boxes item and found minor scratches. I am not very happy because this almost $100 purchase."},{"reviewerName":"Cucamonga Chatty","rating":"5.0 out of 5 stars","reviewTitle":"Really nice and useful","reviewDate":"December 25, 2018","reviewText":"This thing is perfect for fast hot tea water. Retro look is a bonus"},{"reviewerName":"Sampaguita","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"January 29, 2018","reviewText":"Love it. It heats up fast. Very convenient to use."},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"As advertised.","reviewDate":"February 14, 2019","reviewText":"Delivered in a reasonable time. It is as advertised."},{"reviewerName":"Anthony Chen","rating":"3.0 out of 5 stars","reviewTitle":"Leaking!","reviewDate":"January 21, 2019","reviewText":"Leaking from the handle/temperature gauge after a few months of use. Trying to figure out how to get this exchanged."},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Perfect","reviewDate":"July 23, 2019","reviewText":"I am very happy"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Love using it","reviewDate":"January 14, 2019","reviewText":"Heats really fast."},{"reviewerName":"Kunbi","rating":"5.0 out of 5 stars","reviewTitle":"Beautiful!","reviewDate":"April 19, 2019","reviewText":"Just the very kettle I needed for my overseas 240v home!! I love the color!"},{"reviewerName":"Granny Duck","rating":"3.0 out of 5 stars","reviewTitle":"Pretty but it isn't as multi-functional as my old Alton Brown styled one","reviewDate":"February 12, 2019","reviewText":"Gorgeous. Works faster than my old Alton Brown styled one."},{"reviewerName":"DebDeb","rating":"5.0 out of 5 stars","reviewTitle":"Great!","reviewDate":"January 15, 2019","reviewText":"So cute and beats water very quickly!"},{"reviewerName":"MZhang68","rating":"5.0 out of 5 stars","reviewTitle":"Beautiful Kettle!","reviewDate":"January 25, 2019","reviewText":"Excellent!!"},{"reviewerName":"William Carragan","rating":"5.0 out of 5 stars","reviewTitle":"A very fine product","reviewDate":"November 5, 2019","reviewText":"I use it just to heat water, which it does very rapidly. The thermometer is useful as I like to use water at 185 degrees for tea. An excellent unit, compact, efficient, and stylish."},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Awesome kettle","reviewDate":"August 20, 2018","reviewText":"Love this kettle have had lots of compliments works awesome"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Cutest Kettle Ever","reviewDate":"May 8, 2019","reviewText":"Absolutely LOVE it! It is the cutest kettle ever and works great. I love having the temp gauge as well as the water level window!"},{"reviewerName":"suzi","rating":"5.0 out of 5 stars","reviewTitle":"Wonderful quality Love Russell Hobbs","reviewDate":"February 21, 2019","reviewText":"I have never loved a tea kettle more! Looks and works extremely well. Use everyday ( sometimes more than once)!\nChose this over Dualit and was not disappointed!"},{"reviewerName":"Wendy & Jeff","rating":"5.0 out of 5 stars","reviewTitle":"So glad we purchased this!","reviewDate":"February 27, 2019","reviewText":"It is beautiful on the counter top next to the coffee maker and is used multiple times a day. We love it for its functionality and beauty."},{"reviewerName":"Mozzer502","rating":"5.0 out of 5 stars","reviewTitle":"love this","reviewDate":"January 11, 2019","reviewText":"looks great. Works great"},{"reviewerName":"Liza M. Guerra-Reyes","rating":"5.0 out of 5 stars","reviewTitle":"Beauty and Functionality","reviewDate":"February 14, 2019","reviewText":"This is the first kettle I have actually had compliments on when visitors come over. Looks great in my kitchen and heats up quickly. Love the retro look!"},{"reviewerName":"Anni","rating":"5.0 out of 5 stars","reviewTitle":"Cute and Retro!","reviewDate":"August 31, 2018","reviewText":"Love the look of this on my kitchen counter! And it works great!"},{"reviewerName":"Terry A. Morgan","rating":"5.0 out of 5 stars","reviewTitle":"Stylish and Best water heater","reviewDate":"June 1, 2019","reviewText":"I love this essential way to heat water!!!"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Holds a lot of water.","reviewDate":"December 28, 2018","reviewText":"I love this Electric kettle!\nWorks great , Looks cool!"},{"reviewerName":"Lex Villines","rating":"5.0 out of 5 stars","reviewTitle":"Quick hot water","reviewDate":"January 13, 2019","reviewText":"This is a very nice item if you need hot water quickly and it looks cool too."},{"reviewerName":"Shahrdad","rating":"1.0 out of 5 stars","reviewTitle":"usage","reviewDate":"The manufacturer commented on the review below","reviewText":"Even though it looks good ,I don't recommend this .\nIt is already rusting around the lead ."},{"reviewerName":"Caroline","rating":"2.0 out of 5 stars","reviewTitle":"Two Stars","reviewDate":"The manufacturer commented on the review below","reviewText":"After few months of use, we have corrosion in the kettle.\nHow can I replace it?"},{"reviewerName":"anonymous","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"May 11, 2018","reviewText":"Bought it as a gift and they love it."},{"reviewerName":"antoinette starling","rating":"4.0 out of 5 stars","reviewTitle":"Use it daily looks good on counter","reviewDate":"May 17, 2019","reviewText":"Pretty but difficult to take on and off lid"},{"reviewerName":"Judy","rating":"5.0 out of 5 stars","reviewTitle":"Great kettle","reviewDate":"January 5, 2019","reviewText":"Love this!"},{"reviewerName":"Amazon Customer","rating":"2.0 out of 5 stars","reviewTitle":"Leaks","reviewDate":"October 7, 2018","reviewText":"Really loved the kettle but it started leaking after a few months."},{"reviewerName":"Sofia Y.","rating":"5.0 out of 5 stars","reviewTitle":"I really recommend!!!","reviewDate":"November 29, 2018","reviewText":"Amazing kettle! I loved, it matches with other staphes in my kitchen."},{"reviewerName":"gary clayton","rating":"5.0 out of 5 stars","reviewTitle":"Good kettle","reviewDate":"June 16, 2019","reviewText":"Great kettle"},{"reviewerName":"Cody","rating":"5.0 out of 5 stars","reviewTitle":"Love it!","reviewDate":"January 23, 2019","reviewText":"Good product and looks cool too. The temperature gauge is wonderful feature."},{"reviewerName":"M. M.","rating":"4.0 out of 5 stars","reviewTitle":"nice looking.","reviewDate":"January 26, 2019","reviewText":"is ok ,"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"it's lighter than the glass ones--i love it","reviewDate":"January 13, 2019","reviewText":"i liked the design first--then how it functioned--it is lighter and easier to pour than my previous kettles\ni love the red one !"},{"reviewerName":"KLM","rating":"5.0 out of 5 stars","reviewTitle":"Great item - Got wrong color first time","reviewDate":"September 24, 2019","reviewText":"Wonderful item just received the wrong color. Returned without issue and re-ordered again."},{"reviewerName":"Christopher","rating":"5.0 out of 5 stars","reviewTitle":"Loving it","reviewDate":"May 6, 2019","reviewText":"it's pretty and it works"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Good product","reviewDate":"January 20, 2019","reviewText":"It looks good and performance is perfect"},{"reviewerName":"rob","rating":"5.0 out of 5 stars","reviewTitle":"Makes hot water fast.","reviewDate":"March 18, 2019","reviewText":"Great kettle for making any hot water fast."},{"reviewerName":"Russell Morey","rating":"5.0 out of 5 stars","reviewTitle":"functional!","reviewDate":"September 25, 2019","reviewText":"its big and fast and beautiful"},{"reviewerName":"OSCAR","rating":"5.0 out of 5 stars","reviewTitle":"LO PRÁCTICO Y ELEGANTE!","reviewDate":"July 25, 2019","reviewText":"ES ALGO RETRO PERO ELEGANTE A LA VEZ Y SU PRACTICIDAD GENIAL."},{"reviewerName":"Belinda Williams","rating":"5.0 out of 5 stars","reviewTitle":"Excellent Product","reviewDate":"January 30, 2019","reviewText":"I love this product; I also own the toaster... Very fast in heating up the water to the perfect temperature. No more guessing."},{"reviewerName":"vanessa naidoo","rating":"5.0 out of 5 stars","reviewTitle":"I love my kettle","reviewDate":"January 21, 2018","reviewText":"I love my kettle! Works really well and So many people have complements on its vintage look. Russel Hobbs is very popular in South Africa and I was thrilled to get one here"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"A value purchase.","reviewDate":"December 25, 2018","reviewText":"Bought it for someone I care very much for. Still a classic and reliable."},{"reviewerName":"Kerry","rating":"5.0 out of 5 stars","reviewTitle":"Excellent","reviewDate":"September 27, 2019","reviewText":"Love how it looks, the amount of water it holds and how quickly it heats up."},{"reviewerName":"Sheila Gill","rating":"5.0 out of 5 stars","reviewTitle":"Fast noiling","reviewDate":"March 20, 2019","reviewText":"Love it"},{"reviewerName":"Peggy Buehler","rating":"5.0 out of 5 stars","reviewTitle":"Tea kettle envy","reviewDate":"January 3, 2019","reviewText":"Love this kettle: my daughter and friends all want one now!"},{"reviewerName":"Mccangus","rating":"5.0 out of 5 stars","reviewTitle":"wonderful kettle","reviewDate":"February 20, 2018","reviewText":"Everything I have ever wanted or had from Russell Hobbs tea kettles'"},{"reviewerName":"British in the morning!","rating":"5.0 out of 5 stars","reviewTitle":"Love my retro hot water kettle!","reviewDate":"October 16, 2019","reviewText":"I love this! It’s uniquely retro and classic. I bought the toaster, too!"},{"reviewerName":"K. Sloot","rating":"5.0 out of 5 stars","reviewTitle":"Great","reviewDate":"February 7, 2019","reviewText":"Great electric kettle."},{"reviewerName":"Marion","rating":"5.0 out of 5 stars","reviewTitle":"Be careful its surprisingly heavy when filled with hot water.","reviewDate":"April 9, 2018","reviewText":"Hot water almost instantly without having to wait for the kettle to come to a boil on the stove! A wonderful product!"},{"reviewerName":"rene gonzalez","rating":"5.0 out of 5 stars","reviewTitle":"Heats up fast.","reviewDate":"May 14, 2019","reviewText":"Heats up fast."},{"reviewerName":"jkSpier","rating":"5.0 out of 5 stars","reviewTitle":"It’s hot","reviewDate":"June 10, 2019","reviewText":"Nailed it!"},{"reviewerName":"Jenny Purvis","rating":"5.0 out of 5 stars","reviewTitle":"Exactly what I was looking for","reviewDate":"February 12, 2019","reviewText":"So far so good. Heats water fast. Exactly what I was looking for"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Love!","reviewDate":"June 8, 2019","reviewText":"New to tea drinking. Love how easy to use."},{"reviewerName":"Carla Proctor","rating":"5.0 out of 5 stars","reviewTitle":"Happy","reviewDate":"July 20, 2019","reviewText":"Very happy ,looks great"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Really nice kettle.","reviewDate":"January 12, 2019","reviewText":"Really nice kettle."},{"reviewerName":"Libroz","rating":"5.0 out of 5 stars","reviewTitle":"Tetera eléctrica","reviewDate":"August 17, 2019","reviewText":"Preciosa, elegante y fácil de usar. La recomiendo"},{"reviewerName":"The Foleys","rating":"5.0 out of 5 stars","reviewTitle":"impressive look","reviewDate":"January 16, 2019","reviewText":"used on my hot beverage bar"},{"reviewerName":"christine m gyarmathy","rating":"4.0 out of 5 stars","reviewTitle":"Why I like the electric kettle from Russel Hobbs","reviewDate":"January 14, 2019","reviewText":"Attractive and easy to use."},{"reviewerName":"edward","rating":"5.0 out of 5 stars","reviewTitle":"Great piece","reviewDate":"August 23, 2019","reviewText":"We love it"},{"reviewerName":"AZ Shopper","rating":"5.0 out of 5 stars","reviewTitle":"Fast & easy to use","reviewDate":"February 4, 2019","reviewText":"Love it!!!"},{"reviewerName":"Sean","rating":"5.0 out of 5 stars","reviewTitle":"Easy to use","reviewDate":"January 25, 2019","reviewText":"Stylish and functional!"},{"reviewerName":"Lee Stacey","rating":"5.0 out of 5 stars","reviewTitle":"Best kettle ever!!!","reviewDate":"February 28, 2019","reviewText":"quiet and highly efficient"},{"reviewerName":"sandy vice","rating":"5.0 out of 5 stars","reviewTitle":"Great for keeping the water at a perfect temperature","reviewDate":"January 10, 2019","reviewText":"Tea"},{"reviewerName":"Amazon Customer","rating":"4.0 out of 5 stars","reviewTitle":"Beautiful and silent","reviewDate":"March 23, 2019","reviewText":"Opening the lid is a bit uncomfortable"},{"reviewerName":"swilson","rating":"5.0 out of 5 stars","reviewTitle":"Great looking kettle!!","reviewDate":"August 27, 2019","reviewText":"Love it!!!"},{"reviewerName":"M. Kleiman","rating":"5.0 out of 5 stars","reviewTitle":"V","reviewDate":"March 30, 2019","reviewText":"Love it"},{"reviewerName":"chuck","rating":"3.0 out of 5 stars","reviewTitle":"Redesign the lid.","reviewDate":"The manufacturer commented on the review below","reviewText":"The lid is annoying."},{"reviewerName":"Alla Yefremova","rating":"5.0 out of 5 stars","reviewTitle":"Perfect product","reviewDate":"January 4, 2019","reviewText":"Like everything."},{"reviewerName":"Marianne Stear","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"February 25, 2018","reviewText":"Works great and very quiet"},{"reviewerName":"David Barton","rating":"4.0 out of 5 stars","reviewTitle":"WELL MAID,,,BUT I NEVER GOT MY $$70.00 PRIME MONEY","reviewDate":"October 13, 2019","reviewText":"EVERYTHING"},{"reviewerName":"Lorna L DiMarco","rating":"5.0 out of 5 stars","reviewTitle":"Does the job while looking adorable","reviewDate":"September 27, 2019","reviewText":"Super fast"},{"reviewerName":"Miguel dulanto","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"April 20, 2018","reviewText":"Muy buena"},{"reviewerName":"Homebody","rating":"5.0 out of 5 stars","reviewTitle":"Beautiful and functional","reviewDate":"February 18, 2018","reviewText":"It heats water much faster than the gas stove. I love the retro look. It's easy to clean, if you fill it with water and one T of white vinegar, heat it and leave it overnight. The filter on the spout keeps calcium deposits out of the water when you pour. I don't know how long it will last, since I've only had it for a couple of months."},{"reviewerName":"Linda Moore","rating":"5.0 out of 5 stars","reviewTitle":"I like to design and if you are making jello or ...","reviewDate":"February 6, 2018","reviewText":"I like to design and if you are making jello or a cup of hot chocolate or tea for a friend by time you get your other supplies, the water is hot and ready for use. It is always full of water and ready for use. I enjoy this product."},{"reviewerName":"Keb300","rating":"5.0 out of 5 stars","reviewTitle":"Love it!","reviewDate":"January 3, 2018","reviewText":"This is a great pot. Love how it looks. Love the temperature gauge for different types of tea. Love the convenience. It heats up really fast as well. Exceeded expectations."},{"reviewerName":"ardnam","rating":"3.0 out of 5 stars","reviewTitle":"Would like to give f stars but the use of plastic ...","reviewDate":"November 4, 2017","reviewText":"Would like to give f stars but the use of plastic on the interior concerns me. There are plastic indicators for 1 cup, 2 cups and 3 cups on the interior. These will always be exposed to boiling water . Additionally the cover of the gauge is also plastic and always exposed to boiling water. This really concerns me so I do not use this pot daily.\nHaving the cup level indicators is handy as you don't have to pre-measure water but I'd rather measure than have my water boiling with plastic possibly leaching.\nThe retro style is great and adds some \"pop\" to the kitchen. It pours evenly. Cleans up easily. I really like the gauge feature on the outside but it comes with plastic on the inside. With a bit more effort and slightly greater expense, they should have made the effort to refrain from plastic parts on the interior. I just can't get past the health risk with this. Overall, the plastic in the design makes this more of a disappointment than an asset."},{"reviewerName":"funbear","rating":"4.0 out of 5 stars","reviewTitle":"incredible retro tea pot....","reviewDate":"November 5, 2017","reviewText":"I read steampunks review...\nI FULLY AGREE!!!\nI wanted to give this 5 stars soooooo bad... cause I LOVE IT!!!\nHowever, having plastic touching boiling water is not up with the modern times...\nit certainly is not up with the old times, as the Brits were drinkin tea long before plastic was invented...\none of the plastic parts, the cup count, can be remove with pliers...\nthe other plastic part covering the thermostat, can not be removed without leaks...\nputting that issue aside... (Rusell Hobbs, pls correct this, I will gladly buy the metal replacement part)\nPutting that issue aside... the pot is superb in every way!\nthey captured the retro look perfectly!\nThe electric base, is NOT attached to the pot, very nice...\nsize is perfect, for a few cups, or for a big pot...\nthe stainless inside cleans well..\nscreen on the spout\nI love the thermostat viewable on the outside, looks very 1800s\nauto off when boiling, set it and forget it...\nbrilliant.... just beware if plastic and boiling water concerns you..."},{"reviewerName":"Dean Burns","rating":"3.0 out of 5 stars","reviewTitle":"Pretty, but pricey","reviewDate":"The manufacturer commented on the review below","reviewText":"This is a really cool looking water kettle which will replace my Hamilton Beach stainless kettle. I also have a Mr. Coffee kettle that has individual temperature settings. This one heats up at about the same rate as the single temp HB, but not as quickly as the Mr. Coffee. The Hamilton Beach is about half the price of this one and the Mr. Coffee is similarly priced. This kettle does have a temperature gauge, which appears to be accurate, but if you want a specific temperature, for instance 175 degrees for green tea, you'll have to watch the gauge and turn it off early, or allow it to boil and then cool down to the desired temp. With the Mr. Coffee, you can select the temp and wait for the beep. As others have stated, it does have some plastic on the inside. There is a sight glass for the water level and there are also plastic indicators for up to three cups that you can view from the top with the lid off. In my opinion, you're paying a premium for the aesthetics, which are really nice. It just kind of depends on what's important to you. It's a little pricey for what you get with regards to functionality."},{"reviewerName":"Karen E.","rating":"5.0 out of 5 stars","reviewTitle":"russell hobbs does it again","reviewDate":"November 1, 2017","reviewText":"i have this kettle and the secura Secura The Original Stainless Steel Double Wall Electric Water Kettle 1.8 Quart. these kettles have 1.7L capacity and boil water in 8 minutes. the russell hobbs kettle has an external water level gauge, and a retro-style thermometer so you know the ideal temperature with which to steep your tea. this kettle is beautiful to look at. however, plastic does touch the water because of the water level gauge, and the sides become hot to the touch because it is not insulated. it wouldn't work for me because i have young kids, but if i did not i would use this kettle over the secura."},{"reviewerName":"Silvester Percival","rating":"4.0 out of 5 stars","reviewTitle":"Looks really cool, but has shortcomings","reviewDate":"October 16, 2018","reviewText":"This is a good water kettle overall, but it could be improved. First, the good. It looks awesome and has sparked more than a few conversations in my office, where I use it. Everyone loves the retro styling. The shape is cool, the mixed red and stainless is cool, and the analog temperature gauge is cool. It also works pretty well overall and heats water about as quickly as any other I have used. The temperature gauge also seems to be pretty accurate. It also has some nice design features, such as a fill level indicator by the handle, a lid that's easy to take on and off, a good non-drip spout, and little indicators inside that show how many cups you have poured in. Overall, it has nice features.\n\nBut there are a few features I don't like quite as well. First, although I'm not super persnickety about plastic in my kettles, the large plastic \"bubble\" around the temperature gauge is prominently on the inside. It's a lot of plastic touching hot water. In addition to the leaching of chemicals from plastic (most people's concern), I also wonder if it will start leaking eventually into the analog gauge. Second, the temperature gauge has a big metal rod sticking through the interior of the pot. This makes thorough cleaning somewhat harder and also stands the chance of breaking eventually. Finally, although it's a cool kettle, the price seems a bit high at $80. It would be a much better sell at $50 or so.\n\nOverall, a good kettle, but could be improved, especially for the price point."},{"reviewerName":"Bessesdotter","rating":"5.0 out of 5 stars","reviewTitle":"Analog and easy to use","reviewDate":"April 30, 2018","reviewText":"My last kettle was a glass model with a single button to start and boil only feature without a temperature gauge, plus it had a hinged lid with little plastic parts that broke after 8 years. With the lid swinging loose, it was a burn hazard and needed to be replaced. I read every review on almost every brand available. I wanted stainless and analog with a single button to start. This Russell Hobbs fit my requirements and it arrived in a timely manner as promised. The lid is secure and doesn't fall off or get loose. The gauge is large and easy to read for making green tea or beverages that don't need 212 degree boiling water. We did not want the digital because of an elderly relative who would use the kettle and might have some confusion over pressing buttons or reading small digital interface. A single button to push on and she can use this to make our twice a day pot of tea with great ease. The window in the side is the only caveat, the markings are black on a clear window making it slightly difficult to read. One could mark with a label or paint pen if needed--we just wear our reading glasses. Some reviews commented on the red plastic measuring gauges on the inside for 1-3 cups of water, but they can be removed easily if plastic is not wanted. The stainless is holding up well, the red is cheery and the handle has ridges which make gripping easy. I am very well pleased with this kettle.\n\nNOTE: we have very hard water in our region that leaves white marks on everything, but I filter my water and get little mineral build up."},{"reviewerName":"M. Galindo","rating":"5.0 out of 5 stars","reviewTitle":"Vintage Look Electric Kettle","reviewDate":"November 11, 2017","reviewText":"This electric kettle from Russell Hobbs is good looking and works wonderfully. This electric kettle is part of the retro collection, and it looks beautiful. This kettle has a distinct style that is reminiscent of kitchenware from the 40s and 50s - very cute vintage look. The one I have is black with shiny silver. There is a temperature gauge on the front of the unit that displays the temperature of the water inside the unit. This is important because, while black tea needs boiling water to infuse, green and herbal teas need a temperature less than boiling for optimal taste.\n\nThe handle is heat resistant, and there is a filigree spot to rest, and it is very decorative and a beautiful detail. The lid comes off entirely to enable filling, and there is a small button under the handle that turns the kettle on. It shut's off automatically when the water reaches boiling.\n\nIn the inside of the kettle - which is all mettle - there are 3 red markers that indicates 1, 2 or 3 cups and promotes a rapid boil. Ideal for a quick cup of tea, a single serving of soup or oatmeal. The kettle operates smoothly and effectively. Water reaches boiling pretty quickly, about the same as any other kettle performs. The pour from this kettle is smooth (there is a filter at the spout that is easily removable and cleaned) and there is no drip - and I actually tried to make it drip, without success.\n\nThere are electric kettles that cost less than this, but very few look as beautiful as this. Form and function combine beautifully in this kettle."},{"reviewerName":"Kindle Customer","rating":"4.0 out of 5 stars","reviewTitle":"Electric Kettle","reviewDate":"November 7, 2017","reviewText":"With the Russell Hobbs Retro Style Electric Kettle, you have to love the retro look. This is what this kettle is all about. It heats water very quickly though there are kettles that are quicker and many are much slower. The spout works good and gauge reads the water temperature as you are using it. The handle is comfortable and the lid stays put. The temperature gauge works as it should.There is absolutely nothing wrong with this model.\nThat having been said...here's what I don't like about it. The lid is not hinged so it must be removed when filling or cleaning and set aside. The lid snaps on very loudly which is a problem for me in the early morning with a sleeping wife.\nWe have very hard water and must clean kettles and the like often. The inside of the kettle has three little plastic paddles on a rod which are used as 1, 2, and 3 cup measures. You can tell the amount of water being put in from the faucet by using these paddles. They are really in the way for cleaning and are of no real use for me. There is also a rod which goes from the temperature gauge to the middle of the kettle. This is stationary and would have to be cleaned around.\nThe Retro Style Kettle is very elegant looking and does have the retro look. It looks great on the counter, but I much prefer one of Russell Hobbs other styles."},{"reviewerName":"Family7","rating":"4.0 out of 5 stars","reviewTitle":"Excellent kettle; lid needs work.","reviewDate":"November 1, 2017","reviewText":"The retro style electric kettle was a great addition to our kitchen. I had a different brand kettle before, but I like this one more as the style and rich red color fits our kitchen’s red oak wood. It heated very quickly and was very quiet too. The temperature gauge is really cool! One thing is didn’t like about this, and something must be done to address this, was the lid. It is very difficult to put the lid on and to take it off. It makes a loud sound when I take it off or on and if I do this at night, it can wake my kids up. Please address this."},{"reviewerName":"Brad4d","rating":"4.0 out of 5 stars","reviewTitle":"Heat just what you need","reviewDate":"November 8, 2017","reviewText":"What a bright and cheery note for your early morning tea. This is a thoughtfully designed hot pot which holds 1.7 Liters of water. It will boil a full kettle of water in a little over 7 minutes but many times I only want a cup of tea and this has been ingenuouslyprovided for. Inside the pot are 3 different plastic markers to show you just how much water to put in. This certainly speeds up the heating process and saves energy. There is also a easily visible temperature gauge on the front of the pot to show you just how hot the water inside is becoming. I didn’t know that green tea really needs only 160 degrees for brewing whereas my favorite, black tea, requires a full boil at 212 degrees.\nThe pot has a drip less spout which is very handy as my present one drips hot water on me while I pour out its contents. There is a removable filter at the spout which keeps scale out of your beverage.\nThis is an excellent value for the price and is cheery to boot. This is a nice addition to your kitchen"},{"reviewerName":"D. Buxman","rating":"5.0 out of 5 stars","reviewTitle":"Helps you cut down on coffee by drinking tea!","reviewDate":"November 11, 2017","reviewText":"Written by my son in college:\n\nI decided to get a kettle so that I would be more inclined to drink tea instead of coffee, and so far it is working. This kettle is small and compact, and a great addition to my dorm room. It has cup measurements on the inside(can measure 1-3 cups of water) so that you can boil as much water as you need. In addition to the cup measurements inside, there is also a liter measurer tool located inside the handle. Another great feature of this kettle is the temperature gauge located on the outside of the kettle. I will admit the gauge on my unit is fairly inaccurate(the water usually boils when the gauge reads 172 deg), but that is only a minor inconvenience, because once you know the number that your gauge reads as boiling, you can just adjust and know that my gauge is off by approximately 40 deg, so if I want 150 deg water, then I heat it until my gauge reads 110deg.\nPros\n-Auto off feature when water is boiled/ when there is no water in it(if you turned it on by accident)\n-Several ways to measure how much water you are boiling\n-Temperature gauge(even if it is inaccurate)\n-Small convenient size(fits ontop of my mini fridge along with my coffee maker)\n-Very easy to clean(simply boil the water and remove the filter)\nCons\n-the temperature gauge is inaccurate\n-the electrical cord is a little bit short(less than a meter) so plan out where you want this thing and how close the nearest outlet is."},{"reviewerName":"Brie Allen","rating":"4.0 out of 5 stars","reviewTitle":"Too Hard To Open Lid","reviewDate":"January 17, 2018","reviewText":"This is a fantastic kettle that looks cute and allows me to boil water at pretty specific temperatures for tea or baking. It boils quite fast like any other electric kettle but the temperature gauge is priceless when other electric kettles do not show any indication of temperatures.\n\nThe handle is cold to the touch once it is down boiling and the top is actually quite hard to take off. There's that tiny thing on top that you have to use to open the kettle and the top metal lid is hot, so only that tiny knob is cool to the touch. I think this would be too hard for older customers to use because it takes some strength to pull the top off and it could cause burns if mishandled. Russell and Hobbs could have designed an easier to open lid because this one almost feels like it is sealed shut at times.\n\nThe paint has not chipped and the metal exterior looks great and it is a very cute kitchen gadget to have. The cup markings inside the kettle are useful and there are markings on the outside on the side near the handle too.\n\nRussell Hobbs get a lot of things right with this kettle but the top is way too hard to pull off."},{"reviewerName":"Worddancer Redux","rating":"3.0 out of 5 stars","reviewTitle":"I like the steam-punk looks. But the fact that the boiling water comes into contact with plastic makes this a non-starter","reviewDate":"The manufacturer commented on the review below","reviewText":"I like the steam-punk looks, and was considering getting one of these for my tea-drinking steampunk aficionado librarian friend.\n\nBut I won’t do it. A kettle is something a tea-drinker uses a lot. One must be confident that it is safe: that it doesn’t explode, melt cabinetry.....or poison those who use it frequently to boil their water. The fact that (unnecessarily) there are plastic parts that come into contact with the water—water that will be boiling, and is thus in an excellent position to leach stuff out of those plastic parts—makes this adorable-looking kettle a non-starter.\n\nI will stick with my less chic, but entirely non-plastic electric kettle, and look elsewhere for a gift for my friend (whom I really like, and thus for whom I don’t want to serve up more toxins)."},{"reviewerName":"Joseph","rating":"2.0 out of 5 stars","reviewTitle":"Two broken kettles","reviewDate":"January 30, 2019","reviewText":"My first kettle arrived damaged (the top and spout were bent and it was unusable) so they promptly switched it with another and it keeps tripping the breakers in our house no matter which circuit I try (even tried it outside where there wasn’t anything plugged into that breaker). It did boil fast the one time it worked before tripping my outlet and it looks great, but this second one is going back too and I’m not going to try a third but I’m disappointed because I love the look"},{"reviewerName":"Customer","rating":"2.0 out of 5 stars","reviewTitle":"Poor safety design","reviewDate":"The manufacturer commented on the review below","reviewText":"It looks slick. And it boils water. However there are these tiny diffirences that makes or breaks the product.\n\nOne of them is: the base is not sealed. Seriously, the bottom part of product that comes in contact with water is not sealed. Meaning if there's some water on sides of pot and said water drips down - it doesn't fall to tabletop. The water disappears inside of the base. At the very least, this will cause undue corrosion. St the most if something is wrong with breaker, it will shorten the circuit. It is plainly dangerous.\n\nI could have rated this product for \"piece of crap\" for many reasons, but this one trumps all."},{"reviewerName":"Aaron Davis","rating":"5.0 out of 5 stars","reviewTitle":"We love this kettle","reviewDate":"September 22, 2018","reviewText":"A kettle ought to be a simple appliance, but too often, they don't meet your needs. I've had some that were difficult to fill or to clean. I have had some that made it hard to know when the water was boiling. This one takes care of everything. The top opens completely so there is no problem cleaning or filling. There is a thermometer and an auto shut off that makes it simple to know when the water is ready. The kettle comes right off of its power source so there is no need to unplug it in order to pour or fill. All around, it is a great kettle. The retro-red color is an added bonus!"},{"reviewerName":"SoozeSays","rating":"5.0 out of 5 stars","reviewTitle":"A Sturdy Electric Kettle withCheery Color and Retro Style","reviewDate":"November 15, 2017","reviewText":"Is it wrong to say I love the look of this electric kettle on my counter? This well made, sturdy little kettle’s cheery color and retro style makes me smile, and would look great in any type of decor (see photo below). Although I have only had it a few weeks, my husband and I use it at least once a day each, and sometimes more often. It’s large 1.7 L (7 cup) capacity is handy when you need to boil more than one cup of water, while the gauge on the front lets you know the exact water temperature. There is also a water level gauge on the side, by the handle, so you know how high to fill it for quick boiling of a cup or so of water. Probably the best feature for me, though, is the little removable filter over the inner entrance to the spout, which can be removed and cleaned, preventing lime scale build up. This is not inexpensive, but the quality is excellent and I would expect it to last a long time. This would also make a great gift."},{"reviewerName":"Brian Hollingsworth","rating":"5.0 out of 5 stars","reviewTitle":"A HOME RUN","reviewDate":"December 9, 2017","reviewText":"This kettle is extremely high quality construction and looks like a million dollars. Anyone spending this type of money on a kettle\n\nis more concerned about the presentation/aesthetics of it than simply boiling water........it delivers big time. For those concerned about the plastic\n\ncup gauge in the bottom don't worry as in three seconds it can be removed. It is simply clamped to the metal pipe and plenty loose enough to\n\nbe taken right out of the kettle without damaging anything. My only negative is that it turns off the second it hits the boiling temperature. I like hot\n\ncoffee and sometimes have to fool it by removing the lid as it reaches boiling point ( make sure there isn't too much water in it ). Having done this it\n\nwill boil even more robustly and not trigger the shut off to kick in. Russell Hobbs ( which has been the dominant kettle brand in the UK forever ) hit\n\nthis one out of the ball park."},{"reviewerName":"Leah Maines, best-selling, award-winning author, actor, and editor","rating":"5.0 out of 5 stars","reviewTitle":"Great retro style and excellent British tea kettle.","reviewDate":"November 17, 2017","reviewText":"Russell Hobbs is a very popular British brand that has been around for a long time. They are known for their high-quality products. I was excited to get this electric kettle. This one is part of their retro style collection, and it is so cute on my countertop. If you are a tea drinker, an electric kettle is a must. This one has a temperature gauge so you can get the perfect temp for your tea—green tea tastes best if you don’t boil the water. Black tea is best with boiling hot water. I love this feature. It’s also great for instant oatmeal.\n\nIt heats the water up very fast—much faster than heating water on the stove.\n\nThis kettle is also great because it will auto turn off when the water boils, or if there is no water left in the kettle—so no burning the pot.\n\nThe kettle is stainless steel, and very sturdy/very well made."},{"reviewerName":"Joanna D.","rating":"4.0 out of 5 stars","reviewTitle":"Handsome layabout","reviewDate":"November 15, 2017","reviewText":"Pros:\nRetro good looks, comes in black or natty red\nGood size, holds plenty of water 1.7liters\nSeems fast (didn't compare times, stay tuned)\nEasy to use--press lever, no programming\nTemp gauge tells you how hot water is\n\nCons:\nNo warm hold at temp\nNo shut off at chosen temp (i.e., 180 for white tea)\nPlastic parts inside, idiotic tabs for volume, plastic on sieve that catches any gravel from hard water.\nPrice, at almost a benjamin, you could do more\n\nConclusion: handsome layabout, boils fast and look fabulous doing it but no high achiever."},{"reviewerName":"Bill Oterson","rating":"5.0 out of 5 stars","reviewTitle":"Love It in Many Ways","reviewDate":"November 9, 2017","reviewText":"This 'Retro Style Electric Kettle,' from Russell Hobbs truly does look great on my countertop. I love the 'Retro' appearance. However, beyond that, the very visual temperature gauge is a necessity when brewing different teas that require specific temperatures for optimum results. And although primarily a coffee drinker my taste for exotic teas is growing. For brewing coffee I grind whole beans and pour heated water over them and have acquired the unfortunate habit of losing track of the water boiling, making the automatic shutoff an indispensable necessity. Perhaps even a life saver."},{"reviewerName":"DKK","rating":"5.0 out of 5 stars","reviewTitle":"Cute and Classic","reviewDate":"June 27, 2019","reviewText":"I like white appliances and this fits right in with my white Kitchenaid pieces. I can't rate it yet for longevity but it heats fairly fast (I was using and electric French Press that heated 6 cups in less than 2 min.) It is larger than what I was expecting even though I had looked at many different brands and compared sizes. I will get used to that because it is so beautiful, chrome and glossy white."},{"reviewerName":"Jessica Elliott","rating":"3.0 out of 5 stars","reviewTitle":"Stainless AND plastic","reviewDate":"October 21, 2018","reviewText":"Here’s the thing—the Russell Hobbs electric kettle looks amazing. It’s a stand out piece in my kitchen that people comment on. I love how it looks. However, IMO it’s not worth the high cost due to the plastic components. It feels cheap. It’s not easy to clean. I enjoy using it and it looks beautiful. But I hate the plastic on the inside as it defeats the purpose of wanting only stainless steel touching my hot water."},{"reviewerName":"Christopher Bushman","rating":"4.0 out of 5 stars","reviewTitle":"I love the retro look of this kettle on my counter","reviewDate":"November 2, 2017","reviewText":"I love the retro look of this kettle on my counter. It is my second Russell Hobbs purchase and looks great along side the toaster.\n\nI am not a heavy dudty user of the kettle so I can't say I have put it through its paces but the half dozen times i have used it were great. No complaints. Heats water quickly. Love it"},{"reviewerName":"Jeanne L.Harrington","rating":"2.0 out of 5 stars","reviewTitle":"poor quality","reviewDate":"The manufacturer commented on the review below","reviewText":"Bottom Line This is a poor quality product. I have owned this pot now for 8 months. Within six months the silver top had a chip in it. It's just my husband and I so this was not manhandled by children. It also does not perform as well as my old hot pot. It is also difficult to clean when you have a buildup of scale in it. I bought it because of the Vintage look and color and now I have put it in the cabinet and I'm back to using my old hot pot because this one is just plain bad!"},{"reviewerName":"Chris","rating":"5.0 out of 5 stars","reviewTitle":"Love the Look","reviewDate":"November 5, 2017","reviewText":"This is a very well made and cool looking little kettle for quickly boiling water for recipes or beverages. The kettle has an old fashioned look to it reminiscent of the old style coffee pots (from my childhood days). The kettle has a nice non slip handle for easy pouring and a temp gauge on the front. So far I am very impressed with this. Love the look especially."},{"reviewerName":"Shokra","rating":"4.0 out of 5 stars","reviewTitle":"Stylish & Trusted Brand","reviewDate":"January 16, 2019","reviewText":"We purchased this electric kettle when the one we brought over from England finally died on us. It's very sleek, stylish and compliments our kitchen nicely. My only pet peeve about it is the lid - The built-up condensation splatters on the countertop every time I take the lid off."},{"reviewerName":"Lucky Clucker","rating":"5.0 out of 5 stars","reviewTitle":"Very cute but also functional","reviewDate":"November 12, 2017","reviewText":"Cute!! This is just so cute (like the toaster and coffee maker) and it works just as well as any other electric kettle I've had and is far more attractive to have sitting on my counter. Now if I could just afford one of those retro fridges and ranges to go with it...."},{"reviewerName":"Aaron","rating":"3.0 out of 5 stars","reviewTitle":"Plastic components","reviewDate":"The manufacturer commented on the review below","reviewText":"There are few plastic components inside the kettle which is not good"},{"reviewerName":"Suzanne Silver","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"June 24, 2018","reviewText":"Oh I am in love with this kettle....it is divine"},{"reviewerName":"DALE HATT","rating":"2.0 out of 5 stars","reviewTitle":"Will they replace it","reviewDate":"The manufacturer commented on the review below","reviewText":"5 months old and spout leaks already, we’ see if company set it right"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Select the proper tea to fully appreciate your kettle.","reviewDate":"March 12, 2018","reviewText":"I like the way it looks and the expedient and efficient way it performs💂‍♀️"},{"reviewerName":"KC","rating":"4.0 out of 5 stars","reviewTitle":"Steampunk Good Looks, But Plastic Touching Water","reviewDate":"November 3, 2017","reviewText":"I was hoping this lovely looking retro kettle by Russell Hobbs would have, as appears from the outside, a smooth inner stainless steel lining for boiling water. Unfortunately, the pot has some areas where your boiling water is touching plastic while boiling, as you can see from my pics. The red \"quick boil\" level measuring plastic pads sticking out inside allow you to measure 1-3 cups of water to boil when you want fast hot water for a small number of servings and don't want to wait for a whole pot of water boil, and luckily, this is removable. However, there is an inner plastic cup section over the temperature gauge area that is fairly large and permanent. A side water level view in plastic shown on the outside under the handle, is also in contact w the hot water. If this is important to you, just be aware that this is not plastic-free boiling water.\n\nThat said, this is a good sized and serviceable pot, that heats water quickly, looks very pleasing and has a large, easy-to-grip handle. There is also a removable mesh filter on the pour spout, that will keep loose tea out of your cup. The pot turns off easily (on/off lever pops up) when your water boils, and it's great to have a dedicated boiler like this for quick hot drinks. Overall, this is a nice electric boiler, and depending on your desire for a full metal boiling interior, may or may not fit your needs."},{"reviewerName":"AmazonCustomer","rating":"4.0 out of 5 stars","reviewTitle":"I really like the style","reviewDate":"April 15, 2018","reviewText":"I really like the style. The temperature gauge is really handy, I like to know the temperature for different teas. I like that it isn't digital, There are plenty of digital temperature gauge tea kettles out there, so that makes this one unique! I had a Russell Hobbs tea kettle without a temperature gauge for about 7 years. It still works great, I just wanted an extra kettle- I really make a lot of tea. And I wanted this style because it has character!\nMy only dislike is the filter. It pops out soooo easily. It's nearly impossible to install. Then when it's finally in, I close the lid, and it pops right out again. I just put it away, so I'm not bothered with it. I really would have liked to use it with the kettle."},{"reviewerName":"Brian Shops Online","rating":"2.0 out of 5 stars","reviewTitle":"Overpriced, Oversized and includes Plastic","reviewDate":"November 10, 2018","reviewText":"Says \"Stainless Steel\" there are Plastic parts in the part you're boiling water. The product feels incredibly flimsy compared to the sturdiness of the picture. It DOES boil water quickly. But probably FAR more than you need. Sure you can put less water in but I think everyone would have a much smaller kettle taking up counter space and simply boil water twice in the event you need 8 cups of tea (which is about what this giant kettle has space for.) Overpriced may be subjective but there is no other electric kettle at this price range that doesn't at least have several boil options and features. This one basically boils water. The temperature gauge is pretty cool but it's only an aesthetic feature. You can't set the temperature."},{"reviewerName":"Amazon Customer","rating":"1.0 out of 5 stars","reviewTitle":"Made in China, don't buy!","reviewDate":"September 27, 2018","reviewText":"Made in China, don't buy!"},{"reviewerName":"Captain C.","rating":"5.0 out of 5 stars","reviewTitle":"THIS HOT WATER POT IS THE CAT'S PITOOT!","reviewDate":"May 6, 2019","reviewText":"This pot does NOT mess around. It doesn't sit and gurgle and bloop and eventually heat up. It is like BAM, HOT!\n\nWe drink coffee and tea in the mornin. I drink instant coffee and she drinks tea. Well, our tin/enamel cups hold 50 ounces each. If you fill this pot up to the spout with cold water it makes us two steaming cups in a flash. It is so nice to get almost instant boiling water. Now, I have this pot plugged into a 30 amp circuit and it does not give me any worries. The power cord is very heavy duty and is long enough to reach the plug too. The temperature gauge is handy if you are brewing green tea (you don't want it to boil) or if you are making warm water for baking. Cleaning is a breeze and the color matches all the rest of my red appliances. I'm set."},{"reviewerName":"creed","rating":"1.0 out of 5 stars","reviewTitle":"Nice kettle **Update: died after 9 weeks**","reviewDate":"July 3, 2019","reviewText":"I really like this blue electric kettle. I had a glass one that died after 2 years..another glass one with led lights that didn't last 6 months. The glass also showed the mineral build up. I still clean my kettle with vinegar every week or so, but it's nice not to see it. I haven't accidentally burned myself on this kettle either. It seems well designed and weighs less than my old glass kettle.\n\n**UPDATE 8/9/2019**\n\nAfter owning this kettle for just 9 weeks, it will not heat water. The power light comes on when I depress the switch but it just sits there. Of course it's a month past its return window. Waiting to hear from manufacturer."},{"reviewerName":"HeidiMac","rating":"5.0 out of 5 stars","reviewTitle":"Completely Satisifed","reviewDate":"June 10, 2018","reviewText":"Beautiful kettle; works wonderfully. Other reviews mention plastic parts, and yes, they exist. We weren't hung up on that by any means, so we didn't let that detail deter us. The water tastes fine and the whole unit functions perfectly, even after many months of use. You won't be disappointed."},{"reviewerName":"Dewayne","rating":"5.0 out of 5 stars","reviewTitle":"OMG this is so cute and easy to use","reviewDate":"October 14, 2019","reviewText":"This is awesome! Well the reason that I started looking for a electric kettle is due to being on propane, I didn’t want to be paying that much to heat up water for my hot tea. This works so awesome!!! I fill it up at night then in the morning I just come in and push the little black lever down and then go take my shower, get dressed and then go have my hot tea! I’m so happy now it’s been a very long time since I had hot tea in the morning due to waiting to purchase a home because I didn’t know what then home would have or not have."},{"reviewerName":"T. Durden","rating":"4.0 out of 5 stars","reviewTitle":"Good kettle except for temperature control","reviewDate":"May 25, 2019","reviewText":"I found this when looking for kettles with variable temperature controls for making different kinds of tea. I liked the way it looked and thought that even though it didn't have the temperature presets and automatic controls that others did, the large temperature gauge would be a workable alternative. The kettle does in fact have a nice, unique look. It heats water quickly and has a great, smooth pour. So far so good. For me, it fell short when it came to controlling the temperature of the water. My plan was to watch the gauge and turn it off when it got to the desired temperature. You can do definitely do this, but it's not as easy as I'd like. The markings are 9 degrees apart and that reduces precision. More importantly, I found that I had to look at the gauge at eye level in order to get a decent reading. Since I'm a taller than my kitchen counter, this got old fast. I ended up returning the kettle.\n\nVerdict: It's a nice kettle that works well. But, if you're obsessive about controlling the temperature of your water like I am, it's not ideal."},{"reviewerName":"Kelly M","rating":"1.0 out of 5 stars","reviewTitle":"Wrong colors in box!!!","reviewDate":"The manufacturer commented on the review below","reviewText":"This is the 2nd kettle I’ve received!!! They were both the wrong color. The product says white but when you open the box they are NOT"},{"reviewerName":"funtobemehehe","rating":"5.0 out of 5 stars","reviewTitle":"Love this kettle!","reviewDate":"June 27, 2019","reviewText":"Beautiful, fast, lots of hot water. Love this! We purchased this after I broke my pretty ceramic kettle. We’ve had this one for a few months now and I’m really happy with it. Every time I see it I think wow, that’s a good looking kettle! It holds a lot of water so I don’t have to refill often and o can make plenty of tea or coffee for guest. I like the thermometer so I can have brew tea at the ideal temperature. I also like that it’s short and wide vs tall. It’s also very light so I’m handling mostly water weight vs kettle weight. Thank you!!!"},{"reviewerName":"maclaugh","rating":"5.0 out of 5 stars","reviewTitle":"Simply the best designed electric kettle we have ever owned and there ...","reviewDate":"April 4, 2018","reviewText":"Russell Hobbs has done it again. Simply the best designed electric kettle we have ever owned and there have been more than a few. Clean lines. Color/finish is excellent. Water gauge under handle is superior, The thermometer is F and C, my son spotted that and was greatly impressed. Matches our Russell Hobbs toaster,"},{"reviewerName":"RS","rating":"5.0 out of 5 stars","reviewTitle":"Heats quickly and looks great","reviewDate":"September 22, 2018","reviewText":"This pot heats a large volume of water very quickly. I’m impressed how fast water boils and the pot is very easy to use. It looks great and is well-built. The temperature gauge Is more decorative than useful. It’s easy to know whether the water is hot because the unit clicks off once the heating process is done. Reheating is simple. Just press the switch again in in a few seconds the water will be back up to boiling."},{"reviewerName":"CurlyTop","rating":"4.0 out of 5 stars","reviewTitle":"Super Buy","reviewDate":"August 15, 2019","reviewText":"Fantastic tea pot with very handsome features.\nThe water heats up quickly to the perfect temperature.\nI wish I could have purchased it in other colors but one tea pot is sufficient.\nI gave a 4star rating because is is a bit heavy especially when filled to the top with water.\nThis wasn't noted in the description."},{"reviewerName":"Macgirl, Inc.","rating":"1.0 out of 5 stars","reviewTitle":"Expect this to last 1 year 3 months","reviewDate":"The manufacturer commented on the review below","reviewText":"Purchased 1/26/2018. The kettle now leaks from either the water gauge viewer or elsewhere. Still pretty on the counter but unusable."},{"reviewerName":"First Sister","rating":"5.0 out of 5 stars","reviewTitle":"This electric tea kettle is great! It heats the water in just a few ...","reviewDate":"January 17, 2018","reviewText":"This electric tea kettle is great! It heats the water in just a few moments, and can be so easily turned on to heat water for another cup of tea throughout the day. it is also decorative and fills easily. It sits on a very compact base, which takes up very little counter space in my kitchen."},{"reviewerName":"S. Benesch","rating":"5.0 out of 5 stars","reviewTitle":"Love this fool kettle","reviewDate":"May 8, 2018","reviewText":"Love this fool kettle! Perfect size, and shape. Nice to handle, and use. Like the \"Fill\" level indicator, and the \"Temp\" gauge in particular. Jolly good."},{"reviewerName":"AF","rating":"5.0 out of 5 stars","reviewTitle":"Great product","reviewDate":"January 12, 2019","reviewText":"Bought this for my mother, she is a lifelong tea drinker and it isn’t boiling like a Halloween cauldron, she won’t drink it.....this kettle is the perfect cauldron for a boiling cup of tea. Love the retro design, and she is very happy with it. “This makes a great cuppa” yes, “cuppa” cup of tea."},{"reviewerName":"jamib","rating":"5.0 out of 5 stars","reviewTitle":"Love!","reviewDate":"February 7, 2018","reviewText":"Looks beautiful in my kitchen and I love the ease of making coffee and tea. Heats the water so fast. I loved it so much that I purchased more for gifts this past Christmas!"},{"reviewerName":"motopixie","rating":"5.0 out of 5 stars","reviewTitle":"Best electric kettle you can buy!","reviewDate":"April 10, 2019","reviewText":"We're a family that uses our electric kettle from sunup to sundown for tea and coffee the Russell Hobbs never disappoints. In addition to being stylish, this kettle's handle stays cool, it has an integrated thermometer that lets you know the water temperature, and it's a workhorse. You can reheat the water within minutes from the last heating (if you choose!) Really fantastic appliance and great value."},{"reviewerName":"mcp","rating":"5.0 out of 5 stars","reviewTitle":"ATTRACTIVE KETTLE FROM A RELIABLE MANUFACTURER","reviewDate":"April 1, 2018","reviewText":"I had a Russell Hobbs Kettle for at least twenty years, it still works but I wanted a new one. I bought this because I consider it to be from a reliable company. The design is attractive, the water boils quickly and it does everything it is supposed to do."},{"reviewerName":"Rick &amp; Tyna","rating":"5.0 out of 5 stars","reviewTitle":"I love this! Will always own one!","reviewDate":"December 4, 2018","reviewText":"I loooove this thing!!!!\nIt boils water so quickly...so, so, SO easy to use! Small enough to not be counter clutter but large enough to boil enough water for everything I’ve neeses it for thus far. It’s also super stylish/chic.\nLOVE IT!"},{"reviewerName":"Robin MH","rating":"5.0 out of 5 stars","reviewTitle":"Heats up Quickly !","reviewDate":"July 18, 2019","reviewText":"I purchased this for a recent tea party. It’s the hit of the gathering. It heats up easily to three different temperature settings !! Looks retro but has updated modern flair."},{"reviewerName":"CW","rating":"5.0 out of 5 stars","reviewTitle":"Quick boil and sleek looking.","reviewDate":"January 31, 2018","reviewText":"Loving my new kettle. Heats water in a flash. No more waiting for the pot to boil on the stove. I like the handle on the side rather than a handle on the top - makes pouring much easier."},{"reviewerName":"Amazon Customer","rating":"4.0 out of 5 stars","reviewTitle":"No finish alarm","reviewDate":"January 9, 2019","reviewText":"Bought this for a present . It has a great look and goes with the toaster I bought . One complaint is it does not have a tone when heating is completed. I guess that goes with the old style motif . Otherwise , happy ."},{"reviewerName":"Kerry","rating":"5.0 out of 5 stars","reviewTitle":"Cute Kettle","reviewDate":"October 2, 2019","reviewText":"This electric kettle is cute addition to the kitchen counter. The quality and style are exceptional. It is larger than I expected but that's good to."},{"reviewerName":"Elmisti72","rating":"5.0 out of 5 stars","reviewTitle":"Love it!","reviewDate":"September 15, 2019","reviewText":"Love this tea kettle. The only thing that would make it better is a flip top. Btw, it was much bigger than I expected. Perfect if you need a large kettle."},{"reviewerName":"J. Bowman","rating":"3.0 out of 5 stars","reviewTitle":"Cute little pot","reviewDate":"The manufacturer commented on the review below","reviewText":"Looks great on my counter. Heats water up fast to boiling. Water temp gauge lets you know when at lower temp so can turn off early. Only con is it is loud when heatingbut does heat fast."},{"reviewerName":"Nejla Sherdo","rating":"5.0 out of 5 stars","reviewTitle":"lasts 4ever","reviewDate":"April 5, 2019","reviewText":"I love the Roussell Hobbs products, my old Roussell tea pot is still working, I got it in 1985!! That's 34 years!!!\nIt's quick, and great size. I love the retro look."},{"reviewerName":"Neat","rating":"5.0 out of 5 stars","reviewTitle":"Large and nice look","reviewDate":"April 30, 2019","reviewText":"Love this kettle. It is large and does not steam which saves your cabinets from the residue. I use bottled water some it doesn't leave the lyme in the kettle or filter."},{"reviewerName":"Debbie Robbins","rating":"5.0 out of 5 stars","reviewTitle":"faster than the microwave","reviewDate":"September 17, 2019","reviewText":"much easier for times when I just need HOT water; certain temp for certain teas...…..i.e. lower temp for green.\ncleaner taste as well"},{"reviewerName":"Stefani Buhajla","rating":"5.0 out of 5 stars","reviewTitle":"Sturdy and functional cuteness!","reviewDate":"September 6, 2019","reviewText":"Love this kettle. The temp gauge on the front is super handy. Plus, it’s adorably retro and sturdy! I bought the toaster to match."},{"reviewerName":"Aukele","rating":"5.0 out of 5 stars","reviewTitle":"The Hobb's Kettle is Nice","reviewDate":"June 6, 2019","reviewText":"The Hobbs Kettle heats water FAST, but it isn't noisy. It's also attractive on the counter. The handle is cool & comfortable to use.\nI like it."},{"reviewerName":"Debra","rating":"5.0 out of 5 stars","reviewTitle":"Straight forward function and beautiful","reviewDate":"August 2, 2019","reviewText":"Retro look while working without all kinds of digital buttons to deal with. Handle is great for older people. Very easy to grasp and hold on to."},{"reviewerName":"Anna Maria","rating":"5.0 out of 5 stars","reviewTitle":"Cool","reviewDate":"April 10, 2019","reviewText":"Vintage style, this kettle works very well.\nWaking quickly the water and check the temperature with an accurate thermometer.\nRecommended."},{"reviewerName":"Jane Fowler","rating":"5.0 out of 5 stars","reviewTitle":"Unique","reviewDate":"August 16, 2019","reviewText":"My husband and I Lovett e color and retro look. We also like that the lid fits tight so no worries about spilling boiling water."},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Cute, works.","reviewDate":"June 7, 2019","reviewText":"Dicent. One month in. Temperature gage is functioning but to me it is just decorative. SIMPLY touch fith fingers."},{"reviewerName":"C. Schmidt","rating":"5.0 out of 5 stars","reviewTitle":"Pretty and useful","reviewDate":"January 28, 2019","reviewText":"Durable, easy to use, large capacity (fills my largest teapot). My children can use it to make individual cups of tea and it looks spiffy sitting on my countertop."},{"reviewerName":"Loretta-Rose","rating":"5.0 out of 5 stars","reviewTitle":"Hot water in an instant","reviewDate":"April 16, 2019","reviewText":"Our family appreciates the speed that the water heats up. It’s attractive enough to have out on the counter at all times."},{"reviewerName":"Ofir Galvez","rating":"5.0 out of 5 stars","reviewTitle":"... for my mom as a Christmas gift & I loved it so much that I had to buy me ...","reviewDate":"January 29, 2018","reviewText":"Bought a Kettle for my mom as a Christmas gift & I loved it so much that I had to buy me one for myself as well. We a both are so satisfied with our Kettles!"},{"reviewerName":"Redhead in Maine","rating":"5.0 out of 5 stars","reviewTitle":"Cute Kettle","reviewDate":"August 1, 2019","reviewText":"Love this kettle, it’s looks awesome, works great and it’s easy to use , I bought the cream, hardest part deciding which one to get ."},{"reviewerName":"shiva","rating":"5.0 out of 5 stars","reviewTitle":"Love , love and more love","reviewDate":"November 1, 2018","reviewText":"I am very please with this Katle. I waited a little to write a review just to be sure this unit works properly. There is no leak or any other issue with the katle. The heating time is extremely fast. Love the look and it adds a little cracter to my coffee and tea station"},{"reviewerName":"Craig Worrell","rating":"5.0 out of 5 stars","reviewTitle":"I love the retro style and color","reviewDate":"January 5, 2018","reviewText":"I use this everyday. It actually works a little faster than I expected. I love the retro style and color."},{"reviewerName":"K K Schwartz","rating":"5.0 out of 5 stars","reviewTitle":"Very stylish","reviewDate":"January 9, 2019","reviewText":"If you like retro style, you'll love this electric kettle as I do. It's durable, easy to clean and use, and should last many years."},{"reviewerName":"kathleen anderson","rating":"5.0 out of 5 stars","reviewTitle":"Great style & design!","reviewDate":"March 27, 2019","reviewText":"Love love everything about this electric teakettle- conversational piece & livens up the kitchen!"},{"reviewerName":"SJCDAVE","rating":"5.0 out of 5 stars","reviewTitle":"Super functional and quick","reviewDate":"March 14, 2019","reviewText":"Love the temperature gauge and the interior cup indicator which helps heat just the right about of water."},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Easy to use","reviewDate":"July 20, 2019","reviewText":"Beautiful color easy to use very impressive and heats water very quickly"},{"reviewerName":"CAM","rating":"5.0 out of 5 stars","reviewTitle":"Stylish quality","reviewDate":"May 26, 2018","reviewText":"Love this kettle. Its retro style brightens our countertop and is complimented frequently. It heats the water very quickly and shuts off automatically. The temperature gauge is helpful if you want a specific temp for your tea or other needs."},{"reviewerName":"Patricia K. Ashley","rating":"5.0 out of 5 stars","reviewTitle":"You will never be disappointed with a Russell Hobbs electric kettle!","reviewDate":"January 12, 2019","reviewText":"I had a Russell Hobbs before and loved it, really missed it when it literally wore out. I am so pleased\nwith the new one and enjoy the “Retro” model in red. Sturdy and efficient as well as stylish!"},{"reviewerName":"Tamara","rating":"5.0 out of 5 stars","reviewTitle":"Temp. Control","reviewDate":"January 6, 2019","reviewText":"So glad I finally got this for myself!!! I hated how dirty my stove top pots would get."},{"reviewerName":"Jun Lin","rating":"5.0 out of 5 stars","reviewTitle":"Love the design","reviewDate":"August 16, 2019","reviewText":"Just what I was looking for and look great too"},{"reviewerName":"BG","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"December 30, 2017","reviewText":"Very pretty! Constructed nicely."},{"reviewerName":"Cliente de Amazon","rating":"5.0 out of 5 stars","reviewTitle":"Love it","reviewDate":"February 16, 2019","reviewText":"Great looking, works well but it does take quite a bit of space."},{"reviewerName":"Ellen P.","rating":"5.0 out of 5 stars","reviewTitle":"Not leaking and worth money u spent!!!","reviewDate":"August 3, 2019","reviewText":"Just liked everything about it!!!"},{"reviewerName":"eamusa","rating":"5.0 out of 5 stars","reviewTitle":"Great Kettle!","reviewDate":"February 20, 2019","reviewText":"Beauty and function, the two things a kettle must have. Love it!"},{"reviewerName":"Kevin Mitchell","rating":"5.0 out of 5 stars","reviewTitle":"Very easy to use","reviewDate":"October 22, 2019","reviewText":"Works great"},{"reviewerName":"Pipin","rating":"5.0 out of 5 stars","reviewTitle":"Works great and looks amazing","reviewDate":"June 18, 2019","reviewText":"Love my new vintage looking kettle."},{"reviewerName":"Abigail","rating":"5.0 out of 5 stars","reviewTitle":"Good looking and fast boiling","reviewDate":"December 2, 2018","reviewText":"Why did I wait so long to buy this? Great,fast boil and great retro design!!!!"},{"reviewerName":"Cintia C. Thormann","rating":"2.0 out of 5 stars","reviewTitle":"Rusting at Chrome area","reviewDate":"The manufacturer commented on the review below","reviewText":"Very nice look as a vintage! But, the material is very poor. In last than 5 months it’s rusty. See the pictures!"},{"reviewerName":"marilyn horton","rating":"5.0 out of 5 stars","reviewTitle":"Beautiful and quick heating","reviewDate":"April 12, 2019","reviewText":"Looks amazing in my kitchen ."},{"reviewerName":"DDF","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"April 4, 2018","reviewText":"I purchased several of these to give to my children after I tried mine---love these!"},{"reviewerName":"kimo","rating":"5.0 out of 5 stars","reviewTitle":"Very good","reviewDate":"April 29, 2019","reviewText":"Very good. Heats water very fast"},{"reviewerName":"L. Vaughan","rating":"3.0 out of 5 stars","reviewTitle":"Check your order before tossing the boxes","reviewDate":"December 13, 2018","reviewText":"Ordered red got black. Oh, well. It works."},{"reviewerName":"Arin Colman","rating":"4.0 out of 5 stars","reviewTitle":"Cute!","reviewDate":"June 8, 2018","reviewText":"Thinner material than expected but still really love the kettle. Measurement guides are super handy!"},{"reviewerName":"victoria king","rating":"5.0 out of 5 stars","reviewTitle":"Great electric tea kettle","reviewDate":"February 7, 2019","reviewText":"Quick and easy\nMy husband uses it twice a day"},{"reviewerName":"Marianne D.Pender","rating":"5.0 out of 5 stars","reviewTitle":"Good looking and efficient.","reviewDate":"January 14, 2019","reviewText":"Have gone through a number of electric kettles, and this is the best one yet. Good looking piece of equipment alao"},{"reviewerName":"LaceK","rating":"5.0 out of 5 stars","reviewTitle":"Very cute","reviewDate":"January 29, 2019","reviewText":"Looks great in my guest suite kitchenette."},{"reviewerName":"Jon","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"February 22, 2018","reviewText":"Big nice kettle. You can see the temperature of the water so its convenient"},{"reviewerName":"T","rating":"5.0 out of 5 stars","reviewTitle":"Great Product","reviewDate":"June 2, 2018","reviewText":"Excellent product. Fast and fits naturally in the hand making for an easy pour."},{"reviewerName":"Y.","rating":"5.0 out of 5 stars","reviewTitle":"A stylish thing that works","reviewDate":"December 10, 2018","reviewText":"A stylish thing that works"},{"reviewerName":"Mike Nikogosyan","rating":"5.0 out of 5 stars","reviewTitle":"Nice","reviewDate":"December 7, 2018","reviewText":"Really nice"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Great Kettle","reviewDate":"May 22, 2019","reviewText":"Works great, looks great and tastes great!"},{"reviewerName":"Linda Macdicken","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"February 28, 2018","reviewText":"Love it take me only few minutes to heat up the water"},{"reviewerName":"Karla Garcia","rating":"5.0 out of 5 stars","reviewTitle":"Love it!!!","reviewDate":"December 7, 2018","reviewText":"I absolutely love it! It’s easy to use and clean and it looks super cute."},{"reviewerName":"PCRC","rating":"4.0 out of 5 stars","reviewTitle":"Four Stars","reviewDate":"February 9, 2018","reviewText":"Nice looking. Pretty large."},{"reviewerName":"elizabeth a. osha","rating":"5.0 out of 5 stars","reviewTitle":"but great!","reviewDate":"December 16, 2017","reviewText":"it's big, but great!"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"April 28, 2018","reviewText":"Quick Shipping. Product just as described. A+"},{"reviewerName":"moira phillips","rating":"5.0 out of 5 stars","reviewTitle":"Lovely and efficient","reviewDate":"August 16, 2019","reviewText":"A lovely functional kettle. It’s perfect."},{"reviewerName":"Sheila Neylon","rating":"5.0 out of 5 stars","reviewTitle":"Good capacity. Handsome","reviewDate":"February 10, 2018","reviewText":"Impressive. Good capacity. Handsome. Nice to have the temperature window. High capacity"},{"reviewerName":"Huguette","rating":"5.0 out of 5 stars","reviewTitle":"Beautiful","reviewDate":"June 19, 2019","reviewText":"A gift to my daughter and she just loves it"},{"reviewerName":"Allie M Katz","rating":"5.0 out of 5 stars","reviewTitle":"Get it while it is hot! Great product!","reviewDate":"January 12, 2018","reviewText":"Love, love, love it!"},{"reviewerName":"Shoeslover","rating":"5.0 out of 5 stars","reviewTitle":"i like the design and the quality is good","reviewDate":"January 25, 2018","reviewText":"It is almost two month old by now, works well, quick and not loud. Old style design, and it is looking great on the counter next to my high tech kitchen appliances. I hope it will work longer then two years- all previous kettles in the same price range were functioning exactly for two years, no one day longer!"},{"reviewerName":"Leah Otto","rating":"5.0 out of 5 stars","reviewTitle":"Great.","reviewDate":"February 9, 2018","reviewText":"Love this tea kettle. Looks great and works great. Holds a nice amount of water and heats quickly!"},{"reviewerName":"AmazonAddict","rating":"1.0 out of 5 stars","reviewTitle":"Hard to open the lid","reviewDate":"January 28, 2018","reviewText":"Hard to open the lid but I love its design too much to return"},{"reviewerName":"Amanda A.","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"December 17, 2017","reviewText":"We use it several times a day to heat water for our tea!"},{"reviewerName":"Iris74","rating":"3.0 out of 5 stars","reviewTitle":"Cute but some room for improvement","reviewDate":"The manufacturer commented on the review below","reviewText":"I use my electric kettle multiple times a day in the kitchen and have made my way through a couple from lesser known brands before finally settling on a Kitchen Aid KitchenAid KEK1722SX 1.7-Liter Electric Kettle with LED Display - Brushed Stainless Steel. This kettle is very close in price to the Kitchen Aid at the time of writing this review so I was curious to compare the two.\n\nRussell Hobbs is a well known brand in England while it may seem fairly new in the US market and they are known to make reliable appliances.\n\nTemperature gauge and time to boil : Time to boil is pretty comparable, with the Hobbs being slightly quicker, and the heating process is very quiet. The temp gauge is pretty cool since it looks like an old style boiler gauge. However, you have only one option with this kettle - boil. There is no hold warm function and no way to have it automatically heat to variable temperatures depending on the tea you are brewing.\n\nPhysical build : I do like the Empire red look on the Russell Hobbs but the lid is a pop off sort as opposed to a hinged top on the Kitchen Aid. Also, the Hobbs is much lighter to hold which may be a plus for some. A negative for me is that the Hobbs has the heating element exposed inside the kettle. This makes it a bit more difficult to clean around and will be a perfect spot for calcium deposits to build up. The Kitchen Aid has a concealed heating element which gives you a smooth bowl to clean.\n\nVolume Gauge : There are two ways to measure how much water you have in the kettle. You can either see it in the transparent gauge inside the handle or you can use the red snap on piece inside the kettle to fill it to exactly one or two cups. I very rarely use the gauge on my kettles since I can usually tell by weight how much I have in it but the gauge on the Kitchen Aid is much bigger and shows more gradations than the one on the Hobbs.\n\nFilter : this may seem minor but you are going to have water deposits in your kettle and you don't want them ending up in your tea cup. The filter on the Hobbs is not as snug or as well built as the one on the Kitchen Aid. It is quite flimsy and snaps into place instead of sliding into grooves so, with heat and repeated use, I can't imagine it will last terribly long.\n\nThere is a fair bit of plastic inside both kettles and I know a lot of us try to avoid that. I have included a picture of the inside of the Hobbs so you can see the large disc covering the gauge.\n\nIn sum, the Russell Hobbs is a very good looking and perfectly fine serviceable kettle but, in the price range, you get a lot more bang for your buck with other electric kettles. Were it a bit cheaper I would definitely rate it 4 stars."},{"reviewerName":"Richard L. Steiner","rating":"5.0 out of 5 stars","reviewTitle":"None Better","reviewDate":"November 5, 2017","reviewText":"This retro style Russel Hobbs tea kettle is amazing in both looks and performance. It is a beautiful thing to see on our kitchen counter. The bright red color combined with the shiny chrome gives the kettle an elegant appearance.\n\nThe no slip handle makes it easy to hold and there is a removable lime filter back of the spout.\n\nThe kettle is extremely well made and it heats water quickly. It is much faster than a pot on the stove. I have said the thing is built like a tank and shows typical British quality.\n\nThe kettle will shut off automatically when the water in it boils or it can be stopped heating by turning it off when the easily seen gauge on the front of it reaches a point you like. There is a small indicator light under the handle near the base that shows power on or off.\n\nWhen the Russel Hobbs kettle arrived we retired one of those high tech electric tea pots with all of the settings, LED screens and popup lid.\n\nThat elaborate kettle worked well after studying the owner’s manual for a week or so, but the Russel Hobbs is the epitome of simplicity and much favored.\n\nTo operate the new kettle it is only necessary to take off the lid, fill the kettle with the amount of water preferred, replace the lid and push the power lever down. What can be easier than that?\n\nDo I recommend the Russel Hobbs electric tea kettle? You bet I do."},{"reviewerName":"Condor","rating":"5.0 out of 5 stars","reviewTitle":"Cool looks meets function","reviewDate":"November 12, 2017","reviewText":"I have used electric kettles for years. In my house they are much more than just a convenience and in use several times a day.\n\nAn electric kettle is something you didn't think you'd need until you have one... and then wonder how on earth you ever lived without it. No more kettles boiling dry on the stove because you got side tracked, no more being stuck in the kitchen waiting for the water to boil to avoid the former. And we all know that when you watch a kettle on the stove it takes twice as long for it to finally boil.\n\nThis is where electric kettles shine: they bring the water to a boil and then shut off. The better ones are insulated and keep the water hot a lot longer than the flimsy glass kettles. So if you forgot about it you just push down the switch and in a minute or two the water is back to boiling.\n\nThis electric kettle from Russell Hobbs stands out both by its different and very appealing looks and also by its functionality. Having a temperature gauge built in is actually a very smart idea since you don't always want boiling water (for hot chocolate or cocoa, for instance, or for baby formula). You still have to watch it, of course, and shut the pot off when the desired temperature has been reached. Or you can just let the temperature drop down to the desired temperature.\n\nThe pot is insulated, so no burned skin when accidentally touching it. That is a huge plus for me. The wider footprint prevents the pot from being knocked over. And the top opening is wide and makes for easy cleaning to prevent lime buildup over time.\n\nThis a high quality pot which I expect to give me years of service. Should any interior rust spots appear, an issue with some pots I had throw out, I will amend my current rating."},{"reviewerName":"M Johnson","rating":"5.0 out of 5 stars","reviewTitle":"Elegant Looking Kettle","reviewDate":"November 13, 2017","reviewText":"First of all, this electric kettle is beautiful! It is rather large, has a very substantial handle that is easy to grasp. Sits on a flat round element that you plug in to heat. When water has reached boiling, the unit automatically shuts off. You lift the kettle off the element to pour. You turn it on my pressing the switch at the bottom of the kettle. It boiled 3 cups of water in 3 minutes. There is a dial on the front that has a thermometer so you can see how fast it is heating, and what the temperature is. It holds a lot of water, so you can make a full pot of tea, and more. There is a window on the outside to show how full it is. There are also 3 red plastic \"dots\" on the inside that show 1, 2, or 3 cups, which makes it easy to know how much water to put in. Easy to clean since the lid comes off and the opening is large. I like this feature. My old kettle had a very small opening so it was hard to reach in to clean. This kettle is so elegant looking and works great. I highly recommend it. It is just for boiling water. To make tea, you would pour the water into a cup or a tea pot to steep. Would not recommending steeping the tea in this kettle, just use it to boil the water. It would make wonderful gift for the tea lover in your family. See my photos for a closer look."},{"reviewerName":"Christine Abraham","rating":"4.0 out of 5 stars","reviewTitle":"Functional and fun- great gift idea too!","reviewDate":"November 22, 2017","reviewText":"Each time someone walks in the room I ask “What do you think of my new tea kettle” and they all give the same answer: it’s big! This is my first impression too.. because in the product image it looks smaller in scale. It’s not taller than my other kettles.. it’s just wider, and that gives the illusion everyone is seeing.\n\nThe kettle is a fun drsign, not a boring silver appliance like my other kettles. While is has a nostalgia design, it’s two-tone colors modernize the experience. The kettle is 1.7 liters- a big plus for having a second cup or sipping tea as a family.\n\nThe temperature gauge is helpful when we brew different types of tea- green tea and jasmine are family favorites."},{"reviewerName":"OnAmazon","rating":"3.0 out of 5 stars","reviewTitle":"Has plastic parts","reviewDate":"The manufacturer commented on the review below","reviewText":"3.5 stars - I would have loved this kettle if not for the non-removable plastic parts inside the kettle:\nPros:\n+ Very classic, retro design. Looks ultra cool on the counter.\n+ Large size, holds 1.7L\n+ Quick to boil, has auto shut off\n+ No leak spout\n+ Indicator inside for 1-3 cups to quickly boil a small amount\n+ Temp gauge outside so you can easily heat water at lower temps\nCons:\n- There's some plastic pieces inside that's not removable! The biggest negative for me.\n- Can be bulky depending on your counter space."},{"reviewerName":"Jay","rating":"4.0 out of 5 stars","reviewTitle":"Love the Look but miss the Practicality of my former AROMA 1.5 L H20X","reviewDate":"July 3, 2018","reviewText":"I've been a long time user of Electric Kettles and even remember when there were only two brands in US that were metal, all the others were plastic! An avid Tea Drinker, plastic simply doesn't render a good Cup. Since then, I've had several brands made of metal and recently, the one at my Main House finally burnt out after many, many years. (8 yrs!) It was also heavily used - it was the AROMA 1.5 L H20X. I was very happy with it as it was a bit smaller but filled the Teapot, therefore, very fast to boil.\nFor some reason I decided to try a new Brand & model just because there now are SO many options even though it made me feel a bit guilty as the AROMA had served me so well for so long.\nAfter many evenings trying to decide not only the new Brand, I selected the RUSSELL HOBBS RETRO 1.7 L as I love vintage appliances. But now I had to make a color choice, too! I also know that this Brand has been popular in England forever. When it came, I was a bit surprised how LARGE it is - it seemed so much smaller in photo (only then did I realize my old Aroma was only 1.5 L). While I love the look, its so large its almost TANK like. As it holds more water, this also makes it much heavier than my Aroma, too. (I mean HEAVY when you're filling AND pouring !). I'm also a bit disappointed that it doesn't boil as fast as my old Aroma and again, this probably has to do with the amount of water in the large cylinder tank.\nBottom Line: While I do like the look of the R Hobbs Retro, I miss my Aroma (1.5L) because it was faster to boil; also to fill; smaller on the counter and lighter to pour. I think when the one at my other House finally goes, I'll replace with the Aroma again. The price of the Aroma is substantially less expensive."},{"reviewerName":"Spike D.","rating":"4.0 out of 5 stars","reviewTitle":"Good kettle, fast boiling and retro look.","reviewDate":"November 10, 2017","reviewText":"The only thing missing on this electric kettle is the ability to set to a certain temperature. The water is boiled until it reaches 100 deg. Celsius or 212 degree Fahrenheit. If you need the water to be hot at certain temperature you would need to stand there and watch the needle. My wife only drinks hot water, so it works well for her, she just filled up the kettle, push down the lever and walk away. No more whistling kettle screams like end of the world.\n\nThis kettle does a great job boiling water. It goes from room temperature to full boiling in less than 5 minutes with the kettle 3/4 full. The retro look is interesting, my wife loves it. For me, it is ok :-). If you use the quick boil feature, you need to fill the water up to levels mark by 3 plastic leaves inside the kettle. It marked 1, 2 or 3 cups. Of course, less water equals faster boiling, so nothing special there. This kettle's volume is about the same as most others, about 1.7 litters.\n\nMy other Cuisinart electric kettle as light that illuminates water level and set temperature for about the same price. But one is modern look, this one is retro."},{"reviewerName":"Anthony Trendl","rating":"5.0 out of 5 stars","reviewTitle":"Excellent Look, Easy to Use","reviewDate":"November 3, 2017","reviewText":"This Russell Hobbs electric kettle matches my toaster perfectly, also in retro red.\n\nPlainly, this boils water. It does so in style. Use it for tea or, as I do, for pour-over coffee. The temperature stays constant. There's a thermometer on the front. This matters if you take coffee or tea seriously as you want the temp under the boiling point and at an exact temp depending which bean or leaf.\n\nThere's a base that connects the electricity. The kettle itself holds just under two quarts.\n\nThe handle never gets hot.\n\nThat's the sum of it. It is excellent for use at the office or kitchen table.\n\nAnthony Trendl\namericanspeechwriter.com"},{"reviewerName":"Dr. E","rating":"4.0 out of 5 stars","reviewTitle":"Great for Oatmeal, Ramen, Tea ... Super Cute!","reviewDate":"November 25, 2017","reviewText":"We have the Russell Hobbs Retro Style Toaster and just love it! Therefore, when we saw this electric kettle, we couldn't resist.\n\nWhile we already have a Cuisinart CPK-17 PerfecTemp 1.7-Liter Stainless Steel Cordless Electric Kettle, but that one is frequently in my office (during the school year), so this seemed like the perfect permanent addition to our kitchen (since it matches the charming toaster). Now, if you have not used electric kettles before, do know that they are entirely worth the price and the precious kitchen space. (Especially, if you have been microwaving water for your tea! Trust me, the differences is very noticeable!)\n\nAs it stands, while this holds the same amount of water as the Cuisinart version, it is wider and shorter (neither better nor worse, just different). It has a cute old-school look whereas the Cuisinart one has a sleek, modern aesthetic. Moreover, the Cuisnart version has a blue back light on the water gauge (so you always know how much remains with a quick glance). Moreover, this electric kettle has a number of plastic parts (whereas plastic is extremely limited on the Cuisinart kettle).\n\nSo, for me, though the aesthetics of this are super cool, I really like the one-touch pre-programmed buttons on the Cuisinart one (these include oolong, green, black, and white tea ... it's pretty great).\n\nI think that if you are getting this for tea, you may also wish to also consider the Cuisinart one (the quick pre-set buttons are a huge convenience). HOWEVER, if you are planning to use this for oatmeal, ramen, and a variety of other like products, (in addition to tea) this could be a nice choice. There's no doubt, it's adorable!"},{"reviewerName":"Pam Ireland","rating":"5.0 out of 5 stars","reviewTitle":"Works Wonderfully!","reviewDate":"February 17, 2019","reviewText":"I purchased this kettle a few months ago, and have been very pleased with the outcome. This kettle is ideal for the person who is in a pinch for time, but doesn’t want to use their microwave to heat their water. Aside from its retro design, the features that make this kettle stand out from the others are as follows:\n\nWater temperature gauge\nQuick boil indicator\nDrip free pouring\nRemovable, washable filter\n\nWhen filling your kettle, you will find that there are three “quick boil indicators,” which can be seen from above. These allow you to quickly fill the kettle with one-three cups, depending on how much you want to have. These are incredibly helpful when you’re unsure how much a cup or mug can hold - just fill your cup with water, pour it into the kettle for heating, then pour it directly back into your cup.\n\nThere is a temperature gauge located on the front of the kettle, so you can look to see how hot the water is. When water has reached peak boiling temperature, the lever located on the side of the kettle switches it off. This feature ensures safety for your household, and minimizes the likelihood of a kitchen fire. The water stays warm for a good ten minutes though, so there’s no need to worry about it being too cool to steep tea or another drink of your choosing.\n\nSpeaking of pouring, the Russell Hobbs website states that the pour spout is designed to keep the boiled water from spilling or leaking, thus keeping your hands free from any burns. You will find that this is 100% true, as water comes out in a steady stream and does not leak from the airtight lid.\n\nWhen you are finished using your kettle, you can remove the anti-scale filter (located in the pour spout) for cleaning. The filter prevents limescale from falling into your cup, making for a cleaner, more pure drink.\n\nOnce again, this kettle is great for the person who is in a hurry. It is stylish, easy to use, and easy to clean. You will find that it fulfills all of its promises, and will save you precious time."},{"reviewerName":"Big Miles Davis Fan","rating":"5.0 out of 5 stars","reviewTitle":"Russell Hobbs Electric Kettle - Good and easy to use","reviewDate":"November 13, 2017","reviewText":"I will be using the Russell Hobbs electric kettle from now on. It replaces the manual kettle. One advantage with this electric kettle is that the red plastic water level indicators inside help me measure precise amounts of water to boil at a time whereas I do occasionally over fill the manual kettle for my morning beverage.\n\nA second advantage with the Hobbs kettle is the water temperature gauge. If I don’t brew my beverage right away the gauge tells me the water temperature so I know if it’s still hot enough for my brew.\n\nIt takes exactly three minutes to boil three cups of water and the kettle switches off when it begins to boil. Boiling water covers the red plastic water level indicators but I don’t worry over that. After all I have microwaved food in plastic containers for years with no adverse effects to date.\n\nThis kettle sits well on a base that is separate and connects to the wall socket. The lid fits tightly. The spout has a filter and is replaceable. The kettle is very easy to use right out of the box and I like it."},{"reviewerName":"Arwen in NM","rating":"5.0 out of 5 stars","reviewTitle":"A Keeper","reviewDate":"November 16, 2017","reviewText":"Honestly, I'd give this more stars if I could. Not only does it do exactly what it says it will do, but it is super fun to look at. I love the crisp, clear red with the chrome. For me, it's not so retro as I didn't grow up with an electric kettle. But I appreciate the aesthetic a lot.\n\nThere are not a ton of pieces to lose. You have the heating plate, the lid and the screen at the spout. Just keep on top of keeping that clean to reduce the scale build up (if you live in one of THOSE areas like I do.)\n\nIt heats fast. I can pop it off to pour my tea water at the right temperature thanks to the easy-to-read dial on the front. Even my husband, not a fan of anything on the counter, likes the way this kettle looks."},{"reviewerName":"Joe Marino","rating":"5.0 out of 5 stars","reviewTitle":"High quality! Water boils very fast","reviewDate":"January 11, 2018","reviewText":"My wife has a daily ritual for over 15 years. She loves to make tea in the morning before she heads to work. In the past, we had an electric kettle but one day after about 3 months of ownership it literally caught on fire and burned the countertop. We started using the stove and a whistling kettle since then. We were very leery getting another electric one. I gave her this one for the holidays. She has used it every day since. All in all it has been performing admirably! Really surprised just how fast it gets water boiling. The gauge on the side is accurate and a nice feature if you need water at a certain temp. The build quality is great, it has a good heft to it and feels like decent quality. Overall very happy with this kettle!"},{"reviewerName":"Just Trying to Help","rating":"4.0 out of 5 stars","reviewTitle":"Probably nicer than I deserve, but I like it none the less :)","reviewDate":"January 4, 2018","reviewText":"I like this russell hobbs kettle, but I wish the temperature gauge had indicators for various drinks. The outside of the box showed what temperature you wanted for each kind of hot beverage, but I forget these things easily. As you can tell, I'm kind of a neophyte when it comes to that. I never realized you should have different temps for different beverages. I just boiled water and used it.\n\nI don't use the water measuring thing on the inside, I just fill it up and boil it, but i live in a household with 6 people in it so the water never sits in the pot for very long, particularly during the winter months of the year.\n\nOverall I think its a great pot and I love the chunky handle. Very nice retro look too."},{"reviewerName":"Hunting Creek","rating":"5.0 out of 5 stars","reviewTitle":"Auto shut-off","reviewDate":"November 7, 2017","reviewText":"I love this. It's made my life so much better and I didn't realize I needed this as much as I do. Not only is it vintage adorable, and red (!) but it is perfect for my daily cups of tea. My favorite feature is the automatic shut off. I am the girl who walks away and forgets she's put water on for tea. This is such a great safety feature for me. I no longer worry about whether I forgot or not. I walk away and it turns off. Perfect."},{"reviewerName":"MommaMia","rating":"5.0 out of 5 stars","reviewTitle":"Classic styling","reviewDate":"November 16, 2017","reviewText":"My mom wanted an electric tea kettle but hesitated because, as she says, \"they are all so homely.\" This one is anything but homely! It's got some antique styling and it's her very favorite color...fire engine red! This heats quickly and is very easy to use. You won't be disappointed with this one!"},{"reviewerName":"MarilynnTaylor","rating":"5.0 out of 5 stars","reviewTitle":"Adorable and does what it's supposed to.","reviewDate":"February 23, 2018","reviewText":"I just received it and started using it, but I love it so far. It looks great on my counter, heats the water fast, keeps the water hot for a good amount of time and lets you know what temperature it is. The only plastic that comes in contact is the little filter screen that you can remove if you want, but it also won't touch the water long enough to leach anything, and there is hard clear plastic around the dial that is in the water reservoir. They say it's BPA free."},{"reviewerName":"John W. Graham","rating":"4.0 out of 5 stars","reviewTitle":"Slow to heat","reviewDate":"November 5, 2017","reviewText":"I got this because I am always finding the need to boil water for tea, instant soups, etc.\n\nMy review is based on using the kettle for a week of daily usage.\nThis kettle is somewhat thin-walled and gets very warm / hot to the touch on the outer walls when heating.\nHeating a full kettle takes ages - much longer than a much lower prices T-Fal unit. You could certainly boil a pot of water faster on an electric stove.\n\nI've also used some kettles abroad that heat in a fraction of the time it takes this one, so this observation is based on using multiple kettles from multiple manufacturers.\n\nThe temp gauge basically goes up to 212F. Not very useful - only aesthetic in value. Everyone knows that water has reached 212F when it is boiling. It just makes the kettle look cool and retro. The kettle does look nice - it has a retro vibe and an almost steampunk design element.\n\nI found the lid especially tight fitting.\n\nThe plastic water level indicators are of some concern to me: what might they be leaching when in contact with the Universal Solvent.\n\nOverall - the design looks nice on the outside but the walls are thin and get hot and it takes too long to heat."},{"reviewerName":"Sotto voce","rating":"5.0 out of 5 stars","reviewTitle":"Kitchen cool!","reviewDate":"November 3, 2017","reviewText":"It's the Retro that got me. It's the excellent performance that keeps it on the counter.\n\nVery cool. It's an artsy kitchen addition for the practical purpose. Fast boiling water is accomplished. Auto off at boiling point. The internal cup volume indicator is crafty. The kettle has a removable fine filter in the spout that you might not notice until you wash it. It's better than the images indicate.\n\nWe're boiling water everyday, morning and night. The kettle gets a workout here."},{"reviewerName":"janc111","rating":"1.0 out of 5 stars","reviewTitle":"NO plastic should be in lining of pot!!","reviewDate":"The manufacturer commented on the review below","reviewText":"learning about plastic insides turned me off to this purchase!!!!!--plus canceling my cart with matching toaster in it!"},{"reviewerName":"L. Mastrangelo","rating":"4.0 out of 5 stars","reviewTitle":"More for looks than for function.","reviewDate":"November 26, 2017","reviewText":"Don't get me wrong, this will boil water but I think it is more designed to look good or look retro. Prior to this kettle, I had a Breville kettle that heated water much more quickly.\n\nThe form beats the function here as well. There are a lot of plastic parts that come in contact with the water which makes me uncomfortable. In the end, we don't use a kettle all that much but it looks good near where we keep our coffee service."},{"reviewerName":"Tech Addict","rating":"4.0 out of 5 stars","reviewTitle":"Does it’s job but has issues","reviewDate":"June 17, 2018","reviewText":"This kettle’s been a lifesaver. Looks good and feels sturdy.\nOnly drawback, the ridges on the inside which prevent it from ever draining completely. That is simply poor design. Longer term I’m concerned about maintaining this pricey appliance.\nIt has a wide mouth so it is easier to clean than my last one. But the water retention (even after completely inverting it) is bothersome."},{"reviewerName":"Sierra M.","rating":"1.0 out of 5 stars","reviewTitle":"Moisture build-up in temperature gauge","reviewDate":"The manufacturer commented on the review below","reviewText":"Unfortunately, this kettle began getting moisture build-up in the temperature gauge within six months :( I loved the look, went well with my kitchen. But, poor craftsmanship. My hubby got this for me as a gift because our last broke."},{"reviewerName":"C. Quinn","rating":"5.0 out of 5 stars","reviewTitle":"excellent electric kettle with fabulous vintage style","reviewDate":"June 13, 2018","reviewText":"I love this electric kettle for both its style and its functionality. It looks fabulous in my kitchen, blending nicely with the 1940s styling of my tile work. I like the quick boil feature and the temperature gauge as well. I've had no problems with the heating element or any other features of this kettle in the months I've been using it."},{"reviewerName":"Jess","rating":"5.0 out of 5 stars","reviewTitle":"it looks nice in my kitchen","reviewDate":"June 8, 2018","reviewText":"order this one to match my coaster in retro style. it looks nice in my kitchen, kind of decoration. it's lighter than my previous one. the only thing i don't like is the red plastic \"flag\" indicates the volume of the cups. not comfortable for plastic things inside of the boiled water. other than that is fine"},{"reviewerName":"Butterfly","rating":"5.0 out of 5 stars","reviewTitle":"Cool and easy to fill.","reviewDate":"July 9, 2018","reviewText":"I love the look and the fact the lid may be removed to fill. Much easier to fill than those with a hinged lid."},{"reviewerName":"Mitzi","rating":"4.0 out of 5 stars","reviewTitle":"Electric kettle","reviewDate":"November 2, 2017","reviewText":"This is a bit big, that's the only reason for the 4. I replaced my old one with this one and it takes up a lot more space. Over all I really like it though. I like three temp gauge on the front and it's really easy to clean."},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Awesome retro look, modern performance","reviewDate":"November 12, 2017","reviewText":"This kettle is adorable, the retro look is superb. It works to boil water fast and quietly, plus the bell sound is quite nice. My favorite part is the temp gauge on the front that helps you easily keep track of your desired water temp."},{"reviewerName":"Jeff Beardsley","rating":"5.0 out of 5 stars","reviewTitle":"Stylish and functional","reviewDate":"December 21, 2017","reviewText":"I love the look of this kettle! The retro style is just what I was looking for. It also does what I need it to. A perfect cup of tea is only moments away and that makes me smile."},{"reviewerName":"L. Perry","rating":"5.0 out of 5 stars","reviewTitle":"Love it.","reviewDate":"November 11, 2017","reviewText":"So retro, so classic, sooo adorable. And it doesn't just look nice, it works well. Quick heating, nice capacity, and well constructed. Millions of jolly mugs of tea to come!"},{"reviewerName":"J. Dickerson","rating":"5.0 out of 5 stars","reviewTitle":"Simple","reviewDate":"May 4, 2018","reviewText":"Great replacement for others with pushbuttons to control heat. Easy to maintain and boils water fast."},{"reviewerName":"Person with a name","rating":"5.0 out of 5 stars","reviewTitle":"Beautiful and practical","reviewDate":"March 3, 2018","reviewText":"I've gone through several over the years, and this is the first one I actually adore ♡"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Cute and works great","reviewDate":"May 11, 2018","reviewText":"Very nice. The steel is a little thin, but it's cute and works great."},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Great","reviewDate":"October 2, 2018","reviewText":"Love the look and very easy to use and clean. We use it daily!"},{"reviewerName":"Pat","rating":"5.0 out of 5 stars","reviewTitle":"Heats water fast!","reviewDate":"July 11, 2018","reviewText":"I love this electric tea pot. It’s so pretty and heats water fast. I would recommend to every tea drinker\n👍🏻"},{"reviewerName":"M. Pant","rating":"5.0 out of 5 stars","reviewTitle":"Superb!","reviewDate":"August 5, 2018","reviewText":"Really works well"},{"reviewerName":"Carol Ann Buchanan","rating":"5.0 out of 5 stars","reviewTitle":"A great kettle. A little heavy when filled","reviewDate":"March 19, 2018","reviewText":"A great kettle. A little heavy when filled."},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Fast","reviewDate":"February 4, 2019","reviewText":"Love this product. Heats up quick, easy to use. Much faster than heating water on the stove."},{"reviewerName":"TanseyWort","rating":"4.0 out of 5 stars","reviewTitle":"Works well, but a little slow","reviewDate":"November 13, 2019","reviewText":"This is a beautiful appliance. It works as advertised and is easy to set up. I'm not a huge fan of the lid: While it does hold nicely, I do prefer a pop up as dexterity will continue to be an issue for me. Unfortunately, it takes at least twice as long to heat up a liter of water as my prior Delonghi KMix electric kettle. I'll just need to plan better."}],"qAndA":[{"question":"Are there any other plastic parts except filter that touch water? Will it work with the filter removed?","answer":"Thank you for your interest. The spout of the kettle is plastic, and the scale filter has a plastic frame. The scale filter should not be removed when the kettle is in use."},{"question":"Will the kettle turn off automatically at a certain temperature?","answer":"Thank you for your interest. This kettle will turn off automatically once the water boils. Additionally, the Water Temperature Gauge constantly shows you the temperature of the water inside the kettle. You can use the gauge for making drinks that require different water temperatures like green tea, white tea, and coffee."},{"question":"Where are this kettle and your other products made?","answer":"Is there an official group who all ask this question?"},{"question":"Is the kettle suitable for use in the US (110v) ?","answer":"Thank you for your question, Vahe. This kettle is designed for use in a United States or Canadian 120 volt electrical outlet."},{"question":"Will this item work with 220 voltage overseas?","answer":"The manual says it's 110. I doubt it would work on 220."},{"question":"Can the plastic water level markings inside the kettle be removed?","answer":"Hi. The instruction packet does not promote removal of interior red plastic. I love my kettle."},{"question":"Is the warranty valid in Canada?","answer":"Thank you for your question. The warranty on this kettle is two years from the date of purchase, with a valid sales receipt. Canadian consumers can register their product online at www.prodprotect.com, and receive a third year of warranty coverage."},{"question":"What are the three temperatures between 176 and 212?","answer":"Thank you for your question, Brian. Each of the dots on the water temperature gauge represents nine degrees (F). The temperature will be 185°, 194°, and 203° (F) respectively on the portion of the gauge you are inquiring about."},{"question":"The russell hobbs electric retro tea kettle? is it for an american or a uk electrical plug/outlet does not indicate on amazon. does anybody know?","answer":"We use it here in the USA with no problems at all, so I guess it's made for American plug style/type."},{"question":"seems like there is a plastic thing inside, is it possible to remove it and still run the kettle properly?","answer":"No you cannot take the plastic out. I tried as well but could not"},{"question":"can you reheat coffee in it?]","answer":"I wouldn't...\nit would be too easy to boil the coffee. Also the coffee flavour would remain in the kettle."},{"question":"Does the outside stay cool after boiling?","answer":"No, it is very hot to the touch. I tried it with a laser thermometer this morning and it hit 199 degrees. I imagine the lack of insulation is why it is also noisy. The handle is completely cool though."},{"question":"Is there a high altitude, above 6000 feet that will allow the auto shutoff to function?","answer":"Not that I am aware of."},{"question":"Is there any plastic on the inside?","answer":"Thank you for your question, Emily. The plastic and metal parts on this kettle are on the exterior. The kettle's interior is stainless steel, and the Quick Boil Indicator inside the kettle can be removed before using."},{"question":"Is it difficult to clean? How do you clean it?","answer":"I had no problem with the first initial cleaning out of the box, it was harder though because of the bottom. I will only use distilled water in it, so that will keep it clean. If you have to wash it after each time it is used, yes it would be hard to clean."},{"question":"Is this a cordless kettle? Is the cord in the base?","answer":"The cord is connected to the base unit, which the kettle sits on to heat up."},{"question":"How long does it take to get 1.7 L of water to boiling temperature?","answer":"Not sure in actual min. but it's quick I love mine hope this helps."},{"question":"why is there any plastic on the inside of the retro tea kettle to repeatedly get boiled when plastic heated up is carcinogenic ???","answer":"Thank you for your inquiry regarding this Russell Hobbs kettle. We at Spectrum Home Appliances understand that there have been various reports and articles in recent months and years that raise concerns about Bisphenol A (BPA) in consumer products and the impact of such reports and articles on the purchase of certain p… see more"},{"question":"Is this item supplied with eu plug?","answer":"No"},{"question":"How do I get the mold off the bottom? I've had this kettle under a month and there is pink mold growing inside.","answer":"I don't know. Maybe check on You Tube?"},{"question":"Is this a perculator?","answer":"No"},{"question":"What type of socket/plug type is? is it a ab for the usa or type c for europe?","answer":"USA"},{"question":"How many watts does this kettle require?","answer":"12 amps"},{"question":"Can I purchase a replacement filter?","answer":"Not sure. But....I only use bottled filtered water in my kettle to avoid any scale buildup"},{"question":"What shade of blue is the kettle? Robin egg, powder blue or aqua?","answer":"Cant help you I bought black"},{"question":"From the reviews, it is clear that there is some plastic that comes in contact with boiling water; is this plastic BPA free?","answer":"Thank you for your question, Curt. This kettle does not have a BPA-Free Claim. For products that do not claim to be BPA-Free, we have insufficient information to support a BPA-Free claim at this time."},{"question":"Where is this made?","answer":"Look it up on the ad"},{"question":"Is thekattle can work for 220v?","answer":"Thank you for your question, smadar. This kettle operates at 1,500 watts, 120 volts, 60 hertz, and 12.5 amps. The kettle is only designed for use in a standard United States or Canadian 120 volt electrical wall outlet."},{"question":"The cheaper Walmart versions you buy are kinda noisy while coming up to a boil. Is this one like that? Or is it much quieter like a good tea kettle?","answer":"I love my tea kettle. It's quite and heats very quickly. I purchased another one and gave it to a friend for Christmas."},{"question":"How long will it continue to heat the water until it shuts itself off?","answer":"Once the Kettle reaches it's temperature it will automatically stuff off & it will keep the water heated for about 20 to half an hour. You may choose to reheat as you wish. I always do."},{"question":"Do you have this brand that uses 220v 50/60 hz?","answer":"No"},{"question":"Why does it take 1-2 months to ship? I want to purchase this item, but I don’t want to wait that long to use it.","answer":"Whenever I see a product takes 1-2 months to ship and I need it immediately, I simply start looking for another item that is similar to the one I wanted. There are tons of items on Amazon, there is bound to be one that suits your needs."},{"question":"Does the kettle go over the stove or does it have an electical cord that I can I plug it in anywhere? Thank you.","answer":"Electric cord that plugs into North American outlets, not European outlets. Heats very fast."},{"question":"is the inside of the kettle stainless steel?","answer":"Yes it is. Kettle is great too. Highly recommend."},{"question":"How wide is the base? Need to make sure it will fit on counter.","answer":"Thank you for your interest. This kettle measures about 9.5 inches wide, 5.5 inches deep, and 9.25 inches high."},{"question":"What does \"boil dry protection\" feature do if the kettle will switch off automatically when the water reaches boiling point?","answer":"Thank you for your question, Yanso. Once the water has reached a boil, the boil dry protection automatically lowers the temperature to prevent any run off."},{"question":"Does the plug on the cord have 3 prongs?","answer":"Thank you for your question. This kettle features a three prong plug."},{"question":"CS Spectrum brand replied that the plastic indicator can be removed and then in other reply it says it should not be removed. why?","answer":"Thank you for your question, and we're sorry for the any confusion regarding the Quick Boil indicator. We do not recommend using the kettle without the Quick Boil indicator."},{"question":"Can we boil milk in it , if so is it easy to clean afterwards? thank you","answer":"I'm not sure, but I don't think it's a good idea. You could possibly watch the temperature and stop it a bit early to make sure the milk doesn't burn.If you do get burned-on milk (and it sticks pretty badly before it gets to burning temp) it will be hard to clean because you'll have to maneuver under the little pipe an… see more"},{"question":"Is there plastic part inside this kettle? What is the grade (305 stainless steel) of the stainless steel inside the kettle? Thanks.","answer":"Thank you for your question, Claude. There is a plastic insert for the rapid-boil function of this kettle. We at Spectrum Home Appliances understand that there have been various reports and articles in recent months and years that raise concerns about Bisphenol A (BPA) in consumer products and the impact of such report… see more"},{"question":"Will the lid come off by itself when water is being poured? Will it make any noise when the lid is being removed or refitted?","answer":"No, the lid stays on when pouring and it makes no noise. You only need to remove the lid to add water and to clean it. Love this product!"},{"question":"Does the base have a cord keeper underneath it? I hate having extra long cords 6 inches from an outlet","answer":"Yes it does."},{"question":"Is that plastic or silicone indicator?","answer":"Thank you for your question. The Quick Boil indicator is made of plastic."},{"question":"Hi to you. I got the kattle but i nade a big mistake i didnt pay attention that it is not 220v as i need in my country. Can i send it back to you?","answer":"you should be able to send it back! Amazon is very good with returns"},{"question":"Can this kettle be used with 220v?","answer":"Thank you for your question, Dirk. This kettle operates at 1,500 watts, 120 volts, 60 hertz, and 12.5 amps. The kettle is only designed for use in a standard United States or Canadian 120 volt electrical wall outlet."},{"question":"Can the kettle be used for tea or only water?","answer":"Thank you for your question, Khyati. We do not recommend boiling any liquid in this kettle other than water. The kettle can be used to boil as little water as one cup per use."},{"question":"where was this made? Also is the stainless steel food grade safe? I don't see any mention of that on the description","answer":"I am not sure where it is made but it is NOT like the Russell Hobbs I had for years. Has to be China. This is cheap and flimsy and has a huge piece of unnecessary plastic on the inside. Very disappointed, sent it back."},{"question":"where is this kettle made?","answer":"Thank you for your inquiry. This product is made to our specifications in Indonesia and China. The country of manufacture is printed on the box and in the use and care manual."},{"question":"Is it cordless?","answer":"We thank you for your question. Yes, this kettle is cordless, and only the base needs to be plugged in to heat up the water in the kettle."},{"question":"Made in china?","answer":"Thank you for your inquiry, Hoa. This product is made to our specifications in Indonesia and China. The country of manufacture is printed on the box and in the use and care manual."},{"question":"Is the filter made out of plastic?","answer":"It is a small screen with a plastic frame at the spout."},{"question":"How long is the cord?","answer":"A foot?"},{"question":"does this product have any plastic parts?","answer":"Plastic handle plastic lever and some plastic parts on the inside I suggest you do not buy it it was poor quality"},{"question":"Can this kettle be used in Australia we have 220 volts electricity ?","answer":"Not unless you have a step down transformer or some specialized adaptor. Look, Russell Hobbs is an English design firm. They must make a kettle for use in the rest of the world."},{"question":"Will this kettle turn on using a 150watt power source?","answer":"Thank you for your question, Coco. This kettle operates at 1,500 watts, 120 volts, 60 hertz, and 12.5 amps. The kettle will require the use of a 120 volt electrical wall outlet."},{"question":"Is this dishwasher safe?","answer":"No"},{"question":"Do you have this brand that uses 220v 50/60 hz?","answer":"No. The 110v."},{"question":"Freidora colorá","answer":"Mine is black"},{"question":"Does this kettle support the usa electrical outlet or is it a european plug style?","answer":"USA"},{"question":"What is causinf this water kettle to have a prop 65 warning?","answer":"I do not know. Contact the maker"},{"question":"Hi,can i use this kettle in europe with a 220v?","answer":"Thank you for your question, Hay. This kettle operates at 1,500 watts, 120 volts, 60 hertz, and 12.5 amps. The air fryer is only designed for use in a standard United States or Canadian 120 volt electrical wall outlet."},{"question":"I really need a new filter! Where can I get one?","answer":"I really don’t know the answer here. This, I believe ,does not have a filter!"},{"question":"Has anyone had this more than a few years and it still works? If so how long?","answer":"No\nMine is new"},{"question":"Can I use any electrical socket adaptor for Hong Kong ?","answer":"Thank you for your question, Marina. This kettle operates at 1,500 watts, 120 volts, 60 hertz, and 12.5 amps. The kettle is only designed for use in a standard United States or Canadian 120 volt electrical wall outlet."},{"question":"I've heard before this is a British brand. Will this kettle work on american electrical current?","answer":"Thank you for your interest. While the Russel Hobbs brand was established in Britain in 1952, this retro kettle is designed for use in the US and Canada."},{"question":"How much does it weigh?","answer":"I’m guessing just under a pound. Very light. It is made of plastic, but looks more expensive.\nI love this product. Heats very fast. Looks great."},{"question":"Is it truly 1-2 months before getting this at a US address ?","answer":"I do not recall it taking more than a few weeks for mine to arrive, but that was some time ago. I think I would remember if it were an unduly long time."},{"question":"Is there BPA","answer":"Thank you for your question, Ellen. We at Spectrum Home Appliances understand that there have been various reports and articles in recent months and years that raise concerns about Bisphenol A (BPA) in consumer products and the impact of such reports and articles on the purchase of certain products by consumers.\n\nIn … see more"},{"question":"where is it made","answer":"Thank you for your inquiry. This product is made to our specifications in Indonesia and China. The country of manufacture is printed on the box and in the use and care manual."},{"question":"Has the quality of this product gotten better since 2018? I see a lot of complaints about the plastic.","answer":"I couldn't be happier. Not much plastic in my opinion. Had this particular model for a couple of years. Had a different Hobson for years before that."},{"question":"Has anyone had this more than a few years and it still works? If so how long?","answer":"We've had it a few months,but our last Roussel Hobbs tea kettle still works since 1985!!!\nWe plan on buying their pots and pans also. They're made to last, I am sure it'll work for a long time."},{"question":"Does handle stay cool?","answer":"Yes - handle stays cool"},{"question":"Can the kettle be used for tea or only water?","answer":"Thank you for your question, Khyati. This kettle is only designed to be filled with water for boiling."},{"question":"What kind of plastic is behind the temperature indicator inside the tank? Is it polypropylene?","answer":"?"},{"question":"Can the plastic water level markings inside the kettle be removed?","answer":"I have no idea, I never tried tot remove them, they are not bothering me at all. I checked the kettle inside and I think that the internal parts of this kettle can be damaged if you try to remove plastic parts.\nI like this kettle, but mine has a top lid \"difficult to remove and put back\". this simple task requires… see more"},{"question":"Does the knob of the lid get hot when water boils?","answer":"Nope, it stays nice and cool."},{"question":"Does it say anywhere that the plastic is BPA free","answer":"Thank you for your question, Emma. We at Spectrum Home Appliances understand that there have been various reports and articles in recent months and years that raise concerns about Bisphenol A (BPA) in consumer products and the impact of such reports and articles on the purchase of certain products by consumers.\n\nIn s… see more"},{"question":"Can the kettle be used for tea or only water?","answer":"Thank you for your question, Khyati. We do not recommend boiling any liquid in this kettle other than water. The kettle can be used to boil as little water as one cup per use."},{"question":"Will this item work with 220 voltage overseas?","answer":"I do not know that answer. I suggest you contact Manufacturer customer service with this question."},{"question":"How long does it take to boil 3 cups of water?","answer":"I can boil a full kettle in about 5 minutes. I do it all the time. Smaller amounts obviously boil much quicker."},{"question":"Is the kettle made in the uk?","answer":"I believe so."},{"question":"Was there a recall on the kettle Russell Hobbs kettle?","answer":"I did not receive anything about a recall...."},{"question":"How long is cord?","answer":"2feet"},{"question":"Does it have a thermometer rather than a thermostat so that water can come to a full boil and then measure the temp going down for proper tea boiling?","answer":"Yes, it has an external thermometer. However, I believe the internal thermostat triggers the shut off as there is no temperature adjust."},{"question":"What is the wattage of the russell hobbs ke5550rdr ???????","answer":"Thank you for your question, Gary. This kettle operates at 1,500 watts, 120 volts, 60 hertz, and 12.5 amps."},{"question":"is the inside of the lid plastic?","answer":"No only the tab. I’ve only had one problem, it began leaking at the spout. But the company replaced it quickly. Workmanship has gone down over last 25 yrs as I’ve had Russell Hobbs for ages and only one ever broke down"},{"question":"Does is whistle?","answer":"No, you can hear the water boiling, when the water is at temperature, it turns itself off. You can also turn off manually, by lifting the kettle off the heating element."},{"question":"what stores are these products sold in?","answer":"I have no idea. I found them in England, and then purchased this on Amazon."}]}