{"title":"Hamilton Beach 1 Liter Glass Electric Kettle for Tea and Hot Water, Cordless, LED Indicator, Auto-Shutoff and Boil-Dry Protection (40930)","manufacturer":"Hamilton Beach","currentPrice":"$22.49","rating":"4.5 out of 5 stars","totalRatings":"664 ratings","features":["\n         Make sure this fits\n                by entering your model number.\n        \n","Fast and safe hot water: kettle is faster for preparing up to 1 L of hot water than a microwave and safer than a stovetop kettle","Modern design: glass sides with stainless steel accents will look great on your countertop without taking up too much space","Automatic shut off: boil-dry protection means the kettle will turn itself off when water is hot and ready to serve, making it safer than the stovetop","Cordless serving: the kettle lifts off the base for easy serving","Soft blue illumination: interior LED lights illuminate to let you know when hot water is on the way and automatically shuts off when it boils"],"reviewsAspects":["hamilton beach","easy to use","heats water","boiling water","easy to clean","hot water","every day","water quickly","love this kettle","french press","super fast","blue lights","perfect size","stainless steel","blue led","faster than the microwave","times a day","highly recommend","electric kettles","led lights"],"productInformation":[{"Product Dimensions":"5.5 x 7.9 x 8.1 inches"},{"Item Weight":"1.81 pounds"},{"Shipping Weight":"3.22 pounds (View shipping rates and policies)"},{"Department":"unisex-adult"},{"Manufacturer":"Hamilton Beach"},{"ASIN":"B074T6KZRK"},{"Item model number":"40930"},{"Customer Reviews":"4.5 out of 5 stars\n    664 ratings\n4.5 out of 5 stars"},{"Best Sellers Rank":"#168 in Kitchen & Dining (See Top 100 in Kitchen & Dining)\n#2 in Electric Kettles\n"},{"Date first listed on Amazon":"August 14, 2017"}],"productDescription":["\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n      \n\n\n    \n    \n        \n    \n\n\n\n\n\n","A shortage of storage space shouldn’t prohibit you from the convenience of an electric kettle. With the 1-liter design of the Hamilton Beach Compact Glass Kettle, it’s quick and easy to enjoy tea, pour-over coffee, hot chocolate, soups and more in minutes, without compromising valuable counter space. Plus, it has an attractive design that looks great in any kitchen.","Even though it’s compact, this kettle still packs a lot of features. With 1500 watts, it can boil water faster than a microwave, and is safer to use than a stovetop kettle. When the water reaches a boil, the kettle will automatically turn off, which helps keep it from boiling dry. The kettle lifts right off the base without the cord, making serving at the table a snap. A stay-cool handle, push-button lid and easy-pour spout makes filling and serving easy, maximizing the functionality of this powerful but space-saving kettle.","\n","\n","\n","The Hamilton Beach Compact Glass Kettle quickly boils water for tea, pour-over coffee and hot cocoa quicker than a microwave can do the job; built-in safety features like automatic shutoff and boil-dry protection make it safer than boiling a kettle on the stovetop.","Even the most oft-used appliances need space in the cabinets. The 1-liter vessel is the perfect size for tight quarters like apartment kitchens and dorm rooms.","The kettle can be removed from its base and carried anywhere hot water is needed.","\n","\n","\n","A convenient cord wrap below the base keeps the power cord neatly tucked away.","An anti-scale mesh filter around the lip of the kettle is removable, allowing for easy cleaning.","Measurements are labeled on the side of the kettle for quick reference when precise amounts of water are needed.","Hamilton Beach products are thoughtfully designed to make your life easier. We use consumer insights, in-depth research and rigorous testing to deliver the best solution to your everyday needs.","Whether it's preparing delicious meals and beverages effortlessly, or making your clothes look their best, you can count on the brand that has spent over 100 years creating products with you in mind."],"reviews":[{"reviewerName":"D Darkman","rating":"5.0 out of 5 stars","reviewTitle":"Very well designed. A delight.","reviewDate":"October 22, 2018","reviewText":"Lots of little features that show there was someone really smart working on the design of this product. E.g., the top of the carafe, when opened fully, clicks and stays open ... when you first take this out of the box the cord must be unwrapped from inside the base, but you can easily choose to unwrap it to either a 12” or 24” length, whichever works for you. All-glass carafe which, as far as I can tell, is somehow annealed to the stainless heating base without any noticeable exposure to plastic or sealant. The top of the carafe is plastic, rather like a typical coffee maker, meaning there is minimal contact with plastic. A filter pops down when the carafe lid is lowered (a nylon-type mesh with a plastic rim), in case the (typical/normal) lime deposits happen to flake off when you pour. The carafe’s opening is just wide enough to get your hand inside (except if you have a huge hand) for cleaning. It should ONLY be used to boil water. Minimum mark is 0.5 L, max is 1.0 L. I suspect I will be trying it with less than 0.5L (don’t tell anyone) since it has an automatic shutoff mechanism if it boils dry ... which should never happen anyway because about 10 seconds after it reaches maximum boil it shuts itself off. To boil 0.7L of water to a full boil took 2-3/4 minutes. The huge advantage is that with a glass carafe you can see and stop it when it reaches an early boil if you wish, e.g. for tea, rather than buying a much more expensive hotpot where you specify the end-point temperature. The small base can remain plugged in when you lift off the carafe to pour the hot water. The carafe’s design is very nice; blue LED light comes on while it is heating up, shuts off when it reaches a boil. I guess they figured we have enough beeps in our kitchens already, this has no beep to signal it’s done — only shortcoming if that’s an issue; I find it boils so quickly that it gives me just enough time to get a mug, prep A french press with coffee, etc that I don’t mind. Note, this is ETL listed. Says very emphatically, “do not immerse in water” so certainly no dishwashing either — not a problem as I can see. Shouldn’t use abrasive cleaners on it; if lime/calcium deposits occur from your water supply, run IT with a bit of vinegar or cream of tartar. Manual says you should unplug this when not in use, perhaps because it’s fairly easy to hit the “power on” lever which is on the bottom of the carafe’s handle. Handle stays perfectly cool even with repeated use, but of course the glass is as hot as whatever is behind it. White markings are only on one side of the carafe, a negative point if you hold it in left hand while filling (I would take a sharpie and carefully draw three little dots...)\n\nOne reviewer complained you need to squeeze two tabs to open top of pot... note, that is not needed when pouring only when refilling pitcher, and I have found it not to be too big a problem, no different than every tea kettle or hot pot I have ever had.\n\nI bought this not because I needed it, but because using this will somewhat reduce my carbon footprint, for daily teas and coffees, also if I use it to quickly boil water for cooking (pour the boiling water into a pot on stove, can’t cook in this thing) and it’s faster than a gas stove too. A sort of first step before the expensive plunge into induction cookware. Regardless of why you buy this, if you’re the sort of person who takes delight in nicely designed, styled, and functional items, you’re going to like this. If I encounter any flaws or problems, I will return and edit this, so if you find no notes below it means it’s still working well without problems for me."},{"reviewerName":"GusMom","rating":"5.0 out of 5 stars","reviewTitle":"Love mine","reviewDate":"March 13, 2019","reviewText":"Ok folks. Like you, I read the reviews of this product, both positive and negative and am always skeptical. However, some of the negative reviews I was scratching my head. One person commented on the film at the bottom of the pot after use. That's not the pot. That's your water. A simple mixture of dish detergent and vinegar cleans it right up. Another person complained about burning their hand opening the top. Why would you open the top after the water has boiled? You simply pour the water into you cup or tea pot. You should only open the top to put water in the pot. Another person complained of the plastic burning smell. That's a concern but not the case for me. So, with that in mind, here is my honest review. First, this is the second one I've had. I got one as a gift a few years ago and loved it! Then about 2 months ago, I knocked it off the counter and as glass does, it broke. I decided I didn't need the larger pot, as I had, and instead opted for this 4 cup one. Like the larger one, I love it! Unlike a traditional kettle that sits on top of your stove, this automaticly shuts off after the water boils. I don't have to wait and watch the pot boil because we all know a watched pot doesn't boil. :) It is effecient, quick, and does the job. This one is little so if you need more water than 4 cups, buy the larger one."},{"reviewerName":"Hatt","rating":"4.0 out of 5 stars","reviewTitle":"Works as expected, but why so big?","reviewDate":"December 23, 2018","reviewText":"Heats water fine and is all glass and stainless where it touches water, so no off plastic taste.\n\nFeels a bit cheap, especially the switch to turn it on. The opening is too small to fit a hand into so you have to have a Sponge or brush with a handle. There is no stay warm option or lower temperature settings like many other models.\n\nThe most annoying part, the 1 L carafe is LARGER than the 1.75 L water heater I replaced. It also requires a minimum of 0.5 L to heat which is twice as much water as the previous one. So you can’t heat just a cup of water."},{"reviewerName":"Amazon Customer","rating":"1.0 out of 5 stars","reviewTitle":"Tea with a side of cancer?","reviewDate":"January 29, 2019","reviewText":"I NEVER write reviews, but this is serious. The chemical smells this product emits gets into your clothes when pouring water. My shirt smells like burning chemicals. I can’t even imagine what leaches into the water from this. This product shouldn’t be allowed to be sold!!!"},{"reviewerName":"Dreamreader","rating":"5.0 out of 5 stars","reviewTitle":"I love this beautiful tea pot","reviewDate":"March 28, 2018","reviewText":"I love this beautiful tea pot! It certainly is an upgrade to the traditional tea kettle for the stove. This lights up and has blue lights so is entertaining... I use bottled water in mine because our water is very hard. I really like the built in mesh filter just in case!\nThe handle stays cool and the outside of the glass gets warm but not super hot. It boils water really fast, has been reliable ( I have owned it for two months and use it just about every day at least once.) It is 1 Liter in size and has a minimum and maximum water level clearly marked on the side of the teapot. If you are serving from it, the tea kettle comes off of the base so you are not dragging the cord behind you. The on and off switch is super easy.. and there is a built in shut off mechanism when the water boils (so you do not have to worry that all your water will dry up and the elements would get ruined.) IT is much faster than the microwave and I like using it because honestly it is powerful and fun!!! 1500 watts of fun! ( I mean power !)\nShipping: I received mine in two business days as I have prime."},{"reviewerName":"KarenM","rating":"4.0 out of 5 stars","reviewTitle":"Love the kettle but definitely designed with right-handed people in ...","reviewDate":"February 24, 2018","reviewText":"NOT FOR LEFTYS! Love the kettle but definitely designed with right-handed people in mind. Fill lines are drawn on one-side only, so you have to pick the kettle up with your right hand to see the lines. Minimum fill line and maximum fill line numbers are written in white so are hard to figure out if you pick the kettle up with your left hand to try to fill it. Come on Hamilton Beach! How much more would it have cost to put fill lines on both sides?"},{"reviewerName":"Alice","rating":"1.0 out of 5 stars","reviewTitle":"strange smell of plastic - broke in a month","reviewDate":"September 19, 2018","reviewText":"strange plastic smell persisted for 2 weeks but functionality’s great and the kettle’s quiet. plus the blue light while it’s running looks pretty dope\n\nupdate: broke within a month of use - glass shattered when accidentally tipped over on table top after heating water."},{"reviewerName":"luvs2read","rating":"5.0 out of 5 stars","reviewTitle":"Love, love, love this kettle!","reviewDate":"January 5, 2018","reviewText":"I absolutely love this pot and use it all the time. It heats up quickly and shuts off automatically. The first pot I got the switch didn't work, but Amazon replaced it straightaway. I've been using this one now almost every day for weeks and no problems whatsoever. I know one thing for certain, when this kettle takes a digger, I won't hesitate to buy another. It's that nice."},{"reviewerName":"CDM","rating":"1.0 out of 5 stars","reviewTitle":"Buy something else.","reviewDate":"March 11, 2019","reviewText":"Pros: Heated water quickly the one time I used it.\n\nCons: Glass carafe cracked on first heating/cooling cycle. Crack is on the back of carafe, so I didn't see it until I went to fill it to use it again. Called the Hamilton Beach 800 number, and hold times were 35 minutes. Submitted a report through their online system on Friday, March 1. They responded Monday March 4 asking for the receipt and the series number.\n\nPro Tip - the series number isn't on the label where it says \"series number\", followed by a big blank. It's molded into the plastic of the unit and hard to read.\n\nI responded with the series number and invoice within an hour of them asking. I haven't heard anything in the four business days since then.\n\nI have had it for 17 days, and have spent ten of them waiting to find out if Hamilton Beach will replace the defective carafe. I have a couple more days leeway within the return policy, but I will return it to Amazon for a refund and buy something else if Hamilton Beach doesn't do the right things very soon.\n\nUpdate: March 12 - Finally received a response, I was told to cut the cord off the appliance, email a photo proving I did that, and after 3-4 days processing for the email/photo, I will receive a new unit within two weeks. They generously waived the shipping and handling charge for the warranty replacement. <sarcasm> The wait continues."},{"reviewerName":"Nick","rating":"4.0 out of 5 stars","reviewTitle":"Also the lid doesn't like to stay open unless you tilt the kettle back ...","reviewDate":"November 16, 2017","reviewText":"Almost gave it 5 stars, only drawback is I don't care for how the lid opens, you have to squeeze the two tabs on each side which puts your hand above the boiling water. Not a problem if you're careful. Also the lid doesn't like to stay open unless you tilt the kettle back slightly while filling. You don't have to open the lid for pouring though. Overall I like it a lot, time to boil is very acceptable IMO. I recommend it."},{"reviewerName":"Nyaling Marenah","rating":"5.0 out of 5 stars","reviewTitle":"Great purchase","reviewDate":"August 24, 2018","reviewText":"Love this thing! I drink tea constantly. It’s super easy to use, heats up extremely fast, no issues thus far."},{"reviewerName":"Dave C.","rating":"4.0 out of 5 stars","reviewTitle":"Good product.Take care to close lid each time.","reviewDate":"January 25, 2018","reviewText":"I like this a lot, but the lid has to be closed tightly or boiling.continues."},{"reviewerName":"Amazon Customer","rating":"1.0 out of 5 stars","reviewTitle":"Glass cracked after 8 months of light use","reviewDate":"April 29, 2019","reviewText":"I loved this kettle! It's affordable, stylish, and heats water efficiently and safely. However, after 8 months of light use (maybe 1x time a week) the glass cracked while heating water. My counter was covered in boiling water and tiny glad shards 😞\n\nI'm very upset about it, as other than this it was the perfect kettle. I reached out to Hamilton Beach but have received no response. Will update if I hear from them."},{"reviewerName":"Travis","rating":"5.0 out of 5 stars","reviewTitle":"Wow!! So cool","reviewDate":"November 28, 2017","reviewText":"This thing is bananas!!! Not very often am I blown away by something working really well. Filled with water, plug it in, and the water was boiling in under 3 minutes! If I went with my original idea of a steel kettle on the stove top, i'd be waiting at least another 5 to 10 minutes to hear the whistle.\n\nI was looking for something small and efficient for a couple cups of tea at a time, i definitely found what I was looking for. Awesome product! A+"},{"reviewerName":"Joseph L.","rating":"1.0 out of 5 stars","reviewTitle":"Don't trust aggregate review scores - look deeper","reviewDate":"July 29, 2019","reviewText":"I made the mistake of seeing that this product had a near 5 star review and did not do my due diligence. I cannot believe so many people rated it so high. 1.) There is no temperature selection - my previous kettle had a selection of 175, 190, 200, and 212. This seems like an easy feature. Would also be nice to know what temperature the water is. An small simple LED indicator would have been nice. 2.) The button to open the spout is near the spout which will be hot right after you use it. Most of these kettles have the button on the handle. This seems like a big oversight. 3.) The water does not feel as hot as my previous kettle. It does not cook my oatmeal as well as previous kettle. If these features are important to you, look elsewhere."},{"reviewerName":"Chris c","rating":"1.0 out of 5 stars","reviewTitle":"Cracked after a couple months of use","reviewDate":"October 18, 2018","reviewText":"Bought this kettle. I used it for a couple of months and then it cracked while heating up water."},{"reviewerName":"ksdenson","rating":"5.0 out of 5 stars","reviewTitle":"Great purchase!","reviewDate":"April 15, 2019","reviewText":"I drink hot tea a lot and have oatmeal for breakfast almost every morning, so this was a no-brainer. It is SO much faster than the stovetop tea kettle and is easier than the microwave. I love that the bottom of the kettle isn't hot so I don't have to worry about setting it on the countertop, and it's really easy to clean."},{"reviewerName":"Ruth E. Holleran","rating":"5.0 out of 5 stars","reviewTitle":"Reliable and beautiful","reviewDate":"August 24, 2018","reviewText":"I have had this over a year now and it is holding up nicely. I particularly like the blue light while it heats. I find the beep discrete at shut off. The temperature feature is not accurate; when I tested the temperatures they did not match the setting. If this is important to you, take several measurements until you figure out how far it is out and adjust your temperature settings accordingly."},{"reviewerName":"Sasha","rating":"5.0 out of 5 stars","reviewTitle":"Seems to boil water faster than gas stove top.","reviewDate":"March 13, 2018","reviewText":"I love this kettle so much that I recently bought a 2nd for my son who \"borrowed\" mine quite often. I love it for quick hot water for tea. He loves his for quick hot water for instant oatmeal. Mine has worked perfectly for 2 years. Reasonably priced and it seems to boil water faster than my stove top kettle."},{"reviewerName":"Edna","rating":"4.0 out of 5 stars","reviewTitle":"Please, Hamilton Beach, acknowledge your left-handed customers.","reviewDate":"January 3, 2019","reviewText":"I got this kettle for my grandmother so she doesn't have to run the whole stove just to heat up water for coffee. I plugged it in and showed her how it automatically cuts off when the water gets hot and she was sold. She uses it constantly. There's just one problem.\n\nShe's left handed. That means when she's holding the kettle in what is a normal and comfortable way for her, she will not see the minimum and maximum water level markings on the kettle. And she has overfilled it a couple of times.\n\nPlease, Hamilton Beach, go crazy with the luxurious details and PUT THE WATER LEVEL MARKINGS ON BOTH SIDES. Left-handed people everywhere (and those who love them) will thank you."},{"reviewerName":"Colin S","rating":"1.0 out of 5 stars","reviewTitle":"Get something else","reviewDate":"November 6, 2019","reviewText":"Design: It’s quite pretty.\n\nQuality: The auto shut-off on my kettle was broken out of the box (yes, the lid was fully closed). Overall the material quality seems like it would hold up for maybe a couple of years.\n\nSafety: When water is boiling, the whole kettle shakes around on the base, which is not something I’ve experienced with any other kettle and is unsettling, especially since it is made of glass. The carafe itself is not solid glass, so boiling water touches whatever adhesive and (plastic? silicone?) o-ring the manufacturer used to fuse the stainless steel heating plate and the glass.\n\nUsability: The opening is big enough that getting a hand inside the kettle to clean it should be no problem for most people. The spout is small compared to other kettles and does not pour quickly or well. It is also quite close to the plastic lid so it is hard to avoid exposing water to plastic when pouring, even with the plastic mesh filter removed. The lid design, which requires squeezing both sides in order to open the lid, is surprisingly annoying. Other kettles I have owned either had a spring-loaded button or a one-finger pull tab for the lid.\n\nOther: The manufacturer put a hard-to-remove sticker advertising the blue LEDs on the kettle. You can’t see this until you buy a kettle and remove it from the box so I am not sure to whom it’s supposed to be advertising. I feel like this demonstrates the overall level of thought and care that the manufacturer gave to this product."},{"reviewerName":"Tj","rating":"1.0 out of 5 stars","reviewTitle":"No recommendations","reviewDate":"October 16, 2018","reviewText":"Had to return. Received and wouldn't even work."},{"reviewerName":"PoolWalker","rating":"4.0 out of 5 stars","reviewTitle":"Nice, larger than expected","reviewDate":"December 8, 2018","reviewText":"Works well, looks nice with the glass and blue lights. Was disappointed that it is not very compact. It’s the same size as most the 1.7 liter ones, just has a lot of unused space for some reason. The lid requires you to place entire hand over top which is dangerous when there is hot steam inside if you want to refill or open it to let the steam evaporate out. That is it’s buggest flaw. Overall good product tho."},{"reviewerName":"marcia Hall","rating":"3.0 out of 5 stars","reviewTitle":"A pain to fill","reviewDate":"July 15, 2019","reviewText":"I LOVE electric tea kettles. Use boiling several times during the day for all kinds of concoctions. This one has a very small capacity (my fault for not realizing HOW small the amount was). But it is a pain in the neck to fill- you have to pinch the lid to open it; not just use one finger to flip open. It does not STAY open easily either. So only ** for that. The water boils quickly enough- but it takes too long to automatically shut off. I usually hear it boiling - several seconds later it’s STILL boiling!?! I frequently pick it up before it has shut off. Strange. No. Wouldn’t recommend this product. I have had several of these in my life- 8-10? and this is my LEAST favorite. If I hadn’t just moved - expenses! - i would replace."},{"reviewerName":"yescas","rating":"5.0 out of 5 stars","reviewTitle":"Fantastic. Recomend it 200%","reviewDate":"October 15, 2019","reviewText":"Took me 4 weeks of research and decide best choice between traditional coffee maker, stove whistling pot, electric tea kettle, percolate coffee maker. All my pros for this beauty are :\n1. Save space in kitchen\n2. Boil in less than a minute. (45 seconds timed ). You don't get boiling temperature in your cup from coffee makers. so your coffee get cold rapidly specially in winter time when the temp is colder in your house.\n3. No need of coffee filters. I simply toss the grounded coffee in it , let it boil 40 secs. and serve it.\n4. Perfect size for up to 4 regular cups ( 12 oz ). Not too big, not too small , jus perfect size.\n5. No spills, nice blue lighting feature.\n6. Easy to clean, no taste of metal added."},{"reviewerName":"Chris","rating":"2.0 out of 5 stars","reviewTitle":"Lever broken on arrival ; also spout very small","reviewDate":"November 9, 2019","reviewText":"Bought this for my mother as a safer alternative to boiling water. I liked the idea of the BLUE LIGHT so you would know when it was done. Unfortunately, it didn't work out of the box. When pressing the very cheap clear plastic Power ON lever, it immediately returned to OFF position. It didn't stay down. So the blue light and power would remain ON if I stayed there holding the lever down. Returned as defective item.\nI would try another one because of the blue light feature, but I found pouring the water OUT of the glass pitcher to be sub par. They made the carafe spout very small and it makes for a messy pour, especially when trying to pour out the very end of the water. Also, did not like that you had to use two fingers simultaneously to open the lid. It was just awkward. The unit in general was kind of cheapish feeling.\nSee Colin S review a few days before mine. It was spot on with everything I found too.\nGreat idea -- blue light. Bad implementation on this one."},{"reviewerName":"Bthor76","rating":"3.0 out of 5 stars","reviewTitle":"Three flaws with this kettle.","reviewDate":"May 19, 2019","reviewText":"Like: The blue glow from the LED’s when heating the water. Dislike: The steam rising and burning my hand when I pour boiling water out of it. Did the manufacturer not test this? They must’ve know this but continued with its manufacture anyway. Simple solution would’ve been to place the handle further down the kettle. Dislike #2: It takes two hands to open the top of the kettle. Another major flaw. Dislike #3: The auto shutoff feature does not work less than two months after use. Major fire hazard. Yesterday I got distracted by a chore while water was being heated. When I returned the water had boiled out of it yet it was still heating. This is unacceptable."},{"reviewerName":"Therapy M.","rating":"5.0 out of 5 stars","reviewTitle":"A gift and some fun too - a worthy gift","reviewDate":"August 8, 2019","reviewText":"I tried this out before I gave it as a gift. I wanted to know why it was valuable to have set temps . I love mine but it does not have that feature. I also do not drink a variety of tea. I did not find a purpose for myself but the person receiving it has told me how much he appreciated that specific assistance. It works well - looks nice on or off and is quite in its operation. Safety shut off works well so you never have to worry about leaving it plugged in, lift it up off its stand and it auto shuts the electricity off. Great idea for those who tend to forget the little stuff. It is a little heavier than I expected and that was an issue for me. Not for my 28 year old. He enjoys it and wanted to send one to his friend - What more is there to say.. Good Product"},{"reviewerName":"Mary D.","rating":"4.0 out of 5 stars","reviewTitle":"Good quality","reviewDate":"September 28, 2019","reviewText":"I've had this kettle for about a month. It's is great in that I love the quick-boiling of water (much quicker than my gas stove), love the blue light when it's on, the safer auto-off feature, and the cap that clicks & stays open when you want it to. I ordered this one because it's max is only 4 cups and was hoping it would be smaller in size (to use less shelf space). Actually it is a bit larger than another kettle that is made to hold much more so it looks slightly bulky on the shelf. That's why I gave it 4 stars. Some people complained about a plastic odor. Others mentioned the print showing the amount of liquid on the glass being only for right-handed people. This has no odor and I've adjusted to the one-sided print. Overall it seems well made and it works well."},{"reviewerName":"John DeBoer","rating":"5.0 out of 5 stars","reviewTitle":"Great to warm baby bottles","reviewDate":"October 27, 2019","reviewText":"I’m using this in the nursery to heat water to warm bottles. It heats really fast! The water boils within minutes. I don’t want boiling water though, so there has been a learning curve about when to turn it off. I get HOT water in less than two minutes. For someone trying to make tea or something, this boils water way faster than the stovetop kettle. I use this to heat water that I pour into a large mug and then warm bottles in it. It is faster than letting the water run (and doesn’t waste water waiting for it to get hot), and faster and easier than going downstairs to the microwave. I got this instead of a fancy expensive bottle warmer because I will actually use this when we aren’t warming bottles any more."},{"reviewerName":"Amazon Customer","rating":"1.0 out of 5 stars","reviewTitle":"Dangerous！ Autoswitch fails","reviewDate":"May 8, 2019","reviewText":"NICE blue light. But not good quality for heating water. Several times it won't stop heating even the water boils for a long time. This started about 2 months of purchase but happened seldom. Recently, the auto-switch has almost failed but occasionally work.So okay, I will watch it when I boil water. BUT NOW, THE SWITCH HAS FAILED COMPLETELY AND YOU COULD NOT USE IT because when you tap down the switch it will bounce back. I could not bear keeping pressing the switch for it to heat water...."},{"reviewerName":"Knitter","rating":"5.0 out of 5 stars","reviewTitle":"Very convenient, easy to clean, quick","reviewDate":"December 11, 2018","reviewText":"I like the glass container, the convenience of water boiling in a little over a minute, and I even like having the ability to keep the lit up while boiling and pouring so it doesn't come in contact with the water AT ALL :)) I've only had it for 3 months to replace a water service. So much easier than a water service. I just bring in a gallon of spring water to work, heat it in the electric kettle, and I've got a nice hot cup of tea or soup or hot chocolate (you name it - the possibilities are endless! Needless to say I absolutely love this kettle!"},{"reviewerName":"JH-VT","rating":"4.0 out of 5 stars","reviewTitle":"Great Kettle, Heats Fast!!! Love it!!!","reviewDate":"September 24, 2019","reviewText":"This kettle heats the water very fast, from cold tap to boiling in less than three minutes. The instructions call for the kettle to be wiped out after use. My only problem with this is that the opening is small enough to make it awkward to reach inside the kettle to dry the heat plate, and if you do not wipe it mineral deposits can accumulate over time. If you have small hands that will help, but the angle is awkward. A removable lid (or at least if the lid was able to fold back beyond the present 90 degree angle) would make access for cleaning a lot easier on this 1 liter kettle. Otherwise, I give it 5 STARS!"},{"reviewerName":"MG","rating":"5.0 out of 5 stars","reviewTitle":"Amazing kettle!!!","reviewDate":"October 31, 2018","reviewText":"I LOVE this kettle!! Definitely is a keeper!! Boils water way faster than a microwave and stovetop. Takes abt 1 min to boil water at the minimum line & maybe abt 2 mins at the maximum line. After reading some of the bad reviews, I was very skeptical but decided to give it a try... so glad I did. LOVE this product!!"},{"reviewerName":"Kelsie Helberg","rating":"2.0 out of 5 stars","reviewTitle":"Leaky when pouring!","reviewDate":"December 7, 2018","reviewText":"Super fast heat time (and the lights are really pretty), but it leaked all over the place when pouring. I use the Chef’sChoice 681 kettle at home (I've had it for 5+ years, and it is still going strong!!!), but I wanted a cheaper kettle for occasional use at my studio. I returned it and ended up with the Amazon Basics kettle, and it's been 100% fine for the past two months that I've been using it. If you want to splurge though, get the Chef's Choice instead."},{"reviewerName":"1111","rating":"5.0 out of 5 stars","reviewTitle":"Love!","reviewDate":"October 18, 2019","reviewText":"Was weary about an electric teakettle, but this is so easy to use. The heat automatically shuts off when done boiling which is a great feature for the forgetful/busy person. The wide lid is easy to fill as well. The water heats up ridiculously fast. I've had it for several weeks and no signs of rust. The only thing I would change is having the option to take off the plastic straining part on lid. I end up opening the lid completely before pouring so as to avoid having boiling water touching the plastic and thus possibly leaching chemicals. Other than that it's pretty perfect."},{"reviewerName":"Joswen E.","rating":"5.0 out of 5 stars","reviewTitle":"Super good product","reviewDate":"June 30, 2018","reviewText":"Great product. I saw it first at my cousins hone. She purchased at a local store, but I'm an Amazon kind girl so I purchased it online. The packaging was carefully done. I use this product just about every morning. It's fast and the water is extremely hot so buyer beware. I would definitely recommend purchasing this product. Oh, I love watching the water boil & the blue light illuminate. Ty"},{"reviewerName":"LCampbell","rating":"5.0 out of 5 stars","reviewTitle":"Very impressed.","reviewDate":"December 24, 2018","reviewText":"I have an instant hot water dispenser on my sink that was acting like it was about to fail, so I got this after reading how fast it heats water. Once it came in, my dispenser straightened up its act so I took it to the office. It is amazingly fast, pretty to look at, and great for tea, oatmeal, grits, etc. No more cleaning hardened cereals off the microwave walls!"},{"reviewerName":"Sabio","rating":"1.0 out of 5 stars","reviewTitle":"Kettle leeches into the water","reviewDate":"February 13, 2019","reviewText":"After use, the water was cloudy and filled with sediment ( it had been cleaned before use). After I poured the water out, I noticed a sentiment on the bottom of the kettle. I wiped it with a towel and there was a grey stain as noted in photo. Returned right away."},{"reviewerName":"Robert","rating":"3.0 out of 5 stars","reviewTitle":"Too big","reviewDate":"March 2, 2018","reviewText":"It’s a lot bigger than 1 liter.\nI hoped ot would be more compact than a 1-1/2 liter"},{"reviewerName":"Fülü Fülü","rating":"3.0 out of 5 stars","reviewTitle":"Fast enough, but weird shape","reviewDate":"September 11, 2019","reviewText":"First time using a glass kettle. It is fast enough, 500ml boils in 2 minutes, the automatic shut of happens in 2 1/2 minutes.\nI did however find its shape a bit inconvenient. You have to bend your elbow quite a bit to be able to pour it and it feels very heavy in your hand while you do it, it is just awkward. Also the top opening is too small in comparison to the body, so when you need to wash the kettle it is pretty burdensome.\nGood enough, but would not buy it again."},{"reviewerName":"Jessica Ma","rating":"5.0 out of 5 stars","reviewTitle":"An electric kettle that does its job--and quickly!","reviewDate":"October 3, 2019","reviewText":"We were solidly a stove-top kettle family... Until we had a baby. This electric kettle is such a great thing to have around--it boils water SUPER FAST, which is very convenient when it comes time to warming bottles. It also means we can have hot team/instant coffee within a minute or so of starting the kettle (I haven't actually timed it, but it just feels very quick).\n\nThe kettle is lit up blue when it is on. Considering the kettle is made of thin-ish glass (it's not dainty, but it's not as thick as, say, a Mason jar), it holds temperature fairly well. It comes with instructions on how to descale with vinegar, and it's super effective (we live in Los Angeles, and even exclusively using filtered tap water, the scale builds up!). Do heed the max fill level because you will have a counter full of boiled-over water otherwise."},{"reviewerName":"Tim M","rating":"5.0 out of 5 stars","reviewTitle":"Nice alternative to stove top","reviewDate":"June 3, 2019","reviewText":"It’s a great alternative to boiling water on the stove. I put 1L of water in there and it boils in less than 3 minutes. I haven’t officially timed it, but I put water in, turn it on, walk away and when I quickly come back, it’s already finished boiling. It automatically turns off after boiling which is nice. I looked at many electric kettles and settled on a brand I know. This one is for my house, but I’ve been thinking about getting one for work. When I do get another one, I plan on getting this same kettle."},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Plastic chemical free instantly boiled water","reviewDate":"February 11, 2019","reviewText":"Okay, maybe the boiling isn't instantaneous, but it sure feels like it compared to every other method I've used. Absolutely love this kettle. I originally purchased for myself and then went on to buy 3 more for the women of the family. One of those items that makes everything that came before it obsolete and becomes an absolute kitchen essential. Only slight downside is the fear of getting any of the underside of the kettle wet when cleaning with soap and water. It's completely doable with care and entirely worth the ease of boiling water in a container that doesn't expose any plastic parts to boiling water."},{"reviewerName":"Stephanie","rating":"5.0 out of 5 stars","reviewTitle":"Compact & Lightweight","reviewDate":"June 7, 2019","reviewText":"Compact, lightweight and easy to use. I like to make 2-3 cups of tea and this size is perfect. The blue light looks pretty when the water is boiling. Remember to clean it after every use to avoid build up. Boil a mix of water and lemon juice or vinegar then rinse."},{"reviewerName":"samantha o.","rating":"5.0 out of 5 stars","reviewTitle":"Satisfied customer","reviewDate":"April 21, 2019","reviewText":"After scrolling through several options of electric kettles, I decided to give this one a try. I am pleased I did. It heats quickly, has a blue indicator light on the base as to when the water has boiled, and detaches from the heating base. As some reviewers had mentioned, mine does appear to have developed spots on the bottom of the inside. It's not rust spots, so it doesn't bother me. I love it and happy made the purchase."},{"reviewerName":"Heather","rating":"5.0 out of 5 stars","reviewTitle":"GREAT PURCHASE!","reviewDate":"May 24, 2019","reviewText":"LOVE IT. I use it every day to heat water for my coffee. Had it for a couple months now. I love the blue LED feature that instantly goes off when its boiling so I can tell from far away if my water is ready.\n\nI bought this model rather than other similar ones because it seemed to have a higher wattage than others in the same price range. Which means it heats a little faster which saves me a little time in the morning.\n\nAt first I wasnt sure if I liked that the base swiveled. I'm very clumsy and was worried about knocking it accidentally. But it has actually been a useful feature and I wouldn't change it.\n\nVery sleek, very clean lines, fits nicely on my counter. Would recommend over other similar kettles."},{"reviewerName":"David J. L.","rating":"5.0 out of 5 stars","reviewTitle":"The other one failed after a week and this one's smaller","reviewDate":"August 13, 2019","reviewText":"The size is a bit smaller than the competition and that's fine for a single person who changes the water after every use to prevent scaling. It has worked perfectly after 2 months. So much better than a kettle where you don't know if it's boiling. As with others in its class, it has a blue light when turned on and it automatically goes off after reaching full boil. But it works unlike the other I got and returned after a week."},{"reviewerName":"Samantha","rating":"4.0 out of 5 stars","reviewTitle":"Boils, but has flaws.","reviewDate":"May 18, 2019","reviewText":"We’ve had several electric kettles over the years and this is my least favorite. I bought it for the office thinking “compact” meant it would be smaller, but it’s a pretty standard size. Also, when pouring boiling water the steam comes back on your hand holding the kettle...this hasn’t happened with our other kettles. The water boils fine, but I won’t buy this one again."},{"reviewerName":"Sasan A. Kermani","rating":"4.0 out of 5 stars","reviewTitle":"Nice look, gimmicky lid with after thought lock","reviewDate":"February 18, 2019","reviewText":"The lid locks in place, a good thing, you have to unlock it by putting your hand on to and pinch the lock with two fingers to release, not so good. I am not sure why the mechanism could not be on the handle where you hand is.\nAlso, the ad for the kettle says something about being able to wash the kettle easier due to design of the lid! Not really!\nBut it works well and has worked for two weeks now without issues."},{"reviewerName":"nil","rating":"5.0 out of 5 stars","reviewTitle":"it performs true to its promise","reviewDate":"August 23, 2019","reviewText":"This kettle performs just as the product information claims. It is well made, light weight, boils water just over 2.5 min. and the kettle automatically shuts off in exactly 3 min (water at max. level). Boiling water never touches the plastic lid. Tempered glass is good quality. A medium size male hand can reach inside the pot. Blue light feature is a nice touch. Very pleased with the purchase."},{"reviewerName":"Nina Schlosberg","rating":"3.0 out of 5 stars","reviewTitle":"Lights up blue but cheap construction","reviewDate":"September 27, 2019","reviewText":"This kettle is lighter weight than the Chef’s Choice kettle- I suspect there’s more plastic in T’s construction.\nThe plastic ON switch is easy to inadvertently knock on and if there’s no water in the kettle, this could become a fire hazard. I have to admit that I was dazzled by the blue LED lights that go on when water is being heated.\nI’m disappointed with this kettle’s cheap build- it probably won’t last long. Buyer beware"},{"reviewerName":"Emily Sandstrom","rating":"5.0 out of 5 stars","reviewTitle":"perfect in every way; I bought a backup for when it dies or is stolen ....","reviewDate":"November 8, 2019","reviewText":"The blue light is so pretty. The size (smaller one) occupies little space. I have extremely hard water, even filtered, so I wipe it inside often, and intermittentlly use distilled water (for tea; makes much better tea than the hard water does). Have had it for close to two years, and it looks new. Buy two and put one in the closet."},{"reviewerName":"Robin Elliott","rating":"5.0 out of 5 stars","reviewTitle":"Love this kettle!","reviewDate":"January 20, 2019","reviewText":"I've only used this kettle a handful of times so far but I love everything about it. The size perfect - not too big as I thought it might be. It actually heats up water faster than my microwave. I don't know how that's possible but I'm impressed! Once it boils and I pour what I need, I empty the rest and leave the lid open for a while to dry. It dries clean and spot free. It's pretty and neat enough to leave on my counter all the time. A little extra perk... I love the pretty blue glow when it's \"on\". Highly recommend so far!"},{"reviewerName":"mbreinholt","rating":"5.0 out of 5 stars","reviewTitle":"Great Little Kettle","reviewDate":"August 6, 2018","reviewText":"I have it for a few months and it works great. Perfect size for one person. Now I have discovered it is my go-to method for heating water for hummingbird \"juice\". Heats faster than the microwave, and is less messy because I can pour the water directly on to the sugar instead of in and out of the microwave. I have really hard water so in order to keep it looking nice I have to do the vinegar and water boil maybe once a month but it works and the pot looks crystal clear afterwards."},{"reviewerName":"Logan M","rating":"5.0 out of 5 stars","reviewTitle":"Love it!","reviewDate":"April 24, 2019","reviewText":"I really love this thing. It’s aesthetically pleasing, and boils water in about 1 min. Very happy with my purchase!"},{"reviewerName":"Monique Iniguez","rating":"5.0 out of 5 stars","reviewTitle":"Easy and safe","reviewDate":"July 1, 2019","reviewText":"I absolutely love my kettle!! I am blown away at how easy it is to use. Just put in water to the full line, place it on the base, full the little switch, it gets to boiling and auto shuts off.\n\nWhen it is on, the blue light turns on when it is ready the light (and appliance) goes off. If the kettle is removed from base, it shuts off too. I love how safe it is.\n\nThe cord is long enough to have it on a nightstand and extends to the wall below.\n\nIt makes boiling water in 4 minutes."},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Good size for sipping yerba mate at work","reviewDate":"October 4, 2018","reviewText":"I bought it to avoid break room appliances at work that to my taste buds require serious cleaning. I like sipping yerba mate at work and the smaller size of this kettle makes it perfect for reheating water fast to refill the yerba mate gourd. My only complain is that the opening is quite narrow so a man with regular size hands may have problems reaching inside and cleaning without using a brush."},{"reviewerName":"Diane Dial","rating":"5.0 out of 5 stars","reviewTitle":"Hot water quick, quick, quick!","reviewDate":"September 30, 2019","reviewText":"If you are a buyer looking for a quality way to heat water for your tea or whatever in a very fast manner, this is the kettle/pot for you. I love how fast this product works!! Check it out for yourselves. I would recommend this to anyone. Because it shuts itself off if left on, it would be great for older people."},{"reviewerName":"RR3","rating":"4.0 out of 5 stars","reviewTitle":"so far works well","reviewDate":"November 3, 2019","reviewText":"This is my first experience using a hot pot. It works well, heats the water fast. I do not know if the cutoff switch works or not, haven't left the water long enough to find out. Also don't yet know how well the little filter screen works/cleans up because I haven't used it enough yet."},{"reviewerName":"Connor Bennett-Sheffield","rating":"4.0 out of 5 stars","reviewTitle":"Great value","reviewDate":"October 14, 2018","reviewText":"Only complaint is that it won't automatically turn off. Can't turn it on and go leave it while you get your drink ready."},{"reviewerName":"auntiepatch","rating":"5.0 out of 5 stars","reviewTitle":"Boil water faster than the microwave!","reviewDate":"January 22, 2019","reviewText":"I received one of these from Hamilton Beach in exchange for a review. It works so well, I bought one for my sister-in-law and one for my son. It boils water much faster than the microwave! I don't know how it does it, but the water is boiling before I can get my cup and tea bag ready. I love it and you will, too!"},{"reviewerName":"Doug","rating":"5.0 out of 5 stars","reviewTitle":"0:03:50--Three minutes, fifty seconds to boil","reviewDate":"June 28, 2019","reviewText":"Three minutes and 50 seconds is all this takes to get a liter of boiling-hot water. Actually, it takes about 20 seconds LESS to boil, but it boils for about those extra 20 seconds before shutting itself off. Works really well. Enjoy it every day for French-press coffee. Had it about a month now. I'm amazed enough to write a review, which I do rarely. Good value."},{"reviewerName":"RealDeal","rating":"5.0 out of 5 stars","reviewTitle":"Wow this is perfect!!","reviewDate":"October 30, 2018","reviewText":"I LOVE THIS! Its affordable and boils water very fast.\nIf your just heating water for a single cup, then only place a cup of water in there. It will come to a boil within a minute or 2. I love everything about it. No more microwaving cups, I always hated doing that."},{"reviewerName":"K.B.","rating":"5.0 out of 5 stars","reviewTitle":"Great purchase","reviewDate":"June 23, 2019","reviewText":"After having this awhile now, I'm happy to say it's still working great. Heats perfectly and quickly with no issue with the auto shut off. I make sure to clean it but some water spots on the base have been hard to avoid. Not worried about it though. Beats heating water on the stove."},{"reviewerName":"Sean Murphy","rating":"4.0 out of 5 stars","reviewTitle":"Works good, builds up on the bottom fast","reviewDate":"October 10, 2019","reviewText":"Been using this for a few months now and it has been pretty good, it heats up fast, and keeps the temp for a few minutes after if you are doing multiple cups or bowls. It does build up hard to remove stuff at the bottom quickly and it is not easy to clean it off. It looks really good though and I love the lights on it."},{"reviewerName":"Tailor","rating":"2.0 out of 5 stars","reviewTitle":"Very light weight","reviewDate":"September 9, 2019","reviewText":"This kettle feels like a toy. Do not like the plastic \"on and off switch\". Does not feel sturdy or solid. Was hoping that it would be like my previous Faberware kettle. However I needed a replacement asap. so this will do for now."},{"reviewerName":"SamT","rating":"5.0 out of 5 stars","reviewTitle":"Best item that I bought all year","reviewDate":"October 20, 2018","reviewText":"This is hands down the best item that I've bought all year. I prefer warm to hot drinking water. At first, I thought I would only use this for tea, but I use it just to heat up a regular glass of water. It's quick (boils within 2 minutes), easy and efficient. So far, the product has been durable and has ben used multiple times in a day. I would highly recommend."},{"reviewerName":"PattiB","rating":"5.0 out of 5 stars","reviewTitle":"Best purchase in years","reviewDate":"November 5, 2019","reviewText":"I'm not a tea drinker and so I never thought I would need an electric kettle. But since I don't have a microwave, I need boiled tap water to irrigate my sinuses a couple times a day. This kettle is a life saver and one of the best purchases I've made on Amazon in recent years."},{"reviewerName":"Elizabeth B","rating":"5.0 out of 5 stars","reviewTitle":"Works fast!","reviewDate":"February 21, 2019","reviewText":"Initially I was impressed by how quickly this boils water! Since we got it, I have used it many many times and I love it more and move everyday. It works great, is easy to maintain and easy to use. You have boiling water in about 2 minutes. It's fabulous!"},{"reviewerName":"Simon","rating":"5.0 out of 5 stars","reviewTitle":"Great Kettle. Worth the money","reviewDate":"February 26, 2019","reviewText":"I had been searching for a kettle on amazon for awhile, and I decided to buy this one since my sister has the same one and it worked very well. Some people might find it to be a little bit small for the amount of water it boils every time, but I think it works fine for me as I live by myself only. It boils water in less than 5 mins and it's easy to use. I'm satisfied with it."},{"reviewerName":"Kathy D.","rating":"3.0 out of 5 stars","reviewTitle":"Cover doesn't stay up.","reviewDate":"January 14, 2019","reviewText":"This heats nice & fast, I like the size (usually just for me) but the lid doesn't stay up when filling or cleaning. Pretty bothersome, as I use it often. If only using occasionally you won't really mind."},{"reviewerName":"Christopher Kindig","rating":"2.0 out of 5 stars","reviewTitle":"Build quality?","reviewDate":"November 8, 2019","reviewText":"So far the unit has worked great the only thing that I have an issue with is the handle, it is coming apart and the edges of the stainless steel are razor sharp. I will be removing the stainless steel strip from the handle as to prevent anyone in my home from being cut by it."},{"reviewerName":"Cam Hill","rating":"5.0 out of 5 stars","reviewTitle":"LOVE it, Fast,Neat blue lite indicates water hot. Glass & Metal","reviewDate":"September 23, 2019","reviewText":"Love it, does the job fast. Clear glass and stainless. Blue lite indicates water hot. Attractive . Seems durable. Had it a few months. It does have a very short cord that does allow much distance to an outlet."},{"reviewerName":"A. J. Amoury","rating":"5.0 out of 5 stars","reviewTitle":"Heats up VERY FAST.....Small, but POWERFUL","reviewDate":"September 9, 2019","reviewText":"Perfect size, i use this to make my baby bottles and it's much better than a stovetop kettle, as it allows for you the luxury of forgetting you put it on! It heats up super fast which is perfect."},{"reviewerName":"AMaines","rating":"5.0 out of 5 stars","reviewTitle":"nice pot, nice size.","reviewDate":"November 5, 2019","reviewText":"I chose this one because there's just me and my wife usually. The one liter is big enough. Most others are 1.7 liter.\nHeats very quickly, much faster than the gas range, less expensive, I'm sure."},{"reviewerName":"Kevin","rating":"5.0 out of 5 stars","reviewTitle":"Fast","reviewDate":"August 18, 2019","reviewText":"Works great! I'm sure it is faster than the microwave considering the volume of water it heats and it is definitely faster than the stove top or any coffee pot. I'm very happy with it so far."},{"reviewerName":"FW","rating":"5.0 out of 5 stars","reviewTitle":"Love the Hamilton Beach Glass Kettle - Life Changing","reviewDate":"December 14, 2018","reviewText":"Love the Hamilton Beach Glass Kettle. It's life changing :-) It heats-up water so fast, that I'm making tea a lot more often than I did before."},{"reviewerName":"alodhia","rating":"5.0 out of 5 stars","reviewTitle":"Effective product and nicely compact","reviewDate":"April 16, 2018","reviewText":"Works as expected but the benefit is it's smaller size. It doesn't take up too much counter space and the glass gives it a nice minimalist look."},{"reviewerName":"Leo","rating":"2.0 out of 5 stars","reviewTitle":"Doesn’t shut down automatically","reviewDate":"March 2, 2018","reviewText":"I like the construction of the pot and how’s it color while boiling but the system doesn’t shut it down automatically once the hot water reach the highest point . So you need to keep an eyes on it , if you don’t water will dry out"},{"reviewerName":"Tctne","rating":"5.0 out of 5 stars","reviewTitle":"Perfect","reviewDate":"August 22, 2018","reviewText":"Really like this kettle. If you remove the filter there is no plastic touching the water. The lid is plastic, however the max fill line is well below the top. Open to pour and you never touch the plastic with the hot water. Shuts off automatically when removed from base of once water boils."},{"reviewerName":"Big Cat","rating":"5.0 out of 5 stars","reviewTitle":"Great Kettle!","reviewDate":"April 8, 2018","reviewText":"Heats water quickly and has an auto shut-off. I have one for work and one for home. I like that it is clear, so you can see how much water you have left. If you use filtered water, water deposits don't build up."},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"LOVE IT","reviewDate":"February 28, 2019","reviewText":"I sized down from a too-heavy, too-big metal Breville electric teapot. Being alone and 80 yrs. young, I didn't need something industrial size! This little guy is perfect - and love those LED lights! Just the right size and not too heavy."},{"reviewerName":"Nicole J.","rating":"5.0 out of 5 stars","reviewTitle":"Great little","reviewDate":"August 26, 2018","reviewText":"Boils water quickly. Easy to use. I have not had any issues with rust as others mention. The instructions clearly state that there may be some discoloration on the bottom from the heating coils, and there are some faint spots, similar to what you might see on the bottom of your pan after cooking on an electric stove."},{"reviewerName":"JoLo","rating":"4.0 out of 5 stars","reviewTitle":"Looks cool, it’s real hot","reviewDate":"May 14, 2019","reviewText":"Have been wanting a kettle for some time and I really enjoy this one. It looks sleek and heats up fast. I’d recommend not letting it boil until it trips off if you don’t want to handle something that is extremely hot. You will feel the steam on your hand when you pour if you let it get to maximum temp. Cleaning is bit of challenge for me as I have large hands."},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Good quality","reviewDate":"August 18, 2019","reviewText":"This is a nice kettle. I actually thought it would be bigger, but that was my fault I didnt read the dimensions. I'm still very happy with my purchase, I've had this kettle over a month now and it gets the job done. Easy to clean and it looks good on my counter."},{"reviewerName":"A. Shafir","rating":"5.0 out of 5 stars","reviewTitle":"Hamilton Beach Compact Glass Kettle","reviewDate":"December 10, 2018","reviewText":"Tea Kettle light, transparent therefore easy to clean and fast heating. Has build in filter for heating water with adding any kind of flavors. Power cord is a little bit too short thus power outlet has to be closed by to use it."},{"reviewerName":"Amazon Customer","rating":"1.0 out of 5 stars","reviewTitle":"One Star","reviewDate":"January 19, 2018","reviewText":"Developed mold at the base after two months of proper use."},{"reviewerName":"Mose","rating":"5.0 out of 5 stars","reviewTitle":"Very valuable and efficent","reviewDate":"November 5, 2019","reviewText":"This does what is exactly suppose to do. Cost efficiency. Very fast heating and extremely easy to maintain. Perfect for any hot beverage especially tea."},{"reviewerName":"Robert Allocca","rating":"5.0 out of 5 stars","reviewTitle":"Beyond Expectations","reviewDate":"January 15, 2019","reviewText":"Accurate description. Boils 1 liter of water in 3-4 minutes, which is quicker than the microwave or stove kettle. Easy to clean, has a filter and the cover stays in place. Excellent purchase. I recommend this product."},{"reviewerName":"Audrah","rating":"4.0 out of 5 stars","reviewTitle":"Great kettle fast boiling water in 4 minutes","reviewDate":"August 23, 2019","reviewText":"I love this kettle, it boils water super fast. Much better than my old brand. I worry about the glass not being strong long term, but for now awesome!!"},{"reviewerName":"gem","rating":"5.0 out of 5 stars","reviewTitle":"Great kettle for boiling water fast","reviewDate":"November 29, 2018","reviewText":"I love this kettle so much, I bought a second one for my office. The blue light shows you when it's on. It boils water super fast- much faster than a traditional kettle on the stove. Easy to clean, love the glass decanter."},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Glass is best","reviewDate":"October 1, 2019","reviewText":"I use bottle water for my sinus rinse but still had a problem with chronic infection of both sinus and ears. I still use bottle water, but now I heat it up twice, let it cool and then use it. So far my doctor visits are just for checkups and not medication request. The glass was the true attraction."},{"reviewerName":"Dana","rating":"5.0 out of 5 stars","reviewTitle":"All around great kettle","reviewDate":"October 6, 2018","reviewText":"I decided to wait a good long time before I wrote a review so here I am. Kettle is a dream to use. I love being able to see when the water is boiling and the lovely blue light is an added bonus. I haven't one negative thing to say."},{"reviewerName":"litldill","rating":"4.0 out of 5 stars","reviewTitle":"Easy to use and store","reviewDate":"July 7, 2019","reviewText":"It's quite simple to use and stores easy. The 4 stars is really for the cord length and storage of cord looks like it won't last ling for someone who puts it away and uses 3 days per week."},{"reviewerName":"K. H","rating":"3.0 out of 5 stars","reviewTitle":"Three Stars","reviewDate":"July 25, 2018","reviewText":"Heavy, so if that is a concern, buyer accepted return t.you seller"},{"reviewerName":"Trevor Pool","rating":"5.0 out of 5 stars","reviewTitle":"Best electric kettle for the money","reviewDate":"March 21, 2019","reviewText":"Used this for about 6 months. We only put purified water in it and it has no hard water build up and no issues at all. We love it and use it multiple times a day. If you have an electric stove it is a must (IMO) and also cleaner than a kettle heated on a kettle."},{"reviewerName":"Cknits","rating":"5.0 out of 5 stars","reviewTitle":"Best hot water kettle on the market.","reviewDate":"July 14, 2018","reviewText":"The best hot water kettle I have tried. This was a gift and I have had the same one for four years without issue. It heats up super-fast (less than a minute), looks good (the blue light is awesome) and is easy to keep clean. Great price and amazing value."},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Perfect for morning tea","reviewDate":"January 3, 2019","reviewText":"I am very happy with the Hamilton Beach electric kettle. It works exactly as advertised, and is perfect for my use. It heats up water to the boiling point in under 2 minutes, and shuts off (safer and quieter than the microwave). No leaking or spitting water, and the LED blue light lets you know that the kettle has completely shut off. It's easy to fill and clean. I'm very happy with this purchase."},{"reviewerName":"Jason","rating":"5.0 out of 5 stars","reviewTitle":"Amazing","reviewDate":"February 4, 2019","reviewText":"Great, well made kettle. As a college student, this kettle sees a lot of use. I use it multiple times a day everyday, serves its purpose and is quick and easy to clean."},{"reviewerName":"Chalice Bailey","rating":"1.0 out of 5 stars","reviewTitle":"UNSAFE - doesn’t consistently turn off at boiling point","reviewDate":"April 3, 2019","reviewText":"Isn’t turning off when it comes to a boil and Hamilton Beach Has a very short return window so i’m stuck with an unsafe electronic appliance."},{"reviewerName":"CL","rating":"5.0 out of 5 stars","reviewTitle":"Faster than my gas stove!","reviewDate":"April 24, 2018","reviewText":"Love the smaller size of this. Most of the similar items are too big. And it's fast- I've got my tea water in half the time my gas stove takes.\n\nI don't understand the listed shipping time of 1-2 months. Mine arrived in 4 days."},{"reviewerName":"SANDRA TORREGROSA","rating":"5.0 out of 5 stars","reviewTitle":"Elegant and stylish!","reviewDate":"April 16, 2019","reviewText":"I purchased this glass kettle because I wanted a nice looking glass kettle for my kitchen. It’s very pretty, sturdy and only 1 liter. So it’s not too large, just right!"},{"reviewerName":"Tracey Fu","rating":"2.0 out of 5 stars","reviewTitle":"Broke in less than 2 months","reviewDate":"March 2, 2019","reviewText":"Worked well until it broke during the second month of owning it. Probably used it <10 times and just completed stopped working. Two stars because it did work at some point but clearly not very durable or reliable past a couple months."},{"reviewerName":"Rhiga37484","rating":"5.0 out of 5 stars","reviewTitle":"Great gift","reviewDate":"May 15, 2019","reviewText":"Like the title says, boils water super fast too. Super safe and user friendly. Awesome for tea drinkers like myself."},{"reviewerName":"Molly C. Ott","rating":"5.0 out of 5 stars","reviewTitle":"Perfect","reviewDate":"August 18, 2019","reviewText":"My husband said this the best purchase you ever made. Love it. Quick to heat water, perfect size for a counter top."},{"reviewerName":"NancyA","rating":"5.0 out of 5 stars","reviewTitle":"Love this","reviewDate":"October 29, 2018","reviewText":"The glass is sturdy, the blue light is kicky. This item gives me pleasure every day."},{"reviewerName":"ashley","rating":"2.0 out of 5 stars","reviewTitle":"Not the best. Sad.","reviewDate":"January 21, 2019","reviewText":"I like the convenience of the electric kettle and the size since I only use it for tea, however I have only had it for a week and it already started leaving white marks on the metal plate that heats the water up. (Pictures attached)"},{"reviewerName":"Kindle Customer","rating":"5.0 out of 5 stars","reviewTitle":"Best Kettle Ever!","reviewDate":"December 25, 2018","reviewText":"These are the best electric kettles. They are so easy to use and clean. They heat water super fast (I even use it to boil water for cooking because it's so much faster than the stove)!"},{"reviewerName":"T. King","rating":"5.0 out of 5 stars","reviewTitle":"perfect, small kettle","reviewDate":"January 15, 2019","reviewText":"this is the perfect size for 2 tea drinkers - 9.5 inches tall by 6 inches wide. Holds only 1 liter of water, not 7 cups like it says. heats up really fast - we LOVE it!"},{"reviewerName":"by2447","rating":"5.0 out of 5 stars","reviewTitle":"Nice kettle","reviewDate":"April 13, 2019","reviewText":"Looks nice and, doesn't use much counter space, and boil quickly. Being glass, it kind of disappears sitting on the counter because you can see through is."},{"reviewerName":"Heather","rating":"5.0 out of 5 stars","reviewTitle":"Worth taking up counter space","reviewDate":"April 14, 2019","reviewText":"Why didn’t I get this sooner? So much easier to use (and clean) than a traditional tea kettle. Highly recommend."},{"reviewerName":"Veronique (LOTUS.SPIRITCRAFTS)","rating":"5.0 out of 5 stars","reviewTitle":"I aboslutely love this teapot","reviewDate":"January 24, 2019","reviewText":"This kettle is a compact size, fits on your counter, heats of fast (although it gets a little loud) it is an awesome buy."},{"reviewerName":"Matthew Kenney","rating":"5.0 out of 5 stars","reviewTitle":"Beautiful electric kettle. Love it!","reviewDate":"September 29, 2019","reviewText":"This electric kettle is the best one I have purchased. Have to see how the durability does after a year."},{"reviewerName":"Ilkr Phydone","rating":"5.0 out of 5 stars","reviewTitle":"It is adorable Hamilton product","reviewDate":"February 16, 2018","reviewText":"It is adorable Hamilton product. Very good looking with blue light. Heating time is perfect, and it is a very safe product. I would recommend it"},{"reviewerName":"carelia","rating":"5.0 out of 5 stars","reviewTitle":"We love our kettle","reviewDate":"February 3, 2019","reviewText":"We've used it multiple times daily since we bought it (4 months ago) and it works great. The auto shut-off (turns itself off when the water boils) is a nice feature."},{"reviewerName":"Shawn W.","rating":"5.0 out of 5 stars","reviewTitle":"Just what I was looking for.","reviewDate":"November 12, 2019","reviewText":"I wanted something small, fast, and easy to clean. This fit the bill. I also like how it lights up on the bottom."},{"reviewerName":"Ulven","rating":"5.0 out of 5 stars","reviewTitle":"Fast","reviewDate":"October 22, 2019","reviewText":"So happy with my new kettle. Heats super fast and easy to use. The blue lights are just a bonus."},{"reviewerName":"Bridget DK","rating":"5.0 out of 5 stars","reviewTitle":"This hot pot makes me happy","reviewDate":"September 9, 2019","reviewText":"I drink a lot of tea and would not be without a good hotpot to heat my water. The size is just a bit smaller than my older pots, but makes more than enough for a couple of cups of tea, or water for my husband's larger French Press. This little friend is fast and the blue light is very pleasing. From time to time I clean with a little vinegar to remove deposits."},{"reviewerName":"Kuda E.","rating":"5.0 out of 5 stars","reviewTitle":"Hmilton Beach 1 Liter glass electric kettle","reviewDate":"November 7, 2019","reviewText":"I like the finish and performance of it . So far it works as described by the seller."},{"reviewerName":"Kaito","rating":"4.0 out of 5 stars","reviewTitle":"Convenience","reviewDate":"December 5, 2018","reviewText":"Certainly, I enjoy the blue LED light and the fact that it's small. However, the best key feature is the speed of heating the water. Since I live in a compact apartment, it's very convenient to pack it with me on the go since the cord wraps up under the plate of the kettle."},{"reviewerName":"Daniel Flemming","rating":"5.0 out of 5 stars","reviewTitle":"So far it's just great.","reviewDate":"February 9, 2019","reviewText":"I've only had this a week so I have no idea about durability. It's attractive, especially the blue LED and hearts water incredibly fast."},{"reviewerName":"X Y Zey","rating":"3.0 out of 5 stars","reviewTitle":"They say to empty all water after use to avoid mold. Annoying when your not used to doing..","reviewDate":"September 28, 2018","reviewText":"Love the Lite it's a bit heavy takes getting used to glass..."},{"reviewerName":"Ralph Nader","rating":"5.0 out of 5 stars","reviewTitle":"Best bang for the buck","reviewDate":"November 6, 2018","reviewText":"Good product excellent quality, looks reliable"},{"reviewerName":"Ann Kesel","rating":"4.0 out of 5 stars","reviewTitle":"The kettle boils the water quickly. It gets the job done!","reviewDate":"September 18, 2019","reviewText":"I love this electric kettle! It is exactly what I needed. I love the blue light that goes on when heating and shuts off when done."},{"reviewerName":"Jadyn Park","rating":"1.0 out of 5 stars","reviewTitle":"Does NOT work","reviewDate":"January 23, 2019","reviewText":"One star for fast delivery. As you can see, mine does not work. It’s been plugged for 10 minutes and I see no light whatsoever. The water is as cold as it was 10 minutes ago. I would like to ask for an exchange."},{"reviewerName":"Golfer","rating":"5.0 out of 5 stars","reviewTitle":"Lightening fast","reviewDate":"June 17, 2019","reviewText":"This pot is fantastic. Heat water very fast. The LED blue light lets you know it is heating. Easy to clean. Looks nice on the counter. No cons to this pot."},{"reviewerName":"NM Victoria","rating":"5.0 out of 5 stars","reviewTitle":"Great product","reviewDate":"October 27, 2019","reviewText":"Love it, looks great on the counter. Gets a little too hot but it’s fine"},{"reviewerName":"MIke","rating":"5.0 out of 5 stars","reviewTitle":"Love this pot. The blue LED lighting really helps its function, not just looks","reviewDate":"November 4, 2018","reviewText":"HIGHLY recommended. Fast efficient, and it filters water being pourd out, as if that matters...."},{"reviewerName":"paola","rating":"5.0 out of 5 stars","reviewTitle":"LOVE IT!!","reviewDate":"May 23, 2018","reviewText":"Love it. Part of my day to day. Its part of my family! Haha!! I bought this one because its small enough and NOT huge. I live in a tiny home \"literally\" so this works great for my space."},{"reviewerName":"Anna M.","rating":"5.0 out of 5 stars","reviewTitle":"Very efficient, temperature control and easy to use!!!","reviewDate":"March 14, 2019","reviewText":"I read reviews on this product before buying it. However like many other reviews there is pros and cons. Overall I must saw I really love this kettle pot! Heats up the water super afast and I like how it turns off once the temperature has been reached!! Highly recommend this kettle pot!!!!"},{"reviewerName":"Shoga","rating":"1.0 out of 5 stars","reviewTitle":"Faulty item - returned the product","reviewDate":"January 25, 2019","reviewText":"The product was defective: the switch did not work. I have returned the product."},{"reviewerName":"nmyopnyn","rating":"5.0 out of 5 stars","reviewTitle":"So Cool You’re Sorry When It’s Done","reviewDate":"November 10, 2018","reviewText":"Love this. Heats water so quickly and looks soo cool doing it that you’re sorry when it shuts off! Told my sister and she got one too. It really is amazing."},{"reviewerName":"Palm City Girl","rating":"5.0 out of 5 stars","reviewTitle":"FABULOUS!!!","reviewDate":"July 4, 2018","reviewText":"Absolutely love this tea pot. Heats the water so fast you can’t believe it. The blue lights look cool too. It’s so easy to use, my 88 y/o mother uses it. Definitely buy it!"},{"reviewerName":"Michael","rating":"4.0 out of 5 stars","reviewTitle":"Push the button, get hot water","reviewDate":"August 1, 2019","reviewText":"It boils water. My toddler loves the color. I like that I can see when its time to clean."},{"reviewerName":"Christopher Yaconiello","rating":"5.0 out of 5 stars","reviewTitle":"Hot water","reviewDate":"September 2, 2019","reviewText":"Heats up the he water quickly have had it for a couple months good for my French press"},{"reviewerName":"Pleb","rating":"5.0 out of 5 stars","reviewTitle":"Works! Small and simple to use.","reviewDate":"October 19, 2019","reviewText":"Nice, small, simple to use. And works. Turns off at the right time. Don't see much else to it otherwise."},{"reviewerName":"EmmaK","rating":"5.0 out of 5 stars","reviewTitle":"Love it!","reviewDate":"August 27, 2019","reviewText":"Great product! I’ve never owned one of these before but I think it works great. It quickly heats up water. Love it!"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"LOVE","reviewDate":"August 15, 2019","reviewText":"I've had this kettle for months now and I still love it. It is a breeze to clean with: one part vinegar to one part water and boil. As a plus, it looks nice displayed on the kitchen counter. =)"},{"reviewerName":"KGreen","rating":"1.0 out of 5 stars","reviewTitle":"died in two months","reviewDate":"April 24, 2019","reviewText":"Loved this when it worked. It died after about two months. It made a buzzing noise and quit. Out of stock so Hamilton Beach offered to let me choose an equal or less priced item but I must pay shipping and handling. After only two months."},{"reviewerName":"Maria13","rating":"5.0 out of 5 stars","reviewTitle":"Excellent tea pot.","reviewDate":"February 19, 2019","reviewText":"Love the blue light that keeps me aware the pot is on. Water boils quickly to just the right temperature. Highly recommend."},{"reviewerName":"Yuriko Shiguetomi","rating":"5.0 out of 5 stars","reviewTitle":"Great!!","reviewDate":"February 12, 2019","reviewText":"I loved it!! It is fast and It turns off when water boils!"},{"reviewerName":"Deborah S. Sussex","rating":"5.0 out of 5 stars","reviewTitle":"Its a gem","reviewDate":"September 10, 2019","reviewText":"Boils water for tea very fast. No annoying scare the cat whisrte"},{"reviewerName":"djs","rating":"5.0 out of 5 stars","reviewTitle":"Nice Kettle","reviewDate":"September 11, 2019","reviewText":"Fast and easy to use. I like this smaller 1 liter size."},{"reviewerName":"C. Price","rating":"5.0 out of 5 stars","reviewTitle":"Fast","reviewDate":"February 10, 2019","reviewText":"I use this daily as I am a tea drinker. It heats up fast and looks like new after months of use."},{"reviewerName":"Lia Laqua","rating":"5.0 out of 5 stars","reviewTitle":"Great product","reviewDate":"August 29, 2019","reviewText":"I am sorry I waited this long to get an electric kettle"},{"reviewerName":"Douglas J Paterson Sr.","rating":"5.0 out of 5 stars","reviewTitle":"Fast & stylish.","reviewDate":"April 17, 2019","reviewText":"This kettle looks wonderful on my kitchen counter and works as advertised."},{"reviewerName":"Delay","rating":"5.0 out of 5 stars","reviewTitle":"Good boiling kettle","reviewDate":"February 15, 2018","reviewText":"This glass kettle has been a great addition to the kitchen. It is designed to boil water. What can I say, besides it does its job quickly and without fuss? OK, the blue light is a nice touch."},{"reviewerName":"hannah schwab","rating":"5.0 out of 5 stars","reviewTitle":"A kitchen staple.","reviewDate":"August 19, 2019","reviewText":"I love this kettle. It cuts down boiling time for so many things."},{"reviewerName":"Bella19","rating":"5.0 out of 5 stars","reviewTitle":"Great kettle!","reviewDate":"January 19, 2019","reviewText":"I love this kettle. I bought 2, one for me and one for my daughter. I use it multiple times during the day."},{"reviewerName":"Alice","rating":"5.0 out of 5 stars","reviewTitle":"Nice looking, Glass kettle","reviewDate":"November 14, 2018","reviewText":"Bolą water really fast, is made from glass and looks cute with those Led lights. I've been using it two months now and I'm happy with it.\nThe only strange thing is that it is much bigger than 1 liter, but the max level is places in the middle."},{"reviewerName":"J.","rating":"5.0 out of 5 stars","reviewTitle":"Quick and quiet","reviewDate":"November 8, 2019","reviewText":"Quickly and quietly boils water!!"},{"reviewerName":"Nigel","rating":"5.0 out of 5 stars","reviewTitle":"Quality item","reviewDate":"March 28, 2019","reviewText":"Finally a well designed and well made item. Does what it is supposed to."},{"reviewerName":"vevette000","rating":"5.0 out of 5 stars","reviewTitle":"Very satisfied so far","reviewDate":"February 12, 2019","reviewText":"Easy to use, quickly boils water, came with no damage."},{"reviewerName":"Xiaoyu Bai","rating":"4.0 out of 5 stars","reviewTitle":"Switch automatically goes off before the water is heated.","reviewDate":"February 26, 2019","reviewText":"In general good quality. But the switch was hard to turn on after few weeks of using. I need to keep pressing down the switch to let the water boil. Otherwise the switch will just jump up and stop the kettle before the water was boiling."},{"reviewerName":"romance reader","rating":"4.0 out of 5 stars","reviewTitle":"It glows blue","reviewDate":"April 15, 2019","reviewText":"I love the electric kettle, it glows blue when turned on, my only problem is that it's only 1L, smaller than I expected. But it boils quickly."},{"reviewerName":"Joann Reyes","rating":"5.0 out of 5 stars","reviewTitle":"Great for the Office.","reviewDate":"May 8, 2019","reviewText":"I make tea every day and it heats up the water quick and automatically turns off when it's done boiled. Overall, great purchase."},{"reviewerName":"Boxer Mom","rating":"5.0 out of 5 stars","reviewTitle":"Love this small but mighty tea pot","reviewDate":"July 15, 2018","reviewText":"Love this small but mighty tea pot! Heats in minutes. By the time you get your loose tea out, the water is boiling! Great product."},{"reviewerName":"Daniela Emanuela","rating":"5.0 out of 5 stars","reviewTitle":"Love this item!!!","reviewDate":"February 10, 2019","reviewText":"This is my second one in the last 5 years. I actually purchased this one as a gift for a relative of mine bc I liked mine so much. Easy to use, easy to clean, and it looks great on the countertop as well. Great deal ! Great product."},{"reviewerName":"Martha","rating":"5.0 out of 5 stars","reviewTitle":"It's fun to watch water boil! LOL","reviewDate":"May 3, 2019","reviewText":"I love it! It's fast, beautiful and encourages me to drink more tea!"},{"reviewerName":"Kraig R Aaronson","rating":"5.0 out of 5 stars","reviewTitle":"👍","reviewDate":"July 9, 2019","reviewText":"I bought the 1 liter unit, but it realized I really wanted the 1.7 liter unit. I now have two, the smaller one is on a shelf. They work great. I had the old metal one before. The clear glass units are easier to see water levels and if there starting to boil."},{"reviewerName":"Debbie","rating":"5.0 out of 5 stars","reviewTitle":"Love","reviewDate":"January 31, 2019","reviewText":"I love this the water is hot and fast to got hot."},{"reviewerName":"Vera Rakier","rating":"5.0 out of 5 stars","reviewTitle":"It's fast, quiet and attractive on the counter","reviewDate":"April 1, 2019","reviewText":"This tea kettle is right in every way. Perfect for heating water for one or two cups of tea. The water boils in under three minutes, it's very quiet, fun to look at when the water bubbles while colored by the blue light. I love this kettle and recommend it."},{"reviewerName":"Fisherwoman","rating":"5.0 out of 5 stars","reviewTitle":"Quality product. Good value too","reviewDate":"July 13, 2019","reviewText":"Researched a great deal. This works well. Careful not to open lid with hot water inside. Very efficient. Easy to use."},{"reviewerName":"SCD","rating":"5.0 out of 5 stars","reviewTitle":"Fancy!","reviewDate":"November 9, 2019","reviewText":"Works great especially in an office environment"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Great investment","reviewDate":"April 30, 2019","reviewText":"Half my family is coffee lovers while other half is tea lovers so this products is a great medium for all of us. Whoever invented this is a genius 👍"},{"reviewerName":"Laura Byrd","rating":"5.0 out of 5 stars","reviewTitle":"Looks nice, works fast","reviewDate":"September 19, 2018","reviewText":"I like the glass - the water level is much easier to see than a tiny water level window on stainless steel."},{"reviewerName":"H Park","rating":"5.0 out of 5 stars","reviewTitle":"Boils water","reviewDate":"November 2, 2019","reviewText":"and it looks slick."},{"reviewerName":"T. Box","rating":"5.0 out of 5 stars","reviewTitle":"It hot! Very Hot!","reviewDate":"August 17, 2019","reviewText":"It hot! Very Hot!"},{"reviewerName":"bridget","rating":"5.0 out of 5 stars","reviewTitle":"Fast and easy","reviewDate":"February 28, 2019","reviewText":"Great way to heat water for my tea!\nSo fast and easy to use"},{"reviewerName":"Judson","rating":"5.0 out of 5 stars","reviewTitle":"Even boils while being watched!","reviewDate":"September 22, 2019","reviewText":"Hard to get excited about boiling water, but this makes it more exciting and is far faster than using a stove or a microwave."},{"reviewerName":"ShelterIslandJoe","rating":"5.0 out of 5 stars","reviewTitle":"Heats quickly","reviewDate":"October 11, 2019","reviewText":"Heats very quickly."},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Hot!","reviewDate":"January 26, 2019","reviewText":"Everything we wanted in an electric kettle and for a great price."},{"reviewerName":"Vickie M. Wright","rating":"3.0 out of 5 stars","reviewTitle":"HOT!","reviewDate":"August 26, 2019","reviewText":"Do Not Like How the Metal Has Particulars in the Bottom after use and wash."},{"reviewerName":"EllieK","rating":"5.0 out of 5 stars","reviewTitle":"Fantastic electric kettle! Very happy with purchase.","reviewDate":"December 2, 2017","reviewText":"Fantastic tea kettle. Exactly what I was looking for. Heats up water amazingly fast. I honestly couldn't be happier with this purchase. iIt's exactly what I was looking for."},{"reviewerName":"alleycat","rating":"5.0 out of 5 stars","reviewTitle":"sleek and fast","reviewDate":"June 11, 2019","reviewText":"Very nice small appliance.. It heats water very quickly for tea and coffee and it is an attractive addition to my countertop."},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Quick Boiling Water","reviewDate":"June 25, 2019","reviewText":"Very nice, boils water very quickly."},{"reviewerName":"drivendew","rating":"5.0 out of 5 stars","reviewTitle":"Tea","reviewDate":"September 18, 2018","reviewText":"Could be cheaper but it works as advertised."},{"reviewerName":"Megan","rating":"3.0 out of 5 stars","reviewTitle":"You can buy another brand I wish I had","reviewDate":"September 19, 2019","reviewText":"It’s alright"},{"reviewerName":"carolina","rating":"5.0 out of 5 stars","reviewTitle":"Perfect","reviewDate":"June 26, 2019","reviewText":"I love it. Easy to use, easy to clean, boiling water in seconds no spills"},{"reviewerName":"Bryce Burton","rating":"5.0 out of 5 stars","reviewTitle":"Amazing!","reviewDate":"January 5, 2019","reviewText":"Best kettle I have ever owned! This thing seriously takes less than 90 seconds to boil water. Love the blue lighting also!"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Excellent","reviewDate":"August 25, 2019","reviewText":"Excellent"},{"reviewerName":"woody","rating":"5.0 out of 5 stars","reviewTitle":"Outstanding","reviewDate":"April 16, 2019","reviewText":"Fast, Quick, Hot Hot Hot! No issues"},{"reviewerName":"Amazon Customer","rating":"1.0 out of 5 stars","reviewTitle":"started burning!","reviewDate":"October 22, 2019","reviewText":"My husband was making tea one night and we started to smell a strong burning rubber smell. The inside of the kettle was smoking/burning and the entire room smelled like chemicals. Seemingly very dangerous product as I have read other reviews such as this."},{"reviewerName":"Stargazerrw","rating":"5.0 out of 5 stars","reviewTitle":"Works wonderfully","reviewDate":"August 13, 2019","reviewText":"This works great, heats water quickly, and has an automatic shutoff that has saved me a few times. Really happy with this!"},{"reviewerName":"AwesomePossum","rating":"5.0 out of 5 stars","reviewTitle":"Pretty and functional","reviewDate":"April 17, 2019","reviewText":"Good water kettle. Does what it describes. The light is pretty. It didn't work at first when plugged in, but was fine after jiggling the switch a few times."},{"reviewerName":"kneenuh","rating":"5.0 out of 5 stars","reviewTitle":"Looks really nice. Would buy again","reviewDate":"January 31, 2018","reviewText":"Works really well, Looks really nice. Would buy again."},{"reviewerName":"Bonnie Rabbitt","rating":"5.0 out of 5 stars","reviewTitle":"Heats up quickly.","reviewDate":"April 27, 2018","reviewText":"First of all it looks great on our kitchen counter. The water heats up very fast and its lovely to watch. The size is just right for me (1 liter)."},{"reviewerName":"dianne h.","rating":"5.0 out of 5 stars","reviewTitle":"Quality and Price","reviewDate":"November 28, 2018","reviewText":"Great pot..exactly as described..heats almost instantly..highly reccomend."},{"reviewerName":"Fush","rating":"3.0 out of 5 stars","reviewTitle":"Good so far","reviewDate":"September 30, 2019","reviewText":"So far so good. Only have product for about 2 weeks and boils water super fast"},{"reviewerName":"Townedge","rating":"5.0 out of 5 stars","reviewTitle":"First one lastet three years, with heavy use.!","reviewDate":"April 2, 2019","reviewText":"Let's hope the new model will be equally great!"},{"reviewerName":"majesticgoldenrose","rating":"5.0 out of 5 stars","reviewTitle":"It's not full size","reviewDate":"September 20, 2018","reviewText":"This is the mini version!! That's why it costs less than the 1.7 L one."},{"reviewerName":"Mr fun","rating":"5.0 out of 5 stars","reviewTitle":"Heats water fast and stays hot","reviewDate":"August 29, 2019","reviewText":"Bought this for my daughter for her dorm room. She LOVES it!\n\nHeats water fast and stays hot."},{"reviewerName":"Eugess","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"December 31, 2017","reviewText":"Water boils super fast. Great product."},{"reviewerName":"T. Watson","rating":"4.0 out of 5 stars","reviewTitle":"Fast boil","reviewDate":"October 15, 2018","reviewText":"Works very quickly for my pre-morning commute."},{"reviewerName":"kms","rating":"5.0 out of 5 stars","reviewTitle":"Use it frequently!","reviewDate":"July 11, 2019","reviewText":"Easy to use...water heats up quickly."},{"reviewerName":"Nehama","rating":"5.0 out of 5 stars","reviewTitle":"Cumple su función","reviewDate":"March 28, 2019","reviewText":"Excelente producto"},{"reviewerName":"James B","rating":"5.0 out of 5 stars","reviewTitle":"Hot Water Fast!!","reviewDate":"October 29, 2018","reviewText":"This product produces hot water in less than 2 minutes. I no longer use the microwave to have hot water. Outstanding product!"},{"reviewerName":"Lan","rating":"5.0 out of 5 stars","reviewTitle":"I love it","reviewDate":"November 10, 2018","reviewText":"I love it"},{"reviewerName":"Amasong","rating":"5.0 out of 5 stars","reviewTitle":"Perfect","reviewDate":"May 15, 2019","reviewText":"Easy to use; attractive design."},{"reviewerName":"Jules98","rating":"5.0 out of 5 stars","reviewTitle":"Great product!","reviewDate":"February 12, 2019","reviewText":"I LOVE this kettle. My mom had one and I kept eyeing it. It heats up water without the stove being turned on and does so quickly. The water is HOT when it's done and I love how the water will stay warm enough for a second cup if I want."},{"reviewerName":"Monica","rating":"4.0 out of 5 stars","reviewTitle":"Happy with the clear glass see through","reviewDate":"October 23, 2018","reviewText":"Happy with the clear glass see through, but take a bit longer too boil than other steel kind..and better if the lid are not plastic ."},{"reviewerName":"Kali","rating":"5.0 out of 5 stars","reviewTitle":"It's a very good product","reviewDate":"March 24, 2019","reviewText":"This product is amazing. I use it for tea and to boil water for noodles quickly. So easy to use. Definetly worth it."},{"reviewerName":"Devoid","rating":"5.0 out of 5 stars","reviewTitle":"Nice","reviewDate":"March 25, 2019","reviewText":"It heats up the water pretty fast for you folks who are in a rush"},{"reviewerName":"Courtney","rating":"5.0 out of 5 stars","reviewTitle":"So quick!","reviewDate":"January 2, 2019","reviewText":"I’ve really been enjoying this product. I’ve been using it for roughly a week and I’ve had no problems. It produces boiling water so quickly. It seems to be very durable. Highly recommend!"},{"reviewerName":"praisehim","rating":"5.0 out of 5 stars","reviewTitle":"Love","reviewDate":"October 21, 2019","reviewText":"Bought for my mom she loves it and uses it everyday."},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Exceeded expectations","reviewDate":"January 4, 2019","reviewText":"Exceeded expectations. I use it in an office shared with multiple people and it has held up great through fairly heavy use. I would buy it again."},{"reviewerName":"Christina","rating":"5.0 out of 5 stars","reviewTitle":"Boyfriend Bought it and I yelled at him....","reviewDate":"December 16, 2018","reviewText":"BUT, Oh my god is this useful. Want Tea? HAVE TEA in 2 seconds. Want Hot cocoa? HAVE it 2 seconds. Need to heat up any type of liquid. BOOM do it. LOVE THIS THING. And it lights up too which is pretty cool. 10/10 would recommend."},{"reviewerName":"Grace S","rating":"5.0 out of 5 stars","reviewTitle":"Very good","reviewDate":"February 9, 2019","reviewText":"Very high quality! My husband love the light it make lol!"},{"reviewerName":"Deb","rating":"5.0 out of 5 stars","reviewTitle":"Bought when my Utilitea quit - this is a nice little pot and I like that I can see ...","reviewDate":"March 12, 2018","reviewText":"Bought when my Utilitea quit - this is a nice little pot and I like that I can see it with the lights!"},{"reviewerName":"Karla Ricks","rating":"5.0 out of 5 stars","reviewTitle":"Small apt.","reviewDate":"December 11, 2018","reviewText":"Just the right size for just me!"},{"reviewerName":"Jamee McCorison","rating":"5.0 out of 5 stars","reviewTitle":"Great product","reviewDate":"March 10, 2019","reviewText":"I live this product it is so pretty in my kitchen and works great! I love it!"},{"reviewerName":"Gabriela Franco","rating":"5.0 out of 5 stars","reviewTitle":"Yes we recommend","reviewDate":"May 28, 2019","reviewText":"Easy to use. Gets the water hot. My husband works out of state and takes this with him on all his trips."},{"reviewerName":"John & Michelle Turner","rating":"5.0 out of 5 stars","reviewTitle":"Love it","reviewDate":"August 13, 2019","reviewText":"Love it for tea throw a bag in hit the button and done make tea"},{"reviewerName":"Rony","rating":"5.0 out of 5 stars","reviewTitle":"Great Look.","reviewDate":"July 5, 2019","reviewText":"Awesome kettle."},{"reviewerName":"Hafez","rating":"5.0 out of 5 stars","reviewTitle":"Very good","reviewDate":"June 10, 2019","reviewText":"Very good"},{"reviewerName":"Ta","rating":"2.0 out of 5 stars","reviewTitle":"Shortlived","reviewDate":"June 14, 2019","reviewText":"Broke in three months"},{"reviewerName":"SM","rating":"5.0 out of 5 stars","reviewTitle":"Efficient, easy, small footprint on kitchen counter.","reviewDate":"November 10, 2019","reviewText":"This was everything it promised to be - an efficient, easy way to have one cup of tea or several."},{"reviewerName":"Midori Aoi","rating":"4.0 out of 5 stars","reviewTitle":"Very good product.","reviewDate":"November 27, 2017","reviewText":"I was very impressed with the 1.7 L stainless Hamilton Beach I got for my home, so I thought I would try this one for the office. It's pretty, it heats quickly, and it's much easier to see how much water is in it. The cover is a bit awkward, the switch goes down instead of up, like my other kettle, and the blue light is a bit annoying. Other than that, I'm very pleased with my first impression of my new kettle."},{"reviewerName":"Beatriz","rating":"5.0 out of 5 stars","reviewTitle":"Todo le funciona bien","reviewDate":"June 11, 2019","reviewText":"Llego en perfectas condiciones ,hermoso lo recomiendo con Los ojos cerrados."},{"reviewerName":"65DGW65","rating":"5.0 out of 5 stars","reviewTitle":"Fast","reviewDate":"December 14, 2018","reviewText":"Fast"},{"reviewerName":"Hillbilly.","rating":"5.0 out of 5 stars","reviewTitle":"The right size for one or two cups.","reviewDate":"November 2, 2019","reviewText":"Simple to use and entertaining😀"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Awesome","reviewDate":"November 6, 2019","reviewText":"It’s quick love it"},{"reviewerName":"Michele Clark","rating":"5.0 out of 5 stars","reviewTitle":"Compact","reviewDate":"October 5, 2018","reviewText":"Make boiling water very quickly"},{"reviewerName":"Vidavee","rating":"5.0 out of 5 stars","reviewTitle":"Perfect for the Office!","reviewDate":"October 18, 2019","reviewText":"This kettle is perfect for my office, it is small and the cord wraps into the base. It is quiet and reaches boiling point quickly. Definitely worth buying!"},{"reviewerName":"Sally","rating":"5.0 out of 5 stars","reviewTitle":"Great upgrade from a stovetop kettle","reviewDate":"June 30, 2019","reviewText":"I’ve had it for months and no issues. Works great, heats water FAST, not difficult to clean. The blue lights are a nice touch too. If you’ve used a stovetop kettle all your life like me this is such a great upgrade."},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Great addition to the kitchen","reviewDate":"September 8, 2018","reviewText":"We used this product for boiling water for teas, coffee and ramen. I wondered why I waited so long to invest in such great product"},{"reviewerName":"Shop-Smart","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"September 3, 2018","reviewText":"Glass is healthiest, imo."},{"reviewerName":"Aviichen","rating":"5.0 out of 5 stars","reviewTitle":"fast boiling water","reviewDate":"August 13, 2018","reviewText":"quick easy and dependable. boils water really fast. i use this thing almost every day and its holding up. i would recommend"},{"reviewerName":"Claire Spencer","rating":"5.0 out of 5 stars","reviewTitle":"Easy to use and very convenient.","reviewDate":"October 1, 2019","reviewText":"Well worth the money. I bought this as a gift for my mother and she loves how easy it is to clean and use. Heats up the water very quickly."},{"reviewerName":"Antonieta","rating":"5.0 out of 5 stars","reviewTitle":"very good","reviewDate":"June 3, 2019","reviewText":"I gave 5 Stars because is quite and faster. The design is representative. I have it in. y office and use every day for my tea"},{"reviewerName":"Kaylee Jensen","rating":"3.0 out of 5 stars","reviewTitle":"Love the blue light!","reviewDate":"November 8, 2019","reviewText":"For the price this kettle was wonderful. However, it doesn't always turn off automatically when comes to a boil causing a puddle on my countertop. Overall, it was a good price for what I got."},{"reviewerName":"Erin","rating":"5.0 out of 5 stars","reviewTitle":"Easy to use","reviewDate":"August 25, 2019","reviewText":"Perfect for making tea at home"},{"reviewerName":"Good Reviewer","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"July 26, 2018","reviewText":"Heats super fast and the blue color is cool"},{"reviewerName":"T. C. Brooks","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"May 12, 2018","reviewText":"Fast and easy. The blue LED looks cool"},{"reviewerName":"nolilyan4u","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"July 6, 2018","reviewText":"quickly boils water!"},{"reviewerName":"Veronica Chamberlin","rating":"5.0 out of 5 stars","reviewTitle":"A must for French Press coffee makers","reviewDate":"April 15, 2018","reviewText":"Brings to boil in less than a minute. An absolute must for anyone with a French Press coffee maker, or avid tea drinker. You can monitor the heat and switch off just prior to boil or let it go full boil. Clean design."},{"reviewerName":"Catie","rating":"5.0 out of 5 stars","reviewTitle":"Great!","reviewDate":"September 15, 2019","reviewText":"Totally worth the money! I don’t know how i ever used anything else."},{"reviewerName":"Charles Seguin","rating":"5.0 out of 5 stars","reviewTitle":"Had this thing for a couple years now, still works perfectly and looks like new","reviewDate":"July 16, 2019","reviewText":"great product"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Excellent in every way!","reviewDate":"September 14, 2018","reviewText":"Love it...its good looking and boils water super fast!"},{"reviewerName":"Molly Hernandez","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"February 9, 2018","reviewText":"Love the LED alight function and quick boiled water!"},{"reviewerName":"boltsfan52","rating":"5.0 out of 5 stars","reviewTitle":"Works","reviewDate":"November 12, 2018","reviewText":"Works"},{"reviewerName":"Nana Asamoah-Djan","rating":"5.0 out of 5 stars","reviewTitle":"Great","reviewDate":"October 28, 2019","reviewText":"Works great"},{"reviewerName":"Kenzie","rating":"5.0 out of 5 stars","reviewTitle":"Perfect for a small office. Love it","reviewDate":"October 9, 2019","reviewText":"Love this thing. Easy to use. Heats super fast. Looks cool too with the blue light. Great for my little office."},{"reviewerName":"Hooman","rating":"5.0 out of 5 stars","reviewTitle":"recommend it","reviewDate":"October 8, 2018","reviewText":"Works very well"},{"reviewerName":"kevin roberts","rating":"4.0 out of 5 stars","reviewTitle":"Good buy","reviewDate":"July 19, 2019","reviewText":"Good buy"},{"reviewerName":"paul detto","rating":"5.0 out of 5 stars","reviewTitle":"It boils water!","reviewDate":"October 8, 2019","reviewText":"Lights up and boils water in 3 minutes. Just what i wanted."},{"reviewerName":"delta tango","rating":"5.0 out of 5 stars","reviewTitle":"Magnificent!","reviewDate":"September 11, 2018","reviewText":"Magnificent!"},{"reviewerName":"Emily M.","rating":"5.0 out of 5 stars","reviewTitle":"Perfect","reviewDate":"May 2, 2019","reviewText":"I love this so much. The color and that it wraps at the bottom. It heats up the water so fast!"},{"reviewerName":"Karina K.","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"March 8, 2018","reviewText":"I really like it. And it boils the water quickly."},{"reviewerName":"Lena Jhao","rating":"5.0 out of 5 stars","reviewTitle":"Great Product","reviewDate":"October 9, 2018","reviewText":"Works really well"},{"reviewerName":"Daisha Gatoloai","rating":"5.0 out of 5 stars","reviewTitle":"Makes heating water so quick and convenient!","reviewDate":"July 29, 2019","reviewText":"Takes seconds to get hot water. No more waiting around for a pot on the stove or using a microwave. Easy to pour. Perfect kitchen accessory."},{"reviewerName":"abblase","rating":"4.0 out of 5 stars","reviewTitle":"Does the job","reviewDate":"September 18, 2019","reviewText":"Got this kettle for my office at work...it's a little louder than I had hoped, but heats water quickly and efficiently and the blue light is a nice touch."},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Perfect","reviewDate":"March 20, 2019","reviewText":"I will never use a stovetop top kettle again. This is so quick and easy to use. I love it!!!"},{"reviewerName":"Ann","rating":"5.0 out of 5 stars","reviewTitle":"Great Buy","reviewDate":"December 30, 2018","reviewText":"Great for hot water FAST!"},{"reviewerName":"Anna G","rating":"5.0 out of 5 stars","reviewTitle":"Great!","reviewDate":"September 10, 2019","reviewText":"I got this is a gift for my parents 3 years ago, and they still use it. It's small, and heats water very fast."},{"reviewerName":"Mahmoud Baker","rating":"5.0 out of 5 stars","reviewTitle":"Good","reviewDate":"July 12, 2019","reviewText":"Good"},{"reviewerName":"Rosa C. Fang","rating":"4.0 out of 5 stars","reviewTitle":"Great kettle for the size and price!","reviewDate":"May 2, 2019","reviewText":"Perfect size for me. Beautiful blue lights, heats water quickly.\nThe only complain is that the sprout drips a little."},{"reviewerName":"Laura Sibley","rating":"5.0 out of 5 stars","reviewTitle":"As advertised.","reviewDate":"September 2, 2019","reviewText":"Good for one person"},{"reviewerName":"LB","rating":"3.0 out of 5 stars","reviewTitle":"Rust quickly","reviewDate":"November 21, 2018","reviewText":"The quality is poor. The bottom has started to rust."},{"reviewerName":"Patricia Bexfield","rating":"5.0 out of 5 stars","reviewTitle":"Good deal","reviewDate":"September 26, 2019","reviewText":"A great product that is definitely worth buying."},{"reviewerName":"Henadz Zhyzneuski","rating":"5.0 out of 5 stars","reviewTitle":"Great buy","reviewDate":"October 3, 2018","reviewText":"Cheap fast boiling kettle"},{"reviewerName":"H.C.","rating":"5.0 out of 5 stars","reviewTitle":"Works as intended.","reviewDate":"June 2, 2019","reviewText":"Works just fine to heat water for coffee."},{"reviewerName":"Sonia Magwood","rating":"5.0 out of 5 stars","reviewTitle":"Excellent product","reviewDate":"November 8, 2018","reviewText":"A must have. I use every day. Bought this as a gift for my sis."},{"reviewerName":"Rob","rating":"5.0 out of 5 stars","reviewTitle":"Very Cool","reviewDate":"October 10, 2018","reviewText":"Excellent product with minimum counter space required"},{"reviewerName":"Brooklyn Bermel","rating":"5.0 out of 5 stars","reviewTitle":"great deal","reviewDate":"September 11, 2019","reviewText":"I take this things while traveling and it is suoer helpful when making coffee! heats up really fast!"},{"reviewerName":"joanie kiser","rating":"1.0 out of 5 stars","reviewTitle":"Leaking after 6 months","reviewDate":"September 5, 2019","reviewText":"I really liked the smaller size of this electric tea kettle. It was lighter weight and and easier to pour. But after 6 months\nit is in the trash can do to a leak."},{"reviewerName":"CLIFFORD D.","rating":"5.0 out of 5 stars","reviewTitle":"Stylish and worth it","reviewDate":"October 16, 2019","reviewText":"My wife loves her kettle. She uses it mostly for tea and preparing our daughters water for the formula bottles."},{"reviewerName":"Rosa Cordero","rating":"5.0 out of 5 stars","reviewTitle":"Excelente","reviewDate":"February 25, 2019","reviewText":"Es muy rápida, es de cristal, no me gusta el metal y es súper bonita."},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Great kettle, great price.","reviewDate":"October 12, 2019","reviewText":"It beats the expensive Cuisinart kettle I previously had by far. Boils quickly, shuts off when done, and I like the glass kettle rather than the metal one. I love it."},{"reviewerName":"amanda saez","rating":"4.0 out of 5 stars","reviewTitle":"Four Stars","reviewDate":"March 16, 2018","reviewText":"Great electric kettle! Heats up extremely fast!"},{"reviewerName":"Dawn CW","rating":"2.0 out of 5 stars","reviewTitle":"Missing mesh filter.","reviewDate":"February 8, 2019","reviewText":"Received it in timely. Unboxed it and everything works, however it is missing the mesh filter. Disappointing."},{"reviewerName":"kb","rating":"5.0 out of 5 stars","reviewTitle":"One of our favorite appliances","reviewDate":"February 12, 2019","reviewText":"This is the third one we've bought for ourself and one for each child's family. It's useful and dependable."},{"reviewerName":"TN Guy","rating":"5.0 out of 5 stars","reviewTitle":"Quick boil","reviewDate":"December 28, 2018","reviewText":"Just what we needed to boil water quickly. It takes less than 2 minutes to boil 1 liter. It looks nice too,"},{"reviewerName":"Diane Williams","rating":"5.0 out of 5 stars","reviewTitle":"I don’t miss the kettle on the stove","reviewDate":"September 18, 2018","reviewText":"I love it and it does not take up on my counter. The blue lighting is awesome. I do not miss the kettle on my stove."},{"reviewerName":"Frederico C.","rating":"1.0 out of 5 stars","reviewTitle":"Not worth.","reviewDate":"March 16, 2019","reviewText":"It broke with 3 month of used."},{"reviewerName":"Joe Piria","rating":"5.0 out of 5 stars","reviewTitle":"Heats water fast","reviewDate":"June 30, 2019","reviewText":"Works as advertised"},{"reviewerName":"LizH.","rating":"1.0 out of 5 stars","reviewTitle":"Broke","reviewDate":"February 10, 2019","reviewText":"I liked it until it broke after a month. The plastic filter broke off in pieces from the water heating."},{"reviewerName":"Maureen Gardiner","rating":"5.0 out of 5 stars","reviewTitle":"Perfect...","reviewDate":"October 4, 2018","reviewText":"it is just perfect !"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Great Kettle","reviewDate":"October 14, 2018","reviewText":"Heats quickly, auto shut off, clean and attractive design."},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"bright blue kettle when heating is really nice","reviewDate":"February 6, 2019","reviewText":"I like the fact that it heats faster then kettle on stove, safe and water just as hot."},{"reviewerName":"Maryann Coy","rating":"5.0 out of 5 stars","reviewTitle":"Fast","reviewDate":"January 31, 2019","reviewText":"Great for very fast hot water."},{"reviewerName":"Yane","rating":"5.0 out of 5 stars","reviewTitle":"Awesome, I already bought 4","reviewDate":"March 1, 2019","reviewText":"I love it and everybody also. I already bought for my mom, and 2 sisters in law and the first one for me 2 years ago. I really like it stop automatically."},{"reviewerName":"mannydee","rating":"5.0 out of 5 stars","reviewTitle":"Quick and easy","reviewDate":"June 28, 2019","reviewText":"Love it"},{"reviewerName":"anth prof","rating":"5.0 out of 5 stars","reviewTitle":"Works great and I like the aesthetics of the blue light","reviewDate":"January 28, 2018","reviewText":"This was just what I was looking for. Works great and I like the aesthetics of the blue light."},{"reviewerName":"Natalie","rating":"4.0 out of 5 stars","reviewTitle":"Great for the price","reviewDate":"May 3, 2019","reviewText":"After second day I noticed small white dots on the heating element"},{"reviewerName":"brenda Medeiros","rating":"5.0 out of 5 stars","reviewTitle":"non submerge glass pot","reviewDate":"September 4, 2019","reviewText":"Love it"},{"reviewerName":"Lori G.","rating":"5.0 out of 5 stars","reviewTitle":"Quick boil - very efficient","reviewDate":"October 11, 2019","reviewText":"I have been using the kettle for a quick cup of tea and the water boils amazingly fast."},{"reviewerName":"James D. Rodgers","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"March 25, 2018","reviewText":"Excellent quality very well-made very please with purchase works great"},{"reviewerName":"Judith Johnson","rating":"5.0 out of 5 stars","reviewTitle":"quick boiling time & I like the blue light when in use so I know when it is working.","reviewDate":"October 19, 2019","reviewText":"Use for boiling water for tea etc. Quick, easy & like the blue light. Would buy again"},{"reviewerName":"alicia fronczak","rating":"5.0 out of 5 stars","reviewTitle":"Love this!","reviewDate":"July 7, 2019","reviewText":"Boils water fast!"},{"reviewerName":"friend4v","rating":"5.0 out of 5 stars","reviewTitle":"I’d buy it again if needed to","reviewDate":"October 14, 2019","reviewText":"Works great"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"It just works!!","reviewDate":"October 28, 2019","reviewText":"Best pot I have ever had it does what the adds said it would do i love it\nWhats bad, I use it so much I have to go buy more tea bags"},{"reviewerName":"Amazon Customer","rating":"3.0 out of 5 stars","reviewTitle":"LED lights stopped working","reviewDate":"December 30, 2018","reviewText":"Nice product. Boils water well. LED lights worked well for about 2 weeks, now they flicker or don't work"},{"reviewerName":"Amazon Customer","rating":"1.0 out of 5 stars","reviewTitle":"DON’T BUY IT!!!","reviewDate":"August 10, 2019","reviewText":"The boiler does not stop boiling by itself. And it broken itself after evaporating all water out.\nDON’T BUY IT!!!!!!"},{"reviewerName":"Patricia Dudding","rating":"5.0 out of 5 stars","reviewTitle":"Great product. Great design.","reviewDate":"March 3, 2019","reviewText":"Love it!"},{"reviewerName":"Nabeelah Abdul-Ghafur","rating":"1.0 out of 5 stars","reviewTitle":"The lever does not work. Need to return kettle for one that works.","reviewDate":"March 7, 2019","reviewText":"The kettle lever that warms then boils the water, malfunctions: does not stay down. I need to return it for a fully functioning kettle."},{"reviewerName":"Earle W Christman","rating":"5.0 out of 5 stars","reviewTitle":"Love it!","reviewDate":"July 8, 2019","reviewText":"Excellent product!"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"The best!","reviewDate":"February 28, 2019","reviewText":"Got this because my sister had one, love it and recomend it to all my friends!"},{"reviewerName":"Alan Hyde","rating":"4.0 out of 5 stars","reviewTitle":"love it","reviewDate":"November 16, 2018","reviewText":"works great, heats up fast"},{"reviewerName":"Dafani19","rating":"5.0 out of 5 stars","reviewTitle":"Love it","reviewDate":"April 11, 2019","reviewText":"Love it"},{"reviewerName":"Earl S.","rating":"5.0 out of 5 stars","reviewTitle":"Love this kettle","reviewDate":"March 22, 2019","reviewText":"Quickly and safely boils water without taking up too much counter space."},{"reviewerName":"Ryan Moeskau","rating":"5.0 out of 5 stars","reviewTitle":"The future is now!","reviewDate":"October 2, 2018","reviewText":"I didn’t know it lit up! But it’s super easy. Water in, flip the switch, boiling water out."},{"reviewerName":"Amazon Customer","rating":"1.0 out of 5 stars","reviewTitle":"Don’t buy","reviewDate":"January 24, 2019","reviewText":"It leaks. The blue light is nice and all, but it leaks. It lacks the fundamental function it needs. So disappointed."},{"reviewerName":"Jessie","rating":"5.0 out of 5 stars","reviewTitle":"Good quality","reviewDate":"April 6, 2019","reviewText":"This works so quick and easy! Definitely would buy for a gift for a housewarming too!"},{"reviewerName":"shawnny","rating":"5.0 out of 5 stars","reviewTitle":"Great.","reviewDate":"May 30, 2019","reviewText":"Boils fast. Easy to use. Cordless is great"},{"reviewerName":"Kim K.","rating":"5.0 out of 5 stars","reviewTitle":"Amazing!","reviewDate":"March 20, 2019","reviewText":"Love this for making tea and oatmeal easily. Boils in less than a minute and easy to clean."},{"reviewerName":"Afsana","rating":"5.0 out of 5 stars","reviewTitle":"Not too big and works well","reviewDate":"March 23, 2019","reviewText":"Works great!"},{"reviewerName":"George Chkheidze","rating":"5.0 out of 5 stars","reviewTitle":"Looks great","reviewDate":"February 2, 2019","reviewText":"Great pot boils fast and looks great too"},{"reviewerName":"Mila Miller","rating":"5.0 out of 5 stars","reviewTitle":"Good product","reviewDate":"October 4, 2018","reviewText":"Looks fancy. I like blue light on the bottom"},{"reviewerName":"JohnC","rating":"5.0 out of 5 stars","reviewTitle":"Excellent water heater","reviewDate":"August 13, 2019","reviewText":"Works as it should. Quickly boils water and always shuts off automatically after coming to a full boil."},{"reviewerName":"donna","rating":"5.0 out of 5 stars","reviewTitle":"Fantastic!","reviewDate":"December 28, 2018","reviewText":"The water is boiled so fast! I don't know why I didn't get this a long time ago. Love, love love it!"},{"reviewerName":"F.H.","rating":"5.0 out of 5 stars","reviewTitle":"AWESOME Kettle","reviewDate":"October 7, 2019","reviewText":"This hot water kettle is awesome!! You have hot water in less than 5 minutes. AMAZING!"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Tea and cocoa made simple!","reviewDate":"August 3, 2019","reviewText":"We liked this so much, we bought another as a gift!! Quick and easy for tea and cocoa!"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Arrived on time and all in one piece.","reviewDate":"November 19, 2018","reviewText":"So efficient and boils so fast. Easy to clean so glad I bought this kettle. Plus looks great on my counter."},{"reviewerName":"Stephanie","rating":"5.0 out of 5 stars","reviewTitle":"Works great","reviewDate":"November 27, 2018","reviewText":"Easy to use and works great"},{"reviewerName":"Alyce Albert","rating":"5.0 out of 5 stars","reviewTitle":"Works fast and great","reviewDate":"September 5, 2019","reviewText":"Love it!"},{"reviewerName":"Donna","rating":"5.0 out of 5 stars","reviewTitle":"This might be my favorite thing I ever bought!","reviewDate":"August 16, 2019","reviewText":"This is so awesome! Heats up water for my hot tea in just 2 minutes!!"},{"reviewerName":"Blank","rating":"5.0 out of 5 stars","reviewTitle":"Love it","reviewDate":"August 28, 2019","reviewText":"Great product. Love the clean look, and the blue light."},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"It’s eazy to use.. can’t comment on durability or easy to clean yet..","reviewDate":"February 20, 2019","reviewText":"It’s exactly what I was looking for.. perfect size for one person.."},{"reviewerName":"Lisa Lamontagne","rating":"5.0 out of 5 stars","reviewTitle":"Awesome product","reviewDate":"November 5, 2019","reviewText":"Heats up quick. Great buy."},{"reviewerName":"Annie Vega","rating":"5.0 out of 5 stars","reviewTitle":"the perfect size I love it","reviewDate":"October 8, 2019","reviewText":"the perfect size I love it"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"la. prontitud de calentar el agua","reviewDate":"April 9, 2019","reviewText":"Me encanto el color azul que se refleja en el agua"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Cool","reviewDate":"November 10, 2019","reviewText":"Looks very cool and works perfectly for out needs"},{"reviewerName":"Annie Hua","rating":"5.0 out of 5 stars","reviewTitle":"Quick electric kettle","reviewDate":"October 27, 2019","reviewText":"Love this kettle! Boils the water within seconds!"},{"reviewerName":"Amazon Customer","rating":"2.0 out of 5 stars","reviewTitle":"Two Stars","reviewDate":"May 3, 2018","reviewText":"This plastic thing around inside stinks"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Blue led lights","reviewDate":"April 3, 2019","reviewText":"Love how quickly it heats water. As a tea lover, I am happy."},{"reviewerName":"Michele K.","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"December 9, 2018","reviewText":"Faster than a kettle for sure!"},{"reviewerName":"Dianne","rating":"5.0 out of 5 stars","reviewTitle":"Great product","reviewDate":"June 18, 2019","reviewText":"Love it!"},{"reviewerName":"robert l owens","rating":"2.0 out of 5 stars","reviewTitle":"Heats but not boils","reviewDate":"October 31, 2018","reviewText":"The pot heated water but not to a boil. The thermocouple seemed to cut off the heat prematruely."},{"reviewerName":"LC","rating":"5.0 out of 5 stars","reviewTitle":"Great buy","reviewDate":"September 30, 2019","reviewText":"Great value. I use it in my office for coffee and tea. Love it!"},{"reviewerName":"U. K","rating":"5.0 out of 5 stars","reviewTitle":"Super useful","reviewDate":"October 13, 2018","reviewText":"Use it multiple times a day"},{"reviewerName":"Yuan","rating":"5.0 out of 5 stars","reviewTitle":"recommend","reviewDate":"October 13, 2019","reviewText":"boil water very quick easy to use"},{"reviewerName":"Taylor","rating":"5.0 out of 5 stars","reviewTitle":"Pro","reviewDate":"July 5, 2019","reviewText":"This boils in less than 1 minute!"},{"reviewerName":"Xiao","rating":"5.0 out of 5 stars","reviewTitle":"Absolutely what I want","reviewDate":"September 5, 2019","reviewText":"Small size and delicate. Performs so well that it doesn’t make too much noise when using"},{"reviewerName":"Sue M.","rating":"5.0 out of 5 stars","reviewTitle":"Fastest way to boil water","reviewDate":"July 5, 2019","reviewText":"This kettle heats water incredibly fast! I highly recommend this kettle."},{"reviewerName":"Elayne P. Brown","rating":"4.0 out of 5 stars","reviewTitle":"Heats the water very quickly","reviewDate":"February 4, 2019","reviewText":"love it! I use it for hot tea all the time and instant soups, oatmeal, etc."},{"reviewerName":"pamela","rating":"5.0 out of 5 stars","reviewTitle":"Heats fast","reviewDate":"October 25, 2018","reviewText":"Love it"},{"reviewerName":"Kindle Customer","rating":"5.0 out of 5 stars","reviewTitle":"Great purchase","reviewDate":"September 22, 2018","reviewText":"Love this item"},{"reviewerName":"Pam Vienneau","rating":"5.0 out of 5 stars","reviewTitle":"Fast","reviewDate":"October 17, 2019","reviewText":"Love this! Heats up water so fast for my French press coffee or tea."},{"reviewerName":"Sarah Balley","rating":"5.0 out of 5 stars","reviewTitle":"✅","reviewDate":"August 24, 2019","reviewText":"✅"},{"reviewerName":"Scott M.","rating":"5.0 out of 5 stars","reviewTitle":"Boils water, looks good","reviewDate":"September 9, 2019","reviewText":"Boils water, looks good"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Great product","reviewDate":"January 23, 2019","reviewText":"It was a gift to my mother and she absolutely loved it."},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Easy use","reviewDate":"May 21, 2019","reviewText":"Easy use"},{"reviewerName":"Broderick McElroy","rating":"5.0 out of 5 stars","reviewTitle":"Great purchase","reviewDate":"September 24, 2018","reviewText":"quick, easy and it’s perfect for what I bought it for; boil water!!"},{"reviewerName":"Lori Bean","rating":"5.0 out of 5 stars","reviewTitle":"love it","reviewDate":"July 30, 2019","reviewText":"I love how fast and safe it is and the blue light is a plus."},{"reviewerName":"Peter G.","rating":"5.0 out of 5 stars","reviewTitle":"Best electric kettle ever!","reviewDate":"March 2, 2019","reviewText":"Easy to use-add water and plug in. In a few minutes it will be tea time!"},{"reviewerName":"Pavel Mogilevsky","rating":"5.0 out of 5 stars","reviewTitle":"Durable","reviewDate":"February 14, 2019","reviewText":"Nice"},{"reviewerName":"Peter from Maryland","rating":"5.0 out of 5 stars","reviewTitle":"As Advertised","reviewDate":"November 6, 2019","reviewText":"So easy and efficent. Love it."},{"reviewerName":"Tomasa Nathan","rating":"5.0 out of 5 stars","reviewTitle":"Very easy to use","reviewDate":"July 14, 2019","reviewText":"I really enjoy this pot, I also bought one for my friend."},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Tea lover!!","reviewDate":"October 10, 2018","reviewText":"Love making my tea in under a minute. Thanks"},{"reviewerName":"Byron Day","rating":"4.0 out of 5 stars","reviewTitle":"boils fast , simple to use.","reviewDate":"November 1, 2019","reviewText":"Product works great, good size, faster then stove top."},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"July 4, 2018","reviewText":"Great... AAA +++"},{"reviewerName":"HM","rating":"4.0 out of 5 stars","reviewTitle":"It is waht I need","reviewDate":"October 2, 2019","reviewText":"Quick to boil the water."},{"reviewerName":"Sarah","rating":"5.0 out of 5 stars","reviewTitle":"It's convenient and pretty!!","reviewDate":"February 3, 2019","reviewText":"Easy to use but difficult to clean and dry out."},{"reviewerName":"Diane Warner","rating":"5.0 out of 5 stars","reviewTitle":"It very simple to use","reviewDate":"August 20, 2019","reviewText":"I like how fast it warms my water"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Easy to use.","reviewDate":"November 16, 2018","reviewText":"The blue lights are a nice touch. Heats water quickly."},{"reviewerName":"RicoDoodle","rating":"4.0 out of 5 stars","reviewTitle":"Looks neat and it works","reviewDate":"February 26, 2019","reviewText":"Pretty good for this price."},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Love it!","reviewDate":"November 19, 2018","reviewText":"Love this! It really does great the water fast!"},{"reviewerName":"Yooja kim","rating":"5.0 out of 5 stars","reviewTitle":"Easy to use","reviewDate":"November 1, 2018","reviewText":"Very fast make hot water"},{"reviewerName":"Carlos","rating":"5.0 out of 5 stars","reviewTitle":"Great deal","reviewDate":"February 27, 2019","reviewText":"Great appliance."},{"reviewerName":"Belinda Firth","rating":"1.0 out of 5 stars","reviewTitle":"Won't last.","reviewDate":"September 2, 2019","reviewText":"Haven't had a year and it's already broken."},{"reviewerName":"Fri3ndlyman","rating":"5.0 out of 5 stars","reviewTitle":"We like it...!","reviewDate":"April 8, 2019","reviewText":"Love it. So far no regrets."},{"reviewerName":"Hubert Matysiak","rating":"4.0 out of 5 stars","reviewTitle":"Great item","reviewDate":"November 24, 2018","reviewText":"Amazing product. Much better than previous one"},{"reviewerName":"Heather L Davis","rating":"4.0 out of 5 stars","reviewTitle":"Great product","reviewDate":"September 15, 2019","reviewText":"Easy to use"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Good product","reviewDate":"January 16, 2019","reviewText":"I like it"},{"reviewerName":"BrodyandTitan","rating":"5.0 out of 5 stars","reviewTitle":"Looks nice and works well.","reviewDate":"November 3, 2019","reviewText":"Looks nice and works well."},{"reviewerName":"Gail Jaggers","rating":"5.0 out of 5 stars","reviewTitle":"Great transaction","reviewDate":"November 10, 2019","reviewText":"Works great"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Hamilton","reviewDate":"June 11, 2019","reviewText":"So happy with my compact"},{"reviewerName":"Amazon Customer","rating":"1.0 out of 5 stars","reviewTitle":"the plastic top smells and tastes like chemicals","reviewDate":"September 12, 2018","reviewText":"Was looking for a healthy alternative to plastic. However has got the bad plastic top and smells like chemicals when you use it therefore very unhealthy."},{"reviewerName":"Meng","rating":"5.0 out of 5 stars","reviewTitle":"Worth it","reviewDate":"October 23, 2019","reviewText":"Great."},{"reviewerName":"Omar","rating":"5.0 out of 5 stars","reviewTitle":"Works great","reviewDate":"May 26, 2019","reviewText":"No problems"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Genial","reviewDate":"July 4, 2019","reviewText":"Stasuper"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Works great looks great.","reviewDate":"November 19, 2017","reviewText":"This is a great small kettle. And it's pretty."},{"reviewerName":"Samantha Cash-Melcher","rating":"5.0 out of 5 stars","reviewTitle":"👍🏼","reviewDate":"November 7, 2019","reviewText":"👍🏼"},{"reviewerName":"Katharine A Bergman","rating":"5.0 out of 5 stars","reviewTitle":"awesome","reviewDate":"August 15, 2018","reviewText":"great product"},{"reviewerName":"Sandy","rating":"5.0 out of 5 stars","reviewTitle":"Great product for the office!","reviewDate":"February 5, 2018","reviewText":"Bought this for the office and we use it everyday. Heats very quickly."},{"reviewerName":"Mary Stair Andrews","rating":"5.0 out of 5 stars","reviewTitle":"Aesthetically pleasing but so functional","reviewDate":"August 29, 2018","reviewText":"It heats the water very quickly"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Exelentw producto","reviewDate":"October 18, 2018","reviewText":"Es perfecta"},{"reviewerName":"Westin James Nelson","rating":"5.0 out of 5 stars","reviewTitle":"Great","reviewDate":"April 14, 2019","reviewText":"Great product"},{"reviewerName":"ming chen","rating":"5.0 out of 5 stars","reviewTitle":"good","reviewDate":"August 27, 2018","reviewText":"good"},{"reviewerName":"Marilyn Hoisington","rating":"5.0 out of 5 stars","reviewTitle":"A good product which I like very much!","reviewDate":"March 8, 2018","reviewText":"I had one of these before this one. The lid broke after a year or so. I liked it a lot so decided to get another one. My old one was bigger and I thought the smaller one would be the right size. Now I wish I'd gotten the bigger one. This is a good product and brings so many nice comments with the blue lights."},{"reviewerName":"Anthony","rating":"1.0 out of 5 stars","reviewTitle":"Power plug does not fit into standard socket","reviewDate":"August 6, 2018","reviewText":"I've purchased and now will return 2 of these after both of them had power plugs that would not fit into my sockets. It's so sad they messed up quite a simple thing."},{"reviewerName":"Noelina Nakiguli","rating":"1.0 out of 5 stars","reviewTitle":"Faulty item.","reviewDate":"February 16, 2018","reviewText":"Kettle doesn't turn on."},{"reviewerName":"melissa","rating":"3.0 out of 5 stars","reviewTitle":"pretty small and if you don't make certain the top ...","reviewDate":"January 16, 2018","reviewText":"pretty small and if you don't make certain the top is closed it will burn you when you pour the water."},{"reviewerName":"ResearchingMom","rating":"4.0 out of 5 stars","reviewTitle":"Good kettle but not the only choice","reviewDate":"September 14, 2017","reviewText":"I don't know why they call it compact as it takes up about as much room as my Ovente KG83B Glass Electric Kettle, 1.5-L which I've loved, and is cheaper than this, and the bottom plate of my Ivation Precision-Temperature Electric Hot Water Tea Kettle Pot 1.7 Liter is only a little larger at the corners, only a little more expensive and has temperature settings, which I now don't want to be without.\nThis kettle will only heat 1/2 liter to 1 liter max.\nLove the glass and blue lights. Don't love the strong plastic smell, which hopefully is just from the lid and not in the water.\nThe \"pinch\" lid opener is OK, the switch is right out there at the bottom of the handle and accessible.\nIt boiled 1/2 liter of water at 2 minutes and 17 seconds in my test, and kept a rolling boil until it cut off at 2 minutes 42 seconds. This time was approximately equal to my Ivation."},{"reviewerName":"Shannon Nybakken","rating":"5.0 out of 5 stars","reviewTitle":"One of my all time best purchases","reviewDate":"January 22, 2019","reviewText":"I've had my kettle for about 3 years and can't say enough good things about it. I love that it boils water in 5 minutes, is super easy to start (a flick of the switch), turns off automatically when it has full boiled about 30 seconds, and the cord is attached to the base but not to the kettle, so there is no cord to fight with while you are pouring. I use my kettle for SO MUCH! Sometimes I flick the switch back up once the water is hot, but not yet boiling for times I don't need boiling water. Used in our house for everything: I have a pour over coffee maker and use this to boil the water Tea. Oat Meal. tons of stuff. Yesterday I shut my fridge door and turned around. A pan I had stored above the fridge fell and smashed my water kettle. Needless to say it was a huge mess. No sweat though - at <$30 I'm here on Amazon to buy the replacement. Seriously, this is a great kettle. No need to hesitate."},{"reviewerName":"Jeff","rating":"2.0 out of 5 stars","reviewTitle":"Cheap but poorly designed.","reviewDate":"October 19, 2018","reviewText":"I had an electric kettle that I used everyday for about a year-and-a-half. I took it for granted then it suddenly broke. It was an Ovente. I bought this Hamilton Beach to replace it. I didn't think much of it until I started to use it. The power switch, or the on-off switch, is in a weird place at the bottom of the handle. The lid is not spring loaded. You have to squeeze two things and pull it up. If you don't get the lid up all the way while pinching the two buttons, the lid falls back down. My old one had a spring-loaded lid with the power switch near the top where your thumb goes. Both those features make much more sense than how this Hamilton Beach is configured. Yes it's cheap. But for something I use many times everyday, I'd rather have a spring-loaded lid in a power switch at the top where my thumb is. And why the blue light? Blue makes me think of cold. They should be red LEDs."},{"reviewerName":"C. Wollin","rating":"4.0 out of 5 stars","reviewTitle":"Looks nice and works well.","reviewDate":"October 30, 2017","reviewText":"I'm using this kettle daily at the office to boil water for my hot tea. I've got a couple of other electric tea kettles and this one is \"short and stout\" compared to them, although the base still takes up the same amount of room. It puts off a pretty blue light while it's heating. That drew a lot of attention from my coworkers when I first brought it in. It's actually pretty cool looking. It takes a little over two minutes to heat water to a boil, then shuts off shortly after. The cord coils up neatly underneath to adjust the length. It's a great little kettle for the price!"},{"reviewerName":"Patrick O'Donnell","rating":"1.0 out of 5 stars","reviewTitle":"Unsafe condition and a “warranty” only for receipt hoarders","reviewDate":"December 20, 2018","reviewText":"So I like that it boils water fast, and turns off automatically after it boils for a short period of time, but what I don’t like is the large amount of water that leaks all over the electric base/counter top! The pitcher won’t leak until you put it on the base for some reason. I’ve had it for 6 months and use it once a week at best. This was given as a gift and Hamilton beach won’t take care of the safety issue because I don’t have an original receipt and they say that their records show it is older than a year...well not my fault it sat on a shelf. I thought they would want to make sure I don’t electrocute myself and continue to use their products, but they just “offer” a discount on buying another even though it has a “1 year warranty”. I’d spend money elsewhere on a product that is safe to use and on another company who has faith and confidence in the products they sell."},{"reviewerName":"Todd Post","rating":"4.0 out of 5 stars","reviewTitle":"Space efficient kettle boils water quick for one or two","reviewDate":"September 17, 2017","reviewText":"There are a lot of things I like about this electric kettle:\n- Heats up quick\n- Glass so you can see it work and visually see it's done\n- Cord wraps up and stores under base to keep things tidy\n- Looks stylish\n\nThe smaller \"compact\" size is good for the office, small apartments, tiny homes, etc. but may not be big enough for more than an individual or tea for two. The construction isn't as study as some other kettles I've used and the water doesn't pour completely \"cleanly\" out of the spout if you pour too fast, but for the price this is a solid kettle for individual use or small spaces."},{"reviewerName":"Matt S.","rating":"5.0 out of 5 stars","reviewTitle":"Great value, soo good I bought another.","reviewDate":"February 5, 2018","reviewText":"I bought one of these about 6 years ago for my office desk to make coffee. I typically do one cup at a time (just over 0.5L) and this kettle boils it fast. I've had no problems in over 6 years and 3 job changes in 3 different states. I use on average every other work day in conjunction with my Aeropress. I finally decided to get another for home use.\n\nPros: Quick boiling, LED lights let you know its on, simple to switch on then grab to pour.\n\nCons: Switch is easy to turn on by accident, lid will spill out of the sides if it isn't \"clicked\" into place (both are picky complaints)"},{"reviewerName":"dancingduchess","rating":"3.0 out of 5 stars","reviewTitle":"Automatic shut off quit working after a few weeks","reviewDate":"October 1, 2019","reviewText":"It is really fast. Loved the glass and the blue light but after a few weeks the automatic shut off quit working. I tried it several times and it just kept boiling away. Fortunately it was within the return time frame so I was able to return it. I have an older Hamilton Beach stainless steel electric tea kettle that I've had for several years- so I guess I'll go back to that."},{"reviewerName":"Adam Penfeather","rating":"2.0 out of 5 stars","reviewTitle":"NOT THE BEST DESIGN","reviewDate":"April 4, 2019","reviewText":"This otherwise good product is ruined by the fact that there is no thumb-operated flip mechanism for popping open the lid. If you want to drain every bit of water out of the kettle you have to grasp the top of the lid and squeeze the buttons together and the rush of steam burns your fingers. It's a really awkward design problem. I'll be replacing this with a different product."},{"reviewerName":"ER P.","rating":"5.0 out of 5 stars","reviewTitle":"Best compact glass kettle.","reviewDate":"April 21, 2019","reviewText":"I was looking for a compact glass kettle. At first I bought Emerald 1.2L kettle (beige handle, the one on the right from my pictures) but it leaked so bad every time I poured water because it has a gap under the lid. So I returned it then bought Halmilton Beach and I'm very pleased. This kettle does not leak and boils much faster with beautiful LED light, the stainless steels plate is also good quality which doesnt build up scale quickly as Emerald."},{"reviewerName":"Susan Oliver","rating":"5.0 out of 5 stars","reviewTitle":"Excellent product","reviewDate":"April 19, 2019","reviewText":"I became sensitive to the taste of metal so had to go for glass. The reason I like this product is that I drink ONLY hot water -- no room temperature or ice water. And I drink a lot. Therefore I use it at least 8 - 10 times a day. After 4 years it's still going strong. The reason I am replacing the one i have is that I didn't close the top tightly once and it got dry. It shut itself off when it ran out or water but there is a dark area -- maybe burned? -- that seems to be expanding. It doesn't taste burned and still works fine but it seems like time for a new one. Make sure the top latches before you turn it on."},{"reviewerName":"Karli","rating":"5.0 out of 5 stars","reviewTitle":"Exactly what I needed!","reviewDate":"March 22, 2019","reviewText":"I drink lots of tea, morning & night.\nBoiling on the stove takes too long & I'm not a fan of microwaves.\nI bought this electric kettle to boil my water for my favorite drinks, this thing is awesome!\nNo more waiting around by the stove for my water to finally boil.\nIn my experience, depending how much water is in it, it only takes anywhere from 3-5 minutes to reach a full boil.\nDefinitely recommend to others."},{"reviewerName":"Fathom","rating":"5.0 out of 5 stars","reviewTitle":"Super easy to use and extremely convenient to have hot ...","reviewDate":"September 15, 2017","reviewText":"Gorgeous looking automatic hot water kettle. Super easy to use and extremely convenient to have hot water instantly. It's also really easy to clean. Perfect for home use or even in the office. As a tea drinker, it fits all my needs. I actually quite like the smaller size of this 1 L kettle, so you're not wasting time boiling unused water. A great product!"},{"reviewerName":"David K.","rating":"4.0 out of 5 stars","reviewTitle":"Nice, small and attractive electric kettle...","reviewDate":"August 11, 2018","reviewText":"This is a nice little kettle and it has been performing as I expected. I only wish glass kettles this size had some temperature control. But, it does the trick and looks good doing it. The boil is reasonably fast. The only downside I can think of is that you need to be careful pouring since the spout doesn't direct the water as well as I had hoped. But, if you pour slowly it's not really an issue. I've had no problems with the lid. It locks into an open position and it's not an issue to squeeze the tabs to open it."},{"reviewerName":"Amazon Customer","rating":"3.0 out of 5 stars","reviewTitle":"Rust stains after about a year","reviewDate":"April 27, 2019","reviewText":"I bought this electric kettle about 2 years ago. It's still working but the \"stainless steel\" on the kettle handle and on the bottom band of the kettle got rusty and discolored after about a year. Otherwise, this kettle has worked great with no problems beside the one mentioned in other reviews about needing to make sure lid is fully closed."},{"reviewerName":"T. Gaston","rating":"5.0 out of 5 stars","reviewTitle":"excellent product","reviewDate":"September 20, 2017","reviewText":"I love this kettle, and would give it more than 5 stars if possible. It is easy to setup, use and clean. And it does heat the water very quickly. The cord easily adjusts to the desired length, no extra dangling cord. I am so very pleased with it."},{"reviewerName":"Tenn","rating":"5.0 out of 5 stars","reviewTitle":"Buy this one. Great, fast water kettle, perfect for office or home.","reviewDate":"October 18, 2019","reviewText":"This is coolest water kettle yet. Very easy to use. Small footprint. And super fast. Love it!"},{"reviewerName":"Laurie L Lapham","rating":"5.0 out of 5 stars","reviewTitle":"Great kettle","reviewDate":"March 8, 2019","reviewText":"I've had mine for little over a year and love it. I use it multiple times a day for making my morning coffee and tea. Heats water quickly, is incredibly durable and the automatic shut-off valve clicks over for safety precautions. I don't feel like I'll need to buy a new one anytime soon."},{"reviewerName":"Jeff","rating":"1.0 out of 5 stars","reviewTitle":"Works great...until it cracked after 8 months.","reviewDate":"September 30, 2019","reviewText":"Worked really well until the glass cracked while boiling water and spilling all over the counter. I owned it for 8 months."},{"reviewerName":"David C","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"January 29, 2018","reviewText":"Stylish design. Boils quickly."},{"reviewerName":"Sutley","rating":"2.0 out of 5 stars","reviewTitle":"Scorched Kettle","reviewDate":"March 9, 2019","reviewText":"Kettle didn't turn off when water boiled. Auto shut off stopped working and scorched kettle."},{"reviewerName":"Amazon Customer","rating":"1.0 out of 5 stars","reviewTitle":"I liked this kettle until it boiled dry twice","reviewDate":"March 19, 2019","reviewText":"I bought this for my office, and on two occasions, it boiled dry before it shut off. Into the trash it went. I'm not going to risk setting my office on fire."},{"reviewerName":"Shelby Evans","rating":"4.0 out of 5 stars","reviewTitle":"A Life Changer","reviewDate":"January 22, 2019","reviewText":"LOVE IT!!!!!"},{"reviewerName":"Kapap Guy","rating":"2.0 out of 5 stars","reviewTitle":"Dangerous","reviewDate":"January 13, 2018","reviewText":"I've had this for about a month. It looks nice with the stainless steel base offsetting the black handle and lid. And it brings water to a boil quick, it takes about 2-3 minutes. However the longevity and quality are lacking. There are blue LED's that light in a circle around the base of the glass container. After about a month of use, half of the lights no longer light or they may flicker on momentarily and stay off. The other half of the lights stay on solid as they should. The worst part and this is a safety issue, is that by severely burning my thumb, I realized that the steam generated from the boiling water has started to escape from a seam in the plastic handle. Imagine griping the handle with your right hand. Right about where your thumb would wrap around the handle is a seam. I think that the steam travels through the inside of the handle with enough pressure to finally shut off the auto shut off tab located at the bottom of the handle. Anyway, the steam started escaping through a seam in the handle and burnt my thumb badly. I don't recommend this kettle."},{"reviewerName":"Usher (Phil/Cynthia)","rating":"5.0 out of 5 stars","reviewTitle":"Small but mighty little guy","reviewDate":"November 15, 2017","reviewText":"Best little electric kettle I've ever owned. It's small, holds just 1 liter, but I love that it heats so quickly, about 90 seconds. You can see whats going on with a pretty blue LED light that's on whenever it's engaged and it's uber easy to clean as since it's glass. It doesn't leave the funky plastic taste some of the other kettles do. I enjoy my tea tasting like tea and not some kind of petro-chemical plastic."},{"reviewerName":"Mister T","rating":"3.0 out of 5 stars","reviewTitle":"There are better options but none are perfect.","reviewDate":"January 3, 2019","reviewText":"This is something I use every day all day; particularly first thing in the morning when I don't need any BS! This thing will steam burn you if you grab the handle too high up so you learn to grasp it at the lowest extremity of it's handle. The release for opening the lid requires two hands to use instead of a proper thumb button which other units have. I wanted all glass, no metal touching the water but this has a metal bottom. I wanted a smaller capacity which this does have but it weighs the same as my last one which had a higher capacity. Not easy on Grandma who lives with us. The last one we bought of a different brand didn't last a year before it refused to turn on. I'm spending $ to keep replacing these. I would pay a lot for the perfect lasting water kettle but have never found it. I also use a Whistler all glass kettle but it takes forever to heat water on my electric stove and is quite hard to clean the inside. I'm waiting for someone to design and manufacture a better glass or ceramic water kettle that lasts. The plastic screen at the pour spout is for WHAT? I was able to remove the toxic little screen easily on this model. The last model was nearly impossible to remove it. Good luck shoppers, I'm tryin' to help but it's a jungle of crap out there!"},{"reviewerName":"Judy D","rating":"5.0 out of 5 stars","reviewTitle":"AWESOME KETTLE!","reviewDate":"July 8, 2018","reviewText":"This kettle checked off all of my wishes. It is small (1 L), good looking, functions perfectly, and has no flaws.\nI've had this for about 2 months and it works perfectly. I love how quickly the water boils. I'd say about 2 - 3 minutes when full.\nIt's quicker when less than full.\nI use filtered water, so it still looks like brand new.\nI love the blue lights around the bottom. It gives it some bling and they work perfectly.\nI have recommended this kettle and I will continue to do so."},{"reviewerName":"NorthernPerson","rating":"3.0 out of 5 stars","reviewTitle":"Poor quality control: Loved it for 2 weeks until lights quit & auto-off failed","reviewDate":"November 6, 2018","reviewText":"I became disappointed in this kettle. For the first 2 weeks it was great: heats water quickly, had pretty lights. But after just 2 weeks using it 2x/day the blue lights started to blink, and now the lights don't come on at all. The kettle also does NOT turn itself off now after it starts boiling, so it has to be watched closely or it will boil itself dry: the auto-off feature has already failed. If you have hard water, the kettle can be fairly loud -- I wipe out all the hard water residue every time I fill it; mineral deposits clean up pretty easily. Interestingly, for the first boil on a new fill of water, the kettle is quiet boiling fresh water while it's still clean. But if you leave hot water in it then boil the same water again later for another cup of tea, it makes a really loud rumbly whooshing sound which seems to be from mineral deposits on the bottom from the prior boil. The noise didn't bother me too much, but if you're in a super quiet office it could be disruptive. The interior bottom is metal, so there is metal and plastic (lid) touching the water. I was pretty happy with it at first, but unfortunately this one has to go back."},{"reviewerName":"SW","rating":"3.0 out of 5 stars","reviewTitle":"Boils water as expected, but not without flaws","reviewDate":"September 15, 2019","reviewText":"For the price, this is a good value water boiler (no multi-temp settings). It's reasonably quick and quiet. Doesn't take up too much counter space. Requires more \"minimum\" water than we'd like. Lid a bit awkward to open/keep open. All this might have been 4 stars, but we're rating 3 stars because we don't like the way steam hits your hand as you pour the boiled water, though this can be \"managed\" if you hold the handle on low end (further away from the lid) to pour."},{"reviewerName":"Angelina C.","rating":"3.0 out of 5 stars","reviewTitle":"This kettle needs some tweeking to be perfect","reviewDate":"November 30, 2018","reviewText":"I have owned at least 4 electric kettles over the past decade. I have given away or discarded kettles when they no longer look clean inside (cannot remove scaling) or just needed upgrade. But I was always concerned that I could not see inside the kettle, so decided to get this glass kettle. This Hamilton Beach kettle satisfies the \"see inside\" requirement for sure. However, it is ever so awkward to handle. I would have liked to be able to pick up kettle with my right hand and use the other hand to open spout to fill. No! Filling necessitates pressing 2 little buttons - pinches fingers - and a precise pulling back of the cover. Quite often, it just flops close before it can be filled. I also am not a fan of the plastic lever for starting the boil. So, this will not be a repeat purchase."},{"reviewerName":"JPK","rating":"1.0 out of 5 stars","reviewTitle":"Horrid unremoveable sticker affixed to glass. Dumb plasric strainer.","reviewDate":"June 3, 2019","reviewText":"Hamilton Beach: Thanks so much for slapping a very stupid sticker (that I had to pay for) on the outside of the glass kettle. It is so tightly affixed that I will have to spend a half an hour trying to scrape the thing off. Thanks for adding to my stress level and wasting my precious time. Clearly no one at your firm has an actual brain. That and the plastic that covers the spout with the “filter.” How often do people tell you they want no plastic near the hot water? And you conveniently design a strainer no one wants. I plan to remove it."},{"reviewerName":"Adrienne","rating":"5.0 out of 5 stars","reviewTitle":"Love it","reviewDate":"May 31, 2019","reviewText":"My first electric kettle. I think I looked at every kettle on Amazon. Don't need a lot of capacity, because it's just for me. It heats up super fast. Not very loud. It developed a couple little rust looking spots on the inside bottom within the first week of using it. They haven't gotten worse and no more have showed up. Not sure what the deal is and don't really care. I have hard water and never clean or dry the thing and it still looks great 6 months later. If it broke I'd get another just like it."},{"reviewerName":"Gabriel O'leary","rating":"2.0 out of 5 stars","reviewTitle":"Works alright, but with some complaints.","reviewDate":"September 12, 2019","reviewText":"The kettle seems to heat up quickly, and is aesthetically pleasing. That said when it arrived it had a sticker on the glass that was annoying to remove. I had to get out soap and a sponge and scrub the residue of the sticker off (as it ripped into many little pieces). Not a great start... Upon using it the first time I noticed that because of the shape of the kettle you must tilt it much further than kettles I've used in the past. The container curves back towards the handle making it harder to pour than one with a straight up side. The reason this is annoying is that by the time you've tilted it and it starts pouring your thumb/hand is directly above the spout and hot steam rises to burn your skin."},{"reviewerName":"Jenny Smart","rating":"4.0 out of 5 stars","reviewTitle":"Comes with a sticker that wouldnot come off","reviewDate":"September 12, 2019","reviewText":"I bought this kettle to replace the previous one, from the same company, that worked perfectly for a few good years, just got a bit old and bruised so I decided it is the time for a new one.\nThe kettle came with a HUGE sticker right on the glass, it would not come off with water and soap, and the glue is apparently very heat-resistant, because the sticker is still there after two weeks of everyday use. The sticker brags about the soft blue light inside the kettle, but you don't get to enjoy it because you cannot see anything inside the kettle because of this stupid sticker.\nIf it ever comes off, I will update this review and tell you how long it takes!"},{"reviewerName":"K. Jolley","rating":"5.0 out of 5 stars","reviewTitle":"Very HOT water - Very Quickly","reviewDate":"September 8, 2018","reviewText":"I saw a few poor reviews but took the chance. Glad I did. This kettle makes water very hot very quickly.\n1 Liter is more than I need for a cup of coffee, and 1 cup (measured) boils in less than one minute -- and it is much hotter than 4 minutes in a microwave. (much safer too).\nOn the note of Safety = when pouring the steam will rise up to your hand, it is hot, obviously. pour quickly or with a 'glove'.\n\nUPDATE been using it now for a couple of months, 6 Stars. Got used to pouring quickly, makes tea - coffee - oatmeal - etc in a snap.\nOne thing that is useful is to leave a bit of water in it. That is if you need one cup put in a cup and a quarter. The reason is that the water keeps the minerals in solution and makes it so much easier to clean = every once in a while I just swish it around, pour it out and keep using it. No scrubbing required."},{"reviewerName":"Adam B. Richmond","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars... but","reviewDate":"June 3, 2019","reviewText":"I have never owned an electric water kettle before. I shopped around before I settled on this one. It boils one liter of water in about 4 minutes.\n\nThere a couple of drawbacks 5hougj. I a still rating this with five stars, but thete are two things I would like to point out. It superheats the water to the most turbulant boil I have ever seen. Also the automatic turn-off lags a bit. It turns off the kettle about a minute after the water gets to that super rapid boil."},{"reviewerName":"JMurphy","rating":"5.0 out of 5 stars","reviewTitle":"If your looking to boil water for tea, this is perfect!","reviewDate":"April 23, 2019","reviewText":"I find myself sitting at my desk for long hours into the night. Nothing is better than having a nice cup of tea, without needing to go to the kitchen. If this sounds like you, then you NEED this product.\n\nThe pot comes packaged neatly with instructions inside. The functionality of the pot is super easy. You fill the water to the line and flip the power switch at the bottom of the handle. It's that easy, the rest is automated.\n\nThe pot lights up a blue color which is great if your sitting in a dark room. It allows you to see what the status is of your water and gives off a futuristic vibe.\n\nLong story short - Great buy - I use this pot a lot and have had 0 problems."},{"reviewerName":"Nick S.","rating":"5.0 out of 5 stars","reviewTitle":"Simple, Cheap, Useful","reviewDate":"October 24, 2018","reviewText":"The headline says it all. It boils water and does it quickly enough. It isnt the largest size and what is interesting is that the maximum fill line brings the water up only about halfway up the reservoir.\nThe glass reservoir is a pro and a con. The pro is that you can see whats in the reservoir and if any contaminants collect at the bottom, you know when to clean it. The con is relative to a typical stainless steel model I had in the past that kept the water warmer for longer after I finished boiling it in the first place.\nA soft blue light illuminates at the base to let you know its working.\nFor the price of 2 Starbucks drinks, you can have boiling hot water all season long."},{"reviewerName":"Lisa Lee","rating":"5.0 out of 5 stars","reviewTitle":"I love this kettle","reviewDate":"April 28, 2018","reviewText":"I love this kettle. I use it at work to make my tea. It is super fast and shuts off when ready so it doesn't \"over boil\". You just have to be careful and make sure all the water is out of it when not in use...you don't want mold to form. I pour any left over water out once it has cooled down then either leave the lid open or wipe it down on the inside with a dry paper towel so it dries out properly."},{"reviewerName":"MK","rating":"3.0 out of 5 stars","reviewTitle":"Heat ups Quickly","reviewDate":"June 23, 2019","reviewText":"I liked that this item boiled water very quickly, and it isn't that loud. The blue lights are nice, as well. However, it leaks when pouring about half the time, and I can't figure out why. Then I'm left to clean up spilled water. The base also doesn't stay hot for very long after the water is boiled and while it's still plugged in. So, once it's boiled, that's pretty much it and you'll need to re-boil if you want to top off your water. I relegated it to my office where it gets only occasional use. Good thing I didn't get rid of my old one at home."},{"reviewerName":"Shayelyn","rating":"5.0 out of 5 stars","reviewTitle":"Boils water super fast!","reviewDate":"January 10, 2018","reviewText":"I absolutely love this kettle! At first I was made fun of for wanting/getting this as I was told we have a perfectly good microwave and stove top. But now 3 out of 4 family members have used it and are all very impressed. Boils faster than the microwave or the stove. Auto shuts off but it boils for while before it shuts off so I normally shut it off myself. Great for tea, soups/ramen and hot chocolate. Nice blue glow when turned on. Wished heating up liquids other than water wouldn't void the warranty because it sure is tempting!"},{"reviewerName":"Vickie","rating":"5.0 out of 5 stars","reviewTitle":"Gone to soon","reviewDate":"March 26, 2019","reviewText":"I liked this glass kettle for the time I was able to use it. It was delivered on 2-10-19 and on 2-13-19 the house I was living in caught on fire ( not related to the kettle- faulty wiring in house) pictured is what it looked like after fire. I will buy another one eventually. Worked great, as it was brand new. I gave it all stars because I was happy with it for the time I had it."},{"reviewerName":"Lisa W.","rating":"3.0 out of 5 stars","reviewTitle":"Yes, there appears to be plastic in the carafe, not just the lid","reviewDate":"July 12, 2019","reviewText":"There is an o-ring seal in the bottom of the carafe between the glass sides and the steel heating element. This seal appears to be made out of plastic and will come into contact with the water. If you are concerned about heating plastic and drinking water that comes into contact with heated plastic, then buy another carafe."},{"reviewerName":"A. Rawlins","rating":"5.0 out of 5 stars","reviewTitle":"Boil a liter of water in one minute!","reviewDate":"September 20, 2018","reviewText":"I'm impressed that this thing does what it says it will. I have to admit that it makes me cringe to fill the decanter only half way, but in just one minute a liter of water is plenty warm enough to brew tea or make an instant hot beverage. It does take a bit longer to achieve the full roiling boil that shuts off the power, but still impressively quicker than any other method I've previously used for boiling water. This kettle with it's ring of blue LED lights is perhaps the most satisfying thing I currently own."},{"reviewerName":"Louann Tung","rating":"4.0 out of 5 stars","reviewTitle":"Works faster than a microwave and has fun blue lighting under the bubbles!","reviewDate":"March 2, 2019","reviewText":"Faster than the microwave! I love the blue color. My only complaint is When I open the lid or just pour the water that has just boiled, I faintly smell plastic. Hence the four stars instead of five.Hopefully that will go away as I’ve only been using it two weeks. Meanwhile when I boil water I leave the top lid open now. Maybe the plastic smell is coming from the lid. 1 L is the perfect size for every day use. If you need to boil much more water just boil a second batch because it boils so quickly anyway."},{"reviewerName":"Old Sometime Hiker","rating":"5.0 out of 5 stars","reviewTitle":"Great Electric Kettle","reviewDate":"July 14, 2019","reviewText":"Our old kettle was very stylish. But when you tipped it up to pour, you had to be careful that leaking super heated steam didn't burn your hand. It was also more stylish than practical, and the lids went bad on two of them. HOWEVER, THE HAMILTON BEACH version has a nice, tight fitting lid. No steam leak when you pour. It boils water very quickly. Yes, it looks squat, but it works really great. I don't think I'll be having any future trouble with the lid either."},{"reviewerName":"E. Weightman","rating":"1.0 out of 5 stars","reviewTitle":"Leaks","reviewDate":"February 6, 2019","reviewText":"It leaks all over the counter when we pour it, doesn't matter if you pour really slow or fast there is always a puddle on the counter. I have another model of this in copper color that I bought somewhere else and it is great, that is why I bought this one but this one is a dud. Have to keep paper towel by the cup when we pour."},{"reviewerName":"Mark K","rating":"1.0 out of 5 stars","reviewTitle":"It leaks!!","reviewDate":"April 12, 2019","reviewText":"Kettle was great when I first got it. After about 6 uses it started leaking from the bottom of the kettle, right near the electrical contacts. Not good. Also, the bottom of the kettle is corroding which has been noted here in Amazon reviews previously. I don’t understand why the corrosion appears since the bottom appears to be glass. Sure enough,if you crib it gently the corrosion (rust) comes off. I use bottled water, not tap water, so that’s not the issue. Anyway, it’s trash."},{"reviewerName":"C. gomez","rating":"5.0 out of 5 stars","reviewTitle":"Update :starting to fall apart","reviewDate":"March 14, 2019","reviewText":"( I found a number to call the company. After explaining my situation they said they will replace the unit, it's good to know a company that stands behind it's products.) I bought this in Oct. it worked great. Today I found a piece of plastic and couldn't find where it came from. After inspection, I found it came from inside the lid. Then I pulled on a piece and it snapped off. I can see I will soon not have a lid. Of course I can not find my paper work to call the company."},{"reviewerName":"Lule Mom","rating":"5.0 out of 5 stars","reviewTitle":"Fast water boiling!","reviewDate":"February 15, 2019","reviewText":"I love this kettle. I used to boil water on the stove but it took forever to start boiling and I always had the kettle sitting on the stove. This thing boils water so fast and the blue light is cool. It is easy enough and safe enough for my kids (10 & 12 to use for hot chocolate. I have bought two more since purchasing mine about a month ago, one for work and one as a gift for my mother in law. Highly recommend."},{"reviewerName":"SusanR","rating":"5.0 out of 5 stars","reviewTitle":"Love this kettle!","reviewDate":"March 19, 2019","reviewText":"We decided to quit drinking artificially sweetened instant iced tea and switch to brewed iced tea, so I wanted to get a kettle to avoid boiling water on the stove. I liked that this one is small and doesn't take up too much counter space. It is awesome! It boils a liter of water, which is just right for a pitcher of iced tea, in about 3 minutes. It has a cool blue light while it is heating and it switches off instantly (which is good because I have boiled a pot dry on the stove more than once). I definitely recommend this product."},{"reviewerName":"agitha","rating":"5.0 out of 5 stars","reviewTitle":"Quick and quiet","reviewDate":"September 20, 2018","reviewText":"I love how quick this kettle works! I use it exclusively at work so my coworker and I can have piping hot water for our tea or coffee. The blue lights are pretty while its in use and are a nice, silent indicator of when the kettle's done boiling. There's no whistling or noise at all so you can easily set it and forget it, but it automatically shuts off once it reaches boiling so there's no worry there.\n\nKind of want to get another one for my home use too,,,, maybe for the holidays lmao"},{"reviewerName":"Momoftwo","rating":"5.0 out of 5 stars","reviewTitle":"BUY THIS, SERIOUSLY","reviewDate":"October 13, 2018","reviewText":"I never thought I could love a water kettle, but here I am. This kettle is wonderful. It heats the water quickly and shuts off automatically. I love how I can just pick it up off the base to pour. The blue lights are a great touch. I really cannot think of any negatives about it. Works great. I’m very happy with my purchase."},{"reviewerName":"Fidel Raul","rating":"5.0 out of 5 stars","reviewTitle":"Fast Boiling!","reviewDate":"November 7, 2018","reviewText":"I love that this thing gets water boiling really fast!!! I use it for tea, and instant coffee! I also use it to boil water for food recipes because it's quicker than my \"Quick Boil\" stove top! It is a little difficult to clean if you have big hands, the top of the inside part of the lid has some pointy ends that scratched my hand up. I figured out that in order to keep it clean longer... I have to keep the lid open as soon as I use it to let any drops of water evaporate."},{"reviewerName":"JTKC","rating":"5.0 out of 5 stars","reviewTitle":"So good I bought a 2nd one","reviewDate":"October 7, 2019","reviewText":"Easy to use, easy to clean, and looks classy. My husband drinks a lot of tea and after using this pot to steep tea ( the spout has very fine mesh so you can steep loose leaf tea) he asked me to order a second tea pot so he could have tea in his office at work. Obviously, so good I bought a second one."},{"reviewerName":"Sandra F","rating":"5.0 out of 5 stars","reviewTitle":"Beautiful Product","reviewDate":"September 30, 2019","reviewText":"This is one appliance that I leave out on my counters because I use it every single day. Therefore I bought this smaller model as I did not need anything bigger. I really don't mind having it sit out as it's truly beautiful and colorful. Heats quickly and it's easy to clean. Very happy with this purchase."},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Worth it for the ego","reviewDate":"April 3, 2019","reviewText":"I'm going on a trip to London next month and didn't want to get heckled by brits for microwaving my tea water.\n\nIt only takes a few minutes to boil and it's cheap. But most importantly, it makes the user feel better than everyone else"},{"reviewerName":"gary robinson","rating":"5.0 out of 5 stars","reviewTitle":"Not pretty but works well and lasts forever","reviewDate":"November 30, 2018","reviewText":"We had the larger version of this model for many years. It still works but got rusty over the years. I bought another brand which lasted about 2 weeks and had to reuse the old Hamilton. I finally decided to buy the small version (good enough for the 4 of us). It is not design-looking in any way, but it boils at high temperature for black tea and is durable, since the old one, 10 years old or so, still works!"},{"reviewerName":"Lithawitch","rating":"5.0 out of 5 stars","reviewTitle":"Does its job well","reviewDate":"October 28, 2019","reviewText":"There isn't much functionality to this little kettle but all I need it for is boiling water for my french press and it does the job very well. It boils pretty quickly (no complaints) and the inside has stayed clean with no weirdness for the 2 months I've now been using it. I would recommend."},{"reviewerName":"Lightnin30","rating":"5.0 out of 5 stars","reviewTitle":"Fast, Durable, and Not and Eye Sore! Easy to maintain.","reviewDate":"March 7, 2019","reviewText":"This Kettle heats faster than a Gas Stove. I mean 60 seconds and Boom you have a Roiling Boil!!!! When the Blue LED light goes out it’s DONE! Ready to pour for Hot Tea or Instant Oatmeal, or Instant Coffee! I rinse out with vinegar to keep the calcium from our Hard water from building up. It works great and used Several times A Day EVERYDAY!"},{"reviewerName":"anyomous","rating":"5.0 out of 5 stars","reviewTitle":"compact and easy to use.","reviewDate":"July 12, 2019","reviewText":"I've had mine for a couple of months and use it multiple times a day for tea and for boiling filtered well water for sterilizing. It is easy to handle, looks pretty boiling and works quickly, less than 3 mins at its full point. However you need to have at a minimum .5L water to use and the manufacturer says water only."},{"reviewerName":"MissP","rating":"1.0 out of 5 stars","reviewTitle":"Carafe broke on first use","reviewDate":"December 10, 2018","reviewText":"I was so excited about this item because it was the perfect size I wanted, but was quickly disappointed. On the first use as soon as it started boiling the glass broke and hot boiling water came spilling all over the counter. I'm sure this was a fluke but didn't want to take a chance so I ordered a different brand that I love."},{"reviewerName":"Irene","rating":"5.0 out of 5 stars","reviewTitle":"Love this Kettle","reviewDate":"May 15, 2019","reviewText":"Originally bought this for my mom. She is 93 and has ALZ This is great for her little apt. It's easy to use, She can heat up water, add her instant coffee and we don't have to worry about her forgetting. This pot turns off automatically. Very safe. It's amazing, The outside bottom doesn't get hot. Loved it so much bought one for myself too."},{"reviewerName":"Mongo","rating":"5.0 out of 5 stars","reviewTitle":"easy to use - heats water in a jiffy","reviewDate":"September 19, 2018","reviewText":"I wanted a smaller electric tea kettle than all the 2 quarts. This heats water to boiling in just a couple of minutes for my French press or tea. It has a metal bottom with maybe a silicone seal and plastic top so your water is coming in contact with things besides metal or glass. The blue light is a nice touch."},{"reviewerName":"James W. Densford III","rating":"5.0 out of 5 stars","reviewTitle":"Works Great","reviewDate":"June 9, 2019","reviewText":"This kettle heats the water quickly and looks good. The auto shutoff is a nice feature, and the kettle sets on the heating unit securely. The heating unit/stand is plugged in, so you don't have to plug in the kettle itself - just set it on the heating unit and press the start lever."},{"reviewerName":"DJ","rating":"4.0 out of 5 stars","reviewTitle":"Like it lots.","reviewDate":"October 23, 2018","reviewText":"Love this kettle. Quiet, fast, and so convenient with the retractible cord attached to the base. Use it every morning to heat water for tea. Got it to replace plastic one I had. Only issue is that bottom gets some lime accumulation from tap water. Probably happened in plastic kettle too, but just didn't see it. Most cleans off with baking soda."},{"reviewerName":"JD Martin","rating":"3.0 out of 5 stars","reviewTitle":"Not impressed","reviewDate":"August 30, 2019","reviewText":"Only an on/off switch, no different water temps, after two cups, needs to be refilled. Found it rather inconvenient. Looks pretty when boiling though not a reason to buy it. Short cord so limited on where you can place it on counter. Wouldn't recommend"},{"reviewerName":"Elizabeth F.","rating":"5.0 out of 5 stars","reviewTitle":"Heats quickly and is super easy to use.","reviewDate":"November 12, 2019","reviewText":"Bought this for my grandmother - has previously bought for my mother. Is easy to use - just flip the switch. It will get to a rolling boil within a few minutes, so it can get hotter than is probably needed for making tea/coffee/etc."},{"reviewerName":"love to garden","rating":"5.0 out of 5 stars","reviewTitle":"Love this kettle","reviewDate":"December 31, 2018","reviewText":"I'm a tea drinker, work only had a coffee pot, I hate microwave tea, this is the perfect solution. I've had it for several months now, use it everyday I work. Boils quickly, cleans up nice, love the blue light and the fact it shuts off if I don't get to it right away."},{"reviewerName":"Ann","rating":"5.0 out of 5 stars","reviewTitle":"Works well, looks cool","reviewDate":"March 3, 2018","reviewText":"Nice compact size, looks super cool on counter and really decent for the price. The black screen thingy attached to the top broke off after the 4th or 5th use but I’m not even mad about that because it didn’t seem to serve a real purpose anyway. Used almost every day for the past couple months."},{"reviewerName":"jhlee19","rating":"5.0 out of 5 stars","reviewTitle":"Super quick!","reviewDate":"February 24, 2019","reviewText":"This is my first electric kettle and I'm only sad that it's taken me this long to get one. Bye bye stove top kettle! This thing is quick to boil water. My only tiny complaint is that the hole at the top is small and makes cleaning a little troublesome but it's not a deal breaker."},{"reviewerName":"R. A. D.","rating":"5.0 out of 5 stars","reviewTitle":"Super cool","reviewDate":"October 19, 2019","reviewText":"After my Breville broke after 3 yrs I bought this at 1/8 the cost. It is fantastic and he heats the water to in record time. It can book a cup for my tea in under 30 sec. Love it. And the blue lights are super cool."},{"reviewerName":"Waldo Emerson","rating":"5.0 out of 5 stars","reviewTitle":"Really like the size and usability","reviewDate":"February 28, 2019","reviewText":"We substituted this for a steam kettle with a whistle. Sometimes when in a different room we wouldn't hear the whistle. This is much better. It heats twice as fast as the kettle we used on our gas stovetop. It is super easy to use and well sized for a single person or couple."},{"reviewerName":"Emilie Roberts","rating":"2.0 out of 5 stars","reviewTitle":"Rusted after just a couple of uses","reviewDate":"April 12, 2019","reviewText":"I love how easy this is to use and how pretty it is. That is why I gave it two stars instead of just one.\n\nThe big problem: After using it just a couple of times, there were rust spots in the bottom, in the actual part that brews the water."},{"reviewerName":"ardous","rating":"3.0 out of 5 stars","reviewTitle":"meets expectations","reviewDate":"November 17, 2018","reviewText":"well if works fast and well. One problematic detail is that the blue light is sometimes blinking as if there was a bad connection, but that is purely esthetic. We shall see how long this will last. Meets expectations.I do like the size. Smaller than most"},{"reviewerName":"Michael Cohen","rating":"5.0 out of 5 stars","reviewTitle":"Hearts up super quick","reviewDate":"September 14, 2019","reviewText":"I have no clue how quickly the water boils, but I love it and it looks cool while it's on as it has a glow ring on the bottom that illuminates. The only con is that it doesn't stay hot but nbd."},{"reviewerName":"Toshie","rating":"5.0 out of 5 stars","reviewTitle":"Great size!","reviewDate":"August 4, 2019","reviewText":"We live in a small apartment, and space is at a premium. It is a perfect addition to our table top appliances. I like the automatic shut-off feature and the blue light, which indicates when it is in use."},{"reviewerName":"Eric Henyey","rating":"2.0 out of 5 stars","reviewTitle":"spills water when pouring","reviewDate":"October 26, 2018","reviewText":"I got this kettle to heat up water for tea. It works well and boils water quickly. However, the short spout has a rounded glass bead at its lip, rather than an edge which the water could drip neatly off of. As a result, when pouring, a considerable amount of water runs over the rounded lip and down the side of the kettle. I have to pour it over a sink in order to catch the spillage."},{"reviewerName":"byelihandworks","rating":"5.0 out of 5 stars","reviewTitle":"Don't want to live without it.","reviewDate":"December 30, 2018","reviewText":"what a wonderful addition to my kitchen! fast hot water for that tea that hits the spot in the winter time. Couldn't be happier with this purchase. Shipping was fast and the product was packed perfectly."},{"reviewerName":"Brandi Schmidt","rating":"5.0 out of 5 stars","reviewTitle":"Perfect!","reviewDate":"August 3, 2018","reviewText":"This the first Kettle I have ever bought! I love it. The water boils so fast! I was amazed! I love the blue light and auto shut off. Perfect for my French Press coffee."},{"reviewerName":"Pat","rating":"5.0 out of 5 stars","reviewTitle":"Great kettle that looks cool and heats up fast.","reviewDate":"January 20, 2019","reviewText":"Works great fast. Saves my porcelain mugs from getting microwaved all of the time. I purchased this one to replace an all metal one that constanly needed cleaning from corrosion. Enjoy the blue light on it too."},{"reviewerName":"Rick L","rating":"5.0 out of 5 stars","reviewTitle":"the blue light is cool too. however","reviewDate":"June 15, 2018","reviewText":"its working pefectly. and it boil water quick. the blue light is cool too. however, the limit line for it its quiet low. otherwise its a good product"},{"reviewerName":"Sheepish Gnome","rating":"5.0 out of 5 stars","reviewTitle":"Perfect Kettle for Me","reviewDate":"March 4, 2019","reviewText":"I love this kettle. It lights up and is glass so you can see that it’s on, not much contact of the water with plastic (just the lid). No leaking, heats fast. I wish the cord were slightly longer, but otherwise is perfect."},{"reviewerName":"Mary B.","rating":"5.0 out of 5 stars","reviewTitle":"Electric tea kettle","reviewDate":"February 24, 2019","reviewText":"This is my first electric kettle and I love it! Boils water quicker than electric stove and being made of\nglass it does not get water mineral deposits on bottom. The blue LED lights was a pretty touch also !!"},{"reviewerName":"T. Zelinka","rating":"5.0 out of 5 stars","reviewTitle":"Most used kitchen appliance - LOVE IT!","reviewDate":"December 20, 2017","reviewText":"I got this one for my niece who lives in a studio apartment and she loves it. I have the bigger one. This is a great gift for any tea lover (or french press coffee). The water heats up so incredibly fast!!"},{"reviewerName":"Texas Sparky","rating":"5.0 out of 5 stars","reviewTitle":"heats fast","reviewDate":"October 10, 2019","reviewText":"We purchased this to replace a smaller generic unit and love it. It heats fast and comes to a rolling boil before it shuts off.\nFor the money, you cannot beat this."},{"reviewerName":"mavmed","rating":"5.0 out of 5 stars","reviewTitle":"Works Like A Champ","reviewDate":"June 22, 2019","reviewText":"Superfast used to boil the minimum 0.5-liter for tea. Gets to a rolling boil and I have to manually turn it off.\n\nHaven't cleaned it yet but will with vinegar due to hard water."},{"reviewerName":"Andy","rating":"5.0 out of 5 stars","reviewTitle":"Boils water, backlight a nice touch","reviewDate":"April 22, 2019","reviewText":"It boils 1L water in under 5 minutes. Clear, with a blue backlight as a nice indicator that it’s on. Auto-shutoff once it’s done. It does what I need it to, and it’s only for boiling water."},{"reviewerName":"Scott Colvin","rating":"5.0 out of 5 stars","reviewTitle":"Love this thing!","reviewDate":"April 10, 2019","reviewText":"This replaced an old Sunbeam Hot Shot that broke and this has been a perfect upgrade. It boils water super fast and has a nice controlled pour. Very happy with this purchase."},{"reviewerName":"Lala Seattle","rating":"5.0 out of 5 stars","reviewTitle":"No problems","reviewDate":"August 23, 2019","reviewText":"I use this kettle every day and have never had any kind of problem with it. Have had it for a few weeks now and am very satisfied with my purchase."},{"reviewerName":"William T","rating":"5.0 out of 5 stars","reviewTitle":"Great product, reasonable price.","reviewDate":"November 6, 2019","reviewText":"I've been using it for over a month. Works great. The LEDs are a nice touch. Heats a cup's worth of water up in like 30 seconds or so."},{"reviewerName":"Tracy","rating":"5.0 out of 5 stars","reviewTitle":"Great purchase. No regrets!!","reviewDate":"April 26, 2019","reviewText":"Wasn’t sure about it being made of glass but that has not been an issue at all. Very pretty design and is so quick to heat up. With the lights at the base I don’t have to listen for the click to know when water has boiled- just notice when the lights go out."},{"reviewerName":"Caroline","rating":"5.0 out of 5 stars","reviewTitle":"Great for my morning tea!","reviewDate":"January 25, 2019","reviewText":"I use this at least twice per day- water heats up very quickly. I purchased it about a month ago, and still amazed at how fast water goes from cold to boiling. I am completely satisfied with this purchase- would recommend to anyone looking for an electric kettle. Price was very reasonable too."},{"reviewerName":"gigihonee","rating":"5.0 out of 5 stars","reviewTitle":"Perfect size. Works great.","reviewDate":"May 23, 2018","reviewText":"Very hard to find a kettle in this size. Grab this kettle if you need a smaller size. Max fill line is perfect size to make a full french press pyrex. Works perfectly. Have used daily for about two weeks."},{"reviewerName":"Galadriel","rating":"5.0 out of 5 stars","reviewTitle":"Easy, quick and useful","reviewDate":"September 5, 2018","reviewText":"Easy to use and clean. It works very efficiently.\nMade my life so much easier!!!\nHot water for breakfasts’ tea and oatmeal ready in a breeze and shorten time to boil water to any cooking use. Glad I got it."},{"reviewerName":"Blythe Martinez","rating":"5.0 out of 5 stars","reviewTitle":"Love it!","reviewDate":"May 21, 2019","reviewText":"I use this for tea, grits, oatmeal... ect. The water heats up so quick- much better than waiting for the stove top!"},{"reviewerName":"marlena fryman","rating":"2.0 out of 5 stars","reviewTitle":"Stains fast","reviewDate":"September 23, 2019","reviewText":"I really was excited for this item to make tea and boil water without using a stove. I received it last week. It is already developing a stain on the bottom that will not clean."},{"reviewerName":"Vishal","rating":"4.0 out of 5 stars","reviewTitle":"Blue light is soothing but no temperature control","reviewDate":"November 4, 2018","reviewText":"There is NO temperature control. The water will be boiling hot when it auto shuts off. You can shut off mid way, if you need just warm water.\n\nThe kettle is very fast to heat up though."},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Good product","reviewDate":"March 2, 2019","reviewText":"This kettle is great! Lights up blue when heating the water, what I think is cool!\nBoils the water less than 3 minutes. I am satisfied and the price is great!"},{"reviewerName":"dal","rating":"2.0 out of 5 stars","reviewTitle":"Very flimsy design","reviewDate":"August 25, 2019","reviewText":"The \"mesh\" filter broke the first time I used it. I can still use it but does not work as well as it should."},{"reviewerName":"Anonymous","rating":"4.0 out of 5 stars","reviewTitle":"Still has plastic touching water","reviewDate":"September 2, 2019","reviewText":"I searched for an inexpensive glass kettle because I don’t want plastic touching the boiled water. Lo and behold there’s a filter at the spout made of plastic. It’s not as bad as a fully plastic kettle but still kind of a bummer."},{"reviewerName":"Lee Ann Fancher","rating":"4.0 out of 5 stars","reviewTitle":"Really like this","reviewDate":"January 20, 2019","reviewText":"This boils super fast !!! I do worry about the plastic off on switch. So far so good. I also wish the top can off for cleaning. But I’m making do."},{"reviewerName":"Mikki","rating":"4.0 out of 5 stars","reviewTitle":"Looks cool. Does everything it's supposed to do","reviewDate":"August 2, 2018","reviewText":"Looks cool. Does everything it's supposed to do. The only reason I gave it 4 stars instead of 5 is because the water filter broke the second time we used it. It's not placed well."},{"reviewerName":"ReedMom3","rating":"5.0 out of 5 stars","reviewTitle":"Perfect kettle","reviewDate":"November 8, 2019","reviewText":"This kettle is perfect. Easy to use easy to clean. Heats up fast and stays warm for a while."},{"reviewerName":"Joe Elliot","rating":"5.0 out of 5 stars","reviewTitle":"Get one","reviewDate":"December 30, 2018","reviewText":"I have had one for years and use it daily. Purchased this as a gift because I know it will work."},{"reviewerName":"Edward P. Moran, Jr.","rating":"5.0 out of 5 stars","reviewTitle":"Very useful","reviewDate":"April 2, 2019","reviewText":"I use the boiled water for tea every day. It's fast and efficient. And no taste of coffee or other tastes from a Keurig coffee maker, as there was before."},{"reviewerName":"Cathy Sebastian","rating":"5.0 out of 5 stars","reviewTitle":"Great pot!","reviewDate":"August 19, 2019","reviewText":"Best thing I purchased in a long time! Use it every night! Heats water so fast!!"},{"reviewerName":"george trotman","rating":"5.0 out of 5 stars","reviewTitle":"Great kettle","reviewDate":"May 4, 2019","reviewText":"The kettle works great, boils water for tea works very well It arrived on time and does everything I need it to do. would purchase it again if I need another kettle What else can I say . It works well"},{"reviewerName":"Amazon Customer","rating":"4.0 out of 5 stars","reviewTitle":"Boils water!","reviewDate":"May 13, 2018","reviewText":"Perfect size for me and works great. My only issue is with the design. While pouring hot water you have to move your hand down to the bottom of the handle because the steam will make it a bit uncomfortable. Otherwise a great buy."},{"reviewerName":"lady","rating":"4.0 out of 5 stars","reviewTitle":"Small!","reviewDate":"January 6, 2019","reviewText":"The item is smaller than expected. Also the way the lead opens up is uncomfortable. But the design and led light look nice."},{"reviewerName":"joanE-reader","rating":"5.0 out of 5 stars","reviewTitle":"I was introduced to electric kettles on a trip to ...","reviewDate":"July 27, 2018","reviewText":"I was introduced to electric kettles on a trip to Ireland. Bought this one when I got home. Works well. Just what I wanted."},{"reviewerName":"Terri Bryant","rating":"5.0 out of 5 stars","reviewTitle":"Great Product","reviewDate":"April 11, 2019","reviewText":"Daughter got for boyfriend. It was the one he’d been looking at. He researches well!\nWas excited to receive it!"},{"reviewerName":"Nick Hair","rating":"4.0 out of 5 stars","reviewTitle":"Great product. Reliable.","reviewDate":"March 14, 2019","reviewText":"Great product. Second one I’ve purchased. Heats water quickly. Reliable. Works as described. Clean stainless look."},{"reviewerName":"Lauren","rating":"5.0 out of 5 stars","reviewTitle":"Quick boil","reviewDate":"November 27, 2018","reviewText":"Perfect for making tea! I also boil water in the kettle and then pour it in my saucepan instead of waiting for it to boil on the stove."},{"reviewerName":"Reszzzi","rating":"5.0 out of 5 stars","reviewTitle":"Heats up super quick and shuts off on its own","reviewDate":"February 1, 2018","reviewText":"I LOOOOVE THIS!!! Bought it for myself and my cousin. She told me to let y'all know it is BOMB.COM...LOL. Heats up super quick and shuts off on its own, plus it looks very cool with the blue light feature."},{"reviewerName":"Addie McManus","rating":"5.0 out of 5 stars","reviewTitle":"Love this product.","reviewDate":"May 8, 2019","reviewText":"God I love this kettle. Heats water fast. Idiot proof. Beautiful. Who knew that watching water boil could be so much fun?"},{"reviewerName":"Amazon_Customer","rating":"5.0 out of 5 stars","reviewTitle":"Nice kettle","reviewDate":"October 4, 2018","reviewText":"Great kettle, heats water fast.\nMy only complaint is the capacity vs the size. The max line is about half way up which is a lot lower than most other kettles"},{"reviewerName":"Betty Cloyd","rating":"5.0 out of 5 stars","reviewTitle":"Heats very quickly~","reviewDate":"October 8, 2018","reviewText":"I love that the kettle has no cord, and that the cord is hidden in the base. The top has some sharp edges when cleaning or drying the kettle, the only con side."},{"reviewerName":"Sandra Rego","rating":"5.0 out of 5 stars","reviewTitle":"so stupid loud whistle to worry about while I’m trying to ...","reviewDate":"December 30, 2017","reviewText":"This is a god sent especially with small children in the home who still nap, so stupid loud whistle to worry about while I’m trying to do laundry wash dishes or whatever else while waiting at the water to boil."},{"reviewerName":"Brittany Edwards","rating":"5.0 out of 5 stars","reviewTitle":"Smart buy","reviewDate":"October 31, 2018","reviewText":"Easy to use, and it doesn’t take more than 5 minutes for your water to start boiling and safe for all locations."},{"reviewerName":"Alex","rating":"4.0 out of 5 stars","reviewTitle":"A little small for a family. Probably perfect for one","reviewDate":"February 21, 2019","reviewText":"Easy to use. Top too small to get your head in to clean. A little too small for our family’s needs. Max volume is only 1 L ."},{"reviewerName":"Love shopping!","rating":"5.0 out of 5 stars","reviewTitle":"Looks nice and easy to use!","reviewDate":"June 19, 2019","reviewText":"Just got it today and used it twice (I am a big tea drinker) It is really nice and easy to use."},{"reviewerName":"Mardy","rating":"5.0 out of 5 stars","reviewTitle":"Very pleased","reviewDate":"September 20, 2019","reviewText":"Hot water in a jiffy! Handy, just the right size, & easy to clean"},{"reviewerName":"Shirley Jin","rating":"5.0 out of 5 stars","reviewTitle":"Great product","reviewDate":"July 24, 2019","reviewText":"In a word, it is a product with good quality and design. Love it."},{"reviewerName":"Kelsey","rating":"5.0 out of 5 stars","reviewTitle":"Just as Expected","reviewDate":"February 21, 2019","reviewText":"I have used it for over half a year, and so far there aren't any issues. Very glad with this purchase :)"},{"reviewerName":"Emily Ann","rating":"4.0 out of 5 stars","reviewTitle":"very nice and useful","reviewDate":"February 28, 2018","reviewText":"this works very well so far for me, heats up really fast, wish it had a thumb lift"},{"reviewerName":"SandSea","rating":"5.0 out of 5 stars","reviewTitle":"Nice and beautiful, no rust issue.","reviewDate":"September 18, 2019","reviewText":"Nice and beautiful, no rust issue like steel kettle"},{"reviewerName":"Maro","rating":"5.0 out of 5 stars","reviewTitle":"Perfect","reviewDate":"July 17, 2019","reviewText":"Saw this at my nieces & couldn’t wait to order"},{"reviewerName":"Michele K. Winslow","rating":"5.0 out of 5 stars","reviewTitle":"Love it!","reviewDate":"October 30, 2019","reviewText":"Works great! Just wish it held a bit more water."},{"reviewerName":"Kayleen Gill","rating":"5.0 out of 5 stars","reviewTitle":"Great buy","reviewDate":"October 3, 2019","reviewText":"Perfect for our small camper, heats extremely fast. Looks cool too!"},{"reviewerName":"Jim Bridger","rating":"4.0 out of 5 stars","reviewTitle":"Headline","reviewDate":"March 15, 2019","reviewText":"Really loud and sometimes blows a fuse in our crappy old house, but works fast and well."},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"love this","reviewDate":"July 22, 2019","reviewText":"This kettle is amazing, it boils so fast and the blue light is so nice. This is the perfect size"},{"reviewerName":"FF","rating":"1.0 out of 5 stars","reviewTitle":"Rust - Stay Away","reviewDate":"April 26, 2019","reviewText":"Rust inside the kettle within just 3 months. Only use it twice a day."},{"reviewerName":"ATDM","rating":"5.0 out of 5 stars","reviewTitle":"Can't really be improved.","reviewDate":"December 26, 2018","reviewText":"The larger units are too big for what I need. This is perfect. Very fast to boil. Can't really be improved."},{"reviewerName":"VaBeachHousewife","rating":"5.0 out of 5 stars","reviewTitle":"Great product","reviewDate":"June 18, 2019","reviewText":"Bought for my daughter. She loves it"},{"reviewerName":"Linda M. Lanford","rating":"5.0 out of 5 stars","reviewTitle":"Great product. Quick heated water.","reviewDate":"November 1, 2019","reviewText":"I’ve never had one before and was thoroughly impressed. Heats up quickly and the soft blue light at bottom shows when it’s done. Love it"},{"reviewerName":"Gardenmom","rating":"5.0 out of 5 stars","reviewTitle":"HOT water fast!!!","reviewDate":"July 30, 2019","reviewText":"This is a wonderful product. It heats water quickly to a high enough temperature so that the resulting beverage stays hot!"},{"reviewerName":"Alexandru Rosca","rating":"5.0 out of 5 stars","reviewTitle":"Great so far(2 months) Last thing to check is durability!","reviewDate":"May 30, 2019","reviewText":"Cleans easily, love the auto-shutoff"},{"reviewerName":"Jerry Bredemann Toyota sales","rating":"5.0 out of 5 stars","reviewTitle":"The best bang for the buck","reviewDate":"September 29, 2019","reviewText":"The best bang for the buck"},{"reviewerName":"Grandma","rating":"5.0 out of 5 stars","reviewTitle":"Electric Water Kettle","reviewDate":"February 18, 2019","reviewText":"This product heats water very quickly and efficiently. Like the automatic shut off feature."},{"reviewerName":"Kalea Swan","rating":"5.0 out of 5 stars","reviewTitle":"The size is perfect for our small kitchen","reviewDate":"January 11, 2018","reviewText":"The size is perfect for our small kitchen. This was my 10 year old granddaughter's Christmas present. It is the perfect size for her to safely handle yet big enough for her to serve the family tea and cocoa! Plus the blue light is just too fun!"},{"reviewerName":"Hunter 22","rating":"5.0 out of 5 stars","reviewTitle":"Heats water fast","reviewDate":"February 6, 2019","reviewText":"So far this pot is great. Don't know about the Durability,that is way the 4 star on that."},{"reviewerName":"YJ","rating":"5.0 out of 5 stars","reviewTitle":"Good","reviewDate":"November 29, 2018","reviewText":"Good price and great size, no longer to wait for a long time to get hot water with my traditional kettle"},{"reviewerName":"Darren Rains","rating":"1.0 out of 5 stars","reviewTitle":"lasted less than 3 months","reviewDate":"March 7, 2019","reviewText":"I liked the product and it worked well but only lasted about 3 months of light use."},{"reviewerName":"josue santiago","rating":"5.0 out of 5 stars","reviewTitle":"Great","reviewDate":"April 25, 2019","reviewText":"Work great , boils water fast"},{"reviewerName":"Stephan J.","rating":"5.0 out of 5 stars","reviewTitle":"Easy to use","reviewDate":"September 13, 2019","reviewText":"I love it and use it everyday! Simple fast and easy!"},{"reviewerName":"Mari Kigz","rating":"5.0 out of 5 stars","reviewTitle":"Love it","reviewDate":"June 23, 2019","reviewText":"Easy to use and clean...very quick to boil water"},{"reviewerName":"Geraldine E Green","rating":"5.0 out of 5 stars","reviewTitle":"Fast to boil","reviewDate":"January 2, 2019","reviewText":"I am a tea drinker, I want my pot to boil fast. This does the job.."},{"reviewerName":"Melody","rating":"5.0 out of 5 stars","reviewTitle":"Great kettle","reviewDate":"August 15, 2019","reviewText":"Sp perfect. I love to watch it, and it is fast."},{"reviewerName":"Heather D.","rating":"5.0 out of 5 stars","reviewTitle":"Fast and simple","reviewDate":"September 12, 2018","reviewText":"I love this thing! It makes tea time 10x faster."},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"What I wanted","reviewDate":"August 29, 2018","reviewText":"Love it, water heats up fast and super hot.. the water lasts hot for hours especially in a thermo mug"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Very happy to have purchased this kettle!","reviewDate":"November 25, 2018","reviewText":"This is a great kettle. Heats water very quickly and is easy to use and clean!"},{"reviewerName":"Angelica Armijo","rating":"5.0 out of 5 stars","reviewTitle":"works fast","reviewDate":"October 22, 2018","reviewText":"works fast and is small enough for my kids to use easily"},{"reviewerName":"Becky","rating":"5.0 out of 5 stars","reviewTitle":"Amazing!","reviewDate":"December 6, 2018","reviewText":"So convenient! Boils water in minutes. Can’t imagine like without it now"},{"reviewerName":"jeana","rating":"5.0 out of 5 stars","reviewTitle":"Great kettle","reviewDate":"February 28, 2019","reviewText":"We really like this kettle It is super fast and boils to very hot"},{"reviewerName":"Sandy","rating":"5.0 out of 5 stars","reviewTitle":"Looks great and boils fast!","reviewDate":"July 6, 2018","reviewText":"Works great and boils water so fast. I love using it for tea in the morning. And the blue lights are very pretty."},{"reviewerName":"Anita Prickett","rating":"5.0 out of 5 stars","reviewTitle":"Does its job","reviewDate":"September 18, 2019","reviewText":"Heats up water quickly and turns off when the water boils. Just a simple, smallish electric kettle that does as advertised."},{"reviewerName":"T. Evans","rating":"5.0 out of 5 stars","reviewTitle":"Great kettle!","reviewDate":"June 1, 2019","reviewText":"Love this kettle and the blue light is so cool!"},{"reviewerName":"B","rating":"5.0 out of 5 stars","reviewTitle":"Wonderful","reviewDate":"July 21, 2019","reviewText":"Quick and efficient way to heat water for tea etc..."},{"reviewerName":"J. Brown","rating":"5.0 out of 5 stars","reviewTitle":"Fast boiling water!","reviewDate":"January 3, 2019","reviewText":"Heats one quart at a time. I use it for boiling water for cooking and hot drinks. This is the first clear glass one I've had, so far looks like it will go the distance."},{"reviewerName":"Deb","rating":"5.0 out of 5 stars","reviewTitle":"Heats up the water in 60 seconds","reviewDate":"September 12, 2018","reviewText":"I am always running around, so I appreciate how quickly this heats up the water. Great product"},{"reviewerName":"Bashar","rating":"5.0 out of 5 stars","reviewTitle":"Good quality kettle","reviewDate":"June 24, 2019","reviewText":"Good quality and good size! Love it"},{"reviewerName":"Alixandria","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"February 22, 2018","reviewText":"Very useful, heats water at a decent speed. The auto shut-off is helpful. Also love the blue lighting."},{"reviewerName":"Austin Vojta","rating":"5.0 out of 5 stars","reviewTitle":"Works great","reviewDate":"December 9, 2018","reviewText":"Leave this on my desk at work for making tea. It's pretty quick and quiet, and looks great. Have had no issues at all."},{"reviewerName":"TrekMom","rating":"5.0 out of 5 stars","reviewTitle":"Love this !","reviewDate":"February 8, 2019","reviewText":"Great value for the money. Easy to use."},{"reviewerName":"Richie D","rating":"5.0 out of 5 stars","reviewTitle":"Quick Boiler","reviewDate":"January 21, 2019","reviewText":"Great teapot with excellent features. Quick boiler."},{"reviewerName":"Wolf","rating":"4.0 out of 5 stars","reviewTitle":"Like ability to see boil","reviewDate":"May 3, 2019","reviewText":"Like ability to see boil"},{"reviewerName":"Jennifer","rating":"5.0 out of 5 stars","reviewTitle":"I love this. It works perfectly and for the price you can’t beat it.","reviewDate":"October 15, 2018","reviewText":"I definitely recommend. It works great and it is easy to clean."},{"reviewerName":"David Knox","rating":"4.0 out of 5 stars","reviewTitle":"It works great","reviewDate":"September 5, 2018","reviewText":"This kettle looks elegant on my kitchen counter,\nBoils very quickly and works great!\nI would recommend this to anyone."},{"reviewerName":"Happy","rating":"5.0 out of 5 stars","reviewTitle":"Love it","reviewDate":"October 30, 2018","reviewText":"Easy to use,cooking fast."},{"reviewerName":"heather Z","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"August 27, 2018","reviewText":"Does exactly what it says it will do."},{"reviewerName":"Beau","rating":"5.0 out of 5 stars","reviewTitle":"Happy","reviewDate":"September 28, 2018","reviewText":"Works great and is efficient. No problems as mentioned by others."},{"reviewerName":"PDH","rating":"5.0 out of 5 stars","reviewTitle":"Great for a hot tea drinker.","reviewDate":"November 1, 2019","reviewText":"Heats the water fast. Great for a tea drinker."},{"reviewerName":"AllPartsMove","rating":"3.0 out of 5 stars","reviewTitle":"Not too reliable","reviewDate":"July 30, 2019","reviewText":"Started showing problems within 5 months. Too bad. Not a bad product, but it's falling apart with only one or 2 uses a day."},{"reviewerName":"Julia Byrd","rating":"5.0 out of 5 stars","reviewTitle":"Perfect!","reviewDate":"September 24, 2018","reviewText":"Love it! Great size for the counter top. Water heats up super fast"},{"reviewerName":"D. G. Wright","rating":"4.0 out of 5 stars","reviewTitle":"Boils water!","reviewDate":"March 17, 2018","reviewText":"It boils water. What's to say, other that when turned on, the blue lights make it look like a truck stop. A bit clumsy to fill."},{"reviewerName":"James T.","rating":"5.0 out of 5 stars","reviewTitle":"Buy it, It's affordable!!!","reviewDate":"September 30, 2019","reviewText":"Energy saving tea pot. Saves me time and money boiling water for tea and coffee."},{"reviewerName":"holzea","rating":"5.0 out of 5 stars","reviewTitle":"Heats up fast","reviewDate":"April 6, 2019","reviewText":"Great product"},{"reviewerName":"Fawz Hussein","rating":"5.0 out of 5 stars","reviewTitle":"Quick","reviewDate":"March 28, 2019","reviewText":"Get your boiled water quickly. Low capacity, but I don't need that much anyway."},{"reviewerName":"KKCorms","rating":"5.0 out of 5 stars","reviewTitle":"Best purchase ever.","reviewDate":"October 20, 2018","reviewText":"Just mad that I didn't buy one of these years ago!"},{"reviewerName":"WangKai","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"September 15, 2018","reviewText":"good easy to use"},{"reviewerName":"Stephanie Rodriguez","rating":"5.0 out of 5 stars","reviewTitle":"Look no further! Great design and affordable!","reviewDate":"February 10, 2019","reviewText":"Works perfectly!"},{"reviewerName":"elena janovec","rating":"5.0 out of 5 stars","reviewTitle":"very useful","reviewDate":"December 26, 2018","reviewText":"Love it, fits great on my small counter. I use it many times all day long."},{"reviewerName":"mike riley","rating":"4.0 out of 5 stars","reviewTitle":"Four Stars","reviewDate":"May 7, 2018","reviewText":"Wife loves it"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Hot water fast!!","reviewDate":"February 17, 2018","reviewText":"Used several times so far boils water faster then anything I have ever seen !"},{"reviewerName":"Julie R. Oros","rating":"5.0 out of 5 stars","reviewTitle":"Hot water","reviewDate":"January 29, 2019","reviewText":"Love it."},{"reviewerName":"AV","rating":"5.0 out of 5 stars","reviewTitle":"Electric kettle","reviewDate":"October 25, 2018","reviewText":"I have been looking for a glass kettle for a while and I finally find the one. Really nice and works well, super fast and durable. Fits the budget and it is awesome!\nI will recommend!"},{"reviewerName":"curtis","rating":"5.0 out of 5 stars","reviewTitle":"Great electric kettle!","reviewDate":"October 14, 2018","reviewText":"Works very well, would buy again."},{"reviewerName":"Bethel Mom","rating":"5.0 out of 5 stars","reviewTitle":"LOVE IT A+++++","reviewDate":"September 11, 2018","reviewText":"LOVE, LOVE, LOVE THIS GLASS KETTLE."},{"reviewerName":"Brenda Morales","rating":"5.0 out of 5 stars","reviewTitle":"Love it!","reviewDate":"September 28, 2019","reviewText":"Great for hot tea and hot cereal when in the go!"},{"reviewerName":"Barry","rating":"5.0 out of 5 stars","reviewTitle":"Works great. Looks great","reviewDate":"December 25, 2018","reviewText":"Works great. Looks great"},{"reviewerName":"Liliane","rating":"5.0 out of 5 stars","reviewTitle":"Very good","reviewDate":"August 16, 2019","reviewText":"I love"},{"reviewerName":"Tampajock","rating":"5.0 out of 5 stars","reviewTitle":"fast water boil","reviewDate":"February 21, 2018","reviewText":"fats water boils in 2minutes great product and looks good too"},{"reviewerName":"Vered","rating":"5.0 out of 5 stars","reviewTitle":"Beautiful as described","reviewDate":"October 12, 2018","reviewText":"Water boiling very fast."},{"reviewerName":"Cerise Marino","rating":"5.0 out of 5 stars","reviewTitle":"Great for office","reviewDate":"January 31, 2019","reviewText":"Perfect"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"I love my tea pot","reviewDate":"January 16, 2018","reviewText":"I love my tea pot! The water brews quickly and quietly, and it's easy to keep clean. 1 year in and I use it every day. No problems whatsoever."},{"reviewerName":"Unknown","rating":"5.0 out of 5 stars","reviewTitle":"I will get one for myself.","reviewDate":"November 6, 2018","reviewText":"This was a birthday gift and she was extremely pleased. She said the water heated very fast."},{"reviewerName":"ItsTeatime","rating":"5.0 out of 5 stars","reviewTitle":"Great little kettle","reviewDate":"March 13, 2018","reviewText":"Takes about a min to boil if filled to the MIN line."},{"reviewerName":"agnes","rating":"5.0 out of 5 stars","reviewTitle":"speed of heating; easy to keep clean","reviewDate":"June 28, 2019","reviewText":"we drink tea every day so this is a must for our kitchen!"},{"reviewerName":"1more59","rating":"5.0 out of 5 stars","reviewTitle":"Love Love","reviewDate":"August 19, 2019","reviewText":"It only takes a few moments for the water to boil and it auto shuts off when reaches boiling point"},{"reviewerName":"Cam S","rating":"5.0 out of 5 stars","reviewTitle":"this is great","reviewDate":"September 17, 2018","reviewText":"i use at my desk at work. i love it"},{"reviewerName":"Diane629","rating":"5.0 out of 5 stars","reviewTitle":"Great product","reviewDate":"January 31, 2019","reviewText":"Easy to use, cool blue light when it's on, auto shut off, boils fast!"},{"reviewerName":"Elese Beason","rating":"5.0 out of 5 stars","reviewTitle":"Easy to use","reviewDate":"August 16, 2019","reviewText":"I love it this is my second one"},{"reviewerName":"Mila","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"September 5, 2018","reviewText":"Love it!"},{"reviewerName":"B","rating":"5.0 out of 5 stars","reviewTitle":"Works great","reviewDate":"October 22, 2018","reviewText":"Fast kettle very attractive"},{"reviewerName":"Yariv Mizrahi","rating":"3.0 out of 5 stars","reviewTitle":"Base is leaking","reviewDate":"January 13, 2019","reviewText":"Price and design is good, but the base always wet looks like its leaking from the bottom of the kettel."},{"reviewerName":"natalie","rating":"5.0 out of 5 stars","reviewTitle":"Quickness","reviewDate":"January 20, 2019","reviewText":"Love it !! So quick and easy to use"},{"reviewerName":"Stephanie Kalkes","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"March 20, 2018","reviewText":"Warms up water super fast! Co-workers love this for making tea at work!"},{"reviewerName":"ROBERT K SCOTT","rating":"4.0 out of 5 stars","reviewTitle":"Limited capacity.","reviewDate":"August 24, 2019","reviewText":"Does not have as much capacity as I expected."},{"reviewerName":"AlaskaFan","rating":"5.0 out of 5 stars","reviewTitle":"A must have","reviewDate":"February 24, 2019","reviewText":"Very easy to use. Definitely prefer it over the stovetop kettle."},{"reviewerName":"Comfort'sthekey","rating":"5.0 out of 5 stars","reviewTitle":"A great buy!","reviewDate":"June 18, 2019","reviewText":"It heats the water very quickly!"},{"reviewerName":"Jose M. Santos","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"January 9, 2018","reviewText":"works great"},{"reviewerName":"Ivelina","rating":"5.0 out of 5 stars","reviewTitle":"very good","reviewDate":"October 26, 2018","reviewText":"a good product"},{"reviewerName":"Yuki","rating":"5.0 out of 5 stars","reviewTitle":"Attractive and practical","reviewDate":"April 1, 2018","reviewText":"Size makes it lightweight, and the blue light makes it easy to see when it's heating."},{"reviewerName":"neil.a","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"January 28, 2018","reviewText":"soilid"},{"reviewerName":"Chris W.","rating":"5.0 out of 5 stars","reviewTitle":"Great pot, easy to use.","reviewDate":"September 20, 2017","reviewText":"My wife needed some boiling water quick and this boiled the water quick. Got it boiling fast and saved her coffee day. She was leaving and didn't have her coffee. Son rushed to the kettle, filled it, started it and boom, boiling water for the french press. Hamilton saved the day for her at least.\n\nThis kettle is pretty neat. It is pretty small and really doesn't take up a lot of space. I use it for everything that needs hot water. That includes coffee, tea, soup, ramen and anything else that might need boiling water. You plug it in, turn it on and less than 2 minutes later you have heated water. It feels solid which is important. The handle doesn't get hot and the glass is perfect for boiling water.\n\nIt really isnt very expensive and does look really nice. It is well worth the cost of admission and I would have no issues buying another in the future for wherever there might be a need for one. I can see this being very useful in an office or at a desk where space is at a premium"},{"reviewerName":"Peter Franzke","rating":"5.0 out of 5 stars","reviewTitle":"Solid handle stays cool during use. Fast boiling times.","reviewDate":"March 25, 2019","reviewText":" PROS - Sturdy handle construction that doesn't get hot during use. The metal base Allows for quick boiling times. The top snaps down firmly in place to avoid over spills.\n\nCONS - I actually wish the spout opening was a little smaller. You do need to be careful when you're pouring for if you keep it too far well the cap will not come loose the water can spray out a little bit. If you're careful Like you should be with hot water you won't run into any issues.\nit's hard to knock this thing for not having a temperature control as it's not really what we're looking for but as other manufacturers have appliances that do so you have to at least mention it.\n\nCONCLUSION - if you're looking for a daily hot water boiler you cannot go wrong with this one. It really does boil water fast and you feel safe in using it."},{"reviewerName":"K. Groh","rating":"5.0 out of 5 stars","reviewTitle":"Wonderful for an Afternoon Cuppa!","reviewDate":"September 14, 2017","reviewText":"Being an imported Brit, this is a great thing to have for making a quick cup of tea. It boils quickly and I love the clear carafe and blue light.\nThe turn on switch is easy to tap on (and off). The lid can open and stay open for cleaning out and filling. The handle is easy to grip. The carafe lifts off easily for pouring. It's great for boiling water for cooking (faster than on the stove), water for packet soups, hot tea, instant coffee, etc."},{"reviewerName":"Keith Alan","rating":"4.0 out of 5 stars","reviewTitle":"Really fast boiling","reviewDate":"September 14, 2017","reviewText":"Europe has had electric kettles for a long time. Happy to see they finally made it here. HB is one of those brands I remember as a kid and I am no spring chicken! The kettle works great. It only takes a few minutes to heat up the water vs. 10 minutes on a stove. It is glass which is a huge plus. Some brands use plastic or metal. It lights up blue when it is on and has an auto shutoff. Not sure why the description says compact, as it is a good size for me. My only complaint is how the lid locks and unlocks. Let it cool down before opening the lid! The steam will burn you. The spout has a filter, so if you are adding lemon zest or making tea, it will only pour out the liquid."},{"reviewerName":"Roy","rating":"5.0 out of 5 stars","reviewTitle":"Love it!","reviewDate":"September 21, 2017","reviewText":"This is my very first ever electric kettle. With the weather cooling off soon (we hope!) we will be back to drinking tea and cocoa along with our daily coffee. I don't like the kids using the microwave to heat water, too much room for danger. Don't really like them fiddling with the gas stove either. This is a perfect compromise. It boils water very quickly, about two minutes by my not very precise measurement. The cord is short and wraps up into the base for neat storage when not in use. The lid is easy to remove and put back on. The on switch is easy to find and use. The glass carafe is easy to fill, with a very clearly marked \"max\" line. Easy to clean too. The bright blue LED comes on when the kettle is on. Bright and easy to see. Seems like a great kettle for the price."},{"reviewerName":"Tonia","rating":"2.0 out of 5 stars","reviewTitle":"Holds too little water.","reviewDate":"March 14, 2018","reviewText":"Works great to heat water....but only heats 24 ounces! The blue light doesn't make it worth the price or the small amount of water it heats. Just go to Walmart and but one for half the price that heats double the water."},{"reviewerName":"Krista L. Wilbur","rating":"5.0 out of 5 stars","reviewTitle":"Easy to use, easy to clean, and pretty","reviewDate":"April 21, 2019","reviewText":"I received this tea kettle as a house warming gift and I use it at least twice a day — once to boil water for coffee and once for tea. It is quick and gets the water hot, hot, hot! I am not always good at emptying it out after I’m done and I have hard water so I get a lot of build up in the bottom, but I follow the directions in the user guide to remove it and it works like a dream. Because of the build up, I appreciate the mesh guard at the mouth of the kettle."},{"reviewerName":"R. Song","rating":"5.0 out of 5 stars","reviewTitle":"Let The Tea Guzzling Begin","reviewDate":"September 16, 2017","reviewText":"Being an avid tea drinker, electric kettles are necessary to support this habit. This particular one is a great value for the price.\nI filled it up to the max, 1 liter, and it boiled in about 5min, which is on par with other electric kettles out there. The boiling switch is underneath the handle, and once the kettles reached boiling, it switches itself off. The blue light only comes on while the kettle's heating up, so you'll know when it's done. It's a bit loud for an electric kettle, (alright I admit I'm used to fancy ones) but nothing so bad as a stovetop kettle!\nThe glass not only looks great, but is the best material for boiling water, as it won't leach chemicals into the water. The top is plastic, but the water is so far away from it, except when pouring, that it's not going to hurt much. There's also a built in filter, should you throw in tea leaves or something. And hey, it's easy to clean with all that glass! I had no issue with odd plastic smells after I washed it (handwash). It fits right on the base, which has a spool to wrap the cord in, so it's not sprawling all over the counter.\nAs for its compactness...it's only a few inches shorter than my Epica kettle. So not terribly compact I think, but it's certainly a good size to fit on a smaller counter. I'm seriously considering bringing it to work in cubeville.\nHamilton Beach is a pretty solid brand, (I've had to exchange stuff before and they were great) so I expect that this will last for some time. Not forever, but I'll get my $25 out of it. For a decently priced electric kettle this is a wonderful choice!"},{"reviewerName":"Storywise","rating":"1.0 out of 5 stars","reviewTitle":"Spend more for a better product - lid plastic mechanism breaks easily","reviewDate":"March 6, 2019","reviewText":"While it is simple to operate, the plastic parts that are a part of the lid mechanism don't hold up for long (then the lid won't seal properly). Spend a little more and get a better brand."},{"reviewerName":"Marlene and Mark","rating":"5.0 out of 5 stars","reviewTitle":"It has a LED light inside of it that turns on when it is in use so you can easily see the water boiling from another room","reviewDate":"February 25, 2018","reviewText":"This works so well when I need hot water fast! It literally takes just a minute or two to heat up the water and it is safe as the bottom detaches from the kettle so the bottom is not hot! It has a LED light inside of it that turns on when it is in use so you can easily see the water boiling from another room. It is made out of durable glass."},{"reviewerName":"C B","rating":"1.0 out of 5 stars","reviewTitle":"Doesn’t last long!","reviewDate":"January 27, 2019","reviewText":"I bought this for my husband to use in his office 5 months ago and now half of the lights have stopped working and it doesn’t boil as fast. I’m assuming only half of the heating elements are working. :("},{"reviewerName":"T M Walton","rating":"1.0 out of 5 stars","reviewTitle":"broken switch, stays on","reviewDate":"March 28, 2019","reviewText":"Lid pops open or won't latch properly.\nWorst part is after 1 month of use it won't turn off, switch is busted. It gets used twice a week, so it's like it wore out. Now it heats but will steam up your whole kitchenif you don't watch it"},{"reviewerName":"Amazon Customer","rating":"4.0 out of 5 stars","reviewTitle":"Nice and Pretty.","reviewDate":"May 4, 2019","reviewText":"I bought this for my kitchen at work. So far so good. But, the first couple of rounds the water had a weird smell. I recommend not using those."},{"reviewerName":"Gustav","rating":"2.0 out of 5 stars","reviewTitle":"Metal handle slices fingers","reviewDate":"October 7, 2019","reviewText":"Worked great for about a year and suddenly the metal accent piece became slightly unglued basically becoming a blade, and slicing my finger. Unusable now and dangerous. Would not buy a again."},{"reviewerName":"J.Park","rating":"5.0 out of 5 stars","reviewTitle":"Great Quick Boiled Water.","reviewDate":"September 15, 2017","reviewText":"Great, Compact kettle with a cool blue tint. We love these kettles for some quick boiled water. Make hot cocoa, tea, etc. in minutes without the stove or microwave. It shuts off automatically and really just simplifies life! We love it."},{"reviewerName":"S.S.","rating":"4.0 out of 5 stars","reviewTitle":"I like it.","reviewDate":"May 15, 2019","reviewText":"I wish the lid opened with press of a button on the handle."},{"reviewerName":"Rachel P.","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"April 8, 2018","reviewText":"Good size, efficient, and visually appealing when in use"},{"reviewerName":"V. James","rating":"4.0 out of 5 stars","reviewTitle":"Watch for the blue lights","reviewDate":"November 13, 2019","reviewText":"The blue lights were unusual but you get used to them. Works fine"},{"reviewerName":"OregonConsumers","rating":"5.0 out of 5 stars","reviewTitle":"Love it","reviewDate":"March 25, 2019","reviewText":"Love it so far. Very quick to boil water."},{"reviewerName":"J Matt","rating":"4.0 out of 5 stars","reviewTitle":"Use it every day","reviewDate":"March 25, 2019","reviewText":"I fill this kettle from a Zerowater pitcher I keep in the refrigerator, and it heats up the cold water to boiling fast! Stainless steel bottom still shiny clean after a solid month of daily usage, probably helped by the Zerowater filtering of my tap water. Minus one star due to the initial plasticy smell from the top cover mentioned by another reviewer. Smell went away after a week or so of usage and it didn't affect the taste of the water. I probably would not have noticed it except for the mentioning by other reviewers so I checked for it. No concerns about it now."},{"reviewerName":"Travis Dobson","rating":"5.0 out of 5 stars","reviewTitle":"Amazing","reviewDate":"November 13, 2019","reviewText":"This is great! I had a metal one that started to rust"}],"qAndA":[{"question":"To the manufacturer?seller; Does water come in contact with metal or plastic?","answer":"The bottom of the \"pitcher\" that hold the water is all metal. And, of course, if you do not use the boiled water immediately, steam will drip down from the plastic lid."},{"question":"Is there plastic? lid? inside? outside?","answer":"The lid is plastic. The carafe is glass and the heating element is stainless steel."},{"question":"How do you get rid of the plastic smell? Completed the instructions and still cannot use it?","answer":"I never noticed any plastic smell. I leave the lid up ALL THE TIME, that means the lid is up when water is heating up, when pouring, and when not in use. I never close it so hot water does not come in contact with the plastic lid AT ALL."},{"question":"I love this kettle but after the water comes to a boil everything tastes like plastic. I tried boiling vinegar and baking soda but nothing helps. help","answer":"I have used this hundreds of times in the last year and a half. I have never had water from this taste like plastic. There are no plastic parts touching the water."},{"question":"Will the glass break if cold water is poured into hot pot?","answer":"No, it doesn’t break, love this kettle!!"},{"question":"Does hot water ever touch plastic or is it just glass and steel inside?","answer":"It's just glass and steel inside"},{"question":"Does the handle get hot after the water is boiling?","answer":"No, the handle does not get hot."},{"question":"Is there plastic in contact with the liquid at any point?","answer":"There is a filter at the top of the kettle that has some plastic framing in order to keep it rigid/in place"},{"question":"How long does the water stay hot after automatic turn off?","answer":"The base and carafe are not thick or dense so water will begin cooling right away depending on your room temperature."},{"question":"What is mesh filter made of?","answer":"My guess is plastic"},{"question":"Does it have any plastic ring inside the bottom of the kettle that will contact the water?","answer":"No."},{"question":"How long does the water stay hot for?","answer":"Isn't really made to keep water hot. Shuts off when pressure builds up after water boils. Stays pretty hot for 15+ min or so I'd say."},{"question":"I have had my kettle for a few weeks but finding the inside metal bottom is turning brown, how do I clean it, it says no abrasive cleaners.?","answer":"Hi Libkid and thanks for your question. This discoloration is quite normal and is caused by the naturally occurring minerals found in your water. Place either 1/2 teaspoon (5 ml) cream of tartar (available in the spice aisle of grocery store) or 1 tablespoon (15 ml) white vinegar or lemon juice into the kettle. Then f… see more"},{"question":"does this kettle works on a 50/60 voltage","answer":"I am sorry I do not know what 50/60 voltage means? Are you off grid?"},{"question":"travel. has anyone used this product in their car with 110V adapter?","answer":"Ummm........I would NOT use this in my car. It gets too hot, I mean BOILING hot, and it wouldn't be worth the trip to the hospital for a cup of tea. However, if you are talking about in an RV, I would say, \"Yes!\""},{"question":"can i heat broth in this kettle?","answer":"It's a kettle. You could heat any liquid you want. That said you probably shouldn't as cleaning it up would be difficult and could lead to undesirable build up of crud. Keep in mind that this heats very quickly so thicker liquids will likely scorch or even burn"},{"question":"Can I warm up coffee?","answer":"I think it is for water only..not sure...my Mom has boiled eggs in it..sorry I couldn't help.."},{"question":"How loud is it when it's heating? I'm planning on using this at a desk.","answer":"It is not loud at all. I love mine"},{"question":"Is the lid removable or a flip up top? Is it easy to reach inside to clean it?","answer":"I never removed the lid. And I don’t have a hard time cleaning it"},{"question":"What kind of of metal is the inner metal of the kettle?","answer":"It is stainless steel."},{"question":"How long does it take to boil?","answer":"Its very fast even when full..."},{"question":"is it stainless steel on the inside ?","answer":"Yes. The Hamilton Beach Model 40930 1 Liter Kettle has a stainless steel heater plate in the bottom."},{"question":"Is this borosilicate glass?","answer":"I assume it's not borosilicate. That's a selling point so any product using it would probably say so in their info for the product."},{"question":"What is the diameter of the base? and total height when kettle is on base?","answer":"Base diameter is about 5.75\". Total height included base is 9\"."},{"question":"Does this item ship in 3-4 months as stated in the description info? Or does it ship in 2 days with Prime as stated in options & by \"Prime\" checkmark?","answer":"Mine was shipped in 5 days to Rhode Island"},{"question":"Does it have a warranty","answer":"No idea, but it doesn't have a lot of moving parts and it has performed quite well since we got it. Boils water FAST."},{"question":"Does this have California prop65 warning or not?","answer":"I'm sorry, I don't know what California prop65 is."},{"question":"Is this a sealed glass carafe with a steel plate between it and the heating element?","answer":"The carafe is sealed but the water touches metal on the bottom, no glass on the bottom which is not what I wanted. However it is hard to find a truly all glass model.BTW this thing heats really fast but it boils the water too much for my liking before the auto shut-off kicks in. At least this model is still functional … see more"},{"question":"Does the top open all the way? Some tops open half way.","answer":"Yes"},{"question":"Does the heating plate get rusted ?","answer":"I don't know. My after few months of use still looks fine."},{"question":"how long is the cord?","answer":"About 3feet"},{"question":"how do I remove the glass part?","answer":"The glass part does not separate from the first metal band. It does separate from the bottom, which is the heating element. As far as I can see, the top half is a single unit."},{"question":"Is it dishwasher safe?","answer":"I don't wash it in the dishwasher because of the base of the kettle."},{"question":"Can the mesh strainer be removed?","answer":"It is very easy to forcibly remove the filter. The real question is if the filter can then be placed back on the device."},{"question":"What is the length of the cord?","answer":"3 feet."},{"question":"why does the \"glass\" carafe feel like plastic? It feels cheap and far too lightweight","answer":"It is fine. Works well"},{"question":"Is this water kettle BPA free?","answer":"It's mostly glass and stainless steel, so I would think so, but it doesn't make that claim, so you could not be sure that droplets from the plastic top might not drip down. Speaking of the plastic top, it does not want to stay open, the only thing I don't like about this pot!"},{"question":"How long did it take to ship to you?","answer":"Between 1-2 months it says. Too slow. Not worth it."},{"question":"Does the lid flip up fast?","answer":"Not sure what you mean, you’re the one that flips up the lid. There’s nothing special about it."},{"question":"My kettle no longer turns off when it is done boiling, is there a fix for this?","answer":"I have no idea. Contact Hamilton Beach and ask them."},{"question":"are the lights on the inside of the glass pitcher part? And are they coated in plastic?","answer":"The lights are on the outside of the pitcher. However, half the lights quit lighting after about a month of use."},{"question":"Does the water touch metal in the bottom of the pot? Or is it fully lined with glass?","answer":"Metal on bottom, glass elsewhere."},{"question":"is this 110v only or does it support 220v as well?","answer":"110 only"},{"question":"Is this glass lead free? plastic bpa free??","answer":"??????"},{"question":"Is the outside of the glass get hot to the touch when the water is boiling?","answer":"yes but there is a very good not hot handle"},{"question":"Does it bpa free","answer":"It is glass, not plastic."},{"question":"How long does it take to bring water to a boil?","answer":"It depends on how full the pot is. At the max filling (1/3) of the pot, approximately 3 minutes. For 2 cups of water, 1-2 minute. Approximately half the time of s traditional tea pot on a cooktop."},{"question":"How hot does the water get?","answer":"Very hot, full boil."},{"question":"Can an infuser be used?","answer":"I don’t think an infuser can be used. I have a container that has an infuser that I use for ice tea."},{"question":"Is it BPA-free?","answer":"The plastic is BPA-free. And there is very, very little plastic in this, it’s basically a glass container, and the bottom is either glass covering metal or just metal, I cannot tell which. The plastic top does not contact the water, and it boils so briefly (and when you pour, the contact between water and the top is so… see more"},{"question":"how do I remove the glass part?","answer":"The top half is a single piece, the metal band does not come off as far as I can tell. The bottom piece is separate, the actual heating element."},{"question":"What type of water should i use","answer":"You can use any water I always use reverse osmosis. If you use tap water then I would clean it once a month with vinegar."},{"question":"It looks like the screen that the water pours through is framed in plastic. does the packaging state bpa free?","answer":"Don't know. Can't be that much bpa even if there is, really."},{"question":"Once it brings the water to a boil, does it the water hot and for how long. Or does it just turn off?","answer":"It turns off by itself, keeps hot, but it is glass, and if your house is cold, then it will eventually cool off, There is not warming unit if that is your question"},{"question":"Will it work with smart plug so I can turn on with Alexa?","answer":"??????"},{"question":"I guess its not BPA free?","answer":"It is borosilicate glass, not plastic, the plastic is not touching the water. Except for a tiny screen at the aperture."},{"question":"How long is the cord?","answer":"The cord is 2 ft. long."},{"question":"How do you remove mesh filter?","answer":"I have no idea. You should only be putting WATER into the pot so I'm not really sure why it's even there."},{"question":"How long does it take to boil 1 quart of water?","answer":"The markings on the pot our in liters, 1 liter being the max you should fill to. It takes about 4 minutes to boil, and that is with cold water."},{"question":"Can this be used in a vehicle with an AC adapter, letting the engine run?","answer":"Not that I’m aware of has a plug 🔌 on end of cord"},{"question":"I understand the bottom may discolor, but does the body of the kettle discolor?","answer":"I have it only for 2 months but so far so good... This is a beautiful Kettle"},{"question":"Is the materials BPA free?","answer":"It is glass"},{"question":"Does the lid come off completely?","answer":"No"},{"question":"does it have any smell?","answer":"no it does not have any smell"},{"question":"Qué alimentación tiene el aparato: 110 v o 220 v ?? necesito que funcione en españa","answer":"Es 110"},{"question":"what is the minimum amount of water","answer":"There is no minimum. And if it boils dry, it shuts off. You can boil just enough for one cup if you like."},{"question":"Is this made in China?","answer":"Yes, according to the box that it came, it's made in China. I'm definitely NOT thrilled about that... but I'm loving the kettle itself."},{"question":"I ordered this on the 9th of March and why am I waiting for this between 1-2 months?","answer":"I would contact seller directly"},{"question":"Does the lid come off completely of just flip up?","answer":"The lid only flips up."},{"question":"Can the mesh strainer be removed?","answer":"No, not sure why you'd want to do that."},{"question":"The shipping speed says ‘usually ships within 3 to 4 months’, is it really that slow?! How soon did it ship for people after an order is placed?","answer":"it arrived in 2 weeks"},{"question":"Does it have different temperature settings?","answer":"No"},{"question":"Could tea bags be put into this, to make one big batch, or would I be stuck making individual cups?","answer":"You could for sure, but I don't do that I would poorhot water into different pitcher,Incase you boil water to make soup it will taste for tea then or make other tea and it will have the other tea flavor mixed . Your choice but you can make one batch . Love this product so nice !! So quick too . Boil water for my soup… see more"},{"question":"What is the length of the cord?","answer":"3 feet."},{"question":"Is it compatible with overseas 220 volt electricity?","answer":"Sorry no idea. But the teapot is awesome and works great!"},{"question":"does this use Strix technology for auto turn off?","answer":"it is auto turn off"},{"question":"why does this say usually ships in 1-2 months?","answer":"I have no idea. I have ordered 2 of these and they shipped the day I ordered each one."},{"question":"How many watts?","answer":"Funny, the English instructions do not list this, but the Spanish version says 1500 Watts. But geez, it's only on for 60 seconds before I have boiling water."},{"question":"has anyone had a problem with the pot boiling over?","answer":"NO, we have never filled beyond the max line"},{"question":"Does it leave boil spots on the bottom after several uses?","answer":"Hard water will leave carbonate residue. I will clean-out, as needed, with vinegar."},{"question":"Does it have a concealed heating element? I'm looking for a kettle for a dorm, and can't have an open heating element.","answer":"Yes. Not exposed at all. Electric contacts are internal. A very nice device."},{"question":"What happens if you fill it past the max line? It looks like there’s plenty more room in the kettle.","answer":"I haven’t tried that but imagine the suggested max is to avoid the vigorously boiling water from splashing through the pouring spout causing burns."},{"question":"Is this induction technology, like induction stoves? That's where the hydro saving is.","answer":"Thank you for your question. No, this unit is not induction, it uses a heating element to heat the water."},{"question":"Can I use this with 220 voltage?","answer":"No"},{"question":"what is the minimum amount of water you are supposed to use with this?","answer":"half liter I think"},{"question":"The shipping speed says ‘usually ships within 3 to 4 months’, is it really that slow?! How soon did it ship for people after an order is placed?","answer":"mine on ly took 2 weeks, it might depend on stock available and dates for restocking?"},{"question":"The ad says the anti scale filter is removable for easy cleaning. Is this true?","answer":"Yes"},{"question":"hi, when it's on & you lift the pot off the base, does it turn off, or does it stay on so when you put it back on the base it continues to heat?","answer":"It automatically stops, all you need to do is press the lever to start again. Love that kettle. Use it several times a day."},{"question":"Can you heat milk with this?","answer":"You can but you'd need to wash it immediately. The kettle is hand wash only and you wouldn't want milk crust."},{"question":"Is it BPA free?","answer":"The water does not touch plastic. Just glass and the metal bottom plate."},{"question":"Why does it take 1 to 2 months for this item to ship?","answer":"I have no idea. I have ordered 2 of these and they shipped the day I ordered each one."},{"question":"Does it actually take 3 months before it ships? If so I will go for another option.","answer":"mine arrived in 2 weeks."},{"question":"Does it have any plastic ring inside the bottom of the kettle that will contact the water?","answer":"No"},{"question":"Is this kettle UL approved?","answer":"I think so"},{"question":"Can you boil more than 1L of water?","answer":"You could but it is not recommended"},{"question":"Does the water touch only glass or is there metal in the bottom of the pitcher?","answer":"It has to have metal in the bottom or wouldn't get hot enough to boil the water, and quickly. Electric kettles all have metal in the bottom to do the heating although their walls may be glass, plastic, or metal."},{"question":"How much does the kettle alone weigh? (excluding base)","answer":"Between 1 lb and 1.5 lb....heavier with more water but I usually just fill it with the water I need for that cup of tea so that it takes a little less time to heat up. I rarely fill it up to the maximum line. Not heavy at all. Kettle is also easy to hold too. Hope this helps!"},{"question":"can i turn it on and boil water with the lid open?","answer":"Yes."},{"question":"Is there any kind of filter covering the pouring spout?","answer":"Yes. A translucent fine mesh."},{"question":"Does this kettle come with a warranty?","answer":"Yes it does. In fact we already used it. The filter in the spout broke right away--it's flimsy, and we called the number in the instruction booklet. They asked to cut the cord and email a picture of it with the cut cord. And now, they are sendiya new kettle to replace the broken one. Of course we are now without a ket… see more"},{"question":"Does anyone have trouble turning the pot on? I have to push down on the pot and flip the on switch. Sometimes it works and sometimes it doesn't.","answer":"No issues like that at all. I have mine for 4 months now and very happy with it."},{"question":"Can you add the loose tea directly in the pot before turning it on?","answer":"According to the Use and Care Guide: \"Do not use for other than heating water. Other liquids or food will contaminate the interior and void warranty\". Furthermore, it is not designed for that."},{"question":"Is this kettle a 220 volt kettle?","answer":"No."},{"question":"How loud is this while boiling water? My office is quite quiet and I'd like to use this at my desk without much of an annoyance","answer":"It's not like you would rate it as decibels but I would say it's above-average loudness. My concern wasn't so much about loudness as it was The Toxic smell that's reflected off of the plastic chemical top ironically on a glass and stainless steel unit."},{"question":"Does it beep when you turn it on or when the water has come to a boil?","answer":"It does not beep when you turn it on and it does not beep when the water comes to a boil. It does not beep at all for anything."},{"question":"Where is this kettle made?","answer":"Did not check. I love it."},{"question":"Will not buy when it takes 1-2 months to deliver. Too slow?","answer":"I got mine very fast. 2 days I think with Prime."},{"question":"Is it BPA free","answer":"It is glass so it must be-good kettle"},{"question":"Is this hard to clean inside with this small opening? Thank you.","answer":"No. The opening may be big enough to fit your hand."},{"question":"I am getting significant leaking from the spout when I pour. Does anybody else experience this?","answer":"Not really if I take a little time"},{"question":"What is the warranty?","answer":"Think the slip said 1 year. Heck? Who cares, it is so cheap I'll just get another one."}]}