{"title":"SNAPTAIN SP310 Mini Drone for Kids, Throw’n Go RC Quadcopter for Beginners w/ 3D Flips, Altitude Hold, Headless Mode, Speed Adjustment, One Key Return and Portable Controller Box","manufacturer":"SNAPTAIN","currentPrice":false,"rating":"4.6 out of 5 stars","totalRatings":"113 ratings","features":["\n         Make sure this fits\n                by entering your model number.\n        \n","🛩️YOUR DRONE YOUR WAY - SNAPTAIN SP310 portable mini drone for kids and beginners fulfills few ways to take off. The Newest Way - Throw the drone into the air to take off. The Ordinary Operations - One key take off on the controller box, or joystick take off. More choices to start your flight tour!","🛩️LIMITLESS CHARMING ADVENTURE - Two detachable batteries make a great longer journey up to 14 minutes extend flight time. No confusion in identifying directions under headless mode. Three levels variable speed cater to all flyers, no matter kids, beginners or skilled users.","🛩️EXCELLENT FLIGHT SHOW - SNAPTAIN SP310 RC quadcopter do stunts with 3D flips function deliver impressive air flight shows. Just one button and assign a direction with right joystick to make the performance on. 360° rolling function add more fun that do not limit the direction of forward.","🛩️STABLE FLIGHT PERFORMANCE - Altitude hold function enables to auto-hovering at a fixed height. Subtle adjustment with trimming buttons make flight more controllable. Enhanced stable performance lets kids and beginners easier to enjoy the fun of flight with SNAPTAIN SP310 mini drone.","🛩️ALL IN ONE PORTABLE BOX - SNAPTAIN SP310 portable pocket drone with simple appearance design and all in one portable box. Customized drone cabin and accessories storehouse save more space that you can put into your pocket or bag. Popular little item to complete your fashion."],"reviewsAspects":["mini drone","flight time","little drone","controller box","easy to use","easy to control","highly recommend","battery life","landing gear","around the house","old son","altitude hold","remote control","easy to operate","son loves","battery lasts","easy to fly","much better","exceeded my expectations","comes with 2 batteries"],"productInformation":[{"Product Dimensions":"3.5 x 3.5 x 1 inches"},{"Item Weight":"0.96 ounces"},{"Shipping Weight":"14.4 ounces (View shipping rates and policies)"},{"ASIN":"B07T11J2VW"},{"Manufacturer recommended age":"14 years and up"},{"Batteries":"2 Lithium ion batteries required. (included)"},{"Best Sellers Rank":"#49,114 in Toys & Games (See Top 100 in Toys & Games)\n#269 in Hobby RC Quadcopters & Multirotors\n"},{"Customer Reviews":"4.6 out of 5 stars\n    113 ratings\n4.6 out of 5 stars"}],"productDescription":["Ideal Entertainment with Kids, Families and Friends.","Throw the drone up with the power of arm gently into the air to take off. Make sure there is enough space while throwing the drone up.","\n            Altitude hold function enables to auto-hovering at a fixed height. Subtle adjustment with trimming buttons make flight more controllable.\n        ","\n            Just press the Headless button to active the funtion. No confusion in identifying directions under headless mode. Enjoy the fun of flight!\n        ","\n            Press the return button and the SNAPTAIN SP310 mini drone will fly towards its back following a path that parallels with its original take-off path.\n        ","\n","\n","\n","Four anti-collision protective guards protect the propellers from damage. Do not touch the drone with hand directly while the drone is flying.","The LED indicator allows you to accurately capture your drone in the dark, and blink continuously when the drone is running out of power.","With simple appearance design. Customized drone cabin and accessories storehouse save more space that you can put into your pocket or bag.","1）Read the User Manual Carefully before Use.","2）Do not Launch the Drone at People or Animals.","3）Recommend to Fly Indoors or Windless Weather."]}