{"title":"New House Kitchen Color Changing Electric Kettle with Rapid Boil Feature BPA Free Interior, Fast Heating Water Boiler, Auto-Shutoff, 1.7 Liter/1.8 Quart, Stainless Steel/Black/Red,","manufacturer":"New House Kitchen","currentPrice":"$34.99","rating":"4.4 out of 5 stars","totalRatings":"114 ratings","features":["\n         Make sure this fits\n                by entering your model number.\n        \n","Red hot: This 1. 7 liter kettle changes from black to red when boiling so you always know when the water is hot. This feature makes the kettle stand out on any counter!","Quick boil: boils water quicker than traditional methods like stovetop kettles. It’s perfect for boiling water for tea, Coffee, instant oatmeal and more. This kettle shuts off automatically once water reaches a boil.","Clarity: no more spills or not filling with enough water. The transparent viewing window offers clearly indicated measurements so you can monitor how much water is in the kettle at any time. Once you’re done using, its cord wraps and stores underneath the base for extra convenience.","360° rotating base: 360-swivel base allows kettle to be lifted off and returned to its base with ease from all directions. The kettle can be filled and poured without the hassle of a power cord getting tangled or caught.","Purchase worry free: for your convenience, A 1 year Hassle-Free is provided by New House Kitchen."],"reviewsAspects":["stainless steel","hot water","new house","easy to use","tea infuser","boiling water","gets hot","heats water","hamilton beach","water level","takes up to 5 minutes","led light","house kitchen","level window","electric kettles","works well","color change","black to red","water quickly","tea kettle"],"productInformation":[{"Product Dimensions":"6.9 x 6.3 x 8 inches"},{"Item Weight":"2.95 pounds"},{"Shipping Weight":"2.95 pounds (View shipping rates and policies)"},{"Manufacturer":"New House Kitchen"},{"ASIN":"B07H9QPWGY"},{"Item model number":"Color Changing Electric Kettle"},{"Customer Reviews":"4.4 out of 5 stars\n    114 ratings\n4.4 out of 5 stars"},{"Best Sellers Rank":"#36,119 in Kitchen & Dining (See Top 100 in Kitchen & Dining)\n#183 in Electric Kettles\n"},{"Date first listed on Amazon":"September 12, 2018"}],"productDescription":["\n","\n","\n","BPA-free interior and removable filter ensure your boiled water is chemical-free and clean so you can boil water without worry!","Strix internal temperature control boils water faster and provides additional safety by shutting off the kettle automatically once water reaches boiling point.","Transparent viewing window with clearly indicated measurements makes it easy to view water level."],"reviews":[{"reviewerName":"Carolyn Ko","rating":"4.0 out of 5 stars","reviewTitle":"Great kettle but smells like feet","reviewDate":"July 3, 2019","reviewText":"I bought this because I wanted a retro-ish kettle that held at least 1L. Most kettles today look like fire extinguishers which is not the look I’m going for. The color changed as promised and I love everything about it. The only problem is this weird plasticky smell that only comes only after you boil the water. WTH is it? Beats me. I was going to return it because who wants a kettle that smells like grandpa’s butt?\nBut it’s too cute so I’m keeping it. If I get some strange cancer I’ll update this review."},{"reviewerName":"Linda","rating":"2.0 out of 5 stars","reviewTitle":"Good but not great","reviewDate":"The manufacturer commented on the review below","reviewText":"Not bad ... but not heavy duty. Not easy to place pot onto heating coil. Lid spills if the pot is tipped too far while pouring. Seems to take long time to boil. Smaller pot than our Hamilton Beach so if fast boil and large quantity is important this may not be the best kettle for you. Ok for light use but we make tea all day so not best for us."},{"reviewerName":"M. Woodside","rating":"5.0 out of 5 stars","reviewTitle":"It does it's job","reviewDate":"April 28, 2019","reviewText":"This teapot does it's job by heating the water quickly. I typically only boil half a pot and it's hot in 3-4 minutes. I like that it turns off automatically so I can flip it on and walk away and not have to worry about it boiling dry if I'm not paying attention. The outside does change from black to red when as the water heats, which is a nifty feature."},{"reviewerName":"GOGS","rating":"5.0 out of 5 stars","reviewTitle":"Color changing feature is awesome","reviewDate":"April 10, 2019","reviewText":"Have only used this product for five days but I love the fact that it lets you know how hot the water left in the kettle is by the outside color. When hot the outside is bright as the water cools it turns black. I love my tea super hot whereas my hubby doesn't so he will not heat the water if the kettle is still halfway red."},{"reviewerName":"jp","rating":"4.0 out of 5 stars","reviewTitle":"as advertised","reviewDate":"March 25, 2019","reviewText":"Works fast and red color was the one I'd hoped for."},{"reviewerName":"Adam Heartfield","rating":"4.0 out of 5 stars","reviewTitle":"Very nice and efficient electric tea kettle!","reviewDate":"August 16, 2019","reviewText":"I bought this on Prime Day on a spur of a moment whim but I'm glad I did because I've been wanting to transition from tea bags to loose leaf tea for years and because of my impulse buy, I finally did it! I am so glad I did! The only reason I gave this 4 stars instead of 5 is because it takes a little longer to boil water than I would have thought compared to most electric tea kettles. That is the only draw back. Other than that, this thing is amazing. It has a beautiful LED light that turns on when you click it on and it automatically turns off after its don't boiling plus it stays hot for a while. So I usually set it and do other things while it's going and it keeps it warm for a long time. Love this tea kettle. The tea infuser is essential for tea lovers."},{"reviewerName":"Valerie R. Keym","rating":"4.0 out of 5 stars","reviewTitle":"It’s as advertised, heats fast, turns red & no awkward cord attached to the kettle itself.","reviewDate":"May 3, 2019","reviewText":"The amount of water you put into the kettle is located behind the handle & difficult to see."},{"reviewerName":"Katie Scott","rating":"3.0 out of 5 stars","reviewTitle":"Decent buy","reviewDate":"The manufacturer commented on the review below","reviewText":"I gave it 3 stars because my magnetic stovetop heated the water faster than this pot did but I don’t know if it is fair to give it lower than 3 starts because the stovetop is know to heat quickly. But for every day use for people who have regular stove top it is good."},{"reviewerName":"Marie Ledbetter","rating":"5.0 out of 5 stars","reviewTitle":"Tea pot","reviewDate":"March 20, 2019","reviewText":"I bought it for my daughter it is very nice i boil water for tea in it"},{"reviewerName":"saljwatl","rating":"5.0 out of 5 stars","reviewTitle":"Buy this!","reviewDate":"June 21, 2019","reviewText":"This product is EXACTLY as described! Functional and nice to look at - precisely what I was looking for. No complaints."},{"reviewerName":"Treasure Dickson","rating":"5.0 out of 5 stars","reviewTitle":"Absolutely recommended.","reviewDate":"April 28, 2019","reviewText":"Good product. Fast and easy"},{"reviewerName":"Christopher Elsdon","rating":"5.0 out of 5 stars","reviewTitle":"Does its job, and is a bit of fun :-)","reviewDate":"September 16, 2019","reviewText":"It’s cool, bit of a gimmick but fun 😺"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Excelente compra🤩","reviewDate":"October 18, 2019","reviewText":"Muy útil, práctica, fácil de usar y calienta rápidamente el agua"},{"reviewerName":"nikkih","rating":"1.0 out of 5 stars","reviewTitle":"The heating element might be funky.","reviewDate":"The manufacturer commented on the review below","reviewText":"First, the kettle heated up much slower than expected / promised. It takes as long as stovetop kettles. Then after a week or so of use the heating element won’t turn off. We discovered it was still super hot even hours after switching it off. Not sure what to do?"},{"reviewerName":"Diane K Hutchins","rating":"5.0 out of 5 stars","reviewTitle":"Convenient","reviewDate":"May 31, 2019","reviewText":"Love this! So quick and convenient."},{"reviewerName":"Sophia Anderson","rating":"5.0 out of 5 stars","reviewTitle":"Great buy","reviewDate":"August 2, 2019","reviewText":"Its has an elegant look. Love the fact that it has glass. I am repllmacing an all metal one."},{"reviewerName":"ADRIANA","rating":"5.0 out of 5 stars","reviewTitle":"Me gusta mucho","reviewDate":"September 2, 2019","reviewText":"Calienta muy rapido"},{"reviewerName":"Amazon reviewer","rating":"5.0 out of 5 stars","reviewTitle":"It is fantastic","reviewDate":"October 21, 2019","reviewText":"Love the kettle. The color change when hot is fantastic."},{"reviewerName":"Ken Gordon","rating":"5.0 out of 5 stars","reviewTitle":"Works fast with full kettle","reviewDate":"July 18, 2019","reviewText":"Works fast, no flimsy filter on lid"},{"reviewerName":"Jessica","rating":"5.0 out of 5 stars","reviewTitle":"I’m love it","reviewDate":"September 28, 2019","reviewText":"Easy to clean works really fast"},{"reviewerName":"Lisa Adams","rating":"5.0 out of 5 stars","reviewTitle":"Love!","reviewDate":"August 24, 2019","reviewText":"Love this tea kettle"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Best Electric Kettle!","reviewDate":"August 3, 2019","reviewText":"Best electric kettle!"},{"reviewerName":"Chris","rating":"5.0 out of 5 stars","reviewTitle":"Water gets hot","reviewDate":"September 1, 2019","reviewText":"No dis likes"},{"reviewerName":"Melissa Schneider","rating":"1.0 out of 5 stars","reviewTitle":"Poor quality","reviewDate":"The manufacturer commented on the review below","reviewText":"The kettle broke in less than two months."},{"reviewerName":"David Y. Tsai","rating":"5.0 out of 5 stars","reviewTitle":"Quick and easy","reviewDate":"July 31, 2019","reviewText":"Easy to use and setup"},{"reviewerName":"brus123","rating":"5.0 out of 5 stars","reviewTitle":"Works great","reviewDate":"July 13, 2019","reviewText":"Love this product"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"As advertized","reviewDate":"May 17, 2019","reviewText":"Works as expected."},{"reviewerName":"Andyboff66","rating":"5.0 out of 5 stars","reviewTitle":"Great Idea","reviewDate":"March 7, 2019","reviewText":"Can’t believe this idea hasn’t been thought up before (well maybe it had, and I just missed it)\nSimple, elegant, functional and really kind of cool (no pun intended)\n\nIt’s a kettle, it boils water, it takes about 3-4 minutes to boil from cold, it has an auto off, a fill gauge and is cordless with a standalone charging base.\nNothing remarkable about any of that, until you get to color.\nIt’s Black, but as it heats it changes color to red, (see pictures) warning you that it’s hot, as in hot to the touch or the water inside is recently boiled. Simple idea, but very effective. Red is the universal color for warning signs or danger.\nIf you’re looking for a red kettle to match your other appliances this is not for you, as it’s black when not in use.\n\nDuring the boil cycle the color change is gradual, a sort of dark burgundy as the water gets hotter.\nIf you leave the kettle with the hot water inside it stays red. As tested for well over 5 minutes with hot water still inside.\nIf you empty it, or fill it with fresh cold water it reverts immediately to black.\n\nSo there it is, simple, safe and effective. Oh and it’s also pretty inexpensive. Has to be 5 stars."},{"reviewerName":"moose_of_many_waters","rating":"3.0 out of 5 stars","reviewTitle":"Good value and the color change is a nice feature, but the mechanics have a design flaw","reviewDate":"March 9, 2019","reviewText":"I use an electric kettle at least three times a day. It's an essential item for me. This one is solidly made and heats up water quickly just like others I've owned. The additional features this kettle has that I've never had before are: the top opens up with a button on the handle; there's an LED light that turns blue when the kettle is actively heating; the entire kettle changes in color from black to red as it heats and as long at the water is hot. The button opener works well and looks like it will be durable. The LED light is neither useful nor bad. The color changing feature, though, is actually more useful than I thought it would be. It tells me whether I have to bother reheating the water if I just want to add an ounce or two to my already existing cup. It also tells me whether the water is hot or not when I'm forgetful and haven't been in the kitchen for a few minutes. This kettle is a good value.\n\nNote well: After a month, the on-off switch broke. I opened the kettle up and found the problem: the switch is attached to a thin piece of brittle plastic. Everything else is designed well, but the moveable plastic bracket that holds the switch in place is a definite design flaw. This model won’t likely hold up over the long haul."},{"reviewerName":"Allen C. Huffman","rating":"5.0 out of 5 stars","reviewTitle":"Solid. Color change is convenient. Auto shut-off is great. A bit hard to clean.","reviewDate":"March 23, 2019","reviewText":"The kettle has a nice flip open top, and DETACHES from the electrical base. You can boil water, then remove it from the base so you aren't dragging a power cable around when you pour.\n\nYou need to hand-wash it, which is difficult due to the small opening. I use a brush bottle. Once washed, they say to run a few test boils through it before using the first time.\n\nFill it with water and then depress the \"on\" latch. The black kettle slowly turns red -- it's very interesting to watch. Once it reaches boiling, it shuts off. This is nice. I melted down a previous plastic water boiler by not keeping an eye on it. (Note that the instructions still warn you to unplug immediately after use.)\n\nLike other high power electric times, the power cable plug gets warm.\n\nThis is super convenient and has instantly replaced the old plastic one I used. So far, so good.\n\nIf it dies unexpectedly or I encounter and issues in the future, I will update this review."},{"reviewerName":"Johnny","rating":"4.0 out of 5 stars","reviewTitle":"A beauty that is best for black tea drinkers only","reviewDate":"May 5, 2019","reviewText":"This is a beautiful well-constructed electric kettle. If you typically brew black teas, and find a large size teapot to be an advantage, this kettle's for you. However, for green or oolong tea drinkers, you might want to find a more versatile unit.\n\nEase of use:\nThis large kettle brews up to 1.8 liters, or 61 ounces. I was drawn to it because of it's built in steeping basket which will work with either loose tea, or bags. To utilize its steeping feature, you will need at least an inch of room, which means you will want to brew a minimum of 24 ounces. The steeping basket conveniently drops down from the top.\n\nWhy best for black tea? The kettle shuts off about 25 seconds after beginning to boil. At that point it's rollicking! It's at 212 degrees alright, best for black. At that point, the instructions guide you to slide in the steeping basket containing your loose tea or bags, which is easily done.\n\nHowever, Chinese green teas are ideally brewed at about 180 degrees, and Japanese sencha and other teas need 170. One key disadvantage to this otherwise excellent tea kettle is that temp cannot be regulated like some other units allow. When I brewed two mugs worth of water, 24 ounces, the kettle shut off at 4:26. However, I had to wait another 6:30 for the temp to drop to 180 for the green tea I typically prefer to brew. Thus, you will find easier solutions if you gravitate to green tea.\n\nSpeed:\nSo-so. This kettle is only 1100 watts while others on the market are 1500. That's a direct correlation to faster brewing. 61 ounces of water, a full kettle, boils in 10:00 but the unit shuts off at 10:35. Using my Oxo steel kettle on a relatively new and fast electric cooktop burner accomplished the same job in only 7:17. To boil only 24 ounces of water, this electric kettle is friendlier. As I wrote above, 4:26 to shutoff. I compared that to a pyrex quart sized measuring cup filled with 24 ounces of water in a 1100 watt microwave. That took longer: 6:30. However, for brewing just 12 ounces of tea for one mug, I have found that the micro will get it boiling in a smaller and less thick pyrex measuring cup in just 2:20.\n\nConclusion:\nIf you know you are going to regularly be brewing a full pot, this is an elegant tea kettle that features a beautiful blue glow while brewing. It's a beauty. For anything less, the advantage of the steeping basket is minimized by not-so-fast heating times and the lack of a thermostat to also brew to lower temps. If the manufacture would add this needed feature, up the wattage and perhaps come out with a second junior model with a lower capacity for those of use who brew less quantity, this could be the ideal tea kettle."},{"reviewerName":"andiesenji","rating":"5.0 out of 5 stars","reviewTitle":"Efficient water heating in a very attractive kettle","reviewDate":"March 24, 2019","reviewText":"My daughter is thrilled with this kettle. She is very impressed with the changing color that indicates the water is hot with just a glance. And the water level window is also very handy.\nShe drinks a lot of tea as do my grandchildren so this 1.7 liter is a good size so that everyone can have a mug at the same time.\nIt is not so heavy when full that it is hard to lift. It pours cleanly, without dripping!\nThe automatic shut-off is a great safety feature.\nThe rotating base makes it easy to pick up from any angle."},{"reviewerName":"Peggy Bowes","rating":"5.0 out of 5 stars","reviewTitle":"Boils water in half the time as a microwave","reviewDate":"March 22, 2019","reviewText":"I ordered this for my daughter's college apartment. She says it takes up to 5 minutes to boil water for her coffee in the microwave. This kettle does the job in half the time. Plus, it's entertaining to watch the black kettle turn red as the water boils and then turn back to black as it cools down. My daughter uses it daily."},{"reviewerName":"Hanna.w.","rating":"5.0 out of 5 stars","reviewTitle":"Love the changing color","reviewDate":"March 12, 2019","reviewText":"The changing color is a great visual to see right off the bat whether the water is still hot or not. It's also a great reminder that the kettle is hot so don't grab or touch it by the sides. It also cools and reverts to its base color right away when you fill it with new water. There's no waiting time."},{"reviewerName":"Casper & Boo","rating":"4.0 out of 5 stars","reviewTitle":"decent electric kettle","reviewDate":"May 5, 2019","reviewText":"I loved this thing when i first used it and it works great and when i first tested it with thermometer, it heated up water every time at/near boiling point of 210-212 on first three uses that they have you do before using it for your personal use.\n\nsome issues i have:\n-there is no option to extend boiling time. Kettle shuts off within 30 seconds of boiling start. i need my kettle to keep boiling at a rapid boil for no less than a minute and preferably a little longer to kill off bacteria that doesn't get killed off by filtering it first.\n-no cool spot other than handle to hold kettle with your other hand, that is an issue for those of us with smaller, weak, arthritis, etc hand issues.\n-Small opening will be hard for some to wash in there good enough IMO, i don't ever plan on putting anything but purifiied water in this to avoid it getting nasty on me in areas i nor a brush can reach.\n-Minor imperfections in kettle like a tiny knick/scratch on outside of glass that i can feel. discoloration in silver part of lid showing smudges like stains that are unclean-able.\n-listing pics seem to purposely omit the ugly 'hand icon with an X through it and words under it saying caution hot' that is on glass near fill lines on left side of them (see my pic). We are not kids, we don't need our appliances/etc to needlessly have its cosmetic look ruined some by companies putting 'permanent' warnings on them like this one!\n\neven with these pretty much minor issues and since kettle works great at doing what it is meant to be, i still do like this kettle very much and it has made my every other day job of purifying and boiling two gallons of water for the 10 cats & dog and then having to wait for ever for it to cool a thing of the past. After first time, i now fill this up in AM with filtered water and turn it on to boil water for the next day and transfer water to pitcher in fridge later in day when it is cooled. To deal with my preferring my water to boil for recommended full minute or two, i started to use a large paper tie thingie and tie it around button so it cannot shut off kettle. i just set a timer for 11 minutes which is 1 minute longer than it normally takes to boil cold filtered water from fridge and i then pull down tie off button and kettle shuts off (just pull tie back over button next time i turn it on)..\n\none thing i noticed on second day and what makes me think this kettle perhaps isn't going to last long, is even though i use filtered water only in this, there are already permanent stains inside kettle on heating base (glass is not throughout kettle) and they are only getting worse looking. I do not actually think they are stains from my water though for the numerous small bubble circle looking stains are only on front and sides of kettle base where the water boils at, on back part the water doesn't get the rapid bubbles when boiling at all. if it was water/mineral/etc staining related, i would think it would be thoughout heating base but, it is not. The staining i have seen on cheaper electrical items in past and it often ended up getting corroded, as if cheap stainless steel like metal was used.\n\nOh before i forget, the cool included tea/fruit infuser turned out to snap into my 20oz Ozark Trail tumbler so i use that to infuse strawberries & dry peppermint leaves overnight."},{"reviewerName":"David Koski","rating":"1.0 out of 5 stars","reviewTitle":"no longer boils after 6 months","reviewDate":"April 14, 2019","reviewText":"UPDATE: after about 6 months of daily use, this no longer turns on. It was nice while it lasted, but 6 months is too short. Avoid.\n\nMy family drinks a lot of tea and we like to have a nice tea kettle -- it boils water easier and faster than on the stove. This kettle works well:\n\n- it is 1.8L instead of the typical 1.7L -- yeah, that sounds like a lot but I have *really big* mugs!\n- you can see the water level through the glass without opening it\n- it is quiet\n- this may sound goofy, but it has a blue LED inside the water while it is on and it looks pretty nice\n- i am using using tea bags (convenient) but the infuser is a great bonus if you want to use loose teas\n\nThere are only two drawbacks to this kettle that I see:\n\n- if you have hard water, you can see the buildup on the glass\n- when you press the button to open the lid, you have to open it more to fill it (it doesn't open as wide as it can)\n\nNot a big deal -- this is a great tea kettle!"},{"reviewerName":"Robert","rating":"4.0 out of 5 stars","reviewTitle":"Even works to make excellent espresso. But be careful as the glass gets hot!","reviewDate":"April 22, 2019","reviewText":"Although I was looking forward to making tea with this kettle, I tried the experiment of making expresso with it and it worked better I expected. The tea infuser has the perfect filter characteristics for making espressso provided you use course ground coffee beans. Because the outlet also has a high density screen, very few grounds ended up in the cups. The only negative is that the infuser is designed to leave a bit too much space between the bottom of the infuser and the hot water so you need to make four small cups of espresso at a time.\n\nI gave this four stars because I burned my hand on the glass. They give you plenty of warningss that the glass gets hot, but there is a natural tendency to use both hands when pouring and I did. The glass is the same temperature as the boiling water. Ouch. But other than that, the safety shutoff makes this a safe kettle. And its ability to make espressor is a real plus for me."},{"reviewerName":"Baazumi","rating":"5.0 out of 5 stars","reviewTitle":"Very Attractive Glass Kettle with LED Light","reviewDate":"April 20, 2019","reviewText":"This is a classy looking glass electric tea kettle that heats water far more quickly than a stove top. The handle is a graceful curve and gives a secure grip for easy pouring. Watching the water heat up with a LED light is one of the best features. The kettle is a bit on the large size and will take up some room on your counters. I love that the kettle comes with a tea infuser, just fill with your favorite loose tea or a tea bag, and the infuser can be removed when not using. Overall the kettle is convenient to use, has a simple on/off switch and looks great."},{"reviewerName":"A. Roach","rating":"5.0 out of 5 stars","reviewTitle":"Takes the guesswork out of boiling water","reviewDate":"July 17, 2019","reviewText":"Boiling water seems like it should be the easiest thing in the world, but that’s not always the case. If I put a mug of water in the microwave for tea, the time depends on the mug size. If I put I a large pot of water on the stove for iced tea, I have to keep checking it to see if it’s boiling or to make sure it’s not boiling over.\nThe New House stainless steel cordless electric kettle takes the guesswork out of boiling water. You simply fill it with water and turn it on. When the water has boiled, it turns itself off with an audible click. It’s much faster than boiling water on my electric stovetop, and it doesn’t take much longer to boil a whole pot of water than it does a mug in the microwave. The pot itself is cordless, so it’s easy to pick up and maneuver around the kitchen.\nThis is one of those small kitchen appliances that you don’t really think you need until you get one, then you really just how handy it is. It’s also easy to store when it’s not in use. The electric plate and cord will easily fit in a kitchen drawer, and the pot doesn’t take up a lot of extra room in a cabinet.\n\nNeti Pot Users\nIf you use a neti pot for your sinuses, this electric kettle is the perfect thing to have on hand. You should always use boiled water in a neti pot, and I find myself not using mine because I don’t want to mess with boiling water. With the New House electric kettle, I no longer have an excuse."},{"reviewerName":"TooManyHobbies","rating":"3.0 out of 5 stars","reviewTitle":"Works but noisy and had a few issues brewing tea in the infuser","reviewDate":"The manufacturer commented on the review below","reviewText":"This electric kettle heats the water really fast and the blue LED lights are really cool looking, but I found the tea brewing process a little cumbersome. I just make tea for myself so I only filled to the MIN line/ 0.5L of water. After filling the carafe, the boiling process worked fine except it was very noisy at the start of the heating. My office is arranged in cubes, and everyone around me was popping their heads over the cube to see what the noise was. But once the water started bubbling the noise subsided, and it only took about 2 minutes to boil the .5 L of water. After allowing the boiling water to settle down, I tried putting my loose tea into the infuser. This was difficult because the top of the kettle doesn't flip up far enough to easily spoon the tea into the infuser. The steam rising through the open lid burned my hands a little bit as I tried to insert the tea. Once I got the tea into the infuser I then noticed that the water just barely touched the bottom of the infuser. To expose all my tea to the water I had to shake the kettle so the sloshing water could hit all the tea leaves. Cleanup was a pain too. The mesh of the infuser is so fine I had trouble getting the loose tea leaves out. I even let the leaves dry and I still couldn’t get them to fall out. The next time I put the tea in a bag and then put the bag into the infuser. This worked fine but it kind of defeats the purpose of having the infuser. In the end I removed the infuser and just use the kettle to simply boil water. Also after using the kettle a few times one of the LED lights stopped working."},{"reviewerName":"Samson Wick","rating":"5.0 out of 5 stars","reviewTitle":"Heats Up Almost Instantly, Ready For Tea Any Time","reviewDate":"June 10, 2019","reviewText":"Before getting this I thought if there was one thing that would bother me it was the capacity. That’s not just this kettle. Most of the ones like it have a similar size. But after getting and using it, it seems just right. When I make tea it’s usually for four people, so it’s easy to run out of hot water with a smaller kettle, but this thing heats up so fast, even if I run out, it’s no problem to just top it off and heat some more right away.\n\nIt’s easy to clean and doesn’t affect the taste of the water.\n\nIf I could make one improvement it would be to add a whistle or chime or something audible and loud to let you know the water is ready. That’s really a minor quality of life thing though."},{"reviewerName":"Kathleen","rating":"5.0 out of 5 stars","reviewTitle":"The POT calling the KETTLE...RED!","reviewDate":"May 27, 2019","reviewText":"You’ve heard that old saying, “The Pot calling the Kettle Black”? Well, in this case is it Black? Red? Black? Red? Whatever it is...it’s AWESOME!\n\nThis kettle works super fast and it’s quite interesting watching it heat and change color. I’m sure the novelty will wear off over time but it is kind of cool (or should I say HOT!). It also has an auto shut off but the water stays fairly hot for quite a while and the large illuminated blue switch located on the bottom is excellent for indicating whether the kettle is on or off. I also love the fact it operates on a separate heater so there’s no cord attached to the kettle itself.\n\nI remember not so long ago where you couldn’t buy an electric kettle. Being in the Property Management business in Florida we served a lot of Canadian Clients who were used to them but they were hard to find. I suppose because tea has become more popular they’ve become more more available. This one is not only interesting but it works well. Just make sure everybody using it knows what it does as they might call the Fire Dept. thinking it’s on fire when it turns red! Hehe"},{"reviewerName":"Russ Nickel","rating":"4.0 out of 5 stars","reviewTitle":"Works great but water level window is behind the handle","reviewDate":"May 21, 2019","reviewText":"Electric kettles are the greatest! They're faster than a microwave or teapot, and most importantly, they shut off automatically upon boiling so you don't have to worry about the water boiling away if you get distracted. I got this one to replace one I'd used for years, and it has some pluses and minuses. On the plus side: (1) It's faster -- about 5 minutes to boil a quart of water, and it comes to a really vigorous boil. (2) It turns itself off if you happen to leave it switched on when it's empty. (3) I like the features: The lighted-when-on switch is nice, and the color changing of the kettle is entertaining and somewhat useful. Two things I don't like as well as my old one: (1) The water level window is underneath the handle, so it's hard to see. (2) The top opening is fairly small, and there's no obvious way to take the lid off, so you can't get a hand in there to clean it (of course, if you only put in water you'd rarely need to clean it). This kettle so far is working fine, and it seems well made to me, so I'm only knocking off a star because I find it irritating that the water gauge is hard to read."},{"reviewerName":"Baazumi","rating":"5.0 out of 5 stars","reviewTitle":"Stylish & Modern Look","reviewDate":"March 8, 2019","reviewText":"I had never heard of electric kettles before one of my friends stayed with me and brought hers. It heated water in seconds far faster than the stove. This New House kettle is an upgrade to what my friend had. Taking it out of the box the first thing I noticed was how attractive the design looks. The rounded style looks wonderful and the handle features a soft rounded curve giving the kettle an up-to-date modern look. The handle is also wide enough to be comfortable for both small and large hands and has a good grip section in the middle. Water heats up fast and shuts itself off so you don’t need to be in the room monitoring it. BPA free. Easy to use, good buy."},{"reviewerName":"Vanessa V","rating":"5.0 out of 5 stars","reviewTitle":"My New Favorite!","reviewDate":"June 6, 2019","reviewText":"This has been a great addition to my kitchen! I love to have hot green tea or hot lemon water in the mornings to start my day, so I was super excited to get this kettle. It quickly (8 minutes) boils up the hot water and I really mean hot (which is how I like it.. I hate heating up water only for it to get cold super fast). I definitely recommend following the directions with not over-filling the kettle because it will boil over and you'll have a hot water mess all over the place. Being stainless steel, it does calcify quite quickly (I live in Texas and we have really hard water, especially if you dont have a water softener) it's nothing a little vinegar water can't fix, which is also a recommendation for keeping your kettle clean. I must say, I also love the auto shutoff feature as well because lets face it, we're all a little forgetful at times. Overall, I'm impressed with this kettle and am looking forward to many more uses with it."},{"reviewerName":"Dinakar Sarma","rating":"5.0 out of 5 stars","reviewTitle":"Very handy to have","reviewDate":"August 25, 2019","reviewText":"This one doesn't get the water boiling /as/ fast as my Russell Hobbs electric kettle, but nothing ever will. However, it does get the water boiling much faster than my stove can when using the same amount of liquid, and a similar sized stove top kettle. Having the electric base stay put while the kettle itself lifts off is also super handy.\n\nWhat I love best about this is the ease of use: there's one giant button that you press, which turns blue to indicate that it's engaged. Then, it boils the water, and the button pops up. When the boiling is done, the button makes an audible click noise that you'll hear just in case you missed the sound of the rapidly boiling water. Quite useful to have multiple methods of checking the state that the kettle is in."},{"reviewerName":"Kevin Fontenot","rating":"4.0 out of 5 stars","reviewTitle":"Great Kettle for Home or Work","reviewDate":"April 13, 2019","reviewText":"I've been using this kettle for several days now and it serves my basic needs. I use it at work to heat water for tea or other hot drinks. The kettle does this very well, it heats the water in a fairly quick time, especially in relation to other kettles I have used. The kettle is easy to clean. I really like the size, it is not too big and holds the right amount of water for me. The kettle itself does not have a cord attached to it so it is easy to fill. The on/off switch is located on the top part of the kettle handle. The cord is attached to the base. My only issue with the kettle is the base, which I wish was a little heavier. The cord is heavier than the base and when unplugged can pull the base if the kettle isn't on it. This isn't a deal breaker though, the kettle works fine and has a nice look."},{"reviewerName":"HeartofAvalon","rating":"2.0 out of 5 stars","reviewTitle":"It's okay.","reviewDate":"The manufacturer commented on the review below","reviewText":"Not impressed with this kettle. The plusses: it's a large kettle; the blue light looks very \"Tron\" like and makes it clear when it is on and heating; it's easy to clean because the top has a large opening; easy to use; the lid has a lever that pops open with a button; and is glass. The cons: the handle gets hot; the base is very \"cheaply\" made/cheesy feeling; must have at least .5L as the minimum to boil water, and the worst, takes 13 minutes to boil a full kettle from room temperature water. I tested it against another kettle that I purchased and it was a full 4 minutes behind my other kettle. Overall, it's \"okay\" for occasional use, but for everyday, I would prefer a speedier kettle."},{"reviewerName":"Strategos","rating":"5.0 out of 5 stars","reviewTitle":"My wife uses it every day and it makes her life better","reviewDate":"September 22, 2019","reviewText":"You put water in it, and 10 minutes later you have boiling water. It has good power (you can put in liter of water and it will be boiling in about 6 minutes). It auto-shuts off when water reaches boiling so there is no safety hazard.\n\nIt's probably a more efficient use of power than boiling water on an electric stove.\n\nThe only downside is that it's heavy (especially with a lot of water in it), but it's well-balanced with a weighted bottom so it's still easy to pour.\n\nHaven't used it with tea strainer (my wife is coffee drinker)."},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Simple, easy","reviewDate":"March 1, 2019","reviewText":"Everything about this is easy to use. Instructions are clear, and the execution is fantastic.\n\nHigh quality parts, works as advertised. Wish the cord was a little longer...they do point out they do that for safety, but you can add a safety cord. Seems like an excuse to avoid liability...nonetheless, just a point to make, nothing that you can't see in the pictures.\n\nRecommend!"},{"reviewerName":"Product reviews","rating":"5.0 out of 5 stars","reviewTitle":":)","reviewDate":"June 1, 2019","reviewText":" We needed a new one after the old one stopped working, this is by far better since its bigger and has surfaces you can touch without getting burn like the lid. I really like the color changing because it indicates when its hot and when its cooling down. It is also great at temperature control since the water always end up perfect without being boiling hot or warm"},{"reviewerName":"stuartm","rating":"5.0 out of 5 stars","reviewTitle":"Fast and fun to watch","reviewDate":"April 13, 2019","reviewText":"I had a standard electric kettle made of steel that worked well and looked good on the counter top. But I have always loved glass kettles where you can see the progress. And this fills the bill beautifully. It is heats quickly and looks great while doing it."},{"reviewerName":"Waiting","rating":"5.0 out of 5 stars","reviewTitle":"Simple little kettle. Does what kettles do.","reviewDate":"June 16, 2019","reviewText":"I don't use kettles much for about half the year, but in the winter months it's nice to have hot water just ready to go for a cup of tea or some hot cider. This kettle works well, is fairly fast for my purposes, and the changing colors on the side is a nice touch.\n\nCan't complain, it's cheap and does what it's supposed to do."},{"reviewerName":"brooke","rating":"4.0 out of 5 stars","reviewTitle":"no issues","reviewDate":"July 17, 2019","reviewText":"Very easy-to-use and I love the red and black design. I've been using this daily for about a month and have had no issues!"},{"reviewerName":"Laura","rating":"5.0 out of 5 stars","reviewTitle":"Must buy this kettle","reviewDate":"August 20, 2019","reviewText":" I’ve been trying to decide what type of electric kettle to get for months, and I’m so glad I went with this one! I love the color changing, and pretty quiet. The boil shut off works, and it stays hot for a long time after. I made a time lapse video of the color change! If anything changes I will update my review."},{"reviewerName":"Veeren","rating":"5.0 out of 5 stars","reviewTitle":"excellent","reviewDate":"June 26, 2019","reviewText":"This mug is amazing and very convenient. you never have to worry about the water over heating as it will automatically shut off. It's not made for a ton of water but can easily make 3 or 4 cups per load."},{"reviewerName":"Elizabeth Ann Chadbourne","rating":"5.0 out of 5 stars","reviewTitle":"Perfect. But again","reviewDate":"September 21, 2019","reviewText":"Excellent addition to my office. Hot tea with no hassle every morning = WIN"},{"reviewerName":"David Soyka","rating":"5.0 out of 5 stars","reviewTitle":"Boiling good","reviewDate":"July 8, 2019","reviewText":"I've been boiling water in a tea kettle for years to make tea. This device does an equally good job, without the tell tale whistling. Easy, convenient, does the job. If you like tea, you'll like this."},{"reviewerName":"Oliver DeMille, TJEd","rating":"5.0 out of 5 stars","reviewTitle":"Simple and straightforward, with a cool twist","reviewDate":"March 28, 2019","reviewText":"This is probably my favorite new electric kettle, and I've seen maybe a dozen in the past year that had differing levels of appeal for me. I love that it gives you visual feedback without any confusion as regards the temperature of the water inside. If the kettle is black, the water's not hot. If it's red, it is. Period. I like the simplicity of the on/off switch. I have others with digital controls for lots of different settings, and I honestly never use them. Bring my water to boiling and I'm good. I like that it's on a swivel base that has no incorrect orientation. If it's resting solidly on the cradle, the handle can face any which way, and you're good. The handle is well-balanced and stays cool. The body of the kettle does get hot, so keep out of reach of children and pets. The lid has a simple button the top of the handle to release the latch so it flips open. Very attractive, functional and well-designed electric kettle. Great for gifting!"},{"reviewerName":"Susan R. Meyer","rating":"5.0 out of 5 stars","reviewTitle":"Silence is Golden!","reviewDate":"March 21, 2019","reviewText":"I have always loved whistling teakettles. That is, until my last one - a beautiful red one with a whistle so loud my neighbors can hear it. And it terrifies my cats. So, I jumped at this silent electric kettle. It heats up quickly and lets you know it's ready by turning red. It's easy to pour. It turns itself off. Although there are fancier models that allow you to adjust the water temperature, unless you are a tea expert you'll never miss this option. If you're like me, hot is hot. This makes a nice cup of tea, doesn't take up a lot of space and isn't louder than a fire siren. That's more than enough for me and I'm happy to brew a nice cup of tea or soup or hot chocolate with ease."},{"reviewerName":"Austenparker","rating":"4.0 out of 5 stars","reviewTitle":"Quality kettle, very attractive","reviewDate":"March 5, 2019","reviewText":"We have two electric kettles now - one metal and this opaque one. I got this one because it complements my decor better. This one is by far more attractive. I like the fact that it turns red to indicate that it's hot. It heats fairly rapidly - not as rapidly as the metal one, but that one is super fast. Overall, this is a good product and I'm satisfied."},{"reviewerName":"Daffy Du","rating":"3.0 out of 5 stars","reviewTitle":"Disappointing--there are better options","reviewDate":"The manufacturer commented on the review below","reviewText":"I've been a big fan of electric kettles ever since acquiring my first several years ago--a stainless steel Hamilton Beach model. It's basic but does the job, and it continues to do it well. All the others I've tried since then are measured against it.\n\nThis one at first seemed to be similar, so I had high hopes for it. I prefer stainless so as not to drink any chemicals that might leach out of plastic, and I don't need lots of bells and whistles. What I noticed first, however, was that it takes noticeably longer to heat the water than the Hamilton Beach one does. It also is harder to read the water level gauge, which is mainly a function of the spacing between the markings, as the gauges are located in the same place on both kettles, on the body, inside the handle. But the kicker was the fact that as the water level got lower, this kettle consistently leaked from the button you use to lock down the lid. IOW, it was fine when I was pouring when the kettle was full, but when it maybe 1/3 full, the water leaked, and it made a mess on the counter. Water also collected on the base where you set it to heat.\n\nI'll stick with the Hamilton Beach, thank you, which also cost $10 less than this kettle at my local warehouse store. This one isn't ready for prime time, in my experience.\n\nThree stars."},{"reviewerName":"Lee Ward","rating":"4.0 out of 5 stars","reviewTitle":"Shockingly easy to use, but doesn't turn the exact color in the product photo","reviewDate":"March 23, 2019","reviewText":"It turns maroon, not red. But wow, it's easy to use. What I like best is it shuts itself off once the water reaches full boil. That's a game changer for me and my family.\n\nThe flip switch is a pleasure to use. It shines bright blue when on, and goes back to cloudy plastic when kettle is off or not being used.\n\nThis is very lightweight. I kind of miss a more solid tea kettle, but this one is much easier to use."},{"reviewerName":"😺Zutto 😺","rating":"5.0 out of 5 stars","reviewTitle":"Beautiful, fast, efficient electric kettle! Stainless Steel, the best!","reviewDate":"April 2, 2019","reviewText":"I love this kettle, because it is a beautiful color, and once the water boils, it does change colors. The water boils and boom, shuts off automatically. I prefer to use this kettle than the stove top. This way, I don't have to turn on the gas oven. It fits firmly, has the hidden cord, and small enough without taking up space. Plus the pot is stainless steel, an excellent choice.\n\nI place this right next to my Brita Filter Water Pitcher. Then, I use the hot water for many reasons. This is excellent!"},{"reviewerName":"Kindle Customer","rating":"4.0 out of 5 stars","reviewTitle":"There is no temperature control but works well otherwise and lights up pretty","reviewDate":"March 28, 2019","reviewText":"Everything is great about this tea, or water kettle, by New House Kitchen, except that in the description on Amazon it said that you could control the temperature, such as for green tea, when in fact there is no way to do that. I am disappointed in that. However the rest of the kettle's features are perfect! The kettle is a good size, and includes a tea infuser. It does indeed heat up pretty quickly, and lights up a pretty blue while heating up. You can remove the tea filter if you chose not to be brewing tea. The kettle itself is attractive and doesn't take up too much room on the counter. It has a button for flipping open the top, and another one for turning on the kettle. I like that the electric cord can be long or short by wrapping it on the bottom. Over all this is a great tea kettle for tea, instant coffee, or oatmeal. I would recommend, but just know you can't set it to different water temperatures. Also, the kettle gets very hot."},{"reviewerName":"CorpGovNet","rating":"1.0 out of 5 stars","reviewTitle":"Makes Great Tea","reviewDate":"The manufacturer commented on the review below","reviewText":"This makes great tea but it could be even better if the hot water never touched a plastic spout or boiled water vapor up to a plastic lid. Additionally, many teas taste better when they are heated below boiling point. This kettle has no temperature adjustment.\n\nThe blue light is beautiful and it functions well.\n\nUpdate: Within a week, the button to press to turn the kettle on no longer works. I hesitate to give it only one star, because mine may be an isolated case. However, based on my experience, I can't recommend the product. Since I have to hold the button down to keep the kettle on, that is unworkable to me.\n2nd update: Rather than toss it, I'm using a rubber band to keep button pressed down. Of course, I have to watch, because no automatic shut-off. Now I'd give it 1.5 stars."},{"reviewerName":"S. D. Fischer","rating":"4.0 out of 5 stars","reviewTitle":"“Quick Boil” Takes 11 Minutes","reviewDate":"March 24, 2019","reviewText":"I have owned a Proctor Silex electric kettle for six years and use it mainly when I travel to make tea in a hotel room. It still works, but one of the two hinges on the lid broke and the filter for the spout keeps falling out so I thought it might be time for an upgrade.\n\nThe stainless steel kettle looks nicer than the plastic kettle and I am more comfortable using it since it is BPA-free. The filter on the spout is built-in so I don’t have to worry about it breaking loose. It is easy to use, with one switch to turn it on and off. Like the Proctor Silex, it shuts off automatically once the water boils which is an important safety feature.\n\nThe cord for the base is short (for safety according to the directions) but the kettle can be placed on it with the handle facing any directions (referred to as a 360 degree swivel base in the directions) which is more convenient than the Proctor Silex.\n\nThe water level window is on this kettle is behind the handle and I had some trouble reading it accurately. The Proctor Silex kettle has clear windows on both sides so it is much easier to gauge the water level.\n\nI timed this kettle to boil filtered water from my refrigerator twice, and it took 11 minutes both times. That was longer than I expected given the description says “quick boil”. The Proctor Silex only holds 1 liter which it boils in 7 minutes, as did this kettle when I reduced the water from maximum to 1 liter.\n\nGiven this kettle costs $10+ more than the Proctor Silex, I expected it to be far superior which was not the case. Although the base and spout filter are better, it is harder to read the water level. This kettle holds more (1.7 liters versus 1 liter) so that may be a consideration."},{"reviewerName":"CJS","rating":"4.0 out of 5 stars","reviewTitle":"Cordless electric, glass hot water kettle/tea maker","reviewDate":"April 15, 2019","reviewText":"This is the second cordless water kettle I have owned, I like this one well enough but for a couple of things that may or may not be important to others. I live where we have very hard water, even with a whole house water softener it is still full of calcium, it builds up quickly, thankfully vinegar does the trick for clean up...but, the opening to this kettle is not really very big, I have smaller hands and struggle with getting a brush down into the kettle to work on the mineral deposits on the bottom of the kettle, if the opening was more straight up and not shaped in it would be a lot easier to clean. The lid doesn’t open all that wide, the button you hit to pop it open makes it open just enough to pour water in from my water bottle but that’s it, you CAN use your fingers to open it up wider but its still not a good working area for people like myself with hard water to deal with nearly every 2 days. It heats up fast, it's convenient, but no thermometer. Comes to a boil, but not a HEAVY rolling boil like my other kettle did. One thing I LOVE about this is the tea infuser. I make STRONG TEA so I can cool it down and have some great steeped iced tea, I use tea bags because that’s what I buy lol. So it does help in making some wonderful steeped tea, the infuser is such a fine mesh it almost looks solid! I am careful to wash and dry it after each use. All in all this is a very nice kettle for just under 50.00, lights up with blue LED’s when on and the whole unit can be stored away easily."},{"reviewerName":"Jadecat","rating":"5.0 out of 5 stars","reviewTitle":"Convenient, visually appealing hot kettle","reviewDate":"April 19, 2019","reviewText":"I love the fact it is BPA free and stainless steel. The black color is a nice matte finish and blends in well on my countertop, because I am not good at putting things away. This is great for making my tea and not using hot water from the coffee tainted Keurig. It is loud when it is heating up, but I don't mind as it reminds me I am heating water and won't forget about it. Plus it changes color to a deep red, and I am then assured that the water is ready to go. There is a nice removable filter inside the spout in case you need something like that. I wish I had obtained one of these earlier during winter as I would have used it a lot more. Solid, well made and the color changing aspect is pretty neat."},{"reviewerName":"Darcia Helle","rating":"3.0 out of 5 stars","reviewTitle":"Looks Good While it Boils Water","reviewDate":"The manufacturer commented on the review below","reviewText":"I'm a tea drinker, and I might be a little addicted to electric kettles. This one is especially fun. I love the color-changing feature, which is mild entertainment when I'm standing in my kitchen, bleary-eyed, resenting the morning sun, and waiting for water to boil so I can make tea, ingest caffeine, and jump start my brain.\n\nThe downfall of this one, particularly for those of us who drink a range of different teas, is that there is no temperature adjustment. It just boils water. As an avid tea drinker, I know that certain types of tea, such as white tea, need a lower temperature, while others, such as Earl Grey, require a much higher temperature. Aside from the color changing feature, this pot does nothing more than the kettle you put on your stove's burner.\n\nThat being said, it's a cool design and looks nice on a table for serving.\n\nIt is, however, a nuisance to clean if you brew tea in the kettle."},{"reviewerName":"PinkWolfyy","rating":"4.0 out of 5 stars","reviewTitle":"One problem that brought it down, it's hard to clean.","reviewDate":"May 8, 2019","reviewText":"Even though I recieved this product for free, this is my honest opinion and experience with this product.\n\nThis kettle is great. It feels like such a high quality item, it works fast and even has a spot just for tea. Which was the whole reason I choose this item.\n\nIt is absolutely the best kettle I have ever owned, and heats up in less than 5 mins. It brews a great tea, the holes in the separator are extremely fine.\n\nThe bad, it's hard to clean... sadly it's not to good to be true. It is a pain to clean if you use a finely ground additive to the water, it collects in the kettle. The top of the kettle only opens so much. You can unscrew it but you need really small hands to get to the bottom. But the kettle comes with instructions that can help you fight back on cleaning. They thought ahead, so that was suprising, trying to help the consumer with the most common issues.\n\nOther than cleaning, it is the best kettle I have ever owned. I dont see it falling apart for a long time. I highly recommend this!"},{"reviewerName":"Oliver DeMille, TJEd","rating":"5.0 out of 5 stars","reviewTitle":"My favorite!","reviewDate":"April 6, 2019","reviewText":"This is probably my favorite new electric kettle, and I've seen maybe a dozen in the past year that had differing levels of appeal for me. It has a fairly small footprint, but not too tall - good balance on the dimensions to make it versatile and easy to live with.\n\nI like the simplicity of the on/off switch. I have others with digital controls for lots of different settings, and I honestly never use them. Bring my water to boiling and I'm good.\n\nI like that it's on a swivel base that has no incorrect orientation. If it's resting solidly on the cradle, the handle can face any which way, and you're good. The handle is well-balanced and stays cool. The body of the kettle does get hot, so keep out of reach of children and pets.\n\nI LOVE the infuser attachment!! I do have loose leaf teas that get neglected because I'm too lazy to get out my filters to use them, and this solves that problem for me!!\n\nThe lid has a simple button the top of the handle to release the latch so it flips open. Very attractive, functional and well-designed electric kettle. Great for gifting!"},{"reviewerName":"Jay L","rating":"4.0 out of 5 stars","reviewTitle":"Generally happy with it","reviewDate":"April 14, 2019","reviewText":"I have a few other glass kettles against which I can directly compare this product. This one seems slightly skinnier than others, more toward a cylindrical shape. This marginally reduces the footprint. The LED light is bright and uniform, which is great since that's definitely the reason to get such glass kettles. I didn't really care for the tea infuser. The lid leaks when I pour water out, but fortunately, it just leaks directly into the main spout, so it's not a huge deal... just need to be slightly careful if it's hot water. I haven't timed it but I feel water boils slightly slower in this than my other pots; but eventually it gets the job done."},{"reviewerName":"RomReader","rating":"4.0 out of 5 stars","reviewTitle":"a small-sized 1.7liter kettle **photos**","reviewDate":"March 12, 2019","reviewText":"Surprised at how much shorter this kettle container is compared to our other automatic kettle with the same 1.7-liter max water limit (pic 01). This one is more straightforward than my other kettle. There's only 1 button. To turn it on & off. Once you click the button on, the light towards the button turns red & the kettle starts it boiling process (see pic 02). Once the water boils, the red light & the whole kettle turns off. Very straightforward. I wish there was some other indicator of the kettle being done though like a beeping sound. The size is great for a smaller kitchen like in an RV or a smaller household.\n\nRecommended."},{"reviewerName":"@AnnasGottaCrochet","rating":"5.0 out of 5 stars","reviewTitle":"This Glass Electric Kettle is not just an asset to my kitchen, it is pretty entertaining as well.","reviewDate":"May 24, 2019","reviewText":"This is an awesome product. I use it every single day, at least once. I use it to make boiling hot water for a cup of coffee, or to brew tea, and I even use it to quickly heat water in food preparation as well. It couldn’t be more simple to use, you just fill it with the desired amount of water (I use RO water, more on that later), set it on the corded base, and push the start button. Within just a few minutes you have boiling hot water at the ready. It automatically shuts itself off when it reaches optimum temperature too.\n\nThis kettle includes a Tea Infuser. The infuser has a very fine mesh so you can use loose leaf teas to make a pot of tea. Just put your desired tea leaves, or even tea bags if you like, into the metal infuser filter, fill the kettle with the desired amount of water, obviously enough to cover the level of tea you are using, and place on the base, push the button and that’s it. Within minutes you have a pot of tea ready to use. But I will warn you, it is HOT! When I brew a cup of tea in my single cup infuser it cools a bit as the tea steeps, but with this electric kettle the tea is very hot. I know because I poured my first cup into my travel mug and when I took my first drink a short while later I burned my lips and tongue. So be careful. I have not done it yet, but I really don’t see why you couldn’t make a pot of coffee using the infuser. The tiny holes in the mesh are the same as my pour-over filter cup so it should hold the grounds just fine.\n\nCleaning the tea infuser is easy. You just lift the lid on the kettle, (don’t do this until it cools) and reach in with a few fingers inserted into the top of the infuser, sort of tuck your fingers towards you palm so the infuser bottom points at an angle, then lift it out of the kettle. Once you have the top of the infuser above the kettle opening you can then hold it at a straight angle and continue to lift upwards. I then comes out real easy. Then just dump the contents of the infuser in the trash and run water over the outside of the infuser to wash the remaining bits out of the inside. I sometimes use a fine bottle brush inside if bits get a little stuck in the tiny holes.\n\nCleaning the pot is just as easy. When the tea infuser is not inserted (which it does not have to be inside to use the kettle for just heating water) I can reach my hand fully inside to wash the inside with my sponge or washcloth then just rinse it out well. If you have a larger hand then a long handled bottle brush would work just fine. Don’t put it back on the heating base right away if you get the bottom outside of the kettle wet.\n\nOne way to help keep your pot clean is to not use tap water as that causes calcium (hard water deposits) to build up on the inside. I use my RO (reverse osmosis) water and never get any scale. The only time I have is when someone used regular tap water a few times in a row. If this happens you can descale it by heating equal parts of clear vinegar and water in the kettle, let it sit for a short time, swish it around, rinse thoroughly then let the pot cool. Then boil another pot of water and dump it out.\n\nNow for the fun part. I don’t know why they put this feature on this kettle but I have to say it is my favorite part of the whole cooking experience. When you turn the pot on, it lights up a pretty blue color. It looks like the flame on my stove. Then as the water starts to boil, you can see the blue water dancing through the glass, then it turns to orange. This is such a perky way of waking up in the morning, watching all this pretty light and boil action while it gets my morning coffee off to a pleasant start.\n\nOne thing that I want to clarify, the title of the product says its ‘cordless’ but that is not 100% accurate. The kettle itself is cordless, but the heating base plugs into an outlet, so the term ‘cordless’ in the description really means that once heated, you can take the kettle away from its power source to use it. Speaking of the heating base, it does not get hot, it makes an electrical connection to the kettle that causes the bottom of the kettle to heat up and boil water. The base never gets hot so you don’t have to worry about children touching it when the kettle is off the base, but the kettle itself gets very hot, so do be careful with children around.\n\nThis kettle looks nice on my counter top, it even matches my stainless appliances, and when it is on it's quite the fun lightshow to watch. We are just the two of us so it usually only heats a few cups of water for coffee or tea at a time. But sometimes I need a specific amount of boiling water for a recipe and I use this kettle because it is so convenient for that purpose. If we have company over it has the capacity to make plenty of hot water for everyone’s tea or pour over coffee and it stays warm for up to an hour so we don’t have to keep heating it back up to make extra cups of hot beverage.\n\nI would not only recommend this product to a friend, I would give this kettle as a gift. Once you have had it in your home even a few weeks you will not know how you ever got along without it."},{"reviewerName":"aquielisunari","rating":"4.0 out of 5 stars","reviewTitle":"It's best to compare apples to apples","reviewDate":"May 14, 2019","reviewText":"I unfortunately haven'y had that much experience with electric kettles in the past. I consider myself a home cook and do have some experience with heating water and this kettle is relatively slow. Does that mean that this is a bad buy? No. It is easier and safer than heating water on the stove. When filled to the max line, is indicated by a fill tube inside of the handle. That is where I looked at it a little sideways and then the other way and then up to the light. The fill marks aren't labeled that well in my opinion and the placement of the fill tube on the side of the kettle but behind the handle is a choice I wouldn't have made. Say it loud and proud for safety sakes. Without any water the markings aren't legible. Fortunately the consumer can simply look inside of the vessel or use a measuring cup to fill it.\n\nHow does it work? The (12AWG?) 3 pronged cord is plugged into GFCI protected receptacle and with a simple press to the switch on top of the handle it starts to heat. This means it is not child friendly and needs to be kept out of reach of those who could hurt themselves. The kettle itself gets very hot to the touch. Another reminder that this needs to be kept away from curious hands and paws. When full the heating cycle was about 12 minutes long. When filled to the minimum line the water heated in a little over 4 minutes. That's not long at all for your favorite hot or iced beverage. If you are away taking care of Fido in the tree and Jessica in the doghouse and Samuel learning to run, this kettle will automatically turn itself off at the end of the heating cycle. Patiently waiting, it will be there for that moment we've all been waiting for.\n\nThere is cord storage of sorts on the underside of the heating element/base. You can wrap the cord once but the length becomes ready for storage and not for use. When I bring this kettle down it's nice that the beefy cord won't drag my glasses down with it.\n\nIt won't be my daily driver but experiences are subjective when it comes to kettles."},{"reviewerName":"Suzanne Natafji","rating":"2.0 out of 5 stars","reviewTitle":"New House Electric Kettle: Slow to Heat, Difficult-to-Read H20 Gauge & More Problems","reviewDate":"The manufacturer commented on the review below","reviewText":"This New House stainless-steel electric kettle, model NH11-17, roughly resembles the Hamilton Beach (HB) kettle, model 40880, which I have been using up until this point. Both kettles look similar; both have a 1.7 liter kettle container, an on-light when plugged in, a 29” cord, and a detachable round base into which the kettle affixes.\n\nThere are, however, some differences, so a comparison and contrast between both brands can help buyers see what the NH kettle has to offer them.\n\nIn the 1st difference, the NH cord is very thick (1 ¼” and marked 300V, 105C), which makes it unpliable to lie flat on the counter or to be coiled under the base when storing, which my HB cord does. However, this thick cord might be safer. All of our electrical goods while we worked overseas were kitted out with these super-thick cords, so we are used to using them. The manufacturing of this kettle for multiple overseas markets makes it easier for the company if only 1 type of cord is used instead of using the thinner US cord for our market, and it saves the manufacturer money in having to buy multiple cords for this product. (There is also a difference in plug type: the HB is 2-pronged, while the NH is 3-pronged because it also contains a round ‘earth’ center top pin, which adds to safety measures and because it is aimed at multiple overseas markets.) The thicker cord is a good thing because it ensures electrical safety.\n\nAfter the unboxing, I had difficulty in getting the thick, unpliable cord to fit through the round cord guide on the base. Then, when I tried to place the unfilled kettle onto the base, it wouldn’t lock into the electrical ‘bullseye’ on the base. After playing around with the unit for a bit, I could finally get the kettle to lock into the base, but it was wonky and wobbly. This problem was solved after I had washed/ cleaned out the pot 3X (as per the User Guide) and filled it with water. The water weight helped align the base with the kettle bottom electric node.\n\nA 2nd difference between both units is with the water strainer. For example, the HB has a removable screen filter (made of densely woven stainless steel mesh) which, for warm areas like mine, can also keep out bugs. This screen also helps catch calcification/ mineral sediment from pouring into tea, coffee, etc. because its holes are small. Finally, the filter can be removed and cleaned. The NH, on the other hand, has large holes drilled onto a panel for hot water to pour out of the unit. As a result, neither bugs nor demineralization can be adequately eradicated by using the NH kettle.\n\nA 3rd difference is the open/ close mechanism on the lid and safety. The HB has a button on top of the handle that is safe for opening the lid with hot, steaming water below in the kettle. This button is a safety, and I have never burned my hand by opening a hot kettle. However, with the NH, there is a depressible ‘cuff’ on top of the lid, which opens the kettle. I scalded my hand when I opened the hot kettle and at the same time, as a reflex, my wrist rocked back and hit the ‘On’ button to start heating the kettle more! The lid opening apparatus in the NH needs to be changed to make it safe.\n\nA 4th difference is the water gauge. The HB has 2 easy-read gauges on both sides of the handle, either of which can be seen from distances. However, the NH only has 1 gauge directly under the handle, which can only be read close-up. Adding to the problem is that the NH plastic for the gauge is shiny, making it almost impossible to read – even at a close distance. In contrast, both HB water gauges are made of a matte/frosted plastic, which are easy to read even at a distance on both sides.\n\nA 5th difference is the wattage. The HB has 1500W marked on its box, while the NH, after much scouring of the User Guide and the box, showed nothing. I finally found it on the underside of the base unit: The NH wattage is 1000W. This means that the HB is more powerful by 500 W and faster-heating than the NH.\n\nA 6th difference mentioned in the last sentence above results from wattage differences, and these affect the heating time. The HB takes 6 minutes to come to a full boil and auto shut off, while the NH takes 9 minutes – 3 minutes longer. Note that the Amazon product page advertises this unit as ‘fast heating’, but it doesn’t say how long it takes. The NH is clearly ‘slow heating’ in comparison to the HB because the NH takes 1/3 longer than the HB to come to a full boil and switch off.\n\nA 7th difference is finding the country of manufacture (both China) somewhere on the product or other material. The HB has it printed on the box and under the kettle base. The NH, however, only has it mentioned under the base in small letters. In addition, the NH under base lists a US distribution company, which may make buyers think that the unit is US-made.\n\nAn 8th difference is the User Guide. The HB Guide has strong, larger font sizes in black ink, with multiple diagrams of how to use the kettle and how to clean it. The HB front page Guide also contains phone numbers, all different, for each country in which the HB is sold. On the other hand, the NH Guide is difficult-to-read, with small black print and an equally difficult-to-read yellow color used as headings. Note that only 1 NH phone number can be accessed from M-F from 9-5 EST, while the HB phone number can be accessed any time of night or day.\n\nA 9th difference deals with the NH Guide on page 7, in which the product diagram is missing the problematic lid opening mechanism. This needs to be added to the diagram. (The HB Guide parts page is on page 3, and its diagram is complete.)\n\nA 10th difference is that the NH Guide first page lists its kettle as a “value-focused kitchen appliance” and “adding value and innovation”. Note that in comparison, the value and innovation PLUS safety is demonstrated in the HB kettle, in which safety, ease-of use, and heating speed (as it is advertised), should always be first.\n\nBecause the NH is a new brand, it needs to work out the problems with its product to make it safe, fast-working, and easy to use. As the NH functions now, it garners 2 stars but will serve as my secondary, back-up kettle."},{"reviewerName":"ekerry","rating":"2.0 out of 5 stars","reviewTitle":"Mediocre Kettle","reviewDate":"The manufacturer commented on the review below","reviewText":"I found this product to be less than ideal. Yes it does heat water fairly quickly, had a number of blue leds which show that it is heating, but the handle gets very hot. Grabbing the top of the handle where the user turns off the kettle or opens the lid, it will be extremely hot. Not so much for a burn, but enough to put the kettle down immediately. I don't think this is a very well made. Note, the rest of the handle does stay cool. Also the base is so light that if the cord is bent (from shipping) the base won't stay flat on the counter. I give this a 2 star, I would rate this zero if the handle was any hotter. - Yes you can grab the bottom of the handle, but I don't want to warn everyone in the house about this, the product should just function correctly."},{"reviewerName":"JDThird","rating":"4.0 out of 5 stars","reviewTitle":"Works but irritating infuser","reviewDate":"May 8, 2019","reviewText":"This does the trick. I like the two part design, with the power \"plug\" being the base, and the heating element and all being part of the carafe. Makes it easy to use and when you lift up the kettle, the plate itself isn't scalding hot from generating the heat like a heat plate would.\n\nNot as quick as I had hoped it would be, but it's not too bad. Pretty standard, compared to my gas stove.\n\nFit and finish is nice, good quality materials from the feel. The infuser is really a nice design for the straining part, very small holes that work well with the tea I was using. I wasn't sure how well this would work since I really had wanted to find one that was more like a percolator and ran water through, but it seems to work fine letting it steep after it's boiling.\n\nThe infuser though - no good handle, and it's a really tight fit so if you don't get it at just the right angle, it will not come out. Which can be a pain when it's wet, since you're basically trying to exert enough outward pressure on the sides to lift it out.\n\nThe carafe itself is easy to use, has a comfortable handle, and the on/off is as straight forward as you can get. It sits level on the base, no looseness or tilting at all.\n\nBut the design of the carafe itself is not well thought out, since you can't pour all the liquid out, even after washing and rinsing it out, when you totally upend it, there's a bead around the divide between the glass and the black plastic in the top that wasn't leveled well, and water gets hung up there, even with it totally inverted.\n\nOther than that, though, it's a nice unit for the convenience."},{"reviewerName":"Oliver DeMille, TJEd","rating":"4.0 out of 5 stars","reviewTitle":"Simple and straightforward.","reviewDate":"March 16, 2019","reviewText":"I love an electric kettle, and I find that some of the options I've come across have too many bells and whistles. This is not that. It's a simple on/off toggle that pops off automatically once the water boils. My other kettle has 6 settings, and turns off on all of them except \"boil.\" I sort of get that, but it's still dumb. I like the simplicity of this one. It's also nice that - for the same kettle volume - you get a lower profile on this one. That's nice if your under-cabinet space isn't very tall. It does mean a slight larger footprint, but not enough to make really big difference. This does have a simple rotating cradle, meaning it doesn't matter which direction the handle is facing when you set it on to heat or store the kettle. All in all, it's a decent kettle, if not the very best value for the price."},{"reviewerName":"Scott","rating":"5.0 out of 5 stars","reviewTitle":"Works great for my husband at work","reviewDate":"July 9, 2019","reviewText":"We got this for my husband to use at work. He and a few coworkers like to drink hot tea and this is perfect for that.\n\nThe pot boils water quickly even with a full pot. It will hold the water at temp for a couple hours before shutting itself off. If the water pot is dry it will also automatically shut itself off before the preset shutoff time.\n\nBeing able to remove it from the heater base is so nice. He can take hot water to a couple other people in the office without dragging a cord around or them having to come to him. The cord also wraps nicely under the heating base to keep things neat.\n\nThe clear glass makes it a lot easier to see how much water is in the pot. Also, you don't get the plastic taste like you can with other hot water pots.\n\nThe included tea infuser make it nice for loose leaf tea or even coffee to be brewed while your are boiling the water. It also has a secondary strainer in the pour spout for any loose tea leaves or coffee grounds.\n\nOverall, I would recommend this to friends and family or even buy it for them as a gift. If your looking for a great quality clear glass carafe hot water pot look no further."},{"reviewerName":"Ohstacy—Sight Seecrets","rating":"4.0 out of 5 stars","reviewTitle":"Red Hot Mama","reviewDate":"May 26, 2019","reviewText":"The New House Kitchen Color Changing Electric Kettle boils water in three minutes or less. I also like the BPA-free interior as well as the automatic shutoff features. The stainless steel feels lightweight and inexpensive, but the magic is in the kettle’s changing colors from black to red when the water is finished boiling. Be forewarned though that when the water is finished boiling, the kettle is red hot too.\n\nWhat I particularly don’t like with this kettle is that there is no flip top. This is a total inconvenience. Overall, it’s a satisfactory electric kettle for the money.\n\nI hope my review helps you with your buying decision today. 3.5 stars"},{"reviewerName":"Wired Rabbit","rating":"4.0 out of 5 stars","reviewTitle":"Watching the colors change....COOL!","reviewDate":"June 7, 2019","reviewText":"This is a unique electric kettle. It doesn't have temp controls. It has a nice flip up top that opens with a push of a button. Most of all, it changes color from black to red while heating up. And it is very cool to watch! So as the water boils, the black slowly disappears and the red takes over. One very interesting thing is if there are drops of water on the kettle, they will stay black longer as the heat change is what makes the color change. Since the drops are cooler, it takes longer and, again, WOW, so neat to watch and a good lesson in physics. Who knew? The spout, I wish was more focused for my coffee pour overs. Also, it gets only to 212F/100C, no temp settings except easy on and off. The size is just right for a few people to get their cup of tea or coffee and enjoy , and the show this has while heating up is really fascinating. Worth it for sure!"},{"reviewerName":"TDunn","rating":"4.0 out of 5 stars","reviewTitle":"Handy electric kettle, works well though one tweak would be helpful.","reviewDate":"June 19, 2019","reviewText":"This is a nice basic electric kettle which I've used daily. It heats water quickly and is easy to set up and use. I wish the cord were easier to manipulate, it's stiff and the base doesn't do a great job of holding any extra cord in place. The plate can \"tilt\" due to the cord if the kettle isn't sitting on it. It's not a big deal, just a bit visually annoying. As another member mentioned, the fill meter is on the kettle directly under the handle, this makes it hard to see while trying to fill the pot. It's not undoable, just annoying as you have to kind of tilt over to see it. If you're older like me you end up scrunched over the sink with your glasses down on your nose and squinting at it... as I said, not undoable! ;o)\n\nOverall an efficient little kettle and if anything changes in the next couple of months I'll update the review."},{"reviewerName":"Shanda","rating":"4.0 out of 5 stars","reviewTitle":"Electric Glass Kettle","reviewDate":"June 25, 2019","reviewText":"I had been looking for a glass kettle. I was skeptical to try electric, but I wanted something other than the microwave to heat water for tea, hot chocolate, oatmeal, and noodles.\n\nThis does heat water quickly, and it looks really nice while doing it. It looks really nice doing nothing, too. But the top does not come off and the opening is small for rinsing or cleaning. The entire exterior also gets hot. You must use the handle or gloves.\n\nI don't like the small opening, making it more difficult to clean. For this reason, I will only use this to heat water, but I could do more with a regular stovetop kettle. I had hoped to use this to try more teas, but I'm worried about keeping it clean and unstained.\n\nThis looks beautiful on the counter though. I also like that the cord can be shortened and hidden."},{"reviewerName":"Once in a while","rating":"5.0 out of 5 stars","reviewTitle":"Great kettle","reviewDate":"April 4, 2019","reviewText":"I took this kettle to work for brewing tea. It holds 1.8 liters of water and has a basket for the tea. I brew the tea in the morning and warm it up as needed. The glass allows you to see when the water is nearing a boil and just right for tea. The built-in LED lighting is great when you work in a low-light environment.\n\nThe glass container, which looks beautiful, does get hot to the touch. At least a liter of water is required in the kettle to reach the tea basket. The tea basket is removable for easy cleaning.\n\nFive stars."},{"reviewerName":"Ohstacy—Sight Seecrets","rating":"4.0 out of 5 stars","reviewTitle":"Satisfactory Kettle","reviewDate":"May 27, 2019","reviewText":"First, the New House Kitchen Cordless Electric Kettle doesn’t boil water as rapidly as other electric kettles that I’ve tested. The brushed stainless steel is attractive, however, and has the perfect size to fit into the corner of my counter without the feel of additional clutter.\n\nI also like the BPA-free interior as well as the automatic shutoff feature. What I particularly don’t like is that the kettle has no flip top to refill water.\n\nOverall, it’s a satisfactory electric kettle for the money."},{"reviewerName":"Shanda","rating":"5.0 out of 5 stars","reviewTitle":"Electric Kettle","reviewDate":"June 25, 2019","reviewText":"I got this for my mom because she normally heats water in a pot on the stove for her coffee, tea, and oatmeal. This is great because it turns bright red when it's done and it also auto shutoffs, so she doesn't have to worry if she forgets about it. It also heats really quickly. As fast as the microwave, which my mom refuses to use.\n\nThis is a much safer alternative to using a burner on the stove because of the safety features.\n\nThe exterior red part does get hot, but it's lightweight so easy to handle. The opening at the top is large enough to easily rinse to clean. This isn't a true black when off. It's more a really deep, dark red.\n\nThis is a nice addition to any kitchen. It's really easy to use and looks nice on the countertop."},{"reviewerName":"DZRhino","rating":"5.0 out of 5 stars","reviewTitle":"Really like the blue light, overall nice appearance","reviewDate":"April 21, 2019","reviewText":"The led blue lights around the bottom are fun and let you know when the water or tea is ready. We are not using the tea infuser, just using for hot water so can't judge it for that use. The overall appearance is very clean and simple, goes well in most kitchens. Comparing it to another we have, it is faster in getting the water up to a boil. Like with all of these you should use a kettle scale collector to keep the white scaling down. Like that this one doesn't seem to show the scale as fast."},{"reviewerName":"Mrs. Gallagher","rating":"5.0 out of 5 stars","reviewTitle":"Using in my classroom for science...","reviewDate":"June 13, 2019","reviewText":"I got the New House Kitchen Stainless Steel Cordless Electric Kettle so that I could quickly heat water in my third grade classroom for science experiments we do through our FOSS science units. It is perfect for the classroom. It is easy to use because the kettle’s transparent water level window lets you easily check whether the kettle is filled or not. Once the water is boiling, the kettle will automatically shut off for safety. Its cord wraps and stores underneath the base for added convenience. Of course I am the only one who can touch the kettle. I will often let the water sit to cool down once it has be warmed up."},{"reviewerName":"Editor of Lillian's Diaries","rating":"5.0 out of 5 stars","reviewTitle":"So Easy to Use","reviewDate":"February 27, 2019","reviewText":"The New House Kitchen Stainless Steel Cordless Electric Kettle is so easy to use and warms water up so fast and once it has reached the boiling stage it shuts off by itself which is a blessing for me since I seem to always get sidetracked and walk away forgetting I have a pot boiling away.\n\nThere is an easy user guide included that will tell you all you need to know about this stainless steel electric kettle in a very understandable method."},{"reviewerName":"Honest","rating":"5.0 out of 5 stars","reviewTitle":"Excellent Investment","reviewDate":"June 21, 2019","reviewText":"I love this. It's so easy to use right out the box. So far, I've only filled it about halfway but it only takes about 3 minutes (if that) for that amount of water to boil. And it really boils. It has automatic shut-off and doesn't take up too much space. This has helped me kick my multiple cups of coffee per day habit by making tea something that's not a headache.\n\nThe only thing to caution you about is to make sure your circuitry can withstand it. I first used it in my home office and whenever I turned it on, the lights would dim until it was done. It's fine in the kitchen though."},{"reviewerName":"MsK","rating":"4.0 out of 5 stars","reviewTitle":"No Gimmicks","reviewDate":"May 23, 2019","reviewText":" I was skeptical about the color changing feature of this product, but after boiling water several times, it really does help with letting me know if the water is still scalding hot or not. It should be noted however that even if the kettle is black, the water can still be warm, so it's still a good idea to always be careful around electric kettles.\n\nAnd for fun I wanted to see how long it took for the color to change after I emptied out boiling water, and I clocked 1 minute 30 seconds. The video clip was sped up to save time."},{"reviewerName":"Stacey","rating":"5.0 out of 5 stars","reviewTitle":"The perfect gift for kettle destroyers!","reviewDate":"March 21, 2019","reviewText":"Someone I know has a nasty habit of putting the kettle on the stove, opening the spout cover so the kettle won't whistle, turning the burner to high and walking away. Even if you do that with this pot, you won't destroy the pot. It's got sensors in place to shut itself off when it starts to boil dry. This is a great tool for multitaskers who are prone to destroy kettles on the stove!"},{"reviewerName":"Adryenn Ashley","rating":"5.0 out of 5 stars","reviewTitle":"Easy to use and perfect for everything","reviewDate":"May 6, 2019","reviewText":"Whether you need to make ramen or tea, this kettle is handy for every job that requires hot water. Simple one click operation and viola, in seconds you can hear it working as the water reaches temperature in no time flat. See through form is great, better than my previous steel one. Always know how much water you have and when it's boiling."},{"reviewerName":"OnAmazon","rating":"4.0 out of 5 stars","reviewTitle":"red 'hot' kettle","reviewDate":"May 12, 2019","reviewText":"I love the color indicator. The kettle turns red when the water is hot. It's a quick way to tell if it's ready, without being close or touching the kettle. It's cool (no pun intended). Everything else works exactly as expected on this electric kettle. The negative for me is, while the body is stainless steel, the other parts are all plastic. That includes the handle, base and connecting pieces. It makes the kettle lightweight and very easy to handle. But, I wonder if it will be durable and hold up."},{"reviewerName":"Wired Rabbit","rating":"4.0 out of 5 stars","reviewTitle":"Great temperature controls, cool design","reviewDate":"March 19, 2019","reviewText":"This is for pour over coffee. It works great. It has 8 settings for a variety of uses. The kettle also has a button to keep water temp at the same temperature. Also a half hour auto off for security. The spout pours well over a coffee pour over with a filter. The temperature brought out the flavor of the freshly ground beans. When you place it on the base, a beep tells you you are connected. Always on, with the light, and I unplug it when not in use. A great kettle for the price!"},{"reviewerName":"Patrick","rating":"5.0 out of 5 stars","reviewTitle":"Rapid boil tea kettle","reviewDate":"June 11, 2019","reviewText":"I love this rapid boil electric tea kettle. I honestly don't know what took me so long to get one. It is easy to use and brings water to a boil much faster that the stovetop. I am an avid tea drinker and this has been fabulous to use in the morning and I like not needing to take up a burner on the stove when I'm cooking breakfast. It has an auto shutoff feature which is nice and the water stays warm in the kettle making it easy to refresh your drink."},{"reviewerName":"Ray J. Palen Jr.","rating":"5.0 out of 5 stars","reviewTitle":"The perfect replacement for traditional teapots.","reviewDate":"September 1, 2019","reviewText":"I just love this product. As a tea drinker, especially in cold weather, it's great to have a product that simplifies the tea-brewing process. It sits on your countertop and is operated electrically. The teapot gives off a nice, blue glow and automatically shuts off when done. The teapot is cordless, allowing ease of use when pouring. The insert with the tea bag or tea infuser is easy to remove for cleaning."},{"reviewerName":"Sotto voce","rating":"5.0 out of 5 stars","reviewTitle":"Fast heat, fun thermochromics","reviewDate":"April 30, 2019","reviewText":"A cool merger of induction heat with thermochromic pigment. I like it! Super fast induction heating boils water faster than the microwave."},{"reviewerName":"AvidReader","rating":"4.0 out of 5 stars","reviewTitle":"Nice Teapot but somewhat difficult to clean","reviewDate":"May 16, 2019","reviewText":"I really like this teapot as a water boiler, but doubt I will ever use the infuser again. I think it was a good idea, but it is difficult to clean as is the pot if anything is brewed other than hot water.\nOther than that little factoid, it heats water brilliantly and I really enjoy the blue lighting as it prepare to boil. Also... various heat settings would be nice, but not required."},{"reviewerName":"LawyerMom","rating":"4.0 out of 5 stars","reviewTitle":"Lightweight","reviewDate":"March 9, 2019","reviewText":"I like that this kettle is stainless steel, a real upgrade over the plastic kettles I've used in the past. I just don't like having my hot water exposed to the chemicals in plastics over and over again. This kettle is shaped sort of squat and wide, so it'll fit on narrow shelves. The base has cord storage underneath so it takes up less of a footprint on the countertop."},{"reviewerName":"momofmany","rating":"4.0 out of 5 stars","reviewTitle":"This thing is great! It heats the water quickly","reviewDate":"May 6, 2019","reviewText":"This heats water quickly and it turns from black to red when the water is hot. I would prefer if it had a spout that closes and opens with a push of a button. I love using this for tea, it heats so quickly."},{"reviewerName":"Chloë","rating":"5.0 out of 5 stars","reviewTitle":"Great little kettle","reviewDate":"May 22, 2019","reviewText":"This is a good hot water kettle. It heats up quickly and pours out easily. I haven't had any issues with it so far. It does get pretty hot on the sides so it requires extra caution, especially around younger children, but that hasn't been a problem. I like how easy it is to open and fill. My last kettle was such a hassle, this one is not."},{"reviewerName":"FiFi's Mom","rating":"5.0 out of 5 stars","reviewTitle":"Highly recommended","reviewDate":"May 30, 2019","reviewText":"This is a great item. Delivers hot water quickly and tells you it's ready by changing color. After you get your hot water it will continue to tell you that it's still in a \"ready\" mode by the color of the pot. It will continue to stay red while the temperature is desirable for your hot tea etc.\nVery nice."},{"reviewerName":"K.","rating":"5.0 out of 5 stars","reviewTitle":"Get ready for fall!","reviewDate":"September 6, 2019","reviewText":"An electric kettle is one of the best things you can buy for yourself and your guests. It's so much easier than using an old fashioned tea pot! This one is sleek and easy to clean, and heats water up FAST! I'm telling you, it's a game changer for preparing fall and winter warm drinks!"},{"reviewerName":"Mike Cunha","rating":"4.0 out of 5 stars","reviewTitle":"Does What It Is Supposed To Do","reviewDate":"September 20, 2019","reviewText":"The New House Kitchen Stainless Steel Cordless Electric Kettle boils water rapidly within 5-10 minutes for a full kettle. Cleaning is fairly easy, without too much effort needed. One excellent feature is that the kettle will automatically shut itself off once the water has boiled."},{"reviewerName":"J. A. Bell","rating":"5.0 out of 5 stars","reviewTitle":"A Lot Of Boiling Water In Ten Minutes","reviewDate":"March 10, 2019","reviewText":"This electric kettle boils a LOT of water in about 10 minutes. Love the way the kettle sits on the base, so it's cordless when you pour water. Love the design and that it's stainless steel. Be sure to touch only the handle, as the metal does get hot. Wonderful and very convenient appliance!"},{"reviewerName":"Bookwyrm","rating":"5.0 out of 5 stars","reviewTitle":"Heats water quickly","reviewDate":"July 31, 2019","reviewText":"This electric kettle heats water to boiling rapidly, and entertains while doing so! I like being able to watch the progress of the heating as the kettle changes from black to vivid red."},{"reviewerName":"Thomas M. Loarie","rating":"5.0 out of 5 stars","reviewTitle":"Great Hot Water Maker","reviewDate":"September 3, 2019","reviewText":"Great for just about any need that requires hot water. Heats quickly."},{"reviewerName":"Linda Pagliuco","rating":"5.0 out of 5 stars","reviewTitle":"Works well!","reviewDate":"June 25, 2019","reviewText":"Perfect for a small apartment or the office. Heats water quickly and looks nice!"}]}