{"title":"Electric Kettle, Glass Tea Kettle & Water Boiler Variable Temperature Control Tea Heater with LED Indicator Light Change Auto Shut-Off, Boil-Dry Protection, Keep Warm 1.7 L Tea Kettle (BPA Free)","manufacturer":"FITMAKER","currentPrice":"$30.99","rating":"4.8 out of 5 stars","totalRatings":"198 ratings","features":["\n         Make sure this fits\n                by entering your model number.\n        \n","SUPER FAST – 120V, 1100 Watts of power quickly bring water to a rolling boil within 7 minutes or less, depending on how much water you fill it with.","PREMIUM GLASS KETTLE: Cool and strong, the premium glass kettle made with high quality glass and stainless steel bottom. There is no unpleasant taste or smell, this kettle keep clean and preventing taste contamination.","HIGH QUALITY & BPA-FREE – Not only does this kettle feature a unique and stylish aesthetic that’s beautifully illuminated by blue LED lights, it was also built to last. All of its materials are BPA-Free. Its heat-tempered and stain-resistant borosilicate glass won’t crack under heat.","CONVENIENT WATER LEVEL GAUGE: comfortable washable filter and stay-cool handle to ensure the purest results, touch glass bass, Non-slip handle prevents grip loss.","EXTRA FAST WATER BOILER: Super power make the boiling more efficient than stovetop kettle and microwave. Even when fill to Large capacity(1.7L), the water comes to a full boil within 6-7 minutes and will be ready for tea, pasta, coffee , oatmeal, instant soup, hot chocolate etc."],"reviewsAspects":["easy to use","easy to clean","heats water","led lights","temperature settings","different temperature","stainless steel","highly recommend","every morning","temperature control","boiling water","water boiler","heats up quickly","kettle videoid","water boils","good looking","water fast","tea bag","french press","made of glass"],"productInformation":[{"Package Dimensions":"9.3 x 8.7 x 7.2 inches"},{"Item Weight":"2.5 pounds"},{"Shipping Weight":"2.5 pounds (View shipping rates and policies)"},{"Manufacturer":"YOUSMART"},{"ASIN":"B07PM3C68L"},{"Customer Reviews":"4.8 out of 5 stars\n    198 ratings\n4.8 out of 5 stars"},{"Best Sellers Rank":"#9,078 in Kitchen & Dining (See Top 100 in Kitchen & Dining)\n#60 in Electric Kettles\n"},{"Date first listed on Amazon":"March 24, 2018"}],"productDescription":["Save precious minutes boiling water in the kettle instead of on the stove. Even use kettle-boiled water to supplement whatever’s simmering stove top.","The cordless design allows you to lift up the kettle from the power base and take it anywhere you want. Say goodbye to the old school electric kettle","The best kettle technology out there is used to offer dry-run (boil-dry) protection and auto shut-off. If it starts heating without enough water in the unit, the heater will automatically shut off to avoid damaging the heating element.","The Kettle offers 5 different preset heat settings, which allows for steeping tea at just the right temperature depending on the variety. Using the simple one-touch controls on the kettle's handle, select 60 degrees C for delicate teas, 70 degrees C for green tea, 80 degrees C for white tea, 90 degrees C for oolong tea, 100 degrees C for French press coffee, and \"Boil\" for black tea or to make instant cocoa, oatmeal, noodles, and more.","\n","\n","\n","It is available in five modes each with a different color backlit: 100°C (212°F - default mode - red), 60°C (140°F Green), 70°C (158°F Blue), 80°C (176°F Orange), and 90°C (194°F Purple).","Keep Warm is the kettle’s default function that automatically maintains selected temperature for 30 minutes. The visible glass design allows you to check water volume clearly and enjoy boiling process.","The large opening makes it very easy to clean with a rag or sponge, and the lid come with a mesh to filter whatever you are boiling or warming.","Maximum capacity: 1.7 L","Ergonomic & heat resistance handle on your kettle and pour yourself some hot water! Perfect for daily using."],"reviews":[{"reviewerName":"Jil","rating":"4.0 out of 5 stars","reviewTitle":"Cool Stuff !","reviewDate":"August 3, 2019","reviewText":"Update: After using this for a month -- a circular moldy spots starts appearing on where bubble goes up or where it heats up. :/\n\nI recommend cleaning it 1st before using it by following the inside instructions just to remove anything that's dirty or the factory smell. I just put 1 part vinegar and 2 parts water. Let it sit for 1 night then fill it in with water again, boil it, throw it away and now you can use it normally just fill it in with water.\nI bought this because I just moved and I'm tired of heating water through pans! its legit made my life 100x easier. I can just shower and let it heat my water and move on with my life. Its a simple machine with on/off button and another button that tells it what temp you want it to be. There's 5 settings 60c, 70c, 80, 90c and honestly i dont think you will need more than those. 100c being the highest will literally make it boiling hot with water bubbling. Its also color coded so you cant get wrong here unless you just dont really pay attention. I've been using this everyday for my hot choco and Ive boiled over 10x within this week. I'm loving it so far."},{"reviewerName":"j","rating":"5.0 out of 5 stars","reviewTitle":"Fast boiling with temperature setting function glass electric kettles , BPA free with LED indicatior","reviewDate":"October 4, 2019","reviewText":"I am very pleased with this product so far .My previous electric kettle died. I was looking for a stainless steel one, but find this good looking cordless glass Electric Kettle , so I decided to try it. I have used multiple electric kettles before and this one is so far my favorite. This glass boiler doesn't have any plastic smell , with the wide open mouth. it's so easy to clean. The water boils in all glass and the only plastic that touches the water is the top lip. Love the button that opens the top for easy refill and pour. Others I used flop around. And of course the red light makes it fun and not only does it let you know when the water temperature is perfect by shutting off, but the lights are aesthetically pleasing as well. Like all the water boilers, you need to clean your water boilers with water and vinegar to clean out the mineral deposit (calcium) at the bottom after a month of use. Also, it seems that it heats up the water a lot faster than my old kettle, which is definitely a plus."},{"reviewerName":"Jama","rating":"5.0 out of 5 stars","reviewTitle":"Nice electric kettle so far","reviewDate":"July 22, 2019","reviewText":" I like that It has more granular control over temperature. And it has larger mouth to clean up easily. But I usually use little citric acid to clean up the bottom hardening of the kettle. And also it has nice beep sound whenever the water is boiled and ready. I hope this lasts long. I’ll update if anything changes."},{"reviewerName":"vy le","rating":"4.0 out of 5 stars","reviewTitle":"Heats up water quickly","reviewDate":"June 30, 2019","reviewText":"The product comes and works just like it is supposed to. The water heats up pretty quick and it has different temperature option and it will have different color for each temperature. I bought it to make my saffron drink everyday and I dont need the water to be too hot, so this works for me perfectly. I just left the water in the kettle and drink it straight from there. The 1 star off is because I thought it will look a little fancier, however you get what you pay for and I think this item is a steal for the price already."},{"reviewerName":"CHW","rating":"5.0 out of 5 stars","reviewTitle":"modern look and durable","reviewDate":"August 19, 2019","reviewText":"Instead of other materials, I absolutely choose the kettle which made of glass. Glass kettles provide an alternative to the metal and plastic models that ignore the associated problems in other materials like the metallic taste, rust, unnatural chemicals etc. This beautiful glass kettle has an Auto Shut-off and Boil-Dry protection feature, which allows me to shut off the kettle when no water is present inside. With a non-slip 360 rotary base, makes it more convenient. It also is equipped with bright LED lights which turn on when the kettle is heating. With a maximum capacity of 1.7litres, the water is fully boiled and ready to be used. I really enjoy this kettle a lot every single day."},{"reviewerName":"bvr amz","rating":"5.0 out of 5 stars","reviewTitle":"it worths the money","reviewDate":"October 2, 2019","reviewText":"It heats water very fast, much faster than heating water on the stove top. I really enjoyed the preset temperatures! Since I drink various different teas and coffee everyday, this is a huge convenience. And this kettle will keep my water warm and wait until I get there, and my water isn't too cold or too hot! It's stainless so there is no \"taste\" except the water. Another bonus is that the little LED light on the water level indicator is bright and helps you see the water level in a dimly lit early morning kitchen and the beep when it's done is perfect. If you use a kettle every day this is the one to buy."},{"reviewerName":"Cris in Houston","rating":"5.0 out of 5 stars","reviewTitle":"Excellent kettle","reviewDate":"August 12, 2019","reviewText":"Love the temperature options, love how quick it heats up water. The lights make it more interesting to watch when I'm waiting for it boil. I like that it is GLASS and not metal. The elec kettle this replaced, had metal surface coming off, didn't look like stainless steel to me. I was not happy with idea of my water containing this surface or leaching from it. Yea electric glass kettle. The only thing I would change would be for companies to make/offer smaller kettles. I hate having such a large thing on my sink; other people may not have space issues like I do. Overall very good value."},{"reviewerName":"Nu","rating":"5.0 out of 5 stars","reviewTitle":"A must buy product","reviewDate":"September 28, 2019","reviewText":"A very nice Electric Kettle. I used to buy the stainless steel electric kettle, and I am not satisfied with it because as time goes by, the screen that shows the water level becomes blurred, make it hard to see how much water is inside the kettle. Therefore, I went on Amazon and tried to search a glass kettle. I love how big the kettle body is, and as it is made by glass, I can easily see how much water I have in the kettle. It boils up very fast and there are temperature settings, and different colors stands for different temperature. I have been using this kettle everyday to make my tea, and have no problems with it. The colors make this kettle looks really cool. A must buy item!!!"},{"reviewerName":"Rebecca","rating":"5.0 out of 5 stars","reviewTitle":"Good looking kettle for kitchen","reviewDate":"August 25, 2019","reviewText":"I originally saw a transparent kettle at costco, but didn't end up buying it. When I went back, costco no longer carried it. Hence, I started looking for it.\nLocal store like target were selling similar electric kettles for 50 to 60, which brought me here.\nThrough some searching, I found this little kettle with its unique shape and design. After using it for a week, I like to say its a great buy."},{"reviewerName":"toishiki","rating":"5.0 out of 5 stars","reviewTitle":"Beautifully made with safe materials","reviewDate":"November 4, 2019","reviewText":"I can finally get rid of my old plastic kettle with rusty heating coils inside I am very excited.\n\nThis new one has really nice design, clear class without any potential burning plastic and metal smell, the heating is fast without cleaning worries like I used to have. Hard water has been a big problem and it was really hard to clean, but this one is obviously easy to reach and clean out the accumulated salts and stuff.\nThe LED light is also very cool by the way, and the temperature control is also very neat for some classy tea making without putting any thermometer in."},{"reviewerName":"Mohammed Wafeeq Al-Rawi","rating":"5.0 out of 5 stars","reviewTitle":"Excellent quality with no doubt","reviewDate":"July 28, 2019","reviewText":" Tha glass and the led lights make it look fancy, time to heat the water is very quick, temperature control and water filter, happy with my purchase, see video"},{"reviewerName":"Justin Chang","rating":"5.0 out of 5 stars","reviewTitle":"must have at home!!","reviewDate":"October 7, 2019","reviewText":"This is a great kettle. It's quiet and fast, it boils water, it does everything it should. It also has a very elegant blue light that shows it's on. I love the blue light, indicating that the machine is on and working to boil the water. This kettle is big and heats water within minutes. I found the auto-shutoff feature pretty helpful."},{"reviewerName":"Kyle","rating":"5.0 out of 5 stars","reviewTitle":"Easy to use and almost full automatic","reviewDate":"November 1, 2019","reviewText":" I used to do hot water at the water boiler with gas stove. I read a few articles about the white water mark that stick on the water boiler is bad for the health. I decided to give this electric water boiler a try and it ended up pretty good. I don't have to start any fire (on the stove). I don't have to stand next to it in case I forgot. I only need to fill it up to the level that I need and start it with one click. When the water is boiled, the boiler will turn off by itself."},{"reviewerName":"whitney J Chen","rating":"5.0 out of 5 stars","reviewTitle":"I love it how you can choose what degree you want the water","reviewDate":"September 14, 2019","reviewText":" I’m a big tea drinker, this electric kettle comes handy for everyday use. I love it how you can choose what degree you’d like your water which is important for certain tea. The kettle is a great value for something that’s less than $30. It looks more expensive than it really costed."},{"reviewerName":"Pamela","rating":"5.0 out of 5 stars","reviewTitle":"Fast, Easy to use, Great Size!","reviewDate":"October 7, 2019","reviewText":"I was looking for something to heat water quickly besides my pans or Keurig. This kettle is great. It holds a great amount of water (enough for my entire family). The best feature is the speed in which it heats water. I can start the kettle and it’s boiling water before I can prepare instant grits! It’s great for quick morning meals, or drinks. I love the light that illuminates the water. It’s simple to use and has several options to meet multiple needs. I use it daily."},{"reviewerName":"Yuchiao Hsiao","rating":"5.0 out of 5 stars","reviewTitle":"This is exactly what I need.","reviewDate":"August 24, 2019","reviewText":"It is my habit to burn a pot of boiling water every morning, but I often forget the fire. I always wanted to change the electric kettle, but the old kettle didn't break and didn't change. Now I decided to change it because I saw this electric kettle is really great. It has a strainer at the mouth of the pot and can set different temperatures depending on the tea or coffee, which is exactly what I need.Now every morning, I don't worry about forgetting to turn off the fire."},{"reviewerName":"Wild Explorations","rating":"5.0 out of 5 stars","reviewTitle":"Big and heats up quick","reviewDate":"November 5, 2019","reviewText":" This teapot was fun to unbox. The glass is not actually blue but clear and is also thick and sturdy, which is good because I tend to break things. The temperature controls are very simple and clear and it's easy to clean, not that I'm using anything but water in it. It didn't take long at all to heat quite a lot of water. I like that it's clear, it looks attractive on the kitchen counter."},{"reviewerName":"Mohan","rating":"5.0 out of 5 stars","reviewTitle":"Good Water kettle","reviewDate":"November 11, 2019","reviewText":"The water heats up pretty quick and it has different temperature option and it will have different color for each temperature. This beautiful glass kettle has an Auto Shut-off and Boil-Dry protection feature, which allows me to shut off the kettle when no water is present inside. With a non-slip 360 rotary base, makes it more convenient. It also is equipped with bright LED lights which turn on when the kettle is heating."},{"reviewerName":"mimi of 7","rating":"5.0 out of 5 stars","reviewTitle":"Nice size","reviewDate":"August 30, 2019","reviewText":"I finally got rid of my old metal teakettle and got this glass beauty. Within 5 minutes I have a pot of boiling water. When I get up early I make a pot of French press coffee. I don’t let the water boil but gets to the right temp. I leave it on the counter, it looks nice. Would recommend this to anyone looking for a glass pot. I haven’t had to clean anything out of it but would imagine it will be easy."},{"reviewerName":"Rob Claro","rating":"5.0 out of 5 stars","reviewTitle":"I dont need to microwave my water anymore","reviewDate":"November 2, 2019","reviewText":"I drink a lot of instant coffee and tea and this is perfect addition to my kitchen. Ive always seen and use them overseas most specially in asia during my travels and I always forget to get one when i come back home but I finally got hold of one. I must say this is a cool thing to have. It heats up the water almost as quick as it needs to. I dont have to microwave my water anymore :)"},{"reviewerName":"Katie Arnold","rating":"5.0 out of 5 stars","reviewTitle":"Great electric kettle!","reviewDate":"August 22, 2019","reviewText":" I love electric kettles and this one is perfect. It can hold a great amount of water and it heats up in about a minute. My favorite feature of the kettle is the ability to choose specific temperatures you want the water to be heated to. There is a different colored led light for each temperature. Choosing the temperature of water is awesome because certain types of tea require a certain temperature. Can’t beat the price either!"},{"reviewerName":"Cheryl S.","rating":"5.0 out of 5 stars","reviewTitle":"Boils water in about 2 minutes","reviewDate":"November 7, 2019","reviewText":"A friend recommended this to me and i decided to purchase it when everyone got sick with the flu. It is very easy to use. It takes about 2 minutes to make a teapot of boiling water. We have not only used it for tea but to make instant cereal and soup and even jello too. I like how you can adjust the temperature of the water by pressing the button on the handle."},{"reviewerName":"SHsia","rating":"5.0 out of 5 stars","reviewTitle":"Good electronic kettle","reviewDate":"October 1, 2019","reviewText":"This kettle looks nice and works great. It has led lights in different colors that lights up when it's in use at different temperatures. It heats water quickly. it automatically shuts off when the water is boil to the desired temperature. The size is big enough for regular usage. The bottom of the kettle is made with stainless steel which is easy to clean."},{"reviewerName":"YC RAY LIAO","rating":"5.0 out of 5 stars","reviewTitle":"Pretty Good Electric Kettle.","reviewDate":"July 10, 2019","reviewText":" Easy to use and safe for user. I do not need to keep waiting and water boiled very fast. I like this kettle and highly recommend."},{"reviewerName":"elly","rating":"5.0 out of 5 stars","reviewTitle":"Sturdy kettle aesthetically pleasing.","reviewDate":"July 29, 2019","reviewText":"I wanted a transparent kettle for my kitchen, I have been slowly changing out my old hand me downs and curating a more cohesive style. This kettle works as it should. Water doesn’t take a long time to boil. I’m a heavy user of kettles (4x daily) So I’m hoping this can stand the “tea drinker test” but as it stands I am very happy with the look and capacity."},{"reviewerName":"DVanness","rating":"5.0 out of 5 stars","reviewTitle":"My favorite feature is that it will hold the chosen temp for up to two hours.","reviewDate":"November 6, 2019","reviewText":"Have you ever just wanted a cup of tea, hot cocoa or coffee and it' s either too hot or luke warm. No more of that for me :) That is my favorite feature for this glass kettle. The multiple water temperature settings is GREAT and it will hold that temp for up to 2 hours, plus a different color for each setting!\nThis kettle is perfect for me at work, so I don't have to run upstairs to use the microwave every time I want a cup of tea! It's easy to use and a piece of cake to clean. Happy with my purchase !"},{"reviewerName":"Jennie","rating":"5.0 out of 5 stars","reviewTitle":"great item","reviewDate":"August 22, 2019","reviewText":"I like to make hot tea at home, and as an Asian, we like to drink warm water. This kettle is very convenient to use, boil water very quick, I even just put the tea bag in it to cook, and easy to clean. The quality of the item is very good, and the light makes it very nice to see at night. I like it a lot!\nHighly recommend! Thanks"},{"reviewerName":"Adam L.","rating":"5.0 out of 5 stars","reviewTitle":"Easy to use","reviewDate":"October 17, 2019","reviewText":"I bought this kettle for my parents to replace their broken one. They are so happy when receiving it. There are different temperature options suitable for each using purpose. Mom and Dad drink tea and coffee every day so it is very convenient for them to select the correct degrees and wait. That can save time instead of just boiling everything too hot with their old kettle."},{"reviewerName":"LiLi LaLa Coffee","rating":"5.0 out of 5 stars","reviewTitle":"Works Fast and Great Design","reviewDate":"October 14, 2019","reviewText":"This electric kettle is very nice in design and operation. The blue LED lighting is very nice, the different temperature settings is such a good feature for the different uses I have for the boiled water. The base is good, the display is easy to read and use, and the water boils fast and efficiently. Very happy with my purchase."},{"reviewerName":"Huimin Huang","rating":"5.0 out of 5 stars","reviewTitle":"Easy to clean","reviewDate":"August 22, 2019","reviewText":"I always have metal electric kettle. I finally decided to get glass kettle. This kettle is cordless, so is very easily move around. The large diameter opening, make me easy to clean inside. Doesn't take much time to boil water. And I also can keep my water heat with just push the button. I love to see the LED lights on while boiling water."},{"reviewerName":"Michelle","rating":"5.0 out of 5 stars","reviewTitle":"It’s a kettle","reviewDate":"August 16, 2019","reviewText":" This is a basic electric kettle. It boils water in minutes. One touch of the button can set it to boil. You can choose alternate temperatures if you want. The kettle is made of glass and connects to the base that has the cord. Pretty simple, quality item. It does what it’s supposed to do so 5 stars!"},{"reviewerName":"Jade","rating":"5.0 out of 5 stars","reviewTitle":"Great water boiler","reviewDate":"July 8, 2019","reviewText":"I enjoy my water boiler. It’s great!\nIt cool because you can see the water boil through the see through glass. And it also has some cool lights that change color.\nIt’s convenient that this boiler has different water temperature settings. And it boils pretty quickly. Glad I found this item here for this price rather than paying a bunch load of money for a lower quality water boiler. It was a well worth purchase"},{"reviewerName":"Ravi Kakani","rating":"5.0 out of 5 stars","reviewTitle":"Nice Electric Kettle","reviewDate":"August 30, 2019","reviewText":"Love how fast it boils water. It's easy to clean and when I open the lid, its water drippings goes right back into the pot. No messy on outer surface.Been using it for several days with several times a day and no issues at all.\nNo odors, and stainless bottom is clean and no spots as others are mentioning.\nI like it a lot."},{"reviewerName":"serendipity","rating":"5.0 out of 5 stars","reviewTitle":"Glass Kettle with Disco Lighting ? YES Please","reviewDate":"November 7, 2019","reviewText":" Finally a kettle you can actually see through. I love that this kettle is glass so very sanitary, wont get tea stains if I boil tea leaves, cool differently light features, auto shut off, has a keep warm setting which is awesome because im a tea fanatic, great buy !"},{"reviewerName":"joe guo","rating":"5.0 out of 5 stars","reviewTitle":"I need it!","reviewDate":"August 21, 2019","reviewText":"I used this glass electric kettle for more than two weeks! really beautiful! When this glass electric kettle is working, it will have LED lights of different colors. I like this very much! It is big enough to brew ten cups of coffee at a time! The water heats up very quickly! This is what I need most!"},{"reviewerName":"Debbi Shannon","rating":"5.0 out of 5 stars","reviewTitle":"Super fast heating kettle!","reviewDate":"August 19, 2019","reviewText":" This electric kettle is awesome!! It actually has 4 heating settings. When you first turn it on it defaults to 100c. Press the +- key to change the settings. Heats the water super fast!! Perfect for using it for my French press or to make tea!! I love it!!"},{"reviewerName":"JT","rating":"5.0 out of 5 stars","reviewTitle":"Great E.Kettle that you feel safe for elderly to have!","reviewDate":"September 29, 2019","reviewText":"Its a efficient electric kettle that is safe and looks great. Love the transparent glass design that I feel safe for my elderly parents to use. Unlike the traditional kettle, even you forget to turn it off, it 'll automatically shuts off, plus it's easily to see the water inside the kettle. I love it."},{"reviewerName":"Christina Sawa","rating":"5.0 out of 5 stars","reviewTitle":"Can’t live without it! Love that it’s clear!","reviewDate":"November 7, 2019","reviewText":"I usually use a kettle that you put on a fire, but decided to try an electric one out. I could NEVER go back! The water boils so quickly and I don’t have to worry about the kids burning them selves on fire! I love this and will be buying some for Christmas presents to give to family!"},{"reviewerName":"Chang Family","rating":"5.0 out of 5 stars","reviewTitle":"Good looking Kettle...","reviewDate":"November 11, 2019","reviewText":" Good looking product!\nI have the black water kettle from amazon but I like the way this looks so I’m switching it up!\n\nCon:\nThe little node popping up in the inner kettle makes it a bit inconvenient to clean"},{"reviewerName":"Rebecca Stischer","rating":"4.0 out of 5 stars","reviewTitle":"It beeps","reviewDate":"June 18, 2019","reviewText":"The kettle is great, it looks nice with the different light colors for the different temperatures. I enjoy that I can choose 4 different temperatures. The only reason I put 4 stars is it beeps when you set the kettle on its stand, and when the water has reached the temperature you set it to. It’s only a single, microwave type of beep, but I was not expecting it to beep and I’d rather it didn’t. But, if you would appreciate that feature, go for it!"},{"reviewerName":"V&Y","rating":"5.0 out of 5 stars","reviewTitle":"Kettle","reviewDate":"September 9, 2019","reviewText":"The kettle’s got a sift at the sprout, it is good for making tea. I usually boil the water with the dried flowers or tea bag in it."},{"reviewerName":"gloria","rating":"5.0 out of 5 stars","reviewTitle":"Large Capacity. Heats Up Quickly.","reviewDate":"September 22, 2019","reviewText":"This electric kettle has large mouth to made it super easy for cleaning. Moreover, it heats up water quickly. I also like its large capacity of 1.7 liters. The temperature options with different color LED lights is quite interesting when I am waiting for water boils. Great product with reasonable price."},{"reviewerName":"Teresa","rating":"5.0 out of 5 stars","reviewTitle":"Love traditional tea.","reviewDate":"November 7, 2019","reviewText":"I love having tea. The process even calms me. This electric kettle still gets the water done and still gets the satisfaction of pour hot water, dunking tea bag watching water change the perfect color. Of course kids just care about quick ramen noodles."},{"reviewerName":"Amreen","rating":"5.0 out of 5 stars","reviewTitle":"Good kettle","reviewDate":"November 8, 2019","reviewText":"I love the electric kettle! This kettle comes with a feature to pick a temperature to heat the water. I brew a lot of different types of teas, which need to be brewed at different temperatures so this feature is so helpful. The water boils quickly as well!"},{"reviewerName":"AL","rating":"5.0 out of 5 stars","reviewTitle":"heat up quickly and easy to clean","reviewDate":"September 30, 2019","reviewText":"This electric kettle is large enough for whole family to use. It heats up quickly. I will pour water the night before and press down the bottom then i have hot water for coffee and kids honey drink. It's also very easy to clean with big mouth.\nI love it."},{"reviewerName":"keshab","rating":"5.0 out of 5 stars","reviewTitle":"great thing to have in kitchen and office","reviewDate":"July 26, 2019","reviewText":"I have bought two kettles after I was so impressed with my first one. The best feature of it is you can manually set 5 different temperature modes. So, I can use it just for normal use or with higher temperature for herbal teas. It can heat enough water at a single time. Also, it takes 2-3 minutes to boil. So, I am really impressed with this purchase."},{"reviewerName":"Doris","rating":"5.0 out of 5 stars","reviewTitle":"Office uses working well","reviewDate":"September 30, 2019","reviewText":"I bought the kettle for office uses. All my colleagues are amazed at the well-designed temperature control system and the cool lighting. The “keep it warm” button is very useful for us."},{"reviewerName":"Comfort Homes","rating":"5.0 out of 5 stars","reviewTitle":"Love it","reviewDate":"August 27, 2019","reviewText":"I am very satisfied with this product. This not only has a quick boiling time but it also has an auto shut-off so you don’t have to worry about leaving it on! It only caused 3 minutes by minimum water and 7 minutes by max water. So fast."},{"reviewerName":"Pratik Shrestha","rating":"5.0 out of 5 stars","reviewTitle":"Loves it","reviewDate":"August 6, 2019","reviewText":"Purchased this for my mom, and it’s made life very easy for her. She enjoys drinking warm water, and enjoys various drinks that require warm water throughout the day. This product is so fast, and she’s always complementing how well it works"},{"reviewerName":"Kai","rating":"5.0 out of 5 stars","reviewTitle":"Glass kettle is good","reviewDate":"August 15, 2019","reviewText":"I must to say this one is the best kettle I have ever bought. Great and easy to clean."},{"reviewerName":"Amazon Customer","rating":"1.0 out of 5 stars","reviewTitle":"Cheap crap","reviewDate":"August 6, 2019","reviewText":"Crap"},{"reviewerName":"Charles David","rating":"5.0 out of 5 stars","reviewTitle":"Strong glass. Nice quality","reviewDate":"August 17, 2019","reviewText":"Gets the job done really well. Heats the water pretty fast and the light it has makes it really nice looking. Its made of strong glass and its perfect for my kitchen. Would definitely recommend this to anyone looking for a electric kettle."},{"reviewerName":"Ana Elliot","rating":"5.0 out of 5 stars","reviewTitle":"One of the best","reviewDate":"August 20, 2019","reviewText":"Very good quality product, easy to use and easy to clean, I like this kettle, fast boiling then other kettles. Glass is very easy to clean then metal, useful for daily use, I drink lots of tea so it’s best for me"},{"reviewerName":"Brittany","rating":"5.0 out of 5 stars","reviewTitle":"Perfect kettle","reviewDate":"September 26, 2019","reviewText":" This kettle is absolutely perfect. The temperature control settings are so useful. It heats and boils water very quickly. It's easy to clean and use. Very great value for the price. Highly recommended."},{"reviewerName":"Candy","rating":"5.0 out of 5 stars","reviewTitle":"Fast and accurate","reviewDate":"October 16, 2019","reviewText":"I drink hot lemon water every morning sometimes it would be too hot!! with this electric warmer I can control not just the temperature but also the time!! Perfect for visits too fast and easy to serve!"},{"reviewerName":"Ash","rating":"5.0 out of 5 stars","reviewTitle":"Cool Electric Kettle","reviewDate":"July 15, 2019","reviewText":"This electric kettle is a simple and safe device whose uses can go beyond boiling water for tea. It's easy to use and the water boils up very quickly. It's strong and durable and makes great addition to your kitchen product."},{"reviewerName":"Beryl C.","rating":"5.0 out of 5 stars","reviewTitle":"Love the temp control setting.","reviewDate":"October 7, 2019","reviewText":"Bought this to replace my old T-Fal. Love the temp setting on this kettle since I drink a lot of green and white teas that don't require boiling hot water temp. Great product. Well packaging."},{"reviewerName":"Kan","rating":"5.0 out of 5 stars","reviewTitle":"Great electric kettle","reviewDate":"October 7, 2019","reviewText":"I use this electric kettle every morning. Easy to use. I like to use 80 C water to brew my coffee. with this electric kettle, you can choose the temperature you’d like. It also reaches 80 C, 100 C relatively quickly."},{"reviewerName":"D","rating":"5.0 out of 5 stars","reviewTitle":"Beautiful kettle with light","reviewDate":"November 11, 2019","reviewText":"I broke my last kettle when I knocked it on the cabinet. This one is good, heat up fast and boil water. I like that it is transparent and light, so I know when it starts and stop heating"},{"reviewerName":"Mimi","rating":"5.0 out of 5 stars","reviewTitle":"Great little kettle","reviewDate":"November 1, 2019","reviewText":"Great little kettle especially in the morning when I need to heat up some water fast and get going to work. Just hit the button and go and not have to worry about forgetting the water."},{"reviewerName":"Johnny Shih","rating":"5.0 out of 5 stars","reviewTitle":"Good","reviewDate":"October 17, 2019","reviewText":"This Electric Kettle is better than what i had before. It heats up very fast and also very easy to clean. The amount of water enough for whole family. So far i use it without any problems."},{"reviewerName":"TRUFFLE (A.Y)","rating":"5.0 out of 5 stars","reviewTitle":"heats up quickly and good design","reviewDate":"October 1, 2019","reviewText":"I bought the kettle for my parents. They love it. Especially different color led for different temperature choices and auto turn off for safety. It's a very useful product for every household."},{"reviewerName":"Amber Do","rating":"5.0 out of 5 stars","reviewTitle":"Convenient kettle with different temperature preference","reviewDate":"November 9, 2019","reviewText":" I bought this for my apartment in college and I found it very convenience. Automatically turned off after boiled to the selected temperature. Have cool led lights that represented different temperatures and also a filter where you pour the water out. I shared this with my roommates and they also really like it!"},{"reviewerName":"Tricia","rating":"5.0 out of 5 stars","reviewTitle":"Great electric kettle","reviewDate":"October 16, 2019","reviewText":"Love this product! It heats up very fast. The glass is sturdy. Easy controls on the handle and auto shut off. It is easy to clean and looks very nice. I would definitely recommend."},{"reviewerName":"haim lousky","rating":"5.0 out of 5 stars","reviewTitle":"Great kettle; well priced, well made, well recieved!","reviewDate":"November 12, 2019","reviewText":"This is the best kettle I ever purchased! It heats the water so fast, super easy to clean, and not too hot to touch the kettle. I love the sleek look it has on my counter, with it's nice blue glow."},{"reviewerName":"achraf","rating":"5.0 out of 5 stars","reviewTitle":"Quiet and fast","reviewDate":"August 8, 2019","reviewText":"It's great. It's quiet and fast, it boils water, it does everything it should. it has different temperature option and it has different color for each temperature. So far so good. I would recommend it!!"},{"reviewerName":"china","rating":"5.0 out of 5 stars","reviewTitle":"Love my new kettle!","reviewDate":"November 11, 2019","reviewText":"This heats up super fast compared to a stove top kettle. It has a few different temperatures and with each temperature you get a different color. It’s Perfect!"},{"reviewerName":"Kate","rating":"3.0 out of 5 stars","reviewTitle":"Decent kettle but not what was expected","reviewDate":"September 8, 2019","reviewText":"The kettle is easy to operate, but never actually lights up blue, only red, and it takes just as long as a standard kettle to heat up, unlike most electric kettles, which heat quickly. Overall not a good value for the money."},{"reviewerName":"Randy","rating":"5.0 out of 5 stars","reviewTitle":"Heats Water","reviewDate":"November 6, 2019","reviewText":"The water heats up quickly and of course the lights make heating the water much more fun. I have this in my office and it makes a nice addition."},{"reviewerName":"Shey Burns","rating":"5.0 out of 5 stars","reviewTitle":"Heats up fast","reviewDate":"August 27, 2019","reviewText":"I use this to make my coffee now. It’s a lot easier than boiling water on the stove and then I just pour it in my French press and perfect coffee now."},{"reviewerName":"DG","rating":"5.0 out of 5 stars","reviewTitle":"Adjustable temperature and beeps when ready","reviewDate":"November 3, 2019","reviewText":"It is well made. It has adjustable temperature control and lights up while heating. It also beeps when the chosen temperature is reached."},{"reviewerName":"kevin w.","rating":"5.0 out of 5 stars","reviewTitle":"easy use","reviewDate":"October 8, 2019","reviewText":"Easy use, just press the button for 100 degree. The water comes to a full boil around 7 minutes ，you don't need to watch the fire for the pan."},{"reviewerName":"Arti","rating":"5.0 out of 5 stars","reviewTitle":"love this kettle","reviewDate":"October 10, 2019","reviewText":"I love this kettle! All tea has a different seep temperature and this kettle will let you set your temperature. Plus heats up quickly"},{"reviewerName":"Kindle Customer","rating":"5.0 out of 5 stars","reviewTitle":"Highly Recommend!","reviewDate":"October 21, 2019","reviewText":"I love it!!! It looks pretty, heats up crazy fast and I like the beep it makes when it's done. The colors are so pretty."},{"reviewerName":"Parker Nielson","rating":"5.0 out of 5 stars","reviewTitle":"Fast and easy to use","reviewDate":"November 5, 2019","reviewText":"Fast and easy to use. I was extremely impressed with how quickly this works a boiling water. Super easy to clean as well"},{"reviewerName":"M.S.","rating":"5.0 out of 5 stars","reviewTitle":"Easy to use","reviewDate":"September 28, 2019","reviewText":"Very useful product. I can boil water in a few minutes. I can boil the amount I needed instead of using the water boiler where I use the hot water in for days."},{"reviewerName":"Vuy Vo","rating":"5.0 out of 5 stars","reviewTitle":"Great","reviewDate":"November 5, 2019","reviewText":" Very nice. Have different temperture button that we can choose. Look great also"},{"reviewerName":"Heyee","rating":"5.0 out of 5 stars","reviewTitle":"It boiled fast","reviewDate":"August 25, 2019","reviewText":"Good kettle as expected easy to boiled water and easy to clean . Best for teas and coffee special when your in a hurry."},{"reviewerName":"Mama bear","rating":"5.0 out of 5 stars","reviewTitle":"Compact design with temperature control","reviewDate":"November 8, 2019","reviewText":"This is good as the other one i had but what makes this one better is it has temperature control on the handle"},{"reviewerName":"Tushar","rating":"5.0 out of 5 stars","reviewTitle":"Very nice kettle with multiple temperature settings","reviewDate":"October 13, 2019","reviewText":"Very easy to use and clean. Comes with multiple temperature settings. Works perfectly and is good for the price."},{"reviewerName":"Justin","rating":"5.0 out of 5 stars","reviewTitle":"It is very good and easy to use.","reviewDate":"November 4, 2019","reviewText":"The quality is very good and it is easy to use and clean. used for several days, no issue/concern at all."},{"reviewerName":"WK","rating":"5.0 out of 5 stars","reviewTitle":"GOOD EXPERIENCE","reviewDate":"September 16, 2019","reviewText":"Good to save your time and have a quick tea time. Soon to boiling. Pot is keeping cold and safe even just boiling the water."},{"reviewerName":"iSiS","rating":"5.0 out of 5 stars","reviewTitle":"Nice Kettle","reviewDate":"August 1, 2019","reviewText":"Bought this for making milk bottle water, but instead we always end up using it for hot tea"},{"reviewerName":"Tommy Liu","rating":"5.0 out of 5 stars","reviewTitle":"Best kettle ever","reviewDate":"August 31, 2019","reviewText":"I have never thought that I can have this better kettle until my friend recommended it to me. It's easy to operate and you can set the different temperature to heat up the water in a short period. By the way, it's easy to clean as well. I'm so glad about having this in my kitchen. Highly recommend it."},{"reviewerName":"Jocelyn C.","rating":"5.0 out of 5 stars","reviewTitle":"Simple and fast!","reviewDate":"October 1, 2019","reviewText":"Very well made glass material! Heats up water very fast! Easy to use and control."},{"reviewerName":"Vivi","rating":"5.0 out of 5 stars","reviewTitle":"Fast","reviewDate":"August 19, 2019","reviewText":"After a few days of use, I think the product is good and the price is cheap! Beautiful appearance, fast heating speed"},{"reviewerName":"TB","rating":"5.0 out of 5 stars","reviewTitle":"Great product","reviewDate":"October 28, 2019","reviewText":"Easy to use. Water heats fast and keeps the water warm."},{"reviewerName":"Stephen Wang","rating":"5.0 out of 5 stars","reviewTitle":"Great kettle for the price","reviewDate":"September 11, 2019","reviewText":"Heats up very fast and easy to clean. Will definitely buy again or recommend to others."},{"reviewerName":"Sharon Faulkner","rating":"5.0 out of 5 stars","reviewTitle":"Great but one thing ....","reviewDate":"September 4, 2019","reviewText":"This is a great little Electric Kettle and I am thrilled with it but I do wish that the Temperature was in Farenheight instead of Celcius. But no deal breaker. Love it !!!"},{"reviewerName":"Anjali Baniya","rating":"5.0 out of 5 stars","reviewTitle":"Worth the money!!!","reviewDate":"November 12, 2019","reviewText":"I really liked this kettle as it’s so easy to use and it’s temperature control and color changing feature makes it unique in compare to other."},{"reviewerName":"Ankita","rating":"5.0 out of 5 stars","reviewTitle":"Cute kettle","reviewDate":"November 6, 2019","reviewText":"The kettle is nice and easy to use. It has five temperature settings 60, 70, 80,90 and 100 degrees. It has different light indicators for each temperature settings. Pretty easy to setup for first use. Just need to discard boiled water the first two times and it's ready for use."},{"reviewerName":"Ariel","rating":"5.0 out of 5 stars","reviewTitle":"Why didn't I buy this sooner!","reviewDate":"October 7, 2019","reviewText":"For the amount of tea and coffee we drink, I don't know why we didn't get one sooner. It's so convenient, quick, and easy to use. I love that there are different temperature settings and each setting has a different colored light so you know when it's changed."},{"reviewerName":"Jean","rating":"5.0 out of 5 stars","reviewTitle":"I love it.","reviewDate":"August 23, 2019","reviewText":"Love it. I got it over two weeks and I use it everyday. The different temperatures setting help me to prepare milk or tea. Very easy to clean."},{"reviewerName":"Nate","rating":"5.0 out of 5 stars","reviewTitle":"Works Great","reviewDate":"August 22, 2019","reviewText":"I’ve been using mine about two months. Works great and it’s easy to clean. I use vinegar about once a week to get rid of mineral buildup, but that’s the only real maintenance"},{"reviewerName":"Sharod Barnett","rating":"5.0 out of 5 stars","reviewTitle":"👍🏾👍🏾👍🏾","reviewDate":"August 20, 2019","reviewText":"Great product for a great price"},{"reviewerName":"Pamela Morgan","rating":"5.0 out of 5 stars","reviewTitle":"Electric Kettle, Glass Tea Kettle & Water Boiler Variable Temperature Control","reviewDate":"November 5, 2019","reviewText":"Perfect I use it in my room to make soup or tea it works out great."},{"reviewerName":"Amazon Customer","rating":"2.0 out of 5 stars","reviewTitle":"Broke *immediately*","reviewDate":"November 12, 2019","reviewText":"I don't usually write reviews, but I strongly recommend that you don't buy this. The lid broke instantly the second I got it out of the box and now the lid keeps falling into the pot. This is definitely not well made."},{"reviewerName":"Ronda Mitchell","rating":"5.0 out of 5 stars","reviewTitle":"Love the temperature control feature","reviewDate":"July 22, 2019","reviewText":"I use this to heat water for tea, instant cappuccino and coffee made with mellita filter. The temperature feature allows for the correct temp for these different uses."},{"reviewerName":"Michael Khasin","rating":"1.0 out of 5 stars","reviewTitle":"Stopped working properly in just one month","reviewDate":"August 11, 2019","reviewText":"After just one month of usage the kettle stopped working properly: it will stop heating the water randomly before bringing the water to boiling."},{"reviewerName":"Fangz","rating":"5.0 out of 5 stars","reviewTitle":"Easy to use,","reviewDate":"August 7, 2019","reviewText":"Even with my large hand I can easily clean the inside of this pot"},{"reviewerName":"CHANG YI LIN","rating":"5.0 out of 5 stars","reviewTitle":"Easy to use","reviewDate":"September 3, 2019","reviewText":"It's a modern style product, and I like the way it has three different temperature."},{"reviewerName":"apache","rating":"5.0 out of 5 stars","reviewTitle":"Good Kettle","reviewDate":"October 1, 2019","reviewText":"Very good kettle, you can even choose temperatures!"},{"reviewerName":"Ingrid Y Rodriguez","rating":"5.0 out of 5 stars","reviewTitle":"Very happy 😃 customer","reviewDate":"August 14, 2019","reviewText":"My daughter this beautiful kettle and it heats up very fast. Love it 🥰"},{"reviewerName":"allen","rating":"5.0 out of 5 stars","reviewTitle":"Heat faster","reviewDate":"July 25, 2019","reviewText":" Heat faster! And so pretty light. Good value for me, that’s enough."},{"reviewerName":"yan","rating":"5.0 out of 5 stars","reviewTitle":"Nice kettle","reviewDate":"October 3, 2019","reviewText":"Love how this kettle heats up water fast. Clear glass with lights make it look very cool. No complaints so far."},{"reviewerName":"tywanda shelton","rating":"5.0 out of 5 stars","reviewTitle":"Fabulous kettle","reviewDate":"July 20, 2019","reviewText":"I love the color"},{"reviewerName":"Gut","rating":"5.0 out of 5 stars","reviewTitle":"Love the glass.","reviewDate":"October 15, 2019","reviewText":"I absolutely love the glass!!! Boils fast."},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Love it!!","reviewDate":"October 14, 2019","reviewText":"Love it. Great quality and value for money."},{"reviewerName":"Jennifer W.","rating":"5.0 out of 5 stars","reviewTitle":"Great kettle","reviewDate":"July 31, 2019","reviewText":"It boils two mugs of water in about 2 mins. it's fast and quiet. It has a beep when it's finished boiling."},{"reviewerName":"Dzitkowski, D","rating":"5.0 out of 5 stars","reviewTitle":"Quickly boils water!","reviewDate":"August 26, 2019","reviewText":"Absolutely worth buying! Makes making Instant coffee or tea really easy."},{"reviewerName":"Chris O'Connell","rating":"5.0 out of 5 stars","reviewTitle":"Very well made kettle!!","reviewDate":"September 9, 2019","reviewText":"Love our new Kettle. Very durable and has heat setting options and you can keep it warm for 30 minutes."},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"great product!","reviewDate":"June 26, 2019","reviewText":"very convenient, good usability, five star!"},{"reviewerName":"Jennifer Cheung","rating":"5.0 out of 5 stars","reviewTitle":"Great electric kettle","reviewDate":"July 29, 2019","reviewText":"Loved it!"},{"reviewerName":"Vanessa Stewart","rating":"5.0 out of 5 stars","reviewTitle":"Great Kettle","reviewDate":"September 29, 2019","reviewText":"Love this kettle, easy to use and looks good too"},{"reviewerName":"Sparsh J Varsani","rating":"5.0 out of 5 stars","reviewTitle":"Big enough for whole family and heats up quickly","reviewDate":"July 3, 2019","reviewText":"I bought this one for it’s a large capacity of 1.7ltrs. I was using one kettle for quite a long time, so I was surprised how quickly this heats up the water. At min capacity 0.5L it warms up the water in 5 sec. and I am not exaggerating. At max. the capacity it water boils in 5-6 mins. Just take care of the instructions mentioned for first use and you are all set. Multiple water temperature settings make it quite handy and each temperature setting has a different color. Another good feature is it keeps water hot at a chosen setting for 2 hours if kettle kept on with a switch. I liked this product and will recommend it as well."},{"reviewerName":"Kiki&Pati","rating":"1.0 out of 5 stars","reviewTitle":"Completely useless and cheap.","reviewDate":"August 2, 2019","reviewText":"First of all I didn't receive the amazonbasics brand as advertised! I clearly remember it was sold as such product. I received something called mosche and now on the website the brandname changed again and it's fitmaker or voocoo- I'm not even sure about that. But that's not the main problem.\nRemind me again please, why I should use an electric kettle if it's taking longer than stove top? Lireally, I compared side to side because I was curious after using it a couple times, wondering iif it was just me.\nAlso, it's cheap and flimsy. At first I liked that it was lighter in weight, compared to my previous electric kettle but the reason is the glass being thinner. It won't last any small accidents. Also what's the point of having all those 60°, 70° etc buttons when they are useless. You would imagine they are good to keep water at a certain degree, or at least warm, right? Wrong.\nIt also wobbles and splashes water while boiling and it takes forever for it to autostop.\n\nDon't bother, don't buy. Waste of money, waste of time."},{"reviewerName":"Ghazal Wafa","rating":"5.0 out of 5 stars","reviewTitle":"Recommend it","reviewDate":"June 19, 2019","reviewText":"I had stainless steel of this kind of kettle but didn't work well. This one is very nice and bring the water to boil in like seconds."},{"reviewerName":"A. Starovoytov","rating":"4.0 out of 5 stars","reviewTitle":"Base could have been more stable","reviewDate":"August 3, 2019","reviewText":"It works fine, and there is no plastic/rubbery smell in the water as with some other similar items.\nI am not giving all 5 stars for the following two reasons:\n1) mesh filter is a joke. It does not really match the shape of the opening, thus most of the water flows around the filter when pouring, I know this element is not really needed, but then why have it at all?\n2) the base is a bit narrower than the top, and is very light. When picking the kettle up the base does not stay down being moved due to rigidity of the cable, this is very uncomfortable, you almost have to shake the kettle to loose the base, and then when you put the kettle down onto the base, you don't feel much confidence in the resting position, the kettle sits kind of wobbly because the base is so narrow, it does not actually tip over, but you get a feeling it might."},{"reviewerName":"Julie","rating":"5.0 out of 5 stars","reviewTitle":"An electric kettle being extra","reviewDate":"October 15, 2019","reviewText":"I think we've all seen the water kettles out there that are stainless steal or plastic. This adds a little flare to your life with the LED lights. Always a good talking point when people come over. The kettle is made of glass and although durable, just be more careful to not nick it with anything. It does really boil fast and i love the degree settings. Other kettles just have one setting. Cleaning should be easy since this is only meant to boil water. Use a long handled brush to scrub the bottom. Heat does transfer through glass easily so keep that in mind and use the water quickly after it's boiled. I like this one cause it's that extra in life that we need in our products."},{"reviewerName":"Lisa May","rating":"5.0 out of 5 stars","reviewTitle":"Great product for a great price!","reviewDate":"October 3, 2019","reviewText":"I bought this one for it’s a large capacity of 1.7ltrs. since I was going to use it at work. I was using one kettle for quite a long time, so I was surprised how quickly this heats up the water. At min capacity 0.5L it warms up the water in 5 sec. - so fast!. At max. the capacity it water boils in 5-6 mins. Just take care of the instructions mentioned for first use and you are all set. Multiple water temperature settings make it quite handy and each temperature setting has a different color. Another good feature is it keeps water hot at a chosen setting for 2 hours if kettle kept on with a switch. I liked this product and will recommend it as well."},{"reviewerName":"🌘 Ｊ丹匚Ｑ 🌒","rating":"5.0 out of 5 stars","reviewTitle":"Simple to use and nice","reviewDate":"July 1, 2019","reviewText":"I love this electric kettle. I have been using it every day since I got it to make tea. It has four temperature settings (60, 70, 80, 90, 100) and each setting has a different led color that lights up around the base of the kettle while it is heating up the water. It's great that it has different temperature settings to make different kinds of teas. I just fill it to the max line and pick a temperature and that is it. It heats the water pretty quickly and beeps once it is complete. I also love that it is glass it makes it very easy to clean. I always rinse it and dry the inside with a towel after using it."},{"reviewerName":"Aprilsf","rating":"5.0 out of 5 stars","reviewTitle":"Great kettle for a tea fan","reviewDate":"August 31, 2019","reviewText":"I need a kettle that can keep water at certain temperature after boiling because I love to drink tea. My old kettle takes a while to boil water and doesn’t have the option to keep it warm. This kettle is prefect for what I need and also within my budget. It’s max capacity is 1.7 L, which is enough for me for a day. And it has the filter at the spout, which means that I can directly put tea leaves in the kettle and not to worry about have tea leaves in my tea cup. It heats up pretty quickly too. It’s a great purchase."},{"reviewerName":"Chanh Tran","rating":"5.0 out of 5 stars","reviewTitle":"my fav so far","reviewDate":"August 20, 2019","reviewText":"I bought this when my previous electric kettle died. I was looking for a stainless steel one, but this one looked cool, so I decided to try it. I thought this kettle would be heavier than a plastic kettle because it was glass, but surprisingly it wasn’t that much heavier. The cord is about 36 inches long. I wish it was a bit longer, but it’s not really a problem. Any longer it could be messy. There really isn’t anything special about all electric kettles. They boil water, and this one does the job."},{"reviewerName":"Benjamin Mois","rating":"5.0 out of 5 stars","reviewTitle":"Faster than the stovetop kettle!!! 😁👍🏻","reviewDate":"November 7, 2019","reviewText":" Wow, this kettle not only looks good, but also performs BETTER than the kettle we have on out electric stovetop!!! I honestly was very surprised by this and since we figured that out, this has been our go-to pot since! In the few days we have had it, we have filled it up at least 2 times a day, lol, once in the morning for morning tea and once at night for night time \"sleep\" tea, lol. The \"keep hot\" feature is AWESOME and we use it Every morning. The instructions are very simple, cleaning is Easy and the LED lighting makes this look very nice in the kitchen. We are Very happy with this LED Kettle and would recommend it to anyone who is looking for one! 😁👍🏻"},{"reviewerName":"babak ebadi","rating":"5.0 out of 5 stars","reviewTitle":"I just love it! so many ways to control!","reviewDate":"November 8, 2019","reviewText":"Do you know that the bag of the tea bag is made of the materials that can be turned cancerous if you put them in 100 degrees boiling water? so the solution is having a kettle that gives you control of how hot you really need your water. Every day I boil my water perfectly on 100 degrees, then I keep it in my kettle, whenever I want to use a tea bag, I just warm the water to 80 or 70 degrees, it is hot enough for infusion, but not too hot to trigger the chemical in the tea bag. I also love the different LED colors indicating different temperature. I think this is the best kettle I have ever had. Thank you!"},{"reviewerName":"Leila","rating":"5.0 out of 5 stars","reviewTitle":"Quality product.","reviewDate":"August 1, 2019","reviewText":"The kettle looks very nice.lt is easy to clean. Press-a-button easy to use. It heats water rapidly , turns off after it attains a boiling temperature.I love the led lights.You need to clean your water boilers with water and vinegar to clean out the mineral deposit at the bottom.It looks good on our kitchen counter. I am very pleased with this product. Highly recommend this product."},{"reviewerName":"Ozdemirfurkan01","rating":"5.0 out of 5 stars","reviewTitle":"This is exactly what I was looking for.","reviewDate":"October 27, 2019","reviewText":" I am very pleased with this kettle. It heats the water surprisingly fast. Unlike most kettles, you can vary the temperature. So you can choose different kind of temperatures depend on the kind of drink (tea, coffee etc). This is really cool!\nThe lights (different colors stands for different temperature) make it more attractive. The kettle is big and made of glass, so you can see how the water boils. It’s very simple to use and a must have for people who do not have much time in the mornings. Nobody will regret it!"},{"reviewerName":"Michelle","rating":"5.0 out of 5 stars","reviewTitle":"Perfect temperature every time","reviewDate":"October 14, 2019","reviewText":" This is a great tea kettle that gives you the ability to set your desired temperature. Certain teas do better at certain degrees and this tea kettle makes it easy to achieve the desired temperatures. Even has specific colors for each set temperature. Also has the ability to stay on a heated mode for 2hrs after it boils. Top temperature does produce intense boiling and a slight rocking motion so definitely keep it far in the counter and away from the reach of children."},{"reviewerName":"TanyaNik","rating":"5.0 out of 5 stars","reviewTitle":"Very cool teapot!","reviewDate":"October 28, 2019","reviewText":" I like this teapot a lot, not only because it looks cool but it also has good capacity and temperature can be adjusted. There is a red light that turns on when the water is warming up and it makes the pot glow, as a very nice effect. It also beeps when you put it back on its base to let you know that you put it on correctly. The temperature can be set to 70-100 degrees Celsius.\nThis teapot would make a great housewarming gift or just to own."},{"reviewerName":"Mary S. Anello","rating":"5.0 out of 5 stars","reviewTitle":"Beautiful Kettle","reviewDate":"November 10, 2019","reviewText":" This electric kettle is very nice in design and operation. The LED lighting is very nice, the different temperature settings is such a good feature for the different uses I have for the boiled water such as tea or French press coffee. The base is good, the display is easy to read and use, and the water boils fast and efficiently. Very happy with my purchase! May purchase again for gifts!"},{"reviewerName":"VD","rating":"5.0 out of 5 stars","reviewTitle":"Fast warm/hot water","reviewDate":"November 11, 2019","reviewText":"This item I purchase on the suggestions of my friend. He always brings lukewarm water to drink at the office. One day I tried it and I like the soothing effect in the throat. I tried doing water warm on stove and I hated it. So one day I ordered this and I am glad I did. This is one switch and your water is warm or hot in no time. This kettle is very fast to make the water warm or hot at your desired temperature. I am very happy with the product. Now no hassle of use stove or a pot to make your lukewarm water."},{"reviewerName":"Jolie nguyen","rating":"5.0 out of 5 stars","reviewTitle":"Highly recommended","reviewDate":"June 24, 2019","reviewText":"Very fast boiling!\nLed light make it kool!\n1.7 lits water!\nGood for colleges student or office use"},{"reviewerName":"Stephen","rating":"5.0 out of 5 stars","reviewTitle":"Adjustable temperatures are a game changer!","reviewDate":"November 4, 2019","reviewText":"My old electric kettle died recently after years of heavy use and abuse. It was a simple turn on and boil water system. This one that I purchased as a replacement has settings for different temperatures and it has changed my life! I can set my water to the perfect temperature for tea and never have to let it cool before drinking. I had no idea I could get a feature like that in this price range! Highly recommended."},{"reviewerName":"Becky Tuvshin","rating":"5.0 out of 5 stars","reviewTitle":"Glad to have new smart water boiler","reviewDate":"August 21, 2019","reviewText":" When i unpacked the box and saw the glasses first time, i feel it's pretty thick. I was so impressed that it's able to keep the water warmer in 4 different temperatures and it's showing 4 various colors. You can fold the cord under the base which makes tidy look :), Mostly i liked the wide mouth and it's allow me to clean it easily :) Good choice for the household"},{"reviewerName":"YlefD","rating":"5.0 out of 5 stars","reviewTitle":"Easy Use","reviewDate":"October 2, 2019","reviewText":"This kettle is so easy to use. It also boils so fast. I like the 4 settings of degrees that has it's own designated color. It looks so amazing to watch the water boils in clear glass kettle with lights on."},{"reviewerName":"Musixz","rating":"5.0 out of 5 stars","reviewTitle":"A Fast and Pretty Kettle","reviewDate":"September 13, 2019","reviewText":"Heats the water quickly and looks nice while doing it. Replaced a stainless kettle with this one and I like it so much better.\n\nThe LED lighting is a nice touch that adds to the whole clear glass/water thing. I also like having the controls on the handle.\n\nThe \"mouth\" opens nice and wide for cleaning and is probably 2-3x the size of my old one."},{"reviewerName":"random guy","rating":"5.0 out of 5 stars","reviewTitle":"OMG, screw stove top whistle kettles","reviewDate":"November 6, 2019","reviewText":"this thing is amazeballs. we had one of those stove top whistle one and this one is sooooo much better. 1st, it's faster, it boils water faster than I can finish my shower. It has 5 different temp settings and once it hits the desire temperature, it turns off automatically. no more waiting for the whistle and having to rush to turn off the stove."},{"reviewerName":"Katherine L. Drago","rating":"5.0 out of 5 stars","reviewTitle":"So easy to use !","reviewDate":"November 7, 2019","reviewText":"This kettle is amazing. I hate having to turn the stove on just to boil water for tea or ramen noodles, cocoa. This kettle was so easy to use plug it in and push the on button. It’s great and so fast then it beeps when it’s done. The kettle itself is very nice thick glass and the lid is very nicely made and easy to open and close."},{"reviewerName":"Jason T","rating":"5.0 out of 5 stars","reviewTitle":"Good looking kettle with temperature settings","reviewDate":"November 10, 2019","reviewText":"I like that this kettle as it has several temperature settings and not just boil. This way if I want to drink tea immediately without waiting for the tea to cool down I can drink right away without burning myself. I like that it has several different colored lights that shoe depending on what temperature you choose."},{"reviewerName":"Helene M. Feldman","rating":"5.0 out of 5 stars","reviewTitle":"Electric kettle","reviewDate":"November 7, 2019","reviewText":" It is indeed very easy to use and it took about 3/4 minutes for the water to warm up. I actually played with all the settings, and I was impressed with the bubbles. My only concerned is the pot gets hot on the outside, so make sure you keep it away from young children."},{"reviewerName":"Mimi","rating":"5.0 out of 5 stars","reviewTitle":"Very Easy to use","reviewDate":"August 27, 2019","reviewText":"I bought this electric kettle for my husband. Before I this kettle show up in my kitchen, he was using my pot and boil water on my stove every morning to make his coffee. Here is his review\" This is great! Just seat the glass kettle in the base and very quickly it's boiling. Different color LEDs for the temp levels..great value!\""},{"reviewerName":"Lubna","rating":"5.0 out of 5 stars","reviewTitle":"Very nice 👌","reviewDate":"August 20, 2019","reviewText":"I really liked this water boiler. It changes colors for different water temperaturs. We loved that we could set the kettle to different tempratures not just boiling. The lid is PBA free plastic.\nI feel like this kettle is going to help me save some electricity as it boils the water very fast...way faster than using the stove."},{"reviewerName":"Jay","rating":"5.0 out of 5 stars","reviewTitle":"Simple equipment.","reviewDate":"September 28, 2019","reviewText":"I wanted to get a water boiler that had several temperature options and this one turned out the be perfect. The color changes are a bonus. It holds 1.7 L which is more than enough. The only caution though is that the surface of the glass gets really hot. Other than that, it’s perfect. Simple and does its job."},{"reviewerName":"Stefan","rating":"5.0 out of 5 stars","reviewTitle":"Great gift","reviewDate":"October 17, 2019","reviewText":"Got this for my mom as a gift and she loves it. She is a tea drinker and she use to boil water daily. This makes it so much easier for her. It boils the water extremely fast and looks great doing it. Definitely a nice thing to have. Larga capacity and nice led light for the different warming settings"},{"reviewerName":"Boo","rating":"5.0 out of 5 stars","reviewTitle":"Looks very cool!","reviewDate":"September 9, 2019","reviewText":"I've been using this kettle for over two weeks now. It doesn't have any odor when I first open it, and the glass feels very sturdy and durable. Wide opening makes it very easy to clean, and it hasn't build up any water scum on the inside. It looks super cool when boiling as the blue light glows in the water."},{"reviewerName":"Mani","rating":"5.0 out of 5 stars","reviewTitle":"Nice elegant electric kettle.","reviewDate":"November 8, 2019","reviewText":" Love the Pyrex glass kettle. Very elegant with different color LEDs at the bottom for different temperature setting. Looks cool in my tea/coffee corner. I use it for 100 degrees boiling water, but has buttons for lower temperatures as well."},{"reviewerName":"JIMKO","rating":"5.0 out of 5 stars","reviewTitle":"I love the temperature pre-setting interface....","reviewDate":"August 17, 2019","reviewText":"I bought this to take over my metal one. I prefer a transparent outlook so you know when to clean it up. Especially this comes with temperature pre-setting and different light color, this is really helpful for me to make my green tea at 80 degree C. I will recommend this for tea lover....."},{"reviewerName":"knguyen49","rating":"5.0 out of 5 stars","reviewTitle":"Large volume kettle operated by electricity","reviewDate":"November 8, 2019","reviewText":"Does not get hot on the outside. Great price for a big volume kettle. Heated to boiling temperature in less than 5 min for a full kettle. Can adjusted for light which makes the kettle presentable in kitchen or office. Make a great gift for tea or hot chocolate lover."},{"reviewerName":"Becky","rating":"5.0 out of 5 stars","reviewTitle":"Highly recommend it!","reviewDate":"October 15, 2019","reviewText":"This electric kettle is so cool! It’s fast and no need to watch the gas stove anymore! The kettle shape and the blue light made boiling water more pleasant! Compare to using gas, this is fast and I can do it anywhere besides in the kitchen only! Highly recommend it!!"},{"reviewerName":"STEPHENRH","rating":"5.0 out of 5 stars","reviewTitle":"Super efficient, and super slick.","reviewDate":"November 2, 2019","reviewText":" This is the prettiest kettle I’ve ever seen. It’s also very intuitive to use, easy to clean and efficient. It warms water super fast (to 60, 70, 80, 90, or 100 degrees). Each degree level displays a different color."},{"reviewerName":"rebekah","rating":"5.0 out of 5 stars","reviewTitle":"Beautiful kettle","reviewDate":"August 26, 2019","reviewText":"I used for one week and it is good. When it boils water, it has red light. It has filter on the top. It also has one year's warranty."},{"reviewerName":"JP","rating":"5.0 out of 5 stars","reviewTitle":"Easy clean up","reviewDate":"November 10, 2019","reviewText":"Nice glass electric kettle. I have this to replace my stainless steel one. I can easily see the water level through the glass, the wide open top, the colors coded temperature mode lets you know the kettle is at work and the water temperature will be"},{"reviewerName":"Patrisha F.","rating":"5.0 out of 5 stars","reviewTitle":"Quick to boil","reviewDate":"October 22, 2019","reviewText":"So far so good. I like having a separate temperature setting however I always just use the highest. I am not sure why I would need lower settings but it's nice to have those options. The only Con I have is the length, it would have been a little more convenient for me if the cord was longer."},{"reviewerName":"Maggie","rating":"5.0 out of 5 stars","reviewTitle":"BEAUTIFUL!!","reviewDate":"October 7, 2019","reviewText":" What a beautiful electric kettle.. works like a charm and worry-less! Go take a shower while the hot boil on then it will turn it off automatic. Save my time. I love the colorful light, so pretty! Love it!"},{"reviewerName":"E. King","rating":"5.0 out of 5 stars","reviewTitle":"Very impressed","reviewDate":"November 10, 2019","reviewText":"Really loved this electric kettle. Loved that it is made of glass so you can see the inside- very helpful since I brew tea directly on the kettle. Also loved the different led colors indicating the temperature! And it is so easy to clean!"},{"reviewerName":"snowlady","rating":"5.0 out of 5 stars","reviewTitle":"Eye catching design","reviewDate":"October 8, 2019","reviewText":"I really like the larger 1.7 Liter capacity. My previous one is too small. I also like the see-through glass body with the LED lights. It's very eye-catching. I used it a lot when I have party. My guests also gave compliments a lot."},{"reviewerName":"Anupam Mishra","rating":"5.0 out of 5 stars","reviewTitle":"Good quality material for a kettle.","reviewDate":"October 14, 2019","reviewText":"It's of good quality. The water heats up fast and it has different temperature option and different color for each temperature which helps. Choose the temp you like and it's easy to handle. Doesn't really look fancy, pretty simple."},{"reviewerName":"Sc: russiandan2","rating":"5.0 out of 5 stars","reviewTitle":"Heats water fast, quiet and good looking.","reviewDate":"October 30, 2019","reviewText":"Bought this because I love drinking tea. I am very happy with it. It heats up the water fast, it’s quiet and good looking. It is very easy to use! Turns off when it’s done boiling and holds enough water for everyone to get a cup"},{"reviewerName":"K","rating":"5.0 out of 5 stars","reviewTitle":"Elegant design","reviewDate":"November 4, 2019","reviewText":"Bought this for my office, so far it works very well. I really like the option to heat water to 5 different temperatures, comes in handy for delicate teas. Digital keys, LED lights, and elegant - easy to use."},{"reviewerName":"Chris","rating":"5.0 out of 5 stars","reviewTitle":"Very convenient","reviewDate":"July 17, 2019","reviewText":"This electric kettle is awesome. It heats .5 liters of water in about 3 minutes. If you want to bring the full 1.7 littles to a boil it takes about 8 minutes. This kettle is very straight forward to use and I highly recommend it."},{"reviewerName":"Areeba Karim","rating":"5.0 out of 5 stars","reviewTitle":"Necessity for every kitchen","reviewDate":"October 19, 2019","reviewText":" Easy to use!"},{"reviewerName":"Edz","rating":"5.0 out of 5 stars","reviewTitle":"Works Awesome!","reviewDate":"November 6, 2019","reviewText":" This is a perfect electric kettle. They got designated color for the temperature you desire. Boils so quick. It’s really really nice. Item as described!"},{"reviewerName":"Ahana Malhotra","rating":"5.0 out of 5 stars","reviewTitle":"Useful electric kettle","reviewDate":"November 11, 2019","reviewText":"This electric kettle makes your kitchen look more good. It boils the water very fast and has temperature control which is very convenient especially if you have kids at home. Loved this electric kettle."},{"reviewerName":"LongIslander-inTX","rating":"5.0 out of 5 stars","reviewTitle":"Works great! - recommend","reviewDate":"July 26, 2019","reviewText":"We have been using this product for about a month and it works great. We use it daily, sometimes 2x or 3x a day. No negatives at this point in time. Great price for the value received. Note: I did not rate the temp control because we only boil water and do not reduce the temperature - keep it set on 100 degrees C."},{"reviewerName":"bbates","rating":"3.0 out of 5 stars","reviewTitle":"Cheap base.","reviewDate":"October 25, 2019","reviewText":"I did not keep the product because the base felt so flimsy/cheaply made. The cord is very thick and would flip the light base over if the kettle was not resting on it. Otherwise it worked fine when tested- can't say how it holds up long term."},{"reviewerName":"Lian Qiu","rating":"5.0 out of 5 stars","reviewTitle":"Nice","reviewDate":"August 31, 2019","reviewText":"I bought this one for it’s a unique and stylish aesthetic that's beautiful, illuminated by blue LED lights. I was using the kettle for two weeks, it was very quick to heat up the water. very good."},{"reviewerName":"abu salim","rating":"5.0 out of 5 stars","reviewTitle":"Good Tea Kettle","reviewDate":"November 5, 2019","reviewText":"Heats water very quickly. I used it all the time to make hot tea.\nMy wife use it to heat water for cooking.\nEasy to use and clean.\nGood temperature control"},{"reviewerName":"Upendra","rating":"5.0 out of 5 stars","reviewTitle":"Beautiful kettle","reviewDate":"November 11, 2019","reviewText":"Looks cute with bottom led lighting.\nWorks well with temperatures control.\n1.7lt capacity and with an inbuilt filter.\nEasy to clean and very transperant."},{"reviewerName":"Cynthi liyunam","rating":"5.0 out of 5 stars","reviewTitle":"Very nifty","reviewDate":"November 9, 2019","reviewText":"I recently became and advent tea drinker and this is definitely a much more effective method than a glass at a time in the microwave! I love this thing!"},{"reviewerName":"Naimul Haque","rating":"5.0 out of 5 stars","reviewTitle":"Very handy and easy to use","reviewDate":"September 25, 2019","reviewText":"To make morning tea or coffee, it is very useful. I like it very much. It has several temperature options so we can control from 60- 100 degrees c. I also use it to boil water to purify."},{"reviewerName":"Aakanksha PATEL","rating":"5.0 out of 5 stars","reviewTitle":"Beautiful and Useful Electric kettle","reviewDate":"July 13, 2019","reviewText":"I never had electric kettle at my home. So thought to try out first time. It’s very easy to use. It’s boiling water very fast. I like it’s looks. Also it’s very easy to clean."},{"reviewerName":"Beau","rating":"5.0 out of 5 stars","reviewTitle":"Great product","reviewDate":"August 31, 2019","reviewText":"Very good kettle. It boils the water so fast and save me a lot of time in the morning. And it’s very clean and elegant design. Great kettle for such a great price"},{"reviewerName":"Annie","rating":"5.0 out of 5 stars","reviewTitle":"Worth every penny!","reviewDate":"August 19, 2019","reviewText":"This electric kettle boils quickly and saves me time when I have to leave in a hurry almost every morning. It's easy to clean and seems durable and stain resistant so far. It also automatically turns off when water boils so I never have to worry about whether I left the house with the stove on or not. The kettle also keeps the water warm after it turns off."},{"reviewerName":"toby powers","rating":"5.0 out of 5 stars","reviewTitle":"sharp electric kettle","reviewDate":"October 29, 2019","reviewText":"Very high quality electric kettle. When it heats up, it turns read on the bottom. Nice design and will be a helpful addition to our airbnb."},{"reviewerName":"Mia Hart","rating":"5.0 out of 5 stars","reviewTitle":"Great price for the value","reviewDate":"August 1, 2019","reviewText":"This kettle is great , it heats up the water very fast and it has these pretty colors when it’ on. We are a tea drinking family and we couldn’t live without it !"},{"reviewerName":"ndslvk","rating":"5.0 out of 5 stars","reviewTitle":"Great kettle.","reviewDate":"November 7, 2019","reviewText":"The kettle is perfect for making hot water for our coffee or tea and it looks great sitting on the counter in the kitchen. Thank you!"},{"reviewerName":"ng wai keung","rating":"5.0 out of 5 stars","reviewTitle":"The most important thing about this item is that it can carry 1.7 liters","reviewDate":"September 27, 2019","reviewText":"What I like about this product is that it is clear so you can see it boil. It also boils the water fast and is very cool to look at."},{"reviewerName":"Prakash","rating":"5.0 out of 5 stars","reviewTitle":"Job well done","reviewDate":"November 2, 2019","reviewText":"Does what it says, gets you boiling water within minutes... Temperature control works fine, wish it would had a keep warm option."},{"reviewerName":"Ella","rating":"5.0 out of 5 stars","reviewTitle":"Cute kettle for my bedroom","reviewDate":"August 14, 2019","reviewText":"Cute kettle, I got it for my bedroom to make tea before sleeping and not go in the kitchen. Like the light of it and size and shape."},{"reviewerName":"Hn","rating":"5.0 out of 5 stars","reviewTitle":"Great Electric Kettle","reviewDate":"August 9, 2019","reviewText":" Very clean kettle. Water warm very quick. Easy to use and clean. Happy with my buy. Thanks"},{"reviewerName":"Shanon","rating":"5.0 out of 5 stars","reviewTitle":"Light weight and easy to use.","reviewDate":"June 25, 2019","reviewText":"It boils water very quick. Kettle is easy to clean from inside out. The handle is very ergonomic design. I can take it to travel to anywhere."},{"reviewerName":"RnB","rating":"5.0 out of 5 stars","reviewTitle":"Great kettle!","reviewDate":"November 6, 2019","reviewText":"This glass kettle is amazing. Really simple to install and use right away. High quality product!"},{"reviewerName":"Maryland","rating":"5.0 out of 5 stars","reviewTitle":"Water boils too fast!","reviewDate":"August 10, 2019","reviewText":"I had one kettle already but i Like this one more as it looks more sturdy and water boils too fast !"},{"reviewerName":"david","rating":"5.0 out of 5 stars","reviewTitle":"Very easy to use and clean.","reviewDate":"August 31, 2019","reviewText":"Very easy to use. Different selections of temperature to choose. As expected good quality."},{"reviewerName":"B. Donarski","rating":"5.0 out of 5 stars","reviewTitle":"Love this electric kettle!","reviewDate":"November 12, 2019","reviewText":"Impressive! Boils water in under 10 min. Love the glass carafe! Easy to use buttons."},{"reviewerName":"mohsen sharifi","rating":"5.0 out of 5 stars","reviewTitle":"So powerful!","reviewDate":"August 1, 2019","reviewText":"Reasonably priced and attractive glass body. The blue LED colors the water while boiling."},{"reviewerName":"anna","rating":"5.0 out of 5 stars","reviewTitle":"Awesome kettle","reviewDate":"September 28, 2019","reviewText":"Easy to use, easy to clean and heats up quickly. Great temperature options"},{"reviewerName":"Jordan","rating":"5.0 out of 5 stars","reviewTitle":"Works great","reviewDate":"November 10, 2019","reviewText":"Quick and easy. Using to mix with baby formula powder and works great"},{"reviewerName":"Willie chang","rating":"5.0 out of 5 stars","reviewTitle":"Fast and Easy to use","reviewDate":"September 2, 2019","reviewText":"Getting the water boil in a short time, really good quality. Nice to have one in the kithen."},{"reviewerName":"LHO99","rating":"5.0 out of 5 stars","reviewTitle":"Good product","reviewDate":"September 27, 2019","reviewText":"Easy to clean and fancy looking kettle"},{"reviewerName":"Pamela","rating":"5.0 out of 5 stars","reviewTitle":"I love it","reviewDate":"November 5, 2019","reviewText":"It boils so fast!!!"},{"reviewerName":"Phú Võ","rating":"5.0 out of 5 stars","reviewTitle":"💫💫💫💫💫","reviewDate":"October 13, 2019","reviewText":"Verry good"},{"reviewerName":"InsaFam","rating":"5.0 out of 5 stars","reviewTitle":"Beautifull","reviewDate":"November 4, 2019","reviewText":"Works perfect and look beautifull"},{"reviewerName":"Big Hands","rating":"4.0 out of 5 stars","reviewTitle":"pretty weell made","reviewDate":"June 21, 2019","reviewText":"Used for coffee and tea water. Worked as expected."},{"reviewerName":"IndigoChild","rating":"4.0 out of 5 stars","reviewTitle":"Takes a while for water to boil","reviewDate":"November 13, 2019","reviewText":"I make a French Press worth of coffee every morning, so I boil about 1 L of water. It takes about 5-6 minutes for the water to boil at the 90 C level. It's definitely slower than my last electric kettle. Other than that complaint, it works well and is very easy to clean."},{"reviewerName":"Chandra","rating":"5.0 out of 5 stars","reviewTitle":"Color difference for varying temperature","reviewDate":"November 13, 2019","reviewText":"Kettle is working nice. I liked the feature of temperature control and color differences for it. Also it is transparent which we can see and stop at any time we want. Easy to use and clean also. Auto turn off if you are not using."},{"reviewerName":"Darshita Nidhi","rating":"5.0 out of 5 stars","reviewTitle":"Perfect for cold weather","reviewDate":"November 13, 2019","reviewText":"Entire family started coughing in cold weather and this kettle always have ready to drink warm water. Loving it."}],"qAndA":[{"question":"Is there any plastic on the inside of the kettle, for example the inside of the lid?","answer":"The entire lid is BPA free plastic."},{"question":"What's the wattage of this kettle? I saw both 1100 and 1500 from the descriptions, and don't know which is true.","answer":"The base says 900-1100w. It has 5 different settings for different heat levels. I always use the highest (100c) because it is just the easiers instead of having to guess."},{"question":"Amazon, i need reviews for this electric kettle not for a stainless pot???","answer":"I would like to help you out with the question, but I have never purchased this item.\nSo sorry. I hope you find out what you want to know."},{"question":"Is the kettle very hot to the touch with boiling water inside?","answer":"The kettle itself is but the handle is not. Just make sure you touch the handle not the glass part."},{"question":"Does this work with 220 volt electricity?","answer":"No"},{"question":"Can I turn off the beep?","answer":"You know what? I am wondering that too. I hope someone could answer us."},{"question":"Does the air pocket space between the glass and the plastic get fogged up when it is hot? Thank you in advance.","answer":"I have not seen any fog, I truly love it."},{"question":"Why are people saying this pot should fit in a pressure cooker??","answer":"Because Amazon has the wrong comments on the wrong item 🤦"},{"question":"The description says this is 1100 watts, pictures say 1500 watts. Which is it?","answer":"It is 1100W and it is VERY slow, takes the water a long time to boil."},{"question":"Why are people saying this pot should fit in a pressure cooker??","answer":"MMM I doubt it can cook any stew, but if I ever get the inspiration to throw some meat and potatoes in there, I'll let you know."},{"question":"where is it made?","answer":"It is made in China. However, it is a sturdy product. Heats very quickly and I use it almost every day and have had no issues with it. I would recommend."},{"question":"What is the point of the blue light indicator? Just for looks and does it last as long as the pot? Thanks.","answer":"I have no idea what this product is. I don't own one."},{"question":"Is the bottom of the interior of the tea kettle glass or stainless steel? In other words is it only glass that is touching the water? Thank you","answer":"The bottom is stainless steel."},{"question":"Why are all the reviews for a pressure cooker and not the electric kettle that is advertised? Seems really shady...","answer":"I don't really understand what you are referring to but I have the electric kettle and have absolutely no complaints about its performance nor durability."},{"question":"Is it possible to disable the beeps? I’ll have to return this if it can’t be silent. So annoying!","answer":"Really?, a tiny beep should not warrant a return. It tells you when it's ready"},{"question":"Where is this kettle made? Does any plastic touch the water?","answer":"Made in China. No the plastic doesn’t touch the water"},{"question":"I'm so confused! I want to buy the kettle, but all the reviews are for the pressure cooker. Is there anyone that bought the kettle?","answer":"I bought the kettle and love it. I’ve had it for a few months and it still works great. Heats quickly and has different temperature settings."},{"question":"Does the kettle have an auto turn-off feature?","answer":"Yes and it beeps."},{"question":"Is this supposed to blink red while it is in the 2 hour reheat mode?","answer":"It doesn't say so in the booklet."},{"question":"Does this work with 220 volt electricity?","answer":"110-120v is what is stated on the base."}]}