{"title":"HadinEEon Electric Kettle 1.7L Glass Electric Tea Kettle (BPA Free) Cordless with LED Indicator Lights, Water Boiler with Boil-Dry Protection, Stainless Steel Inner Lid & Bottom","manufacturer":"HadinEEon","currentPrice":false,"rating":"4.9 out of 5 stars","totalRatings":"388 ratings","features":["\n         Make sure this fits\n                by entering your model number.\n        \n","【Food Grade Material】 The electric kettle is made with glass while the inner lid and base are made of food-grade 304 stainless steel. All the water contact surfaces are constructed of FDA approved & food grade material and heat-resistant.","【Heat up quickly and quietly】 It will be a big help in quickly boiling or heating water for cooking such as pasta or polenta. Especially in the morning, it heats so fast and enables you to make hot cereals very quickly as well as hot chocolate, etc. which saves you from being late on most days. Only takes 6 minutes to boil 1. 5L water. No more long time waiting.","【Shuts off automatically with boil-dry Protection】The cordless glass electric kettle provides peace of mind through thoughtful details like an auto shut-off safety feature to provide thermal shock protection. 360-Degree swivel base lets you remove the Illuminating cordless kettle for easy pouring and then it can be replaced at any angle.","【High-quality, scratch-resistant borosilicate glass design】Beautifully crafted from heat resistant glass with the blue light around the rim, it’s both stylish and functional. It provides a visual delight while boiling water as it heats up. Featuring aesthetics as well as durability and ease of use, it’s the perfect addition to your kitchen. Furthermore, it gives you a good view to see inside so that you can clean it thoroughly.","【HadinEEon excellent customer service】 HadinEEon continues to inspire everyone from professional cooks to the at-home chef with innovative technology from a TRUSTED brand. What's more, you get a 3 year and 1 year Money Back for your investment. Please feel free to Contact us if you have any request, we will solve your problem within 24 hours!"],"reviewsAspects":["easy to use","easy to clean","stainless steel","highly recommend","hot water","blue led","year warranty","french press","looks great","well made","tea kettle","bpa free","heats water","led lights","boiling water","heats quickly","high quality","works great","auto shut","addition to my kitchen"],"productInformation":[{"Package Dimensions":"9.5 x 9 x 7.5 inches"},{"Item Weight":"3.75 pounds"},{"Shipping Weight":"3.75 pounds (View shipping rates and policies)"},{"Manufacturer":"HadinEEon"},{"ASIN":"B07S7CB7G2"},{"Item model number":"DE1733"},{"Customer Reviews":"4.9 out of 5 stars\n    388 ratings\n4.9 out of 5 stars"},{"Best Sellers Rank":"#3,005 in Kitchen & Dining (See Top 100 in Kitchen & Dining)\n#36 in Electric Kettles\n"},{"Date first listed on Amazon":"August 12, 2019"}],"productDescription":["\n","\n","\n","A morning never gets perfect until you get the perfect kick of a good tea or coffee. HadinEEon kettle is a great option in fast boiling water.","With its 1200 powerful heating system, it works quickly and boils water within few minutes. It enables you to make hot cereals very quickly as well as French press, etc.","Safe and precise water boiler Equipped with British Strix thermostat control. Strix is the world leader in kettle controls, providing safer and stabler performance. Using genuine Strix controls guarantees safety and eliminates the risks associated with using low-quality components.","It is safe with the stainless steel on the lid where the steam reaches. Other water boilers that just have plastic will eventually crumble.","What’s more, it has glass sides which gives you a good view to see what happens in it. The wide opening makes it easy to put the brush in and clean it thoroughly.","\n","\n","\n","Non-slip handle provides a secure grip and remains cool to touch.","It is comfortable to hold, and the spout doesn’t dribble when pouring. Easily serve and share favorite beverages with convenient cordless pouring.","Its made with glass & stainless steel. All the water contact surfaces are constructed of FDA approved & food grade material and heat-resistant.","What’s more, The cordless design allow you to lift up the kettle from the power base and take it anywhere you want.","\t\t\t\t\n\tElectric Glass Kettle GK1733\tVariable Temperature Electric Kettle GK2003\tElectric Glass Kettle ER3000\tElectric Glass Kettle TN1000\nPower\t1200W\t1200W\t1000W\t1200W\nVariable Temperature\t\t✓\t\t\nCapacity\t1.7 L/ 58 Oz\t2.0 L/ 70 Oz\t1.8 L / 62 Oz\t1.7L / 58 Oz\nSpout\tGlass\tGlass\tStainless Steel\tStainless Steel\nBase\t#304 Stainless Steel\t#304 Stainless Steel\tStainless Steel\tStainless Steel\nThermostat\tBritish Strix\tPremium\tPremium\tPremium\nKeep Warm\t\t✓\t\t\nAuto Shutoff\t✓\t✓\t✓\t✓"],"reviews":[{"reviewerName":"R & M","rating":"5.0 out of 5 stars","reviewTitle":"Great electric kettle","reviewDate":"October 9, 2019","reviewText":"I have not had the kettle for very long, but after a couple uses so far I am very pleased with this item. It seems well constructed and I expect it to last. It comes with a 3 year manufacturer's warranty, so it is nice having that little bit of extra peace of mind.\n\nThe kettle is made of glass with a plastic handle, similar to the materials of a regular coffee pot but heavier. The base is plastic and has a convenient area under it for storing the power cord for easy portability. The power switch is conveniently located on the handle and the pot lights up an attractive blue when powered on reminiscent of the blue flame of a gas stove.\n\nI purchased this so I could have hot water in my home office away from the kitchen. Also it's nice to have the added security of not worrying about leaving a boiling kettle on the stove unattended. 1 liter (4 cups) of water took approximately 5 minutes to get to a full boil. Once it reaches boiling, the kettle shuts off automatically. The instructions that come with the kettle for care and operation are detailed. Like other coffee pots you need to maintain it to prevent limescale and such with vinegar or CLR. Mine is still too new so haven't really gotten to this point yet.\n\nI'm pleased with this item and would reccomend it."},{"reviewerName":"Dave B","rating":"5.0 out of 5 stars","reviewTitle":"Great Value on Attractive Electric Kettle","reviewDate":"October 3, 2019","reviewText":"I am extremely satisfied with the Hadineeon Electric Kettle. It is attractive, easy to clean and heats quickly. It holds up to 1.7 liters of water. Plastic is only used on the exterior of the kettle. The water is in contact with glass and stainless steel, so there is no unwanted tastes. The blue LED's are a great addition, as they light up when heating and give the appearance of being on a gas burner. This kettle is a great value, and I would definitely buy again!"},{"reviewerName":"Review it","rating":"5.0 out of 5 stars","reviewTitle":"High quality and quick boil.","reviewDate":"September 4, 2019","reviewText":" Made well and works great. Boiled water in about 5 minutes. Quality of Materials seems really good! Height is about 9” tall. Beautiful Blue LED lights up bottom and turns off when ready."},{"reviewerName":"Ning An","rating":"5.0 out of 5 stars","reviewTitle":"Love this modern electric kettle","reviewDate":"September 26, 2019","reviewText":"The stainless steel design is elegant and sophisticated. Love the transparent design which allows me to see how much water is inside and see when it boils. It also gives reassurance on cleaniness of the kettle. Very big open at top, which makes it super easy to fill in water and to clean. The speed to boil water is super fast and much faster than the current hard plastic kettle that I use. Also love the blue light when water is boiling, looks so cool. Premium quality product with durable material and a beautiful design! I love it!"},{"reviewerName":"Marshalynn1963","rating":"5.0 out of 5 stars","reviewTitle":"Nice product and seems to work well first day ... Warranties are a nice back up","reviewDate":"October 5, 2019","reviewText":"This is model 1733 and I now see another similar HadinEEon kettle, model 1705 for $28.90. I'm not sure what the difference is in features except there is a spout filter on the less expensive model. I purchased this as a replacement for a less expensive electric kettle which was great and lasted at least 3 years and then quit working. I then purchased a new kettle on Amazon from Algostar Adam for $20.99. It was okay but rocked on the base and after about five heatings, the element burned out and it quit working so back it went. This kettle is more expensive, at $35.90. At first I was comparing it to my first kettle and I didn't like the way the top opened on this one as the previous one opened from the handle. However, I realized that you don't have to open the top of this one to pour from it. All in all, it looks nice, seems to work well on this first day, and I'm hoping it will last a long time. The 3 year replacement warranty and one year refund offered by the Co. makes it worth trying and, from the reviews, it sounds like the Co. will honor the warranties. if needed."},{"reviewerName":"Valentina","rating":"5.0 out of 5 stars","reviewTitle":"Stylish Led Electric Kettle","reviewDate":"September 2, 2019","reviewText":" I got this product to so I could make myself a nice cup of tea in the morning. And let me tell you I’m obsessed with it. It’s very satisfying to see the LED light come on at the bottom rim when boiling, it makes my morning a lot brighter. Not only this but the material it’s made of is so beautiful and very light to carry wherever you go! Which is very convenient when traveling. Aside from being stylish this kettle is very easy to clean compared to others. It’s wide opening at the top allows you to clean fast and efficient with no struggle whatsoever. I would recommend this product to anyone who wants an easy to use kettle that can also be useful when traveling. Bonus if you love LED things like myself. It would make the perfect gift or new edition to your home! :)"},{"reviewerName":"True Buyer","rating":"5.0 out of 5 stars","reviewTitle":"Amazing performance electric kettle","reviewDate":"September 3, 2019","reviewText":" This is so much more useful than a normal kettle. Unlike a normal kettle, it does not whistle loudly when the water is boiled, instead, it automatically stops the heat going to the water, preventing it from getting any hotter. The product works really well and I am so glad I bought it."},{"reviewerName":"casey36","rating":"5.0 out of 5 stars","reviewTitle":"FAST and SILENT! Perfect for Coffee or Tea!!","reviewDate":"September 22, 2019","reviewText":"The HadinEEon Electric Kettle is an easy and efficient way to quickly heat up water to a perfect temperature without tying up the microwave or stove. The Kettle quietly heats up the water in no time at all. It has a cool blue light at the bottom that lets you know when the heating is complete. This has taken the place of my microwave as the go-to way to heat up water. I fully recommend it."},{"reviewerName":"W. Lucas","rating":"5.0 out of 5 stars","reviewTitle":"Solid Build And Works Great","reviewDate":"September 3, 2019","reviewText":"We are fans of instant coffee and various types of tea. This kettle is exactly what we needed. Around 3.5 minutes we were able to have our water ready for use. We have been looking at these for awhile but did not want to give up the counter space. Surprisingly it has a small footprint and the base holds the pot very steady even when it is full.\nThe blue light ring lets you see when the water starts to bubble up which is pretty cool. pouring is no issue as the spout in the front directs the water well. I tested the auto shut off several times and it does kick off on its own. But what I like most about it is the overall look and feel. The construction feels solid and the power switch on the handle glides on and off firmly. Its not hard to turn it off or on at all, it just feels like a sturdy on/off rocker switch that’s going to last. The biggest reason we chose this one over the others was due to the 3-year warranty. However, after holding and using it I do not believe we will have to utilize the warranty. It just feels solid."},{"reviewerName":"Francis","rating":"5.0 out of 5 stars","reviewTitle":"Good quality electric kettle with a touch of style","reviewDate":"September 13, 2019","reviewText":" I love this kettle. I prefer glass kettles because I like to see the purity of water inside of it. This kettle is very good with a good quality and sturdy cable, switch on/off button and the light adds a touch of style and unique design for your kitchen.\nThe water boils very fast. Overall, I am very satisfied and I would definitely recommend this kettle to friends and family,"},{"reviewerName":"JEL","rating":"5.0 out of 5 stars","reviewTitle":"Easy to use, safe, BPA free, & 3 year warranty!","reviewDate":"September 28, 2019","reviewText":"This is such a great kettle. It’s BPA free (and after using a plastic kettle for a while, this makes all the difference and the water tastes so much cleaner), cordless, has such a cool look to it because it lights up blue during use, is easy to clean (the user manual has straightforward cleaning instructions), and comes with a 3 year warranty. Highly recommend this kettle!"},{"reviewerName":"Michele Puckett","rating":"5.0 out of 5 stars","reviewTitle":"very useful and efficient","reviewDate":"September 7, 2019","reviewText":"This product is so helpful in the kitchen! Boils water very fast and is so easy to use."},{"reviewerName":"Tanya Pluckrose","rating":"5.0 out of 5 stars","reviewTitle":"The Best Cup of Tea","reviewDate":"October 15, 2019","reviewText":"Recently I ordered the HadinEEon Electric Kettle and fell in love with it the moment I hit the heat button to heat up a jug of water. Firstly the florescent blue light comes on and creates a lovely background effect as the water heats. It holds a tremendous amount of water. This kettle is very quick and heats a considerable amount of water in a quick period of time. You can see when it needs descaling as it is glass rather than stainless steel. It is light to hold and easy to fill. I highly recommend this kettle as it has so many marvelous benefits."},{"reviewerName":"Kathleen Murphy","rating":"5.0 out of 5 stars","reviewTitle":"Works better than expected!","reviewDate":"October 22, 2019","reviewText":"I had an electric kettle by a different manufacturer prior to purchasing this one. What a difference this one has made. It's easy to use, water boils quickly and it's easy to clean. The base unit is sturdy and has cord storage. The kettle is easy to fill, easy to pick up and to clean. So glad I returned the prior kettle and purchased this one!"},{"reviewerName":"Stephen V","rating":"5.0 out of 5 stars","reviewTitle":"Other companies should follow HadinEEon's example here","reviewDate":"October 8, 2019","reviewText":"I rarely give 5 star reviews but so far this product deserves it. I've waited a long time for a design that prevents hot water from touching any plastic, is glass and easy to clean. For a very reasonable price you get a great warranty and what looks like responsive, sincere customer service. This company apparently really listened to what buyers want - the kind that will earn my loyalty if they maintain these standards.\nAn aside: citric acid powder works great for any mineral deposits - 1/4 tsp, a pint of water, bring to a boil, cool, rinse, wipe dry. No lingering odor or taste."},{"reviewerName":"Gol M","rating":"5.0 out of 5 stars","reviewTitle":"Practical and high quality kettle!","reviewDate":"September 11, 2019","reviewText":"I really like this product! I have another model of this kettle (from the same company) and have used it at home for about a year and I got this new model for my office! I never have problem with that kettle.\nThe design of this new kettle is sophisticated, beautiful, and practical. It is not heavy or too light. The size of the kettle is enough for everyday usage. It boils water quickly. The cleaning is basically piece of cake, no sediment!\nOverall, great experience with the old one and the new one :)"},{"reviewerName":"Seth","rating":"5.0 out of 5 stars","reviewTitle":"Well made, solid kettle at a great price!","reviewDate":"September 13, 2019","reviewText":"This is a really solid kettle. Well made, feels real solid when I hold it. Glass, stainless. Looks great in the kitchen! To boil 1.7L, it took about 3-4 minutes which I felt was pretty quick. My old kettle took twice as long! Good buy, highly recommend. L"},{"reviewerName":"Teresa Alba","rating":"5.0 out of 5 stars","reviewTitle":"Healthy Choice","reviewDate":"October 29, 2019","reviewText":"I am in the process of getting rid of products\nthat can hurt your health. Since borosilicate glass resists chemicals and acid degradation, you don't need to worry about stuff seeping into your water so I made the decision to choose this kettle. Also, it looks beautiful on my kitchen counter top and matches my smart home style with the Blue LED indicator."},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Attractive design, large capacity, won't scald user when pouring, water stays hot a long time","reviewDate":"October 10, 2019","reviewText":" I have used a kettle like this one everyday for years to make tea at work.\n\nHere's what I like about this one.\n\nThe look: the sleek design and fun blue light when heating look cool on my counter, so I don't feel compelled to hide it away in the cabinet, which is good since I use it all day every day.\n\nAuto shutoff: I recently purchased a coffeemaker without auto shutoff, and wow, what a pain.\n\nThe locking lid! With my old kettle, the steam or the processes of pouring would pop open the fill top and scald me. The one has a push button, slow-open top to guard against that.\n\nThe water get very hot (cold to rolling boil in about 7 minutes) and stays hot for a long time, I can still make tea with the heated water an hour later.\n\nFinally, the capacity.\n\nThe only aspect that prevented me from giving this five stars is that the unit isn't as quiet as my last one.\nI often use this at work, so the hiss of the water heating (about 7 minutes to a rolling boil) might disturb others. It is not loud, but not silent either. Although, with how long the water stays hot, I won't have to run it as much."},{"reviewerName":"J. R. Gordon","rating":"5.0 out of 5 stars","reviewTitle":"Great electric kettle as well as great eye candy on kitchen counter ☘️","reviewDate":"October 10, 2019","reviewText":"While I’ve had a stainless electric kettle with an LED light indicator showing temperature variations as it heated up I was not enthusiastic about the inability to determine the amount of water in the container and a smaller opening at the top. I became aware of this kettle and was attracted immediately to it because it was clear which allowed me to see how much water was inside. The blue lights were just an added attraction 🤣 and the bubbles as the water heated quickly made me laugh🙀 I also liked the wider “mouth” of the top because I could also easily heat soups too. There are easy to read markings on the glass carafe showing water (or soup) quantity. It is easy to turn on and off and quick heating and quite attractive on the kitchen counter. The only hiccup is the top opening mechanism. Once I got the hang of it I was fine. But you need to slide the recessed “catch” towards the handle and it opens. If you are right handed use your right hand to hold the handle and slide the “catch” back with the left hand and up pops the top. My first attempts had me holding the handle with the right hand and simultaneously pushing on the “catch” which didn’t open the top but did succeed in turning on the kettle again. Maybe an arrow pointing towards the handle on the sliding “catch “ might be a good addition. Or maybe a little clearer explanation in the otherwise excellent Instructions world help. This little issue was the only reason I didn’t give it 5 stars on Ease of Use. I miss not having the temperature readout only because some of the teas I use give specific optimum temperatures although I’m not at all sure that it really matters and isn’t just a marketing ploy as an excuse for the dollar amount that is charged for the tea 🤣🤣🤣\nI’m really delighted with the new unit and give it a strong Buy recommendation after, at the manufacturers request, I tried it. My stainless kettle will be “gifted” to my sister 🙀🥴🤣🤣🤣"},{"reviewerName":"Disappointed consumer!","rating":"1.0 out of 5 stars","reviewTitle":"TERRIBLE!","reviewDate":"November 5, 2019","reviewText":"First, after just one week of use, this electric kettle had so much loose limescale in it. Every time I boiled water, it was laced with limescale particles. In addition, the kettle is noisy and takes a while to boil. After a few uses, it already looks dreary. My previous, glass electric kettle (which I replaced only because, after many years of use, it looked shabby), had scale build-up but only after many uses. Scale most likely due to the water in my town, but limescale should not build-up after one use.\nI am VERY disappointed with this kettle and would not recommend purchasing it.\nLastly, when the kettle arrived, inside the box was a leaflet from the company that said, if I left a review giving the kettle 5 Stars, I would receive a free item from them. The leaflet listed items I could choose from, at no charge, FOR FREE!!!! Items included a toaster and electric can opener!! They would send me the item of my choice FOR FREE if I gave the kettle a 5 Star rating!!!! Disgusting!\nAlso, I want to add that the lid on the kettle does not close unless you push it tight. The \"switch\" to open the lid is located on the top of the lid, in the center, close to the spout.\nEVERY time I use this item, I literally shout out, \"I hate this kettle\" every time I fill it.\nCannnot stress this too much, DO NOT BUY THIS KETTLE! It is a piece of junk! I rarely take the time to post reviews but this thing has me fumming!"},{"reviewerName":"T. THOM","rating":"5.0 out of 5 stars","reviewTitle":"Great customer service","reviewDate":"September 9, 2019","reviewText":"Updated review 9/28/2019 - I had an issue with the kettle not working correctly and customer service was so fast and willing to help me fix my issue. The initial kettle leaked and they sent me a new one.\nI love it so much, it heats up super fast, looks awesome on the countertops, it's 100% plastic-free on the inside, has a cute blue light, plus super easy to clean.\nI recommend scaling it with citric acid, you can get it at Target or Walmart instead of vinegar.\nPlease don't hesitate in purchasing this Kettle, I purchased other 2 fancy ones that claimed to be plastic-free and were not, major burnt plastic smell.\nTHANK YOU!\n\nLooks cheap and it leaked"},{"reviewerName":"Happy Theologian","rating":"5.0 out of 5 stars","reviewTitle":"Nice Unit","reviewDate":"October 7, 2019","reviewText":"This is the first electric tea kettle I have ever owned, and I am impressed. I have my own distiller. Distilled water is highly reactive because there is nothing in it. That is why it makes such good coffee, tea, etc. Because of that, glass is the very best thing in which to make tea. That was the reason I bought this unit. I make a lot of tea at a time, and it doesn't take but a few minutes for the water to boil. The unit shuts off once reaching a boiling point. I was amazed that the bottom where the glass unit sets into doesn't get hot. It is cool to the touch. The top is not hot, and the handle is not hot. Only the glass container gets hot so avoid touching that. The blue light that turns on when you are boiling your water is so cool and beautiful to watch while it is heating the water. I would recommend this to folks. It serves my purpose very well."},{"reviewerName":"Sylvie","rating":"5.0 out of 5 stars","reviewTitle":"Best glass kettle from HadinEEon for the price!","reviewDate":"October 22, 2019","reviewText":"My stainless steel electric kettle of poor quality has just died and I was looking for a new one from Amazon. Too many to choose from but suddenly I noticed a pretty one in glass from HadinEEon, a seller I have always trusted since I have bought their great milk frother. Right away I purchased their Kettle for a very raisonnable price of $38.90 with a 10%coupon.\nIt did not take me long to see that this beautiful heat resistant glass kettle with a blue light around the rim was not only functional but stylist! It heats quickly and quietly with a boil-dry protection. I appreciate also its big opening at the top that makes very easy to fill in water and to clean. it is BPA free: no plastic comes into contact with the water at any time. I would like to add that HadinEEon has a rare excellent customer service: I have had a question about my milk frother in the past, I have contacted them and they answered me back very rapidly. If you are not satisfied with your kettle, you will get a 3 year and 1 year money back.\nAs you have guessed, I love my new appealing glass kettle. I highly recommend it. Buy it without hesitation!"},{"reviewerName":"Gina Helm","rating":"5.0 out of 5 stars","reviewTitle":"Better than Expected, Quality Product at a great price","reviewDate":"October 21, 2019","reviewText":"Very nice price point for this large 1.7 L kettle. Quick boil heats water fast, has a nice design. LED lights up blue when heating. Clear glass makes it easy to see to clean with a little vinegar mixed with water. Boil dry protection is a great safety feature. The cord can be kept at the exact size and any extra can be looped back under the base to be kept out of the way. The kettle itself is cordless which allows you to take it off the base when hearing is complete so you can make any hot drinks anywhere you desire. Three year manufacturers warranty and great customer service. This is my second Kettle by this maker and I am extremely pleased with the price, design and quality of this product. Will be purchasing more as Gifts."},{"reviewerName":"F. Dedon","rating":"5.0 out of 5 stars","reviewTitle":"Easy to use and auto shut off! Beautiful see through design.","reviewDate":"September 22, 2019","reviewText":"I love this kettle! I live in America and tea is not such a huge thing. So when I had the odd tea I used the microwave. I kept scalding myself by overheating the mug. I also just got my son a French press. Between those two things I figured a kettle would be the way to go. I used to own a fancier one many years ago but dint want to spend that much (the same one is now over 100$!) This one is brilliant especially for my teens. You can see what is going on and it auto shuts off. We’ve all already (as you can tell by the photo!) enjoyed macchiatos this morning. Skip the coffee maker guys. Get a French press and a grinder AND this kettle. I can’t wait for all the cocoa and tea we will easily be able to have this winter."},{"reviewerName":"Joseph D.","rating":"5.0 out of 5 stars","reviewTitle":"Happy with my purchase and customer service","reviewDate":"October 2, 2019","reviewText":"Wanted an electric kettle as I am a tea drinker and had to share my coffee maker...chose this based on other review and am extremely happy with it. Out of the box, washed, ran water thru as instructed, emptied and made a cup of tea. Love the feature that it shuts off when boiling. Top opens fully for cleaning and love that the base stays cool, does not harm my new countertops. It’s just what I was looking for.\nUpdate...2 days after I received it, it stopped working. Filled it up, pressed button, nothing. Returned for refund..too bad as I really liked th design.\nUpdate #2... after contacting the company about my issues with the kettle, the sent me another one (at no charge). I received it and have been using it since without any problems..\nTheir customer service went beyond what I would have expected and am very happy with their product and company. Would definitely recommend this kettle"},{"reviewerName":"Cyndagrace","rating":"5.0 out of 5 stars","reviewTitle":"Fantastic....","reviewDate":"October 25, 2019","reviewText":"I have used electric water kettles in the past that leave a lot to be desired. The HadinEEon Electric Kettle is a wonderful water kettle. It heats fast and is quiet. Very well constructed you know you have a quality product. So many times today you purchase something that works for only a short time then quits. With the HadinEEon Electric Kettle you have peace mind. It comes with a 3 year warranty. I do pour over coffee and thought I would have to purchase an additional kettle with a long spout to make my coffee. The way the HadinEEon Electric Kettle is constructed that is not the case. It works perfectly for that as well. I would highly recommend this kettle."},{"reviewerName":"The Book Man","rating":"5.0 out of 5 stars","reviewTitle":"Nifty device! Easy to use!","reviewDate":"October 11, 2019","reviewText":"I love this kettle. It is easy to use, easy to clean up, and very practical. It performs just as promised. Boiling hot water in 5 minutes. I found it turns on with my plug timer right before I get up in the morning, so my water is hot and ready to use to brew my French Press coffee. I have used a variety of electric kettles, if this continues to work over time, it will be my favorite so far. The blue light ring that is on while brewing is unique and actually practical. I would purchase this product again, if necessary. Great two year warranty as well."},{"reviewerName":"Majimo","rating":"5.0 out of 5 stars","reviewTitle":"Fast Heating and Great Value","reviewDate":"October 27, 2019","reviewText":"I like to have an extra electric kettle for my upstairs coffee bar. This one heats up a bit faster than the one I have owned longer. I have to admit, I like the lighting on the bottom that lets me know when the water is finished heating. It is so quiet also that I sometimes forget I am heating water.\nIt is nice looking and not as cumbersome as my other tea kettle.\nI like the price of this as well. It is a great value for the money. It has a warranty which I like to have.\nI am happy with it and will buy another for my cabin."},{"reviewerName":"GuitarMan96","rating":"5.0 out of 5 stars","reviewTitle":"Stylish kettle that boils water quickly.","reviewDate":"October 26, 2019","reviewText":" I received this kettle about a week ago. It was quite a challenge to choose a kettle as there are so many to choose from. I choose this one in the end as it seemed to have the most positive reviews and I liked how it looks. It is very cool looking, especially with the blue light that let’s you know it’s on. It boils water very quickly - about 5 minutes when filled to the max level, and quicker with less water. The auto shutoff feature works well, just a few seconds after it begins to fully boil (see video). My only criticism is the location of the on/off switch at the top of the handle as it very easy to inadvertently turn it to the on position. However, this did not retract from 5 stars as my wife and I quickly became used to it, but something for the manufacturer to think about. I also like that the lid has a slider to open and to lock it into place. Finally, the whole carafe fits under our refrigerator water dispenser, which makes it super easy to fill and should also help reduce calcium build-up. All in all, this is a very stylish kettle that is quiet and boils water fast."},{"reviewerName":"Supreme","rating":"5.0 out of 5 stars","reviewTitle":"It’s a great way to minimize microwave usage","reviewDate":"October 9, 2019","reviewText":"This electric kettle (Model DE1733) holds water for up to a 7 cup capacity. It’s very easy to use. All you have to do is fill up the kettle by pressing the button on top which opens/closes the lid. Then plug the cord into an outlet and press the switch on/off button which brings the water to a boil and also activates an LED light. The electric kettle becomes cord-free when it’s removed from the swivel base which makes it easy and safe to clean. This electric kettle works well for quick beverage and meal prepping such as tea, oatmeal, and instant noodle soup cups that require hot water. It’s a great way to minimize microwave usage."},{"reviewerName":"Andy B","rating":"5.0 out of 5 stars","reviewTitle":"Improvement over my previous electric kettle for a few reasons....","reviewDate":"October 27, 2019","reviewText":"My previous electric glass water kettle was very good and lasted for years, totaling 2-3,000 cycles of bringing cold water to a boil. This kettle improves upon my previous (different brand) in a ways: First, water does not have to come into contact with ANY plastic if you pour carefully. The glass appears to be higher quality, and opening for pouring in water is much wider when fully open. I can't comment on the reliability of this kettle as I have only had it a week, but the design is everything I need."},{"reviewerName":"udis777","rating":"5.0 out of 5 stars","reviewTitle":"The kettle of your dream.","reviewDate":"October 17, 2019","reviewText":"I bought an apartment and noticed that i cant make a cup of tea and enjoy good view in my window. I said to myself that i need a kettle. Scrolling Amazon happened a miracle, I saw it. That was Hadineeon. I shouted: Oh boy, this is Jack Pot . And I pressed \"buy now\" and on the next day I received it. After unpacking I was surprised. The design was awesome. Crystal-clear glass in combination with a metallic lid and comfortable plastic handle makes beautiful usual effect classic and stylish. My first cup of tea was made in a minute, because this boy boiled water in a blink of on eye. I had rejoiced with silent working and blinking of blue lights. This little kettle became my good assistant and made my life in the new apartment more comfortable. Now I enjoy good view in my window with a hot cup of tea."},{"reviewerName":"John L","rating":"5.0 out of 5 stars","reviewTitle":"Very nice electric kettle","reviewDate":"September 6, 2019","reviewText":"I recently decided to purchase an electric kettle and the design of this kettle is just awesome and of high quality. Its made with glass and most of all it is BPA free. There is no contact of plastic to the water and it is very safe to use. The water boils quickly a full pot of tap water in about 7 miuntes ! It holds upto 1.7L and has the auto shut off feature too. So you do not have to worry about leaving kettle on. It is a nice product! I've purchased so called stainless steel electric kettles in the past that started to show signs of rust in as litte as 1 week of use. Don think that will be a problem with this on because it made of glass."},{"reviewerName":"Ank","rating":"5.0 out of 5 stars","reviewTitle":"Good and nice looking kettle","reviewDate":"October 10, 2019","reviewText":" This is a good product. It’s nice looking kettle which does its job pretty fast! I normally use about 2-4 cups on a regular basis and in no time super hot water is available from this kettle. Rarely I use about 6-7 cups and I am pretty amazed at the speed it takes to boil that much of water.\n\nI like the blue lights that glow when the kettle is on and it turns off with the auto shut off feature once the water is hot. The cable is long enough to set it on the counter and when not required, I like the winding feature as it shows less clutter. Spout is neat, pours just fine and the wide opening is good for cleaning. Looks elegant but is sturdy. All in all a pretty good product I would recommend."},{"reviewerName":"The Denboers","rating":"5.0 out of 5 stars","reviewTitle":"I am loving my new HadenEEon Kettle. It is beautiful in appearance and Efficient In It's Function!","reviewDate":"September 16, 2019","reviewText":" I love the price and the quality! It's like the Rolls Royce of Kettles! It's beautiful in appearance and heats up water very efficiently! To top it off, I don't have to be concerned with ingesting chemicals leached from plastic. I am so happy with it!!"},{"reviewerName":"The Californian","rating":"1.0 out of 5 stars","reviewTitle":"Has Plastic!!","reviewDate":"October 27, 2019","reviewText":"Hinge inside the kettle is plastic. Boiling water will condensate on the plastic hinge and drip back into the water.\nInaccurate website description and I am speechless as to all the reviews here that claim there's no plastic. smh."},{"reviewerName":"David Wylie","rating":"5.0 out of 5 stars","reviewTitle":"Gets the job done.","reviewDate":"September 6, 2019","reviewText":"I, primarily, use this to only boil water. I would suggest that other use in the same manner. It works well and gets water boiling within a min or two by switching on the button to on or powered position. It has lovely lights on it that indicate the kettle is on or powered up. It has an automatic shut off so you can set and forget it. So far I've used it for tea, cup ramen, and instant coffee. The water stays heated for quite awhile after it shuts off. The lid doesn't seem to be detachable which make it seem a little harder to wash. Hence only using it to boil water, so you wont have to wash it as frequently. I gave it 5 stars because of it sleek look and ease of use. I've only had it for a short while but have enjoyed it very much."},{"reviewerName":"Lynette Morgan","rating":"4.0 out of 5 stars","reviewTitle":"Sturdy, attractive tea kettle","reviewDate":"November 9, 2019","reviewText":"I have not noticed any off taste with this tea kettle. I had ordered another one from Amazon earlier this year.....not the same brand....but it died on me after a bout 10 months and the warranty had run out. So a couple of things drew me to this one: I read all the positive reviews: the lid is not made or plastic so the water does not come in contact with plastic; it has a 3 year warranty. Since getting it this past week I have really enjoyed it. It is a good size and the base is not as large as the last one I bought. It is very attractive. Also I can clean the inside whereas the other one I could not put my hand into. The one thing that might be considered a negative is that it takes a little longer to heat the water than my last one. But this is minor so I would definitely recommend this kettle from the few days that I have been using it."},{"reviewerName":"Kristina W.","rating":"5.0 out of 5 stars","reviewTitle":"A must have!","reviewDate":"September 29, 2019","reviewText":" Super easy to use. Sets up in seconds. You will have hot boiling water in under 2 mins! Very easy to clean. It is made out of very strong glass so it’s built to last. I’m so happy I bought this because it helps with entertaining large groups of people when making tea. I also use it to warm up the kids thermos before putting hot lunches in them. I would definitely recommend!"},{"reviewerName":"Martina Horak","rating":"5.0 out of 5 stars","reviewTitle":"good quality Electric Kettle","reviewDate":"October 13, 2019","reviewText":" Nice design, quick boiling with auto shut-off, quality kettle just looking at the electrical cord 3x16GAW good solid wire to plug in the electrical outlet. Electrical cord wraps around bottom of base for length adjustment. Glass kettle has measurements in cups and liters. Easy accessible switch on top. One year replacement and three years warranty is impressive. I don't see anything negative about it"},{"reviewerName":"Andrew K.","rating":"4.0 out of 5 stars","reviewTitle":"Week One: Works great, Looks great","reviewDate":"November 10, 2019","reviewText":"I've had this electric kettle for almost a week. I've used it every day, and so far I'm very pleased with how it works and how it looks. There was no strange plasticky smell when unboxed, which is always a good sign. The glass is clear and strong, and the whole unit feels sturdy and well-made. The design has a sleek modern look that probably works well with just about any kitchen decor. The cord is nice and long, so I can pull the unit far enough away from the backsplash so that it isn't directly underneath the upper cabinets when in use. I gave it 4 stars for cleaning only because I've yet to do anything beyond the initial before-use clean (which was super fast and easy). At this time, I would definitely recommend this product to a friend."},{"reviewerName":"rj","rating":"5.0 out of 5 stars","reviewTitle":"Looks really nice and easy to use and clean","reviewDate":"September 12, 2019","reviewText":"We are a team loving family. I have been meaning to buy an electric kettle for use at home and convenience. It is great quality and easy to use. The Glass kettle gives it a classy look so I might move it from my kitchen to the countertop facing the living room (nice for guests to see hehe). Be sure to read the cleaning instructions with vineger and water. I am particular about cleaning my kitchen gadgets and this one was easy."},{"reviewerName":"Artfuldagger","rating":"5.0 out of 5 stars","reviewTitle":"This is the best kettle I’ve ever had!","reviewDate":"October 23, 2019","reviewText":"I love this HadinEEon kettle! It boils water extremely fast, is super easy to clean and the capacity is one of the largest I’ve seen.\n\nAnd one important factor is that, although it has a max water level mark, it has nowhere inside where water would leak into the handle or interior workings...preventing water from damaging the electronics. This is a very good kettle!"},{"reviewerName":"Barchandune","rating":"5.0 out of 5 stars","reviewTitle":"Quite a nice little gadget!","reviewDate":"November 4, 2019","reviewText":"After buying a milk frother from this company, I learned that they also make an electric kettle. I purchased this one and after using if for several weeks, I'm pretty pleased with it. It works well and quickly, is quiet, and looks very nice. To me, reliability is the most important thing. We'll see how long it lasts, but from all indications, it looks well built and I expect several years of service. I do drink a lot of tea!"},{"reviewerName":"Alisa","rating":"5.0 out of 5 stars","reviewTitle":"High quality electric kettle","reviewDate":"October 25, 2019","reviewText":"I was in the market for a new electric kettle that was of good quality and looked attractive in our kitchen. This product hits the marks in both of those categories. I like the size of this kettle since with one boil you can serve many cups of tea/coffee. It's very nicely made, parts used look like they will last for a long time. I like the fact that you can hide the cord underneath the stand when you are not using the kettle. I love the see-through design, very helpful to clearly see how much water is remaining or how much needs to be added. The neon blue color that lights up when the kettle is on is very nice tough to an already attractive and modern design. Boil time is pretty quick as well. I am really enjoying using this electric kettle, great purchase!"},{"reviewerName":"Colin","rating":"5.0 out of 5 stars","reviewTitle":"Better than that old style kettle","reviewDate":"September 13, 2019","reviewText":"I love this kettle. It looks modern because frankly, it is modern. It's convenient to use. It's effective in its usage. I really enjoy the fact I can just put it in its own spot on the counter. I don't need to take up a burner on the stove. I don't need to warm water up in other less effective ways like using a Keurig or microwave. It takes about 60 seconds to boil water. It shuts itself off after reaching the boiling point. Since it's clear I can also just watch it and see when it's ready. I don't need to wait for any high pitched squealing that the dogs of the neighborhood can hear. There's no learning whatsoever. I took it out of the box and plugged it in. It's incredibly easy to use and boils water extremely fast. I'm throwing out my old metal kettle. This kettle is by far and away the best kettle I've ever used."},{"reviewerName":"MJF","rating":"5.0 out of 5 stars","reviewTitle":"Love affair with a kettle","reviewDate":"October 31, 2019","reviewText":"I love this kettle! First, it heats very fast. Second, I love being able to see how much water to add ... with my old metal kettle, I guesstimated by weight, which was not onerous, but I do enjoy the visibility with the HaddinEEon. This kettle is very attractive on the counter, also. i hope to have a long and enjoyable relationship with my new kettle!"},{"reviewerName":"Derek","rating":"5.0 out of 5 stars","reviewTitle":"Looks Nice and Functions well","reviewDate":"September 4, 2019","reviewText":"It does what it is supposed to do, while looking rather nice. It boiled 1.5L of water in about 7 minutes. That is not the fastest electric kettles I have seen, but definitely no slow. We dont have room in our kitchen, so it has to stay on the counter and that is where this thing shines - it looks nice and clean. The blue light that shows when it is on is a nice touch and it shuts off by itself after it has finishing boiling the water. Overall a good product."},{"reviewerName":"Katherine Kemble","rating":"2.0 out of 5 stars","reviewTitle":"Improper sealing of lid which causes steam to hit pouring hand","reviewDate":"October 29, 2019","reviewText":"The issue with this item is that the back portion of the lid is poorly sealed. Because of this, steam flows onto your hand when you pour your hot water. This is potentially dangerous and should be remedied. I am not returning it because it is too much trouble and I will just hold the handle very far down. I may seal the lid shut with silicone and add water via the spout - I am afraid someone else who is not expecting this will get steam exposure. Definitely not recommended unless this design flaw or quality control issue is fixed."},{"reviewerName":"Mspall","rating":"5.0 out of 5 stars","reviewTitle":"Sleek addition to office kitchen","reviewDate":"October 10, 2019","reviewText":"Very easy to operate with one on/off switch. Comfortable handle/grip. Cleaning is easy, just empty and air dry or wipe with dry cloth. Very pretty with blue base light when heating up to boil, then unit automatically turns off. Approximately eight minutes to boil max capacity 7 cups (1.7L); approximately three minutes for minimum capacity 2 cups (0.5L.) Plan to use at my office so large capacity will be appreciated, as well as auto-off function. Would recommend."},{"reviewerName":"Trinity C.","rating":"5.0 out of 5 stars","reviewTitle":"Fast,Comes in hand and luxury look & Quality. EXCELLENT!","reviewDate":"September 26, 2019","reviewText":"This product really comes in handy for morning tea or middle of the night cozy tea.\nI layed back down thinking it'll take the usual time it takes on the stove to get the water boiling but,... as soon as I layed down, in like the next three min. The water was already boiling with the water filled pretty high.About 6cups.❤Its like I sat down just to get back up! As a tea lover i love my electric kettle and i would recommend it to you.. Also it's great because if you make coffee and want to save it for later, and stock it in the fridge, you can take it out the next morning, add some ice and there you have ice coffee my friends. It holds your leftovers like a pitcher of juice as well. It comes in handy for multiple things."},{"reviewerName":"Amy Schwarz","rating":"5.0 out of 5 stars","reviewTitle":"Great design and very efficient","reviewDate":"September 9, 2019","reviewText":"I purchased this product to use mostly for tea and instant coffee. When I opened the package I was immediately struck by the sleek design. I cleaned the kettle like instructed and filled it about halfway with water. I set it on the base, plugged it in, flipped the switch on and was so impressed by the blue led lights, absolutely love this part of the design! The water began to boil so quickly it was amazing. After the water starts to boil the switch flips off by itself. Great for busy people, like myself, who may forget to turn it off. I would definitely recommend this product to friends and family."},{"reviewerName":"Eric ONeal","rating":"5.0 out of 5 stars","reviewTitle":"Nice electric kettle","reviewDate":"October 9, 2019","reviewText":"Nice electric kettle. Packaged well. Overall pleased with this product. Only used a few days but seems to work well. I will update if the quality changes as I use it.\n\nPros:\nCord stores in base\nGlass kettle- love that no plastic touches the water\nLocking lid\nQuick boil- for me the max (7 cups) took 7.5 mins to reach boiling and 4 cups took 5 minutes to reach boiling.\n\nCons:\nAuto shut off after it reaches boiling, turns off entirely, doesn’t maintain boiling temperature. However, I left it about 7-10 mins after it turned off and when I came back and restarted it, it reached boiling in about one minute, so it apparently retained heat well."},{"reviewerName":"J. Simpson","rating":"5.0 out of 5 stars","reviewTitle":"Powerful, Quiet, Easy!!!","reviewDate":"September 24, 2019","reviewText":"This electric kettle was easy to use, very quiet, and powerful! I will be using this more than I use my Keurig or microwave. I went to make my fiancé and myself a cup of tea and decided to give the kettle a try. I normally use the Keurig and she normally uses the microwave. We both enjoyed the brewing of this electric kettle and were wondering why we didn’t order it sooner. The tea got hot and stayed hot longer than most other brewing machines. We also felt like with the hotness we were able to taste the flavor more. I would recommend this to everybody looking for an easy and quick option. Very powerfully, so you’re not sacrificing your brew by going electric!"},{"reviewerName":"IYou","rating":"5.0 out of 5 stars","reviewTitle":"Great Kettle","reviewDate":"November 8, 2019","reviewText":"This kettle was purchased to replace an older kettle that was on its last legs. The HadinEEon Electric Kettle 1.7L Glass Electric Tea Kettle has a clean simple design that allows it to fit in in any kitchen. It has a large opening making it very easy to fill (an improvement over our last kettle). It also boils rapidly, which is important when you come in from the cold and need a mug of tea quickly (yes, tea - I'm British!). Having the auto-off feature is great (it had died on our old kettle), and the blue LED light is a fun feature that also lets you know it is has been turned on to boil. Looking forward to many years of use."},{"reviewerName":"jilly","rating":"5.0 out of 5 stars","reviewTitle":"Very good product","reviewDate":"November 2, 2019","reviewText":"I like this high-powered kettle, usually I need 3 cups of boiling water only at a time. After turn on the power, I do something else , wait for 3-4 minutes, than I got the water that had just been boiled. It is better than the water that has been heated repeatedly by previously water heater . And watching the water dancing in a glass kettle lit with blue light is also a pleasure."},{"reviewerName":"Randall Reneer","rating":"5.0 out of 5 stars","reviewTitle":"Works great!","reviewDate":"September 6, 2019","reviewText":" It heats up in just over a minute with about 4 cups of water. The light isn't too bright but definitely noticeable as well. Great size and a nice clean look!"},{"reviewerName":"Alex","rating":"5.0 out of 5 stars","reviewTitle":"No more stove boiling!","reviewDate":"September 20, 2019","reviewText":"No more boiling water on the stove! This is great for when you need to only boil water. It heats up very nicely and shuts off when water is boiling. It does takes about 10 minutes to boil when filled all the way up. I will be using this all the time. Great for coffee, tea and hot chocolate."},{"reviewerName":"Amazon Customer","rating":"4.0 out of 5 stars","reviewTitle":"Nice electric kettle","reviewDate":"October 14, 2019","reviewText":"I have been using it for about 2 weeks now to replace a different kettle that no longer had a working auto shut off. So far I am liking it and it has been working well. It fits into our stainless steal kitchen very well and seems well made. The backing was also very good so no worries of damage on shipping. My only minor gripe is that there is no cover release on the handle so to open the cover you have to release the lever on the cover itself which after boiling water can be hot. But the description did not say that it had a handle release I just made an assumption so that was on me and its really not a huge deal."},{"reviewerName":"Kindle Customer","rating":"5.0 out of 5 stars","reviewTitle":"Wish I had purchased this kettle sooner!","reviewDate":"October 21, 2019","reviewText":"For years I've heated water for my tea in the microwave. Recenty, my husband has acquired a taste for it, too, so it made sense to use a tea kettle. The HadinEEon kettle not only performs great, it's pretty to look at, and I don't mind leaving it out on the counter. It's also come in handy for things other than boiling water for tea."},{"reviewerName":"Kris","rating":"5.0 out of 5 stars","reviewTitle":"High end kettle","reviewDate":"October 13, 2019","reviewText":"This is a really good quality and high-end product. It is also an FDA approved based on booklet it comes with.\nMy father used it to warm up water in the winter months due to sensitized teeth to cold liquid.\nI have also used it to warmed up the water to make tea. While warming up the water, I added some fresh mint leaves. It really gives that flavored kicked.\nUses it110V but warms up the water super faster. I mean within 1/10 fraction of time of conventional method."},{"reviewerName":"Catamaran'78","rating":"5.0 out of 5 stars","reviewTitle":"Solid, Well Made Kettle with Nice Style and Finish","reviewDate":"November 6, 2019","reviewText":"Well made and solidly constructed. Switch on handle firm and seems made to last. The 1200 watts is more than sufficient for a fast boil, and if you have other load on your kitchen circuits less chance of tripping breaker. Highly recommended."},{"reviewerName":"Jackiebean","rating":"5.0 out of 5 stars","reviewTitle":"Quick and easy","reviewDate":"September 25, 2019","reviewText":"I needed something to heat water, and this fits the bill! We don't have a stove at work and I got tired of heating up mugs in the microwave. This is quick, clean, and easy to use. The LED light is nice too, no questing whether the device is on or off."},{"reviewerName":"Blair O.","rating":"5.0 out of 5 stars","reviewTitle":"Family loves the blue lights!","reviewDate":"September 21, 2019","reviewText":"This is my third electric tea kettle. I love the look, easy to use features and how quickly it heats my water. It looks great on my counter. My kids love the blue light. We are avid tea and hot cocoa drinkers so my kettle is used a couple times a day. Great buy for the price."},{"reviewerName":"Renee J","rating":"5.0 out of 5 stars","reviewTitle":"It has no plastic components tainting water taste.","reviewDate":"November 1, 2019","reviewText":"I love the quick heating as well as the beautiful design. I will be enjoying tea more often rather than using a stovetop kettle. This HadinEEon is perfect and shows how much water is left for another cup vs. traditional stove kettle. I plan to bring it with me to holiday parties for making tea and hot chocolate 1"},{"reviewerName":"Chanie","rating":"5.0 out of 5 stars","reviewTitle":"Stylish and quality electric kettle!","reviewDate":"September 29, 2019","reviewText":"I've been looking around for a good electric kettle and I was referred by my roomate about this product from HadinEEon. it came with good packaging and everything look very stylish. The good part about it is that the lid is also made from quality stainless steel so it's safe for boiling water! I wouldn't buy if the lid is plastic. Everything was pretty solid and well made. It took 8 minutes and 14 seconds to boil a 1.7 L water. Very convenient and efficient way to boil water. It's backed-up by HadinEEon for 3 years, so I have nothing to worry about! Highly recommended!"},{"reviewerName":"Heavenly Hands craft","rating":"5.0 out of 5 stars","reviewTitle":"Good Kettle","reviewDate":"October 7, 2019","reviewText":"I just got this kettle 2 days ago and so far it's great. The boil time for water when full is about 7 minutes which is on the slow side but everything else is great thus far. I like the blue like and the ease to clean. I would recommend this kettle"},{"reviewerName":"Jafferson","rating":"5.0 out of 5 stars","reviewTitle":"i love this kettle","reviewDate":"October 5, 2019","reviewText":"super easy to use and fast! the only problem is that the button to release the lid is on the lid and becomes hot sometimes otherwise i love it and it’s very amusing for my kids to watch as they are eating breakfast!"},{"reviewerName":"Vanessa Lopez","rating":"5.0 out of 5 stars","reviewTitle":"Great purchase!","reviewDate":"September 11, 2019","reviewText":"I really enjoyed this it’s quick to boil and no fuss having to turn on a stove top teapot and walking away and running back to turn it off. It shuts off soon as it’s done so that’s a really good feature!"},{"reviewerName":"Donna P","rating":"5.0 out of 5 stars","reviewTitle":"Nice kettle","reviewDate":"November 5, 2019","reviewText":" Really nice kettle, boils quick, easy to use and clean. Never used an electric kettle before but now that I have I love it. Highly recommend this product."},{"reviewerName":"Andrewlol","rating":"5.0 out of 5 stars","reviewTitle":"Easy to use, sleek design","reviewDate":"September 25, 2019","reviewText":" The base doesn't take much space, will be using this a lot during the winter for some hot cocoa. Takes about 1-2 minutes to heat up a good amount of water. Just put it on the base and turn on the switch, simple as that."},{"reviewerName":"D. Yao","rating":"5.0 out of 5 stars","reviewTitle":"Beautiful","reviewDate":"October 18, 2019","reviewText":"Easy to use, beautiful, and love the blue light. Only thing to watch out for is that if you accidentally turn the switch 'on' while cleaning or using, and put it back on the base, the switch is still 'on'. I was too distracted to notice the blue light was clearly on as I was rushing for work and rushed out of the kitchen. Kettle continued to steam with the lid open until there was almost no water left. Operator error, learning curve, duh. No damage done. Would buy again."},{"reviewerName":"Samantha","rating":"5.0 out of 5 stars","reviewTitle":"I love my glass kettle","reviewDate":"October 8, 2019","reviewText":"Wow I love this glass kettle! Not only do I make my afternoon teas with it I also use it for my oatmeal in the morning! So easy and fast to use also you don’t need to store it away because it’s so stylish and modern. However you do have to regularly wash out thoroughly with vinegar because of calcium build up at the bottom."},{"reviewerName":"asb","rating":"5.0 out of 5 stars","reviewTitle":"Great quality","reviewDate":"October 28, 2019","reviewText":"Love this kettle. I use it to boil water for my cafe filtre. The brand I used before leaked - this one does not. And it's true that no plastic comes in contact with the water, and the inside of the lid is metal. I like that, while the bottom is metal, the sides are glass. And of course it's so much faster than a cookto-p"},{"reviewerName":"2k","rating":"5.0 out of 5 stars","reviewTitle":"quick and simple!","reviewDate":"October 12, 2019","reviewText":"just an awesome product, heats water quickly and cleans easily.\nglass adds the value that your water is not absorbing any forign particles.\n\nthank you Hadineeon."},{"reviewerName":"mp","rating":"5.0 out of 5 stars","reviewTitle":"Works as advertised","reviewDate":"October 18, 2019","reviewText":"The water boils in just 2-3 minutes. it is really amazing to see this happening in very few minutes. I love the blue light inside the kettle. The water remains hot for long time. The best thing is that after the water is boiled, you can detach the kettle from its charging base and the bottom of the kettle is cool enough to touch or place on a wood surface. It is a large kettle and works just as advertised."},{"reviewerName":"YGD","rating":"5.0 out of 5 stars","reviewTitle":"Cool kettle that doesn't break a budget","reviewDate":"September 7, 2019","reviewText":" Very cool looking kettle with pretty light, when turned on. Love clear glass. Boils faster than stove top. Using it to boil water for everything, not only tea, like eggs, macaroni, etc..."},{"reviewerName":"Kimi Rose","rating":"5.0 out of 5 stars","reviewTitle":"Love this teapot!","reviewDate":"November 8, 2019","reviewText":"We love this teapot. We haven't used it for coffee since we're tea drinkers, but it heats the water so fast and we just love the blue light :) you won't be disappointed."},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Modern","reviewDate":"November 1, 2019","reviewText":"Love this kettle so far, I like that it has an LED light when boiling and goes nicely in my kitchen with all my other modern chrome/black appliances. Also boils water well more importantly lol"},{"reviewerName":"MorningSleeper","rating":"5.0 out of 5 stars","reviewTitle":"Nice electric kettle","reviewDate":"November 4, 2019","reviewText":"Just received, packaged well, seems to be made of high quality material and a simple design. I like that no plastic seems to come in contact with the water. According to the company unlike the older less expensive GK1705 model, this DE1733 has a British Strix thermostat control for safer and more stable performance. Customer service was responsive to answer my questions. Looking forward to testing it out will update review with any developments."},{"reviewerName":"Tom S.","rating":"5.0 out of 5 stars","reviewTitle":"Does not get any better than this","reviewDate":"November 8, 2019","reviewText":"Like drinking from pure clean glass. No plastic comes in contact with the liquid. Automatic shut off makes this a no brainer. Does not get any better than this."},{"reviewerName":"Janet E Anderson","rating":"5.0 out of 5 stars","reviewTitle":"Very nice kettle and very nice price","reviewDate":"September 15, 2019","reviewText":"I was a little skeptical because the kettle I use at work is all stainless steel but this glass kettle/stainless steel is amazing. So beautiful with the LED light and it boils very fast. It is also extremely quiet. I'm hooked. I normally put my cookware and small appliances away when not in use, but this one has a permanent spot on top of the counter."},{"reviewerName":"Sharon F","rating":"5.0 out of 5 stars","reviewTitle":"Great tea kettle!","reviewDate":"October 1, 2019","reviewText":"Bought this kettle to replace a Farberware kettle with a plastic lid that wouldn’t lose its plastic smell. This kettle made great tea from first cup and it’s made very well and attractive. I’m happy!"},{"reviewerName":"Amanda","rating":"5.0 out of 5 stars","reviewTitle":"Heats quickly","reviewDate":"November 11, 2019","reviewText":"I most like that the kettle is glass and does not affect the taste or release chemicals into the water I’m boiling. The kettle seems to be of high quality. Looks very nice as well."},{"reviewerName":"Michael","rating":"5.0 out of 5 stars","reviewTitle":"Fast to boil with a modern look","reviewDate":"September 20, 2019","reviewText":" This kettle works as expected and boils water very quickly. The added LED light is also a great feature especially when using this as night. The glass is a nice touch and ensures there is no BPA in the product. Id highly recommend!"},{"reviewerName":"Amanda","rating":"5.0 out of 5 stars","reviewTitle":"Quick!","reviewDate":"September 9, 2019","reviewText":" Loving this kettle. The light up feature is handy to know when it’s in use, and the auto-off feature and quick boil is a life-saver when making coffee! Now I don’t have to tend the stove!"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Affordable and Best electric kettle!","reviewDate":"September 24, 2019","reviewText":" I bought my first electric kettle and I’m really impressed how quickly it boils the water. The moment you plug in blue light turns on to indicate it’s working and clear glass helps you see when water starts boiling. Light and power shuts off automatically once it’s ready. Best for the price and I love it!"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"well made, quality product with a three year warranty to back it up.","reviewDate":"October 29, 2019","reviewText":"Product came well packaged, after cleaning as suggested, found it could boil water faster that using a kettle on a gas range. Very well made and the three year warranty confirms the quality. Very easy to clean and the blues led lights while heating are a very nice touch."},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"So far, so good","reviewDate":"September 23, 2019","reviewText":"We've been using this kettle for several days - at least four times per day - and so far, we really like it. It boils water quickly, and I like that the top lid is stainless steel. It seems like a good value for the price."},{"reviewerName":"Paul Almeida","rating":"5.0 out of 5 stars","reviewTitle":"Great addition for kitchen.","reviewDate":"September 24, 2019","reviewText":"Comes to a full boil with 7 cups of water in 8 minutes. Base lights up blue when heating. I might not even heat until full boil...starts bubbling within a couple minutes. Base doesn't get hot, just alittle warm so you can just remove it off the heating pad straight to the table. Simple, sturdy, great buy."},{"reviewerName":"sunshine","rating":"5.0 out of 5 stars","reviewTitle":"Minimal Plastic","reviewDate":"October 15, 2019","reviewText":"Having just been diagnosed with breast cancer, I threw away my plastic electric tea kettle and ordered this one. I’m not sure if this is why I have cancer, but I’m not taking any chances. I like the fact that this one has minimal plastic and the boiling water doesn’t touch it. I’m looking forward to many years with this one."},{"reviewerName":"amy labute","rating":"5.0 out of 5 stars","reviewTitle":"HadinEEon Electric Kettle","reviewDate":"November 8, 2019","reviewText":"I have not had the kettle for very long. I am very pleased with the overall product and would recommend this to anyone. I have also purchased for my daughter for her baby formula. It comes with a 3-year manufacturer's warranty, so it is nice having that little bit of extra peace of mind. I purchased this for boiling water for my french press. Maintenance is low as long as you keep it clean."},{"reviewerName":"Marleen M Doran","rating":"5.0 out of 5 stars","reviewTitle":"Top pick for hot water users !!!","reviewDate":"September 27, 2019","reviewText":"I was so excited to get this product because I love to drink tea. This product is amazing. The actual kettle was attractive. Ok amazing this water boiled in less than 3 minutes. Super cool it turned electric blue to let you know that it was hot and ready. The cord wrapped around the base for easy storage. It was just easy to use and I was so happy it turned itself off. I will be buying one for my mother now."},{"reviewerName":"kcare55","rating":"5.0 out of 5 stars","reviewTitle":"Heats water very quickly!","reviewDate":"October 13, 2019","reviewText":"Automatic shut-off a much needed feature in our home. We do the pour-over method of making coffee and tea. Perfect addition to our kitchen!"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Way better than my last one!","reviewDate":"October 4, 2019","reviewText":"This is so easy to use! I love how they made it so simple but so durable. Definitely better than the last one I had. Highly recommended!!!"},{"reviewerName":"JOHN J.","rating":"5.0 out of 5 stars","reviewTitle":"Tastes good","reviewDate":"October 25, 2019","reviewText":"I bought this kettle because I could not taste it at all in the water it heated. It appears to me that most kettles have the same basic feature set - quick heating, auto-off on boil, dry carafe protection - all of which are important, but good tasting hot water is essential. Without good taste, none of the other qualities is enough. I am very happy with this kettle and especially its 3 year warranty."},{"reviewerName":"Becca","rating":"5.0 out of 5 stars","reviewTitle":"Great modern looking kettle","reviewDate":"September 16, 2019","reviewText":" Great, modern looking kettle! It’s a great size and fits perfectly in my minimal apartment! Great product!!"},{"reviewerName":"Nichole Spinarski","rating":"5.0 out of 5 stars","reviewTitle":"Great design and quality!","reviewDate":"October 18, 2019","reviewText":"This kettle has a very nice, clean design! Definitely one of the nicer ones I have seen. You can tell the glass is high quality. Had it for two weeks now and it works greatl (heats quickly, not wobbly). My only -minor- complaint would be the lid not staying open while you pour. If it isn't held, it hits onto the glass. I fear it could crack it, although this kind of glass is made to be durable. Love it."},{"reviewerName":"san mar","rating":"1.0 out of 5 stars","reviewTitle":"Inside, where the glass meets the hotplate there is rubber or plastic. NOT toxic free.","reviewDate":"October 29, 2019","reviewText":"I returned this product. Inside, there is some type of rubber or plastic material between the hot plate and where the glass meet. for those of you looking for toxic free this is not it. We used a pin to test it; the pin moved freely on the glass but when it got to the hot plate it got stuck, there is some type of plastic or rubber."},{"reviewerName":"Miriam Varela","rating":"5.0 out of 5 stars","reviewTitle":"Great product!!!","reviewDate":"September 9, 2019","reviewText":"Super happy with this buy!!! I ordered this kettle to make my morning tea and I absolutely love it. It warms up fast and is super easy to use. It looks so fancy and looks great in my kitchen. I will be purchasing one in the future for my mom."},{"reviewerName":"P. L","rating":"5.0 out of 5 stars","reviewTitle":"Pretty glass kettle","reviewDate":"October 8, 2019","reviewText":"It's light weighted and has blue light ring in the bottom when in use. Happy with the purchase so far :)"},{"reviewerName":"Gianni Ingenio","rating":"5.0 out of 5 stars","reviewTitle":"A Nice sized Kettle for a GREAT price","reviewDate":"September 9, 2019","reviewText":"I bought this kettle and have used it a few times. The important thing to do is to make sure that you rise it before you use it the first time. The water heated up very quickly. The blue light is also very cool!"},{"reviewerName":"Phillip","rating":"5.0 out of 5 stars","reviewTitle":"Great product and value","reviewDate":"September 28, 2019","reviewText":"Boils water faster than a normal kitchen kettle. Auto-shut off works great and the blue light is useful in telling whether or not the water is done boiling. The product may sound like it's plastic when tapping on it, but it is definitely glass. Product comes with a booklet that also instructs how to clean (we have the product for about 2 weeks but have not cleaned it yet)."},{"reviewerName":"glk3","rating":"1.0 out of 5 stars","reviewTitle":"DEFECTIVE","reviewDate":"October 24, 2019","reviewText":"Filled half full, turned it on and ended up with 90% of the water on the counter and floor."},{"reviewerName":"spedadvo","rating":"5.0 out of 5 stars","reviewTitle":"Nice quality kettle.","reviewDate":"November 3, 2019","reviewText":"I ordered this product to use to make tea and instant coffee. I also wanted a product that was BPA free and that replaced my old Keurig machine. The kettle is compact, runs well and produces really nice HOT water that tastes fresh and clean. I would recommend the kettle. The only problem is the thick cord. I had to play with the cord to get it to lay right so the base would lay flat."},{"reviewerName":"Karen Yuan","rating":"5.0 out of 5 stars","reviewTitle":"Five stars","reviewDate":"October 19, 2019","reviewText":"Best electric kettle I have owned. It is made with glass and stainless steel and BPA-free. The glass sides can give you a good view to see the inside. The design of the wide-open lid mouth makes it easy to thoroughly clean the bottle. The capacity is big —1.7 L, taking about 8 min to boil which is pretty fast. And the kettle has a pretty appearance!"},{"reviewerName":"RSM","rating":"5.0 out of 5 stars","reviewTitle":"Great gift idea","reviewDate":"September 16, 2019","reviewText":"Christmas shopping early and this will make a great gift! I haven’t used it, but it seems like a great quality item. Pretty and a good weight. Perfect for cold weather drinks like hot chocolate."},{"reviewerName":"Angela R","rating":"5.0 out of 5 stars","reviewTitle":"Love it!","reviewDate":"October 6, 2019","reviewText":"Got this for my daughter as she wanted to have something to hear up water for tea and not disturb the Keurig. She loves it! Heats up nicely."},{"reviewerName":"Mohamed g abdelrahman","rating":"5.0 out of 5 stars","reviewTitle":"Easy to use, light weight to carry on","reviewDate":"September 17, 2019","reviewText":" Easy to use and value for 30$ I soo happy with this kettle , I tried to many kettle this is the best one , I recommend"},{"reviewerName":"Raul","rating":"5.0 out of 5 stars","reviewTitle":"Fast heating","reviewDate":"September 8, 2019","reviewText":"When they say quick heat they arent kidding! Super fast heat up and a very simple set up. It has a blue light to show you when it's on"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"simple, easy to clean, & quality material","reviewDate":"November 2, 2019","reviewText":"I purchased 3 different electric kettle before this one. I am finally satisfied with this one! The lid opens widely and I can put my hand in to scrub easily. This does not have any fancy functions like warming, setting different temperatures, etc., which I would have not used anyway. I always prefer basics over too many useless buttons.\nIt looks simple, elegant, and clean!"},{"reviewerName":"Mouna Bdeir","rating":"5.0 out of 5 stars","reviewTitle":"Super easy to use!","reviewDate":"September 20, 2019","reviewText":"This is by far the best electric tea kettle, I just love the sleek look and the glass pitcher! it does not whistle loudly when the water is boiled, instead, it automatically stops the heat going to the water, preventing it from getting any hotter.\nI love how fast it boils water and I can have my coffee or tea so easily! The blue light is also neat! I give it 5 stars!"},{"reviewerName":"Lora","rating":"5.0 out of 5 stars","reviewTitle":"Easy and Auto shuts off gives me a peace of mind.","reviewDate":"October 12, 2019","reviewText":"I bought this electric tea kettle because I have been using a glass kettle on the stove but my husband never hears it boiling and I’m afraid it might boil down to nothing and break when I’m not home to tell him “the waters boiling”. This kettle comes to a boil and then automatically shuts off in about 5 minutes👍 No bad taste or smell."},{"reviewerName":"Ayy Que","rating":"5.0 out of 5 stars","reviewTitle":"Quick and Simple to use","reviewDate":"September 6, 2019","reviewText":"Its as easy as 1-2-3. Plug it in, fill it up and soon you have hot water.\nI literally had 4 cups of boiling water in less than 2 minutes without the mess of splattering water all over the stove.\nYou can put it anywhere and it will be safe. Anywhere you have power you can now have hot water!"},{"reviewerName":"Alvin Kurzer","rating":"4.0 out of 5 stars","reviewTitle":"Boils quickly with good taste.","reviewDate":"October 23, 2019","reviewText":"I liked the ease of mounting on the base for heating. The full swivel feature eliminates hunting for a starting position. I would have liked a 1 liter model since most of my use is for lesser volumes than 1.7 liters. The extra size and weight is a minus for me. It is an attractive addition to my everyday appliances."},{"reviewerName":"tudoben","rating":"5.0 out of 5 stars","reviewTitle":"Wonderful kettle!","reviewDate":"October 10, 2019","reviewText":"I am so very satisfied with my new electric kettle. The aesthetics of this is great. I love the blue light when it is heating. I so appreciate that the water contacts only glass. It heats up quickly. This kettle is efficient, aesthetically pleasing and super clean."},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Coffee in a hurry!","reviewDate":"October 8, 2019","reviewText":"Easy to clean, simple use, heated up quickly. All around great buy for this coffee lover."},{"reviewerName":"Kevin W.","rating":"5.0 out of 5 stars","reviewTitle":"Excellent Glass Electric Kettle","reviewDate":"October 25, 2019","reviewText":"This electric kettle is an ideal gift for every family. We love the LED indicator lights with the auto-stop function. Neat and quiet, no more whistle blowing noise in the house. The crystal clear glass container allows us to see the water from cold to boiling hot in a few minutes. The large lid allows us to clear the kettle easily. Highly recommend this product."},{"reviewerName":"Roger Lum","rating":"5.0 out of 5 stars","reviewTitle":"Great Product. Reasonably priced and something that I use every day!","reviewDate":"September 11, 2019","reviewText":" I've been wanting a water boiler for some time now, so I was excited to see what this baby could do! I love that the pot is clear so that I can see exactly when the water begins to boil! It looks so sleek and clean, not to mention fast! Happy so far!"},{"reviewerName":"Chris","rating":"5.0 out of 5 stars","reviewTitle":"Excellent kettle","reviewDate":"October 18, 2019","reviewText":"The kettle is very stylish and seems to be well made. The water heats quite fast and automatically turns off.\nThe kettle is BPA free since it is made of glass. The base does not take much space on a counter and the cord can be tuck away when not in use.\nThe blue LED is a very nice touch. Overall, an excellent kettle."},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Easy to use and clean!","reviewDate":"October 12, 2019","reviewText":"Easy to use and clean. Lid flips up with touch of a button. Minimal plastic pieces. Quick boiling time. Has blue light to indicate it is in use. Fits snuggly on the base and has appropriate length cord. Fits enough water to make glasses of tea or coffee for the entire family. Water with a little odd taste, but each electric kettle I've owned has been like this."},{"reviewerName":"Kathleen","rating":"1.0 out of 5 stars","reviewTitle":"Defective Product","reviewDate":"November 11, 2019","reviewText":"The look of the pot is picture perfect for my kitchen. However it’s usefulness is not. Every time I put water into my cup it leaks from somewhere unknown to me. Then if I leave water in it and come back there is water in my countertop . This product leaks from some unknown place and causes double work."},{"reviewerName":"Craig","rating":"5.0 out of 5 stars","reviewTitle":"Very Easy to Use!","reviewDate":"September 23, 2019","reviewText":"When I first took this electric kettle out of the box, I immediately loved the look of it! I didn’t know it would be just as easy to use. The blue LED light gives it a nice look as it’s working(quietly I might add.) The light shuts off when it’s done and you have tea-ready water! I have already recommended this product to friends of mine!"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Great quality, sleek design","reviewDate":"October 12, 2019","reviewText":"This electric kettle is perfect for quickly and efficiently boiling water. I used for a quick cup of tea and as a way to boil water faster for cooking. It handles both great. It's a bonus that the design is great and I can leave it out on my counter!\nHighly recommend."},{"reviewerName":"Jo-Ann Fury","rating":"5.0 out of 5 stars","reviewTitle":"Attractive, Easy to Use Electric Kettle","reviewDate":"September 26, 2019","reviewText":"I purchased this kettle to replace one my 96 year old mother used daily. She loves it! It’s easy for her to fill and operate. She especially loves the blue neon light ring. This is a very attractive, easy to use, and large capacity electric kettle that I would recommend if you are looking for an electric water kettle."},{"reviewerName":"Timothy","rating":"5.0 out of 5 stars","reviewTitle":"Very Convenient","reviewDate":"September 13, 2019","reviewText":"I love this electric kettle. It takes no time to heat up water and it's very easy to use. I cook in the kitchen a lot and it helps if you are cooking something that needs water. I also used it to make tea and it worked perfectly. It's a good product and I would recommend."},{"reviewerName":"TAT MING CHEUNG","rating":"5.0 out of 5 stars","reviewTitle":"Electric Kettle Review","reviewDate":"September 5, 2019","reviewText":" I found this electric water kettle to be pretty cool as it has LED lights. Also the clear glass allows you to see the water boil. One negative thing I found out is that you have to remove the limestone which can be an annoyance. Otherwise this product is pretty good."},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Very quick heat up time.","reviewDate":"September 24, 2019","reviewText":"OMG I am in love with my new kettle. Awesome for tea's and hot soups. Its light weight so easy to travel with. It's modern and elegant and makes a great addition to our kitchen counter."},{"reviewerName":"Michael","rating":"5.0 out of 5 stars","reviewTitle":"Great product!","reviewDate":"September 25, 2019","reviewText":" Came in a nice package and is very well built! Boils water quickly!"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Easy to use - eases the morning routine!","reviewDate":"October 11, 2019","reviewText":"This kettle is great -- it is very user-friendly, easy to use. Not only is it easy to clean, but it works wonderfully and has greatly cut down on the time it takes for me to get my morning tea ready. The design is modern and we are happy to leave on our counter for display. Would definitely recommend!"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Works great!","reviewDate":"September 12, 2019","reviewText":" It works really well and fast. I've been able to prepare tea or coffee literally in 2 or 3 minutes and it's easy to use.\nI've had it for 5 days and so far , so good."},{"reviewerName":"Neha Shah","rating":"5.0 out of 5 stars","reviewTitle":"very beautiful and efficient product","reviewDate":"October 10, 2019","reviewText":"This product is amazing. It looks so beautiful on my kitchen island and very useful. it boils the water in less then 5 min and turns off automatically when the water is boiled, unlike other kettles which beeps and you have to turn it off. i would recommend it to anyone who has busy mornings and want to make it quick. overall best one so far."},{"reviewerName":"cmuzz","rating":"5.0 out of 5 stars","reviewTitle":"Love this kettle!","reviewDate":"September 7, 2019","reviewText":"I love a hot cup of tea and with this kettle I can get a hot cup of water quickly. I love this Kettle! It’s also so very pretty when it boils! Every kitchen needs this kettle!!"},{"reviewerName":"Leticia Ann Victorino","rating":"5.0 out of 5 stars","reviewTitle":"Love love love this kettle!","reviewDate":"October 19, 2019","reviewText":"I love this kettle! I wasn’t sure if I needed to get one, however, I’m not sure how I survived without one. I didn’t realize how much water I warm, but it’s so convenient, heats water up in minutes, and has become one of the most used appliances that I own. Not to mention, it’s pretty cool to see watch!"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Great for the price","reviewDate":"September 6, 2019","reviewText":"This has everything you would expect on an electric kettle at a very reasonable price. Also it looks great with the glass finish.\n\nMake sure to rinse it and boil water at full capacity once before using it. Mine had a slight plastic scent, but went away after the first boil."},{"reviewerName":"Mario Elezi","rating":"5.0 out of 5 stars","reviewTitle":"Awesome kettle, works great !","reviewDate":"September 8, 2019","reviewText":"I’ve used this for about a week now & I am pleased with the way this kettle heats up quickly & stays hot too. Having this electric kettle has made making tea so fast. Now I can have my hot tea in a minute anytime!"},{"reviewerName":"Robert Watchous","rating":"5.0 out of 5 stars","reviewTitle":"It works as advertised.","reviewDate":"October 31, 2019","reviewText":"I got this to heat water for tea and coffee. I like the wide mouth for cleaning. first impression is of high quality construction. The first boil I filled it full and got a nice rolling boil from cold water in 7 minutes, it shut off 1 minute later. This will be so much more convenient than the microwave for my tea and french press."},{"reviewerName":"helen","rating":"5.0 out of 5 stars","reviewTitle":"fun neon kettle works great","reviewDate":"November 12, 2019","reviewText":"I use this kettle every morning to heat water for my french press. it's a happy sight to see the neon blue ring when I turn it son. Because it's transparent, I can see when the water starts to simmer. And when I get busy, the automatic shut off is a terrific feature. Sometimes the water is ready before I know it!"},{"reviewerName":"FDK","rating":"5.0 out of 5 stars","reviewTitle":"Great kettle so far. Works and looks great","reviewDate":"October 3, 2019","reviewText":"Looks great, looks like it's well made. There is no plastic touching water only glass and the heat conductor. Boils pretty fast and did I say it looks great :)"},{"reviewerName":"S. Hughes","rating":"5.0 out of 5 stars","reviewTitle":"Good product!","reviewDate":"October 31, 2019","reviewText":"After comparing all different kettle I decided to give this a try. I got it the second day. It is packaged well. Easy to use and it boiled the water quickly. Very easy to clean too"},{"reviewerName":"Dayron","rating":"5.0 out of 5 stars","reviewTitle":"Great Product, Great Value, Seems very sturdy and great value","reviewDate":"September 29, 2019","reviewText":"We purchased this product because we were having constant trouble will all the metal electric kettles. This class one seems very sturdy and a great value for its price. It is very ergonomic and easy to use. The indication light is a perfect indication that it is done heating up, in case your are far away from the kettle."},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Absolutely loved this product...","reviewDate":"September 21, 2019","reviewText":"I used this product for couple of days, its absolutely perfect. This electric water boiler has great feature like BPA Free and have very attractive LED lights. Its very easy to use and\nHeat up very fast. Feel secure as its cover 3 years warranty. Highly recommended."},{"reviewerName":"Daniel Flahiff","rating":"5.0 out of 5 stars","reviewTitle":"BEST KETTLE WE'VE OWNED","reviewDate":"November 9, 2019","reviewText":"We've been using the HadinEEon Electric Kettle for over a week now, 3-8X a day and we love it. It is light and effecient and heats up quickly. And of course that cool blue light at the bottom is a fun bonus. No more whistles, or pans on the stove, or too-hot microwaved mugs for us! Fully recommended."},{"reviewerName":"Kathleen O'Connell","rating":"5.0 out of 5 stars","reviewTitle":"Straightforward Quality","reviewDate":"November 11, 2019","reviewText":"Purchased this to replace a fairly generic stainless steel model that had served me well. Everything is pretty straightforward. I like that it is easy to get inside to clean. Boils quickly, looks nice. Pretty much fills the bill. I am happy with the initial quality. The warranty seems exceptional."},{"reviewerName":"Kyuchan Kim","rating":"5.0 out of 5 stars","reviewTitle":"Easy to Use and No Contacts with Plastic","reviewDate":"October 7, 2019","reviewText":"Great product for sure. If you are worried about BPA on plastic products this is a perfect electric kettle that does not have any plastic parts that hot water touches. When I filled cold water to the MAX level, it took me about 5 mins to the boiling temperature."},{"reviewerName":"KT","rating":"5.0 out of 5 stars","reviewTitle":"Chic and quick electric glass kettle!","reviewDate":"October 12, 2019","reviewText":"This kettle looks very stylish on my kitchen counter. It is made of glass and has a thick power cable, it is built well. It boils water very quickly and I can't get over how cool the blue light at the base looks. Very happy with this product!!"},{"reviewerName":"DeeDee","rating":"5.0 out of 5 stars","reviewTitle":"LOVE!","reviewDate":"September 20, 2019","reviewText":"It reaches a boil very fast and I love the look off it."},{"reviewerName":"Felix B.","rating":"5.0 out of 5 stars","reviewTitle":"Stylish Water Heater","reviewDate":"September 21, 2019","reviewText":"Solid product even high quality power cable to sustain voltage. Nice stainless steel design, love the blue LED's lighting up when heating, auto shut off works flawlessly. The 1200 W heat up the water very fast however not as fast as 1500 W models.\nHappy customer!"},{"reviewerName":"MsAmuseBouche","rating":"5.0 out of 5 stars","reviewTitle":"Hot new Kettle!","reviewDate":"October 1, 2019","reviewText":"Loving this new update to my kitchen counter! This Electric kettle is modern and heats quickly!\nEasy to lift off and pours without spilling or dripping! I’ve had several different electric kettles but this design beats them all!"},{"reviewerName":"Jesse","rating":"5.0 out of 5 stars","reviewTitle":"Wonderful Kettle!","reviewDate":"September 8, 2019","reviewText":"This electrical kettle works great! It’s very easy to use, and it fits perfectly on the countertop in my kitchen. I will probably purchase a couple more for my mom and grandma."},{"reviewerName":"Deb F.","rating":"4.0 out of 5 stars","reviewTitle":"Nice addition to Kitchen","reviewDate":"November 2, 2019","reviewText":"Easy to use. Love the built in light!"},{"reviewerName":"Patrick S.","rating":"5.0 out of 5 stars","reviewTitle":"Love it.","reviewDate":"September 22, 2019","reviewText":"Amazing. The water was boiling in a matter of minutes! And the blue light is extremely attractive 😍. Great price for a very high quality product."},{"reviewerName":"J.A..","rating":"5.0 out of 5 stars","reviewTitle":"Affordable and water boiling within five minutes","reviewDate":"October 13, 2019","reviewText":"Order this water boiler for my parents to make their Vietnamese coffee and Tea. Coolest thing is filling it up with water and stepping away for five minutes, then immediately return to water rapidly boiling within the LED feather. There’s only one button so it’s eady user friendly. Thank you"},{"reviewerName":"Raymond D.","rating":"5.0 out of 5 stars","reviewTitle":"Quick and no Mess kettle","reviewDate":"October 21, 2019","reviewText":"It is very nice looking and easy to hold - it brings the water to a boil quickly and does not spit water everywhere. I am going to enjoy this addition to our kitchen appliances!"},{"reviewerName":"Ben","rating":"5.0 out of 5 stars","reviewTitle":"HadinEEon electric kettle","reviewDate":"September 9, 2019","reviewText":"This kettle looks great and is simple to use just by pressing a switch. I use it to make cups of tea and it works flawlessy. I highly recommend for anyone needing a simple way to get boiling water. P.S. it autoshuts off after the water is done boiling."},{"reviewerName":"Pushunina","rating":"5.0 out of 5 stars","reviewTitle":"Best electric kettle","reviewDate":"October 16, 2019","reviewText":"Love it"},{"reviewerName":"cathy kongphouthakhoun","rating":"5.0 out of 5 stars","reviewTitle":"Simple & stylish electric kettle","reviewDate":"September 5, 2019","reviewText":" Love my new electric kettle. It’s a very simple & stylish unit. It’s makes little noise & lightweight. I like that there’s an automatic shut off, when you water is at the right temperature of hotness."},{"reviewerName":"Gloria Ebeltoft-Picotte","rating":"5.0 out of 5 stars","reviewTitle":"The product is very depandable","reviewDate":"October 21, 2019","reviewText":"We have found great joy with our Hadineeon Electric kettle. It is a lot light than our last one, heats the water up pretty fast. I would buy another one if I had to."},{"reviewerName":"Lauren","rating":"5.0 out of 5 stars","reviewTitle":"Quick and easy!","reviewDate":"September 29, 2019","reviewText":"This was super easy to use! Easy to set up, gets hot quickly, and clean up was simple. Now that it's Fall, I'll be using this a lot with hot chocolate and teas! Money well spent."},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Awesome buy!","reviewDate":"September 10, 2019","reviewText":"Tried it out for the first time and the water started boiling almost instantly. Very surprised how amazing it works! It also shuts off automatically once it gets to a certain temperature and the blue light shuts off to tell you it’s done. Awesome buy!"},{"reviewerName":"peggy","rating":"5.0 out of 5 stars","reviewTitle":"Quick boil kettle","reviewDate":"November 4, 2019","reviewText":"I use this electric kettle in my office so that I may brew a quick cup of tea in the afternoon. The water boils quickly and the shutoff valve engages efficiently so there is no risk of overheating or continuous boil. Great source of comfort during the cooler months."},{"reviewerName":"Susan Stevenson","rating":"5.0 out of 5 stars","reviewTitle":"Great for the price!","reviewDate":"September 8, 2019","reviewText":"This is a great product. It heats water fast and can hold a lot of water at a time. It looks great and fits perfectly in my kitchen!"},{"reviewerName":"Sydney Carter","rating":"5.0 out of 5 stars","reviewTitle":"Go with this one!","reviewDate":"October 15, 2019","reviewText":"This product is wonderful and easy to use. I am thankful for this glass electric kettle! It has come especially in handy for making tea while I have been sick this week. The blue color is also soothing. Great product."},{"reviewerName":"Daichi Shimbo","rating":"5.0 out of 5 stars","reviewTitle":"Ease of use","reviewDate":"October 29, 2019","reviewText":"This electric kettle is easy to use including the ease of its cleaning. Also, it works quickly to boil water which is important because I really like to make Japanese tea. Also, the quality of the design is excellent and really is a nice addition to my kitchen."},{"reviewerName":"Nick","rating":"5.0 out of 5 stars","reviewTitle":"As listed","reviewDate":"October 22, 2019","reviewText":"As listed, works well."},{"reviewerName":"Cory","rating":"5.0 out of 5 stars","reviewTitle":"Convenient, Easy to Use, Attractive","reviewDate":"November 5, 2019","reviewText":"We host a few larger parties each year and this year we purchased the HadinEEon Electric Kettle 1.7L Glass Electric Tea Kettle to make hot cider and hot cocoa for our guests. It was so convenient and easy to use. Clean up is a breeze too!"},{"reviewerName":"Daniel Vinokurov","rating":"5.0 out of 5 stars","reviewTitle":"Great purchase for my mom","reviewDate":"September 30, 2019","reviewText":"Great purchase for my mom, who loves to use electrical appliances in the kitchen. The transparent body of the kettle makes it easy to determine the amount of water poured into it. Which is very convenient for use by the elderly with visual impairment."},{"reviewerName":"jeremy catania","rating":"5.0 out of 5 stars","reviewTitle":"Fast alternative to the microwave","reviewDate":"October 7, 2019","reviewText":"I purchased this to avoid heating water for tea in the microwave every morning. This heats water incredibly fast and has been really easy to use and clean. Very happy with the purchase so far."},{"reviewerName":"HUI","rating":"5.0 out of 5 stars","reviewTitle":"Good looking and easy to use.","reviewDate":"September 21, 2019","reviewText":"It is pretty and it works well. Labels on the glass showed the safe line of boiling water. There are a few of spots on the bottom of the kettle after it being used for multiple times, but the situation is much better than some other products on Amazon."},{"reviewerName":"sundeep s randhawa","rating":"5.0 out of 5 stars","reviewTitle":"Simple, Unique Look and easy to use on a consistent basis.","reviewDate":"November 7, 2019","reviewText":"This Kettle is great for anyone looking for a durable, simple to use and consistent kettle. The water heats up very quick and in an even manner. Also has the unique see-thru effect which is an added bonus. Would definitely recommend!"},{"reviewerName":"Bharti Parihar","rating":"5.0 out of 5 stars","reviewTitle":"Great product!","reviewDate":"November 12, 2019","reviewText":"I love this product! I especially appreciate the auto off feature. Uses less energy than using your stove to heat up water for tea, and much more efficient. The portability is great as well if you are camping on a site that has electricity. Great buy!"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Top Quality Product","reviewDate":"October 30, 2019","reviewText":"Am impressed by the quality and efficiency of the HadinEEon Electric Kettle. Also, the aesthetics of the appliance are appealing. Looking forward to it lasting a long time."},{"reviewerName":"Vera Schmitt","rating":"2.0 out of 5 stars","reviewTitle":"Looks good, got nasty on the inside within days","reviewDate":"October 20, 2019","reviewText":"The kettle looks good and boils water rather quickly. HOWEVER, after about 5 uses, there is a lot of scale on the inside. It looks like it's been used for months. Never had that issue before with other glass kettles."},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"love the kettle","reviewDate":"October 7, 2019","reviewText":"love it."},{"reviewerName":"shanee smiley","rating":"5.0 out of 5 stars","reviewTitle":"Safety, convenience","reviewDate":"September 18, 2019","reviewText":"This thing is great! Easier than having to watch a pot on the stove. The blue led light giving you a heads up on when its working and not working is also a great feature! Love it! good buy for sure!"},{"reviewerName":"Michelle Mahoney","rating":"5.0 out of 5 stars","reviewTitle":"Works as advertised","reviewDate":"September 26, 2019","reviewText":"This kettle worked just as advertised and I found it to be both functional and an attractive addition to my kitchen. I highly recommend this product. It has a large capacity and is pretty fast at getting the water up to a boil."},{"reviewerName":"Iqbol","rating":"5.0 out of 5 stars","reviewTitle":"My wife are really happy, she even throw away our old kettle","reviewDate":"September 19, 2019","reviewText":"This HaddinEEon Electric kettle, looks really cool in our apartment. Me and my wife, really like to get home after work and drink a cup of hot tea while enjoying watching tv. It made well, and not so pricey so."},{"reviewerName":"Clayton E.","rating":"5.0 out of 5 stars","reviewTitle":"All you're looking for in a kettle","reviewDate":"October 15, 2019","reviewText":"Surprisingly well made and it looks great too! Does the job quite well, and you'll have no problems with the kettle. Just as it should be!"},{"reviewerName":"Kristina B","rating":"5.0 out of 5 stars","reviewTitle":"Well made easy and fast.","reviewDate":"October 31, 2019","reviewText":"Absolutely love !! Easy to use well made and the blue color is amazing not to mention quick boiling for my coffee needs! Only have used it a couple times so far and love it also love that at the bottom you can hide the cord wipes clean."},{"reviewerName":"Jeremy Peterson","rating":"5.0 out of 5 stars","reviewTitle":"Great kettle!","reviewDate":"October 23, 2019","reviewText":"This Electric kettle works great! Boils water fast, easy to clean. Big opening, easy to open and close. Very clean looking and love being able to watch water slowly heat up. 3 year warranty is also a great perk!! Get it!"},{"reviewerName":"Joseph sulkowski","rating":"5.0 out of 5 stars","reviewTitle":"Quality product and easy to use.","reviewDate":"October 25, 2019","reviewText":"This is an excellent product. It's well made and works flawlessly and heats water quickly. I use it multiple times every day for making hot teas in particular. I highly recommend it for one's family use or as a perfect gift for anyone."},{"reviewerName":"S schrader","rating":"5.0 out of 5 stars","reviewTitle":"Definite buy!","reviewDate":"October 23, 2019","reviewText":"I loved the efficiency of this item! It is so easy to use and so handy!"},{"reviewerName":"G McC","rating":"5.0 out of 5 stars","reviewTitle":"Excellent Electric Kettle","reviewDate":"October 9, 2019","reviewText":"Excellent product. Especially appreciate how water never touches plastic (it touches either glass or stainless steel). Handsome design and water volume labels on side are helpful. Handle is sturdy and top opens easily. Very pleased."},{"reviewerName":"William Warmoth","rating":"5.0 out of 5 stars","reviewTitle":"Great Kettle","reviewDate":"September 24, 2019","reviewText":"We have been shopping for an electric kettle for a long time. Wanted one that was clear. This is fast and love the blue light that tells you it is heating. Great price."},{"reviewerName":"joanne blumenstein","rating":"5.0 out of 5 stars","reviewTitle":"Works great!","reviewDate":"October 11, 2019","reviewText":" This works really fast. From the time I turned it on I could see bubbles. Within 4 minutes I had boiling water."},{"reviewerName":"David","rating":"5.0 out of 5 stars","reviewTitle":"Solid unit","reviewDate":"October 28, 2019","reviewText":"Very simple and straightforward to use. The lack of thermostatic temperature settings is not a problem because you can easily see when the water is near boiling and know you are at about 200 degrees."},{"reviewerName":"Vanesa","rating":"5.0 out of 5 stars","reviewTitle":"Great addition to my kitchen!!","reviewDate":"October 20, 2019","reviewText":"What a wonderful and beautiful product. This electric kettle is a great addition to your kitchen. The water heats up very fast and stays warm for a long time. Love it!"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Love this kettle","reviewDate":"October 13, 2019","reviewText":"I like how quickly this boils water and the glass design lets you know how much water is in it. I've used a kettle on the stove forever and am so glad I've switched to electric. Just perfect!"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Easy to Clean","reviewDate":"October 23, 2019","reviewText":"Absolutely love my new Kettle. The design is very cool and I love that it glows in the dark. It boils water twice faster then my old one. Its is very easy ti clean. Absolutely recommend it !"},{"reviewerName":"stephen g. kehm","rating":"5.0 out of 5 stars","reviewTitle":"So glad I bought this!","reviewDate":"November 12, 2019","reviewText":"We drink a lot of tea. This makes making it so much easier and more fun. This is one of the best things I have ever purchased. I think any tea drinker would be pleased with this product."},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Awesome Product!!","reviewDate":"October 7, 2019","reviewText":"This product is AWESOME!!! Water heats up quickly and I love the blue light at the bottom of the kettle. Its easy to clean and I would definitely but again!"},{"reviewerName":"Joyce Kleinrath","rating":"5.0 out of 5 stars","reviewTitle":"Easy and bottom stays cool to set down","reviewDate":"November 10, 2019","reviewText":"Works well and is fairly quick. I like the blue light when it is on, very clear to see it is working. I especially love the fact that the bottom stays cool so that you can take the pot and set it down anywhere. J"},{"reviewerName":"Sherri Gagnon","rating":"5.0 out of 5 stars","reviewTitle":"Great product.","reviewDate":"October 18, 2019","reviewText":"I love how quick the water comes to a boil. I think the blue light is a pretty cool feature. Looking forward to using this a lot more this coming winter."},{"reviewerName":"TESSA WIDERMAN","rating":"5.0 out of 5 stars","reviewTitle":"Excellent!","reviewDate":"October 7, 2019","reviewText":"Exactly what I expected based on the excellent reviews I read.\nVery compact. Boils quickly and looks great!\nA welcome addition to my kitchen."},{"reviewerName":"Will","rating":"5.0 out of 5 stars","reviewTitle":"Great product","reviewDate":"September 28, 2019","reviewText":"Love the kettle. It looks contemporary and sleek on my counter top. It couldn't get any easier to use and clean. I especially like the glass spout and heavy heating base. A must for tea and coffee enthusiasts."},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Perfect!","reviewDate":"October 30, 2019","reviewText":"It is exactly what I was looking for to make hot tea and hot chocolate! It is easy to use and the look is perfect on my kitchen counter."},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"One month in...","reviewDate":"November 4, 2019","reviewText":"We’ve had this kettle for nearly one month now. So far it works as described. It’s easy to fill up with water, boils rapidly, and the blue light is a nice touch. Pleased overall."},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Great kettle","reviewDate":"September 24, 2019","reviewText":"So far great, water does not touch any plastic, super quite and the blue light is great to let you know it’s on. Also the glass does not get too hot to burn you."},{"reviewerName":"Silver","rating":"5.0 out of 5 stars","reviewTitle":"Loving It!","reviewDate":"November 3, 2019","reviewText":"Made well and works great. Quality of Materials seems really good! Beautiful Blue LED lights up bottom and turns off when ready. You wouldn't go wrong with purchase because It comes with 3 years warranty!"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Well crafted electronic real kettle!","reviewDate":"September 22, 2019","reviewText":"This is an exceptionally well made product. Attractive to look at, easy to use and clean and a definite upgrade from your regular tea kettle. Highly recommend!"},{"reviewerName":"RGL","rating":"5.0 out of 5 stars","reviewTitle":"Quick to Boil Carafe","reviewDate":"November 2, 2019","reviewText":"Really like how the carafe lights up while providing hot water for my tea. Love it."},{"reviewerName":"Sue Belske","rating":"5.0 out of 5 stars","reviewTitle":"Quick and easy","reviewDate":"September 30, 2019","reviewText":"My husband loves fresh brewed ice tea and this is a great alternative to boiling water on stove. It is fast and easy."},{"reviewerName":"Michael M.","rating":"5.0 out of 5 stars","reviewTitle":"Easy to use and fast!","reviewDate":"October 17, 2019","reviewText":"Very easy to use works fast and would recommend this product to anyone looking for a good electric kettle for their everyday use."},{"reviewerName":"Patricia Hicks","rating":"5.0 out of 5 stars","reviewTitle":"Great product!!","reviewDate":"November 11, 2019","reviewText":"Absolutely loved the clean, crisp look. Love it!!"},{"reviewerName":"Carole Ryan","rating":"5.0 out of 5 stars","reviewTitle":"Handle the equipment as instructed.","reviewDate":"September 17, 2019","reviewText":"The product is awesome. I use it for work, for my coworkers tea time. Boils the maximum amount of water (7cups) in 8 minutes."},{"reviewerName":"Robyn Gonen","rating":"5.0 out of 5 stars","reviewTitle":"Game Changer","reviewDate":"November 3, 2019","reviewText":"This electric water heater is the best I have ever came across in my life. The quality is sturdy and the water boils in less than 5 minutes. Super easy to clean and looks great on my countertop."},{"reviewerName":"jessica","rating":"5.0 out of 5 stars","reviewTitle":"Sleek Stylish Fast!","reviewDate":"October 1, 2019","reviewText":"This is what I have been looking for for my french press! I love it! Heats up quick and very sleek looking!"},{"reviewerName":"sk","rating":"5.0 out of 5 stars","reviewTitle":"Looks good","reviewDate":"September 2, 2019","reviewText":" Works good as described. Look and quality is good"},{"reviewerName":"Po-Wen Chang","rating":"5.0 out of 5 stars","reviewTitle":"A good electric kettle","reviewDate":"September 22, 2019","reviewText":" The quality of this electric kettle is good and easy to use!!"},{"reviewerName":"Janet M. Izzo","rating":"5.0 out of 5 stars","reviewTitle":"Good quality","reviewDate":"October 21, 2019","reviewText":"The kettle was what we expected. It boils very fast and id very easy to use.\nFor us, it was very important that the water was not in contact with plastic.\nThank you!"},{"reviewerName":"Rose Piccolo","rating":"5.0 out of 5 stars","reviewTitle":"Great product!!","reviewDate":"November 11, 2019","reviewText":"I use this for tea in the morning. I can’t believe how fast it boils. I missed having tea before work for years because my tea kettle took so long to boil. This electric kettle is awesome"},{"reviewerName":"Amanda","rating":"5.0 out of 5 stars","reviewTitle":"Great purchase","reviewDate":"November 3, 2019","reviewText":"Works great!"},{"reviewerName":"saul weingarden","rating":"5.0 out of 5 stars","reviewTitle":"Excellent Kettle","reviewDate":"November 1, 2019","reviewText":"Kettle is very attractive and works efficiently. Does exactly what it is supposed to do. Need to be aware that the outside of the glass does get hot when water is boiled."},{"reviewerName":"Scott Zylstra","rating":"5.0 out of 5 stars","reviewTitle":"Preformed as expected. Looks sleak, works quick","reviewDate":"October 9, 2019","reviewText":"This electric kettle works quite well. I tired it out and it brought water to boil in about 3 min. The led light is also cool. I am impressed"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Just as advertised","reviewDate":"October 15, 2019","reviewText":"I have only used my kettle a couple of times but I love it! It looks good, it heats water quickly and quietly. I have done a good deal of research and this was the perfect fit for me!"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Buy it!","reviewDate":"November 1, 2019","reviewText":"Love this kettle. Boils water very fast, auto shut off.\nVery happy so far."},{"reviewerName":"Beata Domjan-Jarvis","rating":"5.0 out of 5 stars","reviewTitle":"Love watching my water boil!!!","reviewDate":"September 18, 2019","reviewText":"Slick, easy to use and I love the fact that I get to watch my water bubble!!!"},{"reviewerName":"Greg Allum","rating":"5.0 out of 5 stars","reviewTitle":"Great kettle at a competitive price","reviewDate":"November 10, 2019","reviewText":"We love this kettle, great size and boils quickly. Perfect and much better than some of the expensive counterparts. No regrets in buying this."},{"reviewerName":"Mathivanan","rating":"5.0 out of 5 stars","reviewTitle":"Value for the money","reviewDate":"September 18, 2019","reviewText":"Nice design , no plastic contacts makes it more healthy choice, auto shutdown works as promised, recommended!!!"},{"reviewerName":"Pause break","rating":"5.0 out of 5 stars","reviewTitle":"Good quality electric kettle!","reviewDate":"October 9, 2019","reviewText":"Love the look & feel of the kettle . So easy to use & easier to clean . The quality is very good & sturdy . Nice blue light & looks stylish"},{"reviewerName":"lisa i behnke","rating":"5.0 out of 5 stars","reviewTitle":"The kettle is very easy to use.","reviewDate":"October 16, 2019","reviewText":"I have only had the kettle for a few days but I already love it. It is very easy to fill and clean and heats the water quickly. I also appreciate the auto-shutoff."},{"reviewerName":"Shabbir Mansuri","rating":"5.0 out of 5 stars","reviewTitle":"Kettle to boil water","reviewDate":"October 22, 2019","reviewText":"I love this kettle. It does what it is supposed to do. I like that the company backs it up with the three-year warranty to stand behind the quality of their product"},{"reviewerName":"Zaf","rating":"5.0 out of 5 stars","reviewTitle":"High quality product !!!","reviewDate":"September 10, 2019","reviewText":" Boils water very quickly. Definitely recommend the product !"},{"reviewerName":"Kamee","rating":"5.0 out of 5 stars","reviewTitle":"Quick for a morning cup of tea","reviewDate":"September 14, 2019","reviewText":"Great electric kettle. Love it in the morning, nice and quick boil"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Would buy again","reviewDate":"October 8, 2019","reviewText":"I didn’t know I needed this until I got it! Such a quick boil and not loud like others I’ve seen before. The LED light is a great feature as well."},{"reviewerName":"Russell Jensen","rating":"5.0 out of 5 stars","reviewTitle":"Great Electric Kettle","reviewDate":"September 18, 2019","reviewText":"Fantastic kettle! Love the clear design and the light up ring. We use ours to make tea instead of using a tea maker. Works great! Definitely worth the money"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Great purchase","reviewDate":"October 18, 2019","reviewText":"Love this electric kettle. Looks great on counter. Boils water 2-3 minutes. Fantastic!"},{"reviewerName":"Jarrod Peterson","rating":"5.0 out of 5 stars","reviewTitle":"Easy to use, but make sure you keep it clean","reviewDate":"October 27, 2019","reviewText":"I love it! Super easy to use and set up. Make sure you keep it clean!"},{"reviewerName":"Joanna","rating":"5.0 out of 5 stars","reviewTitle":"Great product for a good price.","reviewDate":"October 9, 2019","reviewText":"Great product for a good price."},{"reviewerName":"Matthew C","rating":"5.0 out of 5 stars","reviewTitle":"Fast to boil.","reviewDate":"November 3, 2019","reviewText":"Heats up super quick. I couldn't be more happy with this product."},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Great tea kettle","reviewDate":"November 3, 2019","reviewText":"Great tea kettele! We like the design and the quality. Its also very easy to clean. Very satisfied with this product."},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Would recommend to friends","reviewDate":"October 10, 2019","reviewText":"Lightweight and easy to use. Heats to boiling very quickly. Easy to clean. Like that it will shut off automatically"},{"reviewerName":"Yoyo","rating":"5.0 out of 5 stars","reviewTitle":"Good product","reviewDate":"October 9, 2019","reviewText":"It looks good in my kitchen and boils fast. It doesn’t make water taste or smell wired."},{"reviewerName":"Shannon Harris","rating":"5.0 out of 5 stars","reviewTitle":"The perfect electric kettle","reviewDate":"October 29, 2019","reviewText":"This product is amazing! It heats lightening fast and looks beautiful while doing it. I would recommend this product to anyone."},{"reviewerName":"Young Yates","rating":"5.0 out of 5 stars","reviewTitle":"Easy to see when water is boiling.","reviewDate":"October 9, 2019","reviewText":"The kettle looks very clean, nice looking. So far we like to use it every day for hot water to make coffee or tea.\nThanks much. Young"},{"reviewerName":"Estelle Mori","rating":"5.0 out of 5 stars","reviewTitle":"Fantastic ketttle","reviewDate":"October 16, 2019","reviewText":"Exactly as described, nice elegant kettle and does not over boil, at perfect temperature for tea. Highly recommend and it’s not too pricey!"},{"reviewerName":"spuri","rating":"5.0 out of 5 stars","reviewTitle":"Great product","reviewDate":"October 24, 2019","reviewText":"Great kettle!! Have been using it for two weeks. Looks nice on the kitchen counter, easy to clean!! Must buy!!"},{"reviewerName":"campmb","rating":"5.0 out of 5 stars","reviewTitle":"Great kettle - great value!!","reviewDate":"September 18, 2019","reviewText":"Excellent, easy to use electric kettle! It is very stylish and looks great being left out on the counter!"},{"reviewerName":"Kim milam","rating":"5.0 out of 5 stars","reviewTitle":"Wonderful product","reviewDate":"October 19, 2019","reviewText":"I love it heats up fast. Will recommend."},{"reviewerName":"Jennifer Dowda","rating":"5.0 out of 5 stars","reviewTitle":"so great!!","reviewDate":"October 23, 2019","reviewText":"The only bad thing about this is that I didn't buy it YEARS ago!! I love it!!!"},{"reviewerName":"Thomas Walter","rating":"5.0 out of 5 stars","reviewTitle":"Hot water in no time","reviewDate":"October 4, 2019","reviewText":"Water heats up more quickly than I imagined. This has seriously upped my tea game. It’s lightweight and has nice design. I recommend."},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"perfect glass kettle","reviewDate":"October 21, 2019","reviewText":"kettle is basically all glass, without much plastic which was a big deal for us.\nvery easy to use, easy to clean."},{"reviewerName":"Leonard Willis","rating":"5.0 out of 5 stars","reviewTitle":"Kettle takes it to the next level for tea!!","reviewDate":"September 6, 2019","reviewText":"This kettle is amazing!! Boils water and shuts off when it is finished. Boils in about 5 minutes. Love this purchase"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"The HadinEEon electric kettle Works as expected.","reviewDate":"October 27, 2019","reviewText":"The kettle is easy to clean, the top lid is wide open allowing access for cleaning. It is easy to use."},{"reviewerName":"Cristina’s Finds!","rating":"5.0 out of 5 stars","reviewTitle":"Love this product!!!","reviewDate":"September 10, 2019","reviewText":"Heats up fast! Very nice design! Came very quickly. So easy to use!"},{"reviewerName":"B N","rating":"5.0 out of 5 stars","reviewTitle":"Quality Electric Kettle","reviewDate":"October 13, 2019","reviewText":"This product felt very good in my hands. It heats the water fast and is easy to use. The LED lights are also a nice addition."},{"reviewerName":"Mansoor Anwer","rating":"5.0 out of 5 stars","reviewTitle":"Great buy","reviewDate":"October 7, 2019","reviewText":"Very good quality and durable"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Good Quality and easy to use","reviewDate":"September 28, 2019","reviewText":"I got this product yesterday, it is good for use such as easy to clean, no noise and quick hot."},{"reviewerName":"Colin Perry","rating":"5.0 out of 5 stars","reviewTitle":"Great Kettle","reviewDate":"October 27, 2019","reviewText":"Easy to use, easy to clean. My wife really likes this kettle. She also likes the look of the kettle with the blue lights."},{"reviewerName":"Christine DiDonato","rating":"5.0 out of 5 stars","reviewTitle":"Great Product","reviewDate":"November 4, 2019","reviewText":"A very nice looking kettle. The LED light gives it a modern touch."},{"reviewerName":"Sue K.","rating":"5.0 out of 5 stars","reviewTitle":"Glad we purchased, works great","reviewDate":"September 22, 2019","reviewText":"Easy to use and clean. Heats water to boiling really fast. Super fast shipping."},{"reviewerName":"Kerrian Johnson","rating":"4.0 out of 5 stars","reviewTitle":"Good product","reviewDate":"October 28, 2019","reviewText":"the water boils really quickly. i have not seen any rusting as of yet! enjoying the product."},{"reviewerName":"Natalia","rating":"5.0 out of 5 stars","reviewTitle":"Modern, durable and affordable kettle","reviewDate":"October 23, 2019","reviewText":"Great kettle! Cool modern design with LED light. Works quietly and effectively. The price is great too!"},{"reviewerName":"Alla P.","rating":"5.0 out of 5 stars","reviewTitle":"Highly recommended!","reviewDate":"October 23, 2019","reviewText":"Heat up Quickly and Quietly.\nNo smells.\nEasy to use.\nEasy to clean.\nHighly recommended!"},{"reviewerName":"Suman Islam","rating":"5.0 out of 5 stars","reviewTitle":"Definitely worth it!","reviewDate":"September 23, 2019","reviewText":"Like this kettle to make some tea or boil some water. Very light weight and easy to carry it anywhere."},{"reviewerName":"Rajiv Yedula","rating":"5.0 out of 5 stars","reviewTitle":"Nice product .. Fast and silent","reviewDate":"November 8, 2019","reviewText":"I am extremely satisfied with this kettle, heats quickly and easy to clean.Quality of material seems really good."},{"reviewerName":"Dan","rating":"5.0 out of 5 stars","reviewTitle":"Great product!","reviewDate":"October 20, 2019","reviewText":"An outstanding tea kettle that’s reliable and sleek without breaking your bank. Exactly what I was looking for!"},{"reviewerName":"Kathleen M Mullen","rating":"5.0 out of 5 stars","reviewTitle":"I love my new electric kettle","reviewDate":"October 31, 2019","reviewText":"Looks great, works beautifully. I am using it to boil water for my a.m. French Press coffee. A perfect fit!"},{"reviewerName":"Vazha","rating":"5.0 out of 5 stars","reviewTitle":"Very good quality","reviewDate":"October 31, 2019","reviewText":"The product is very good - I'd say the best for the price. Love it!"},{"reviewerName":"Ilya I. Kudish","rating":"5.0 out of 5 stars","reviewTitle":"Quality and clean design.","reviewDate":"October 25, 2019","reviewText":"Quality and clean design. Good capacity. Easy to use."},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Works as described!","reviewDate":"October 27, 2019","reviewText":"So far so good! Large kettle that heats up quickly. Light works. Auto-turns off."},{"reviewerName":"Fc2","rating":"5.0 out of 5 stars","reviewTitle":"So far this kettle works well","reviewDate":"November 2, 2019","reviewText":"We have been using this kettle for two weeks - no sign of rust. Overall, we are satisfied with the product."},{"reviewerName":"Kimberly","rating":"5.0 out of 5 stars","reviewTitle":"Good quality for the money","reviewDate":"October 24, 2019","reviewText":"It is very nice and easy to use. Good quality. I recommend it!"},{"reviewerName":"Kristina Brown","rating":"5.0 out of 5 stars","reviewTitle":"Useful and simple","reviewDate":"October 4, 2019","reviewText":"It’s super easy to clean! I liked how there was an indicator light when it’s heated thoroughly."},{"reviewerName":"Park Taesoo","rating":"5.0 out of 5 stars","reviewTitle":"Good value for money.","reviewDate":"September 15, 2019","reviewText":"Good design and performance.\nIn particular, the blue LED lamp below looks good."},{"reviewerName":"Jennie Light","rating":"5.0 out of 5 stars","reviewTitle":"Great product!","reviewDate":"November 3, 2019","reviewText":"This electric kettle is of high quality and very easy to use. An excellent buy."},{"reviewerName":"Debbie Jarrett","rating":"5.0 out of 5 stars","reviewTitle":"Great value great look","reviewDate":"November 8, 2019","reviewText":"I was so happy with this kettle no set up makes water look appetising when boiling love it!!!"},{"reviewerName":"mary","rating":"5.0 out of 5 stars","reviewTitle":"HadinEEon Electric Kettle","reviewDate":"October 21, 2019","reviewText":"Easy to use, clean and starts to boil within a minute and keeps the water warm for one hour."},{"reviewerName":"awalsh7691","rating":"5.0 out of 5 stars","reviewTitle":"Great addition to my office","reviewDate":"October 8, 2019","reviewText":"I bought this kettle to keep in my office. Looks great and works great. Definitely happy!"},{"reviewerName":"Kris","rating":"5.0 out of 5 stars","reviewTitle":"Amazing","reviewDate":"October 20, 2019","reviewText":"I love how fast and easy this product is on heating up water and how easy it is to clean"},{"reviewerName":"Afshan","rating":"5.0 out of 5 stars","reviewTitle":"Good addition to my morning routine","reviewDate":"September 25, 2019","reviewText":"I really like how easy and quick it is to use, the LED lights just add to the ambiance."},{"reviewerName":"Sara","rating":"5.0 out of 5 stars","reviewTitle":"Great kettle","reviewDate":"September 29, 2019","reviewText":"Heats the water really fast. Easy to use. No complaints"},{"reviewerName":"Madison Lorraine","rating":"5.0 out of 5 stars","reviewTitle":"Great deal good product","reviewDate":"October 16, 2019","reviewText":"Great product. Light weight. Easy to use and clean. Small for easy storage."},{"reviewerName":"Laura","rating":"5.0 out of 5 stars","reviewTitle":"Clean design and works perfectly","reviewDate":"November 2, 2019","reviewText":"Looks pretty and boils very fast!"},{"reviewerName":"Reid","rating":"5.0 out of 5 stars","reviewTitle":"This kettle heats water very well","reviewDate":"October 4, 2019","reviewText":"Great value - very user-friendly!"},{"reviewerName":"Arlene S. Hanson-Young","rating":"5.0 out of 5 stars","reviewTitle":"Looks great on the kitchen counter in the great room.","reviewDate":"November 8, 2019","reviewText":"I am very pleased with this kettle. Especially fond of the blue light."},{"reviewerName":"Tammy Doughty","rating":"5.0 out of 5 stars","reviewTitle":"it is glass","reviewDate":"October 31, 2019","reviewText":"it has blue light"},{"reviewerName":"Chad Fong","rating":"5.0 out of 5 stars","reviewTitle":"Enjoyed the kettle","reviewDate":"October 1, 2019","reviewText":"Greatly enjoyed the kettle."},{"reviewerName":"Sandhya van den Eijkhof","rating":"5.0 out of 5 stars","reviewTitle":"Practical use!","reviewDate":"September 28, 2019","reviewText":"It's one of the best kettles we have bought!"},{"reviewerName":"Sam Preston","rating":"5.0 out of 5 stars","reviewTitle":"Perfect for the tea drinker","reviewDate":"November 5, 2019","reviewText":"Easy set-up, quick boil, everything you want"},{"reviewerName":"Celeste Rosalez","rating":"5.0 out of 5 stars","reviewTitle":"Great product","reviewDate":"October 15, 2019","reviewText":"Boils water within minutes! Great product."},{"reviewerName":"Bruce Anderson","rating":"5.0 out of 5 stars","reviewTitle":"as advertised","reviewDate":"October 16, 2019","reviewText":"as advertised, good product"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Boiled water Very fast.","reviewDate":"November 11, 2019","reviewText":"Boiled water Very fast."},{"reviewerName":"nosheen ahmed","rating":"5.0 out of 5 stars","reviewTitle":"Should empty after each use don’t want to leave water in","reviewDate":"October 23, 2019","reviewText":"I like easy make tea"},{"reviewerName":"Lisa Jones","rating":"5.0 out of 5 stars","reviewTitle":"Exactly what you expect and want.","reviewDate":"October 22, 2019","reviewText":"Great product."},{"reviewerName":"Rustem","rating":"5.0 out of 5 stars","reviewTitle":"pretty good kettle.","reviewDate":"November 10, 2019","reviewText":"Better, then I had before."},{"reviewerName":"Maggie","rating":"5.0 out of 5 stars","reviewTitle":"Great Kettle.","reviewDate":"November 2, 2019","reviewText":"Quiet and easy to clean!"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Great Kettle","reviewDate":"October 4, 2019","reviewText":"Sleek, easy to clean"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Beautiful and great","reviewDate":"October 26, 2019","reviewText":"Beautiful and great"},{"reviewerName":"Robert John","rating":"5.0 out of 5 stars","reviewTitle":"Classy","reviewDate":"October 22, 2019","reviewText":"Great Product"},{"reviewerName":"Sophie","rating":"5.0 out of 5 stars","reviewTitle":"Perfect gift!","reviewDate":"October 18, 2019","reviewText":"As an avid tea drinker, this was the perfect gift to receive :) I love the fancy temperature options for different kinds of teas, with one for french press too. The water heats up quickly and makes a gentle beeping sound when it reaches the desired temp. The container is easy to clean and the glass is way more elegant than any other kind of material. The fact that it lights up is just another aesthetic bonus. Overall great kettle!"},{"reviewerName":"Michael P Knarr","rating":"5.0 out of 5 stars","reviewTitle":"simple, fast, efficient","reviewDate":"October 8, 2019","reviewText":"So far a great product. Boils water quickly. The blue light is nice for on indication. And I love the auto off mechanism. I use a French press, so this is a great edition to my coffee routine morning and night. Love it!"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Loving it!","reviewDate":"September 8, 2019","reviewText":"Soo we just got ours yesterday and enjoying life! I dont use coffee machines to make coffee, instead i boil the water and mix it with my Nescafe. But boiling water on the stove takes 10 mins....with this it took less than 5 mins. It's quiet, you can't really hear anything so it's phenomenal to use when everyone is sleeping and you need to get your coffee fix!!"},{"reviewerName":"OhioTransplant","rating":"5.0 out of 5 stars","reviewTitle":"Very good kettle with nice sytling","reviewDate":"October 26, 2019","reviewText":"Kettle works great. Boils quickly and holds nearly 2 quarts of water. Very nice styling as well with blue light showing through the clear glass while the kettle is heating up."},{"reviewerName":"Mitch Marian","rating":"5.0 out of 5 stars","reviewTitle":"Perfecto","reviewDate":"November 4, 2019","reviewText":"My husband got this for my birthday and I LOVE IT! The other one we had was pretty old so this is a nice upgrade. It's glass so you can watch the water bubbling and has an automatic shut off. Perfect for your hot water needs."},{"reviewerName":"Robert Zuercher","rating":"5.0 out of 5 stars","reviewTitle":"Temperature selection options.","reviewDate":"October 18, 2019","reviewText":"Love the temperature selection options. I use for making green tea and French press coffee. And looks great on the kitchen counter top!"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Quick, easy to use and good experience","reviewDate":"September 20, 2019","reviewText":"The kettle is great. Easy to use and boils water quickly. Great choice"},{"reviewerName":"Kcarignan","rating":"5.0 out of 5 stars","reviewTitle":"Boils water fast! Beautiful design. Very useful!","reviewDate":"September 7, 2019","reviewText":"This is a useful product. It boiled 16oz of water in less then 60 seconds. The design is beautiful. The quality is very high end. We used this for out hot chocolate bar over the weekend and what a difference it made over a stand carafe that could hold hot water."},{"reviewerName":"Jesse Chunn","rating":"5.0 out of 5 stars","reviewTitle":"Super useful, excellent quality","reviewDate":"September 18, 2019","reviewText":"I travel a lot for work, and the hotels I stay in will often have a kettle like this to heat water for coffee or tea. I use them a lot, so when I saw a chance to get this item I decided to give it a try for my home.\nI am really impressed with the quality and stylishness of this kettle. Unlike the ones at the hotels, this one looks very \"futuristic\" and cool, especially when it is on and it lights up.\nMost importantly, though, is the fact that it works very well. It will heat a full kettle of water (up to the \"max\" line) in just a few minutes, which is more than enough for several cups of coffee or soup or ramen or whatever. It will heat up just enough for one cup of coffee or tea in just a few seconds (almost instantly), which is what I use it for mostly. Compared to heating water on the stove it is soooo much faster.\nOne thing I especially like about this kettle is that it pours very smoothly, even if you try to pour it too fast. When pouring boiling hot water, you really don't want to spill it on yourself or anyone else. This kettle is designed so that even if you pour it too fast, it maintains a safe stream of water from the spout without running down the side or \"sloshing\" all over you.\nThe kettle itself is \"wireless\", meaning that when you pick it up to fill or pour it, there are no wires. When it is placed on the base, it will heat up, but when you pick it up from the base there are no cords or wires. It is just a kettle that can be carried around like any pitcher.\nYou will be surprised at how often you use this thing once you get it. It makes you wonder how you ever lived without one of these. For the price, it is a great deal and you will use it way more than you expected."},{"reviewerName":"Rajiv","rating":"5.0 out of 5 stars","reviewTitle":"Easy to use and is quick to boil","reviewDate":"September 15, 2019","reviewText":" In our apartment we get a electric stove and at times to heat water the electric stove takes quite a bit of time. I am not a big fan of using the microwave.\nGot this 1.7L electric kettle and plugged it in. Filed it to the max allowed 1.7L and let it go. The water started heating up pretty quickly in a matter of minutes and I can say it took about 8 Minutes to boil the entire 1.7L which is probably less than half the time it takes on a traditional electric stove.\nNow I use this to quickly boil the water and make tea in the morning. Now Tea preparation is saving me close to 10 minutes since the water is heated up pretty quickly. The LED at the bottom adds a nice little cosmetic touch.\nThough being made of glass the kettle is not so heavy, Overall a deserving purchase for the kitchen."},{"reviewerName":"Renee McElroy","rating":"5.0 out of 5 stars","reviewTitle":"Simple and easy to use!","reviewDate":"September 24, 2019","reviewText":"This is a very nice electric tea kettle! It has blue LED lights that light up the bottom. It turns off when it’s done. It just boils water, so simple. That’s all I needed- I have a baby and we need hot water to warm his bottle. This is fast, so I can pour the hot water in a thermos to take with me when we leave the house. I never plan ahead of time so I need something quick for last minute trips. I just flip the switch and a minute or two later I have boiling hot water. Don’t worry I don’t put the water in his bottle! I just put his bottle in the water with milk already in it, to warm it. The tea kettle on the stove takes forever. This is quick and just what I needed! It’s glass so that’s nice and easy to clean. It’s a nice and simple electric tea kettle!"},{"reviewerName":"H. LEE","rating":"5.0 out of 5 stars","reviewTitle":"Nice Kettle for Boiling Water","reviewDate":"October 22, 2019","reviewText":" I needed a kettle that could boil a decent amount of water as well as easy to use without the traditional sounding kettles. So far it's been pretty easy to use. It boils up pretty quickly and the cleaning was easy. It's seems to be sturdy and good quality. It's not a small Kettle so just make sure you read the dimension. There is an auto off when the Kettle is done boiling so makes it easy. I did test out how hot it boils the water and the thermostat read 180 degrees. So it's pretty hot. It's a pretty straight forward Kettle. Just follow the instructions, don't over fill pass the Max and there's no concern about boiling out of the Kettle as it's not sealed. Also, you'll know it's in boiling process as the blue light will go on. Once it's done, the light will shut off. Can't get any user friendly or straight forward than this. If I had to say anything that could be improved , it's the length of the plug, it's not very long so do note that."},{"reviewerName":"MBA","rating":"5.0 out of 5 stars","reviewTitle":"This is the best electric kettle I've ever owned!","reviewDate":"November 4, 2019","reviewText":"I have 3 different electric kettles, one for my office, a vacation home and for our primary home. This kettle is by far my favorite of the 3. My primary concern was having a kettle that didn't have the hot water come in contact with any plastic. This company went out of their way to make a product with that in mind. One of my other kettles doesn't allow you to turn it off during the heating process, you have to physically take the pot off the heating element and if you put it back on, it will continue the boiling process which I don't like. HadinEEon Electric Kettle kettle allows you to turn it off at any point, say if you only want warm to hot water and not boiled water. And it won't continue trying to boil if you put it back on the heating element. The glass is high quality, it heats water quickly, the blue LED light is a nice touch and overall, both my husband and I are thrilled with this kettle!"},{"reviewerName":"Gyro Gyrloose","rating":"5.0 out of 5 stars","reviewTitle":"This thing is a LIFESAVER for a bed-bound patient and would look GREAT in any kitchen as well.","reviewDate":"October 18, 2019","reviewText":"I was in a major car accident and expect to be bed-bound for 6-10 weeks. I needed a source of hot water for a couple of different things; to wet wash cloths so I could give myself a bed/bath, making herbal tea and most importantly to fill my heavy glass bong with nearly boiling water. I could have bought a cheaper model for $10 less but I like the design of this one and it seems to be worth the difference in performance. First boil it only took 3 minutes to bring 1.5 liters to a boil. The thermo turned it off after it came to a rolling boil, as advertised. I may just have to go back to my French Press coffee maker for a while though I do love my espresso machine it’s operation is beyond my ability for now. Bottom line: It seems to be worth every penny and close inspection convinces me the warranty, as fantastic as it is, will likely never be needed!"},{"reviewerName":"DianeW","rating":"5.0 out of 5 stars","reviewTitle":"Super quiet, easy and safer than traditional tea kettle, love the automatic shut-off!","reviewDate":"October 11, 2019","reviewText":"I just purchased the HadinEEon Electric Kettle 1.7L Glass Electric Tea Kettle (BPA Free) Cordless with LED Indicator Lights and am very pleased with it. It is super quiet as compared to our \"screaming\" traditional tea kettle. I didn't need to use a hot pad to hold it, and the water flowed out very nicely while pouring, vs. our old tea kettle, which would burn my hand if not using a hot pad, and the water would spurt out when full, making a mess; so it is definitely safer to use. When using the electric kettle, the blue LED lights give an up-to-date look to our kitchen. The automatic shut-off is a definite plus! Many times I would start our stove with the old tea kettle on it, and would be working somewhere else in the house, where it would be a few minutes before I could get back to it, meanwhile it was whistling non-stop and water was boiling away. The clear glass kettle is helpful as I can see at a glance whether I need to refill it, or just start it. I really can't rave enough about this purchase!"},{"reviewerName":"Andre M.","rating":"5.0 out of 5 stars","reviewTitle":"Great electric kettle","reviewDate":"September 21, 2019","reviewText":" I really enjoy this HadinEEon electric kettle because it makes it very practical to warm up water for my tea. All I have to do is fill the kettle with water and turn it on. After the water boils the kettle automatically shuts off, so I don't have to keep baby sitting it. You can hear it switching off, and the blue light goes off at the same time. If you want to see/hear what I mean, take a look at the short video I attached to this review. It captured the exact moment the kettle went off after boiling some water.\nThe water reaches the boiling point rather quickly. Boiling two cups of water takes me about 90 seconds.\nThe glass makes it easy to keep clean, and the 3 year warranty provided by the manufacturer confirms this is a good quality kettle."},{"reviewerName":"Wrek","rating":"5.0 out of 5 stars","reviewTitle":"Fast Heating, could use a couple other features","reviewDate":"September 24, 2019","reviewText":"After I purchased this item I found out my wife bought one from a big warehouse retailer.\nThe picture shows this product on the left.\nBoth are very similar in function.\nPros:\n- Easy unpacking\n- Very fast boiling: 1200W vs the other one being 1100W\n- Comes with 3 yr warranty\n- Easy to clean\n\nCons:\n- Tab to open the top vs a button on the handle\n- Other product had a tea filter option with a filter built in the spout\n\nBottom Line: Great product. Again a couple other feature would be helpful but if you want to simply boil water this is the product. Customer service is A+, very prompt responses for my questions."},{"reviewerName":"Lori M. Campbell","rating":"5.0 out of 5 stars","reviewTitle":"Pretty and efficient","reviewDate":"November 1, 2019","reviewText":"It is a really attractive kettle, which wasn't even one of my criteria! But, it's nice to have it look attractive on the counter. One of the first things I did when I moved into my new home is set up a tea/coffee corner, and this makes it look so nice (sleek). I also really like that the lid opens up wide enough to clean it well. My other electric kettle only opened to about 45 degrees, so could not clean it well, and it was not clear so I could never tell what was \"lurking beneath the surface\" and be confident it was really clean. Love this!"},{"reviewerName":"Eric P. Rodawig","rating":"5.0 out of 5 stars","reviewTitle":"Sleek Kitchen Kettle","reviewDate":"October 13, 2019","reviewText":"The design is very sleek and modern, matching my kitchen appliances. When it’s turned on, there is a nice soft blue glow to indicate the kettle is in use. I appreciate the thicker, insulated handle to help prevent any burns while pouring. The lid opens slowly so steam doesn’t pour out and cause burns as I’m pouring the hot water. It took about 6 mins to boil a full 7 cups and only 4 mins for 4 cups. I see myself using this to make oatmeal for the whole family on mornings we are running behind and to make my daily cup of hot tea."},{"reviewerName":"L & L","rating":"5.0 out of 5 stars","reviewTitle":"love the clear and clean looking","reviewDate":"September 22, 2019","reviewText":"Our old kettle is fully metal (aluminum? ) and it gets a white deposit from the water. We often have to wash or soak with vinegar. However, the feeling of worrying about if any metal toxicity will leak into the water never goes away.\n\nThis kettle is mostly constructed with glass, its easy to clean and easy cleanout white water spots. The heating element works well, the whole pot of water can be heat up in just a couple of minutes. So far the kettle seems very solid and the LED indicator works well and very stylish."},{"reviewerName":"Kevin N","rating":"5.0 out of 5 stars","reviewTitle":"very fast heating","reviewDate":"September 6, 2019","reviewText":"I have used this kettle for several times and it is working great so far! I use it kettle for making my tea, morning coffee & instant soups. It is very easy to use, to clean and maintain. It also heats water so quickly in just a few minutes and the blue light displayed while heating the water is a nice touch. The auto shut-off feature works reliably at all water levels, it shutting off a couple seconds after the water comes to a full boil. I like being able to see inside the kettle so I can see everything inside and know when clean it when needed. At this time, I really enjoy this kettle and if something happens in the next few weeks, I'll update my review accordingly."},{"reviewerName":"Wanda Thomas","rating":"5.0 out of 5 stars","reviewTitle":"Visibility and Measurements are excellent","reviewDate":"October 31, 2019","reviewText":"I ordered the clear Kettle to easily see the amount of water and to be able to see the boiling status. That is easily accommodated and the blue light makes it possible to do without turning lights on in the middle of the night! The metric and US measurements are clear and easy to read which is a big help. The only issue I had was that the cord is very large and very stiff making placement on the counter and in the cord receptacle a small challenge but nothing that cannot be overcome."},{"reviewerName":"BRO316","rating":"5.0 out of 5 stars","reviewTitle":"Very nice kettle","reviewDate":"September 15, 2019","reviewText":" I really like the ease of using this kettle. You literally fill it with anywhere from 2-7 cups of cold water, close the cover, set it on its stand and press the power button. Only the heat resistant Borosilicate glass body gets hot, everything else stays cool to the touch. I think if you use distilled or spring water, as opposed to tap water, the limescale might not be terrible. However, getting rid of the limescale is as easy as letting white vinegar sit in the kettle for a while, then run water through a couple of boiling cycles."},{"reviewerName":"KATHLEEN SEXTON","rating":"5.0 out of 5 stars","reviewTitle":"Functional and beautiful.","reviewDate":"September 17, 2019","reviewText":"Love this kettle. It works very well. It takes 7 minutes to boil 7 cups which is its full capacity. 4 minutes for 4 cups so you could say a minute per cup. The automatic shutoff is a great safety feature so if you leave the kitchen and forget it is ok. The lid on top is wide enough so you can get into it to clean. Recommended cleaning is with vinegar. The kettle rests securely on its base. Aesthetically it is very pleasing to the eye. The glass looks beautiful not to mention the blue led light when it is switched on. Overall very functional and a great addition to my kitchen."},{"reviewerName":"Tom Columbine","rating":"5.0 out of 5 stars","reviewTitle":"This kettle heats water fast!","reviewDate":"September 19, 2019","reviewText":"This kettle is a replacement for one that died way too early.\n\nThe speed at which it heats water is impressive! The blue light is cool too.\n\nCan't comment on cleaning just yet, but so far it seems it would be fairly easy. The only thing I need to get used to is the lid flip design. It's a little different than other kettles and easier for hot water to bounce back on the hands. Other than that so far so good!"},{"reviewerName":"Sheri L. Wetherell","rating":"5.0 out of 5 stars","reviewTitle":"Safe, easy, great technology, and it's pretty!","reviewDate":"October 6, 2019","reviewText":"I searched high and low for a new electric kettle and, after reading the positive reviews as well as the specs, I decided on this one. I made the right decision! I liked that this one has a British Strix thermostat (you can read about that in the specs), but most of all, I love that it is safe (auto-shutoff) as we have a young one. When the water is heating a blue LED light around the base of the pot lights up so you know it's on. This is a great kettle for such a low price! Two thumbs up."},{"reviewerName":"Katlyn","rating":"5.0 out of 5 stars","reviewTitle":"Loving it so far","reviewDate":"October 23, 2019","reviewText":"I love the look of this kettle, the ease of it being electric, and the lights! It’s extremely easy to operate and keep clean. I have used it for tea as well as to more quickly and easily boil water for sterilizing my babies bottles/pacis/teethers/etc. I’m also planning to use this to heat water for oatmeal, as it’s so much quicker and easier than having to stand by the stove with a pot of water. Loving this product so far."},{"reviewerName":"Joel and Kathy Davisson","rating":"5.0 out of 5 stars","reviewTitle":"Great electric kettle","reviewDate":"September 18, 2019","reviewText":" Great product overall. Love the design, the blue light is pretty. Seems like a quality item that will last. See the video for unboxing and boiling. Boils Max fill in about 5 minutes. I love that the heater pad is separate from the kettle, the only other settles I've used had a coil inside and ended up becoming disgusting after multiple uses. This seems like it will be easy to clean and maintain."},{"reviewerName":"RCR","rating":"2.0 out of 5 stars","reviewTitle":"Misleading description. I returned it.","reviewDate":"November 8, 2019","reviewText":"From reading the description I got the impression that nothing but glass and stainless steel touch the water. However, there's a silicone-like substance at the bottom of the kettle which stays in constant contact with any water you leave in the kettle between boils. I returned the kettle because of this. I'd rather boil water with a simple stainless steel pot."},{"reviewerName":"Barbara A. Bowker","rating":"5.0 out of 5 stars","reviewTitle":"Love it!","reviewDate":"October 4, 2019","reviewText":"This is a very nice kettle. Purchased to replace another from a different company that died after one year. Was pleased with the ease of use and happy to see a three year warranty policy along with a e-mail support system. I am a decaf coffee and tea drinker so it is perfect for me. Heats quickly and better than the microwave. Packaged nicely and speedy delivery."},{"reviewerName":"Donna Mitchell","rating":"5.0 out of 5 stars","reviewTitle":"This electric kettle is perfect, you will love it!","reviewDate":"October 1, 2019","reviewText":"I’m so glad I purchased this kettle! It’s so easy to use and water boils very quickly. You don’t have to wait like you do when putting water on the stove to boil. I love the style and the led lights. It looks very nice on my counter top. If you are looking to purchase an electric kettle , I would highly recommend this one! It’s perfect, you will love it!"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"So fast and easy","reviewDate":"October 9, 2019","reviewText":"Our previous kettle was metal with a small lid. This kettle is glass, so it's easy to see how much water there is, the blue glow shows that it's on, and the large lid allows me to get my hand into the kettle to clean it if necessary. I looked at a lot of options, and this one had everything I wanted for a very reasonable price."},{"reviewerName":"Michael E. Grimes","rating":"5.0 out of 5 stars","reviewTitle":"Very nice electric kettle, fast!","reviewDate":"September 19, 2019","reviewText":"Very nice stylish electric kettle! Could not believe how fast it boiled water. Nice added feature with the removable kettle, no worries about the cord. Lift off plate and pour the boiling hot water where you need it. LED light let's you know the kettle is on. No whistle like the old school stove top kettles, but not a big deal because it boils water very fast."},{"reviewerName":"AAHill","rating":"5.0 out of 5 stars","reviewTitle":"Love this eletric kettle","reviewDate":"October 6, 2019","reviewText":" Super excited on the arrival of this electric kettle. I am a lover of hot tea especially in fall and winter. This kettle is clean and sleek looking love the bkue light and is very quick in getting just the right amount of water boiling quickly!highly recommend."},{"reviewerName":"Jeric Jones","rating":"5.0 out of 5 stars","reviewTitle":"Good Upgrade from a Traditional Kettle","reviewDate":"November 8, 2019","reviewText":"What a great value.\nThis elegant, electric kettle is a much appreciated upgrade to our old style kettle.\nIt boils more quickly and frees up a burner on our stove in the morning.\nIt regulates itself; will not boil over, and it is very easy to clean. When we travel, we take this kettle with us, so we can have tea whenever, and wherever we find ourselves.\nI am certain that we will be purchasing more of these, as it makes a great gift as well."},{"reviewerName":"Wyatt","rating":"5.0 out of 5 stars","reviewTitle":"quick easy excited for cold weather drinks","reviewDate":"October 7, 2019","reviewText":"Did the test pot (first pot you heat and dump). I can't believe how quickly it gets going. So excited that it auto shuts off when it gets to the boiling temp so I don't need to make a dash for the whistling kettle on the stove (will sort of miss the sound, but not the dash)."},{"reviewerName":"echodawn","rating":"5.0 out of 5 stars","reviewTitle":"Great Price and an AWESOME PRODUCT!!!","reviewDate":"September 11, 2019","reviewText":"I just remodeled my house and the look of this Electric Kettle matches perfectly with the modern theme I went with on the interior of my house! Black, Chrome, Glass, AND BLUE LIGHTS!\nIt looks amazing in the evening while I am heating up water for my tea!\nAnd it boils the water fast. 2+ cups of water in less than a minute!\nI will be buying one for my office at work also. THANK YOU!!!"},{"reviewerName":"Mingnon Pender","rating":"5.0 out of 5 stars","reviewTitle":"Boils in 2 min","reviewDate":"September 26, 2019","reviewText":"Best kettle ever! I was in shock when I filled this kettle to the max line and the water boiled in 2 mins. I love that the kettle itself is cordless and is light even with water in it. Surprisingly when boiling if you accidentally touch the glass it will not burn. It’s not cold but not 3rd degree burn worthy like my stove kettle. This kettle rocks."},{"reviewerName":"Ellie","rating":"5.0 out of 5 stars","reviewTitle":"Love the light and design","reviewDate":"September 19, 2019","reviewText":"First time I used this kettle and I was in awe by the LED blue light when the kettle heats up. The kettle heats up pretty fast. Since the kettle is clear, it is easy to clean. Im using this kettle to drink tea at my office and Im loving it."},{"reviewerName":"Bri BC","rating":"5.0 out of 5 stars","reviewTitle":"Good Kettle","reviewDate":"October 19, 2019","reviewText":"Great kettle. Boils water quickly and effectively.\nLove the design for opening the lid. Very helpful, since a simple push-button can stop working (push-button lids are the bane of my existence), and the lid on this is not a push-button lid, so I have confidence this lid will hold up."},{"reviewerName":"John D","rating":"5.0 out of 5 stars","reviewTitle":"LOVE IT!","reviewDate":"September 9, 2019","reviewText":"love the blue light/halo, turns a boring looking kettle into a futuristic appliance. I also love the glass housing, as I have a stainless steel one before, makes it easier to spot the internal to when cleaning.\n\ngood buy."},{"reviewerName":"Mom2One","rating":"5.0 out of 5 stars","reviewTitle":"This is excellent!!","reviewDate":"October 27, 2019","reviewText":"I really like this a lot! I had my other stainless steel one for way too long! Glass is the way to go. It boils quickly and my 5 year old loves watching it. It is so much easier to keep clean than my old one as well."},{"reviewerName":"T. Sayer","rating":"5.0 out of 5 stars","reviewTitle":"Impressive 💁🏻‍♂️","reviewDate":"September 16, 2019","reviewText":" I don’t know much about electric kettles but I picked this one up on a recommendation and haven’t been disappointed. Honestly quite impressed at how fast it boils water and the overall quality. Thank agin"},{"reviewerName":"JohnnyFitz","rating":"5.0 out of 5 stars","reviewTitle":"Awesome electric kettle!","reviewDate":"October 7, 2019","reviewText":"I love this product. It arrived on time and I washed it out first, filled it up and plugged it in. I am really happy with this. It’s easy, clean, and it works really well. It’s perfect for hot tea. Much better than microwaving water for tea. Awesome electric kettle."},{"reviewerName":"John","rating":"5.0 out of 5 stars","reviewTitle":"Quick and beautiful","reviewDate":"September 6, 2019","reviewText":" Aesthetically it's really a beautiful kettle and I liked the blue led while it's on. It didn't take long to boil the water. It has also an auto-off feature for safety."},{"reviewerName":"Brittany Marshall","rating":"5.0 out of 5 stars","reviewTitle":"Amazing Kettle!","reviewDate":"September 9, 2019","reviewText":" The tea kettle was so easy to use! I mean super easy. All you have to do is fill with water, plug it in and hit the switch and in a matter of seconds it starts to boil the water. This sure does beat boiling water on the stove."},{"reviewerName":"AGV","rating":"5.0 out of 5 stars","reviewTitle":"Great replacement for the old looking stainless steel kettle","reviewDate":"October 9, 2019","reviewText":"Great water capacity and heating power, but the feature I like most is how it looks. The glass and blue light allows to see inside the kettle and adds a modern look to the kitchen."},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Love the fact that you can take it off the base in it has a shut off timer","reviewDate":"October 2, 2019","reviewText":"Receive the item on time tried it out immediately looks very nice heated up very quickly it did do the shut off automatically which was nice and of course the glass was hot so you have to be careful easy to clean get your hand down in there and dry it all in all really like the item"},{"reviewerName":"Sunil","rating":"5.0 out of 5 stars","reviewTitle":"Awesome, Durable Kettle","reviewDate":"November 8, 2019","reviewText":"This kettle is excellent. The fact that it's glass ensures no rust (my stainless steel one had rust on the bottom after a while) and it has a large capacity yet is lightweight. Highly recommend! :)"},{"reviewerName":"Kayla","rating":"5.0 out of 5 stars","reviewTitle":"Easy and fast!","reviewDate":"October 20, 2019","reviewText":"This product is very convenient to have instead of using a microwave, which is what I’ve been doing for years. You can reheat the water multiple times and it only takes a few minutes. Easy to use at work as well. This is a must have product."},{"reviewerName":"Ananth919","rating":"5.0 out of 5 stars","reviewTitle":"Fancy durable kettle","reviewDate":"October 3, 2019","reviewText":"This is the first time I am using a fancy kettle which glows beautifully to indicate the kettle is in progress of heating the water. Water gets heated up quickly like within a minute for 4-5 cups of water. Lid latches up very nicely and the kettle doesn't require to open the lid to pour the water. Overall fancy and durable kettle."},{"reviewerName":"Connie Gray","rating":"5.0 out of 5 stars","reviewTitle":"Boils in minutes","reviewDate":"September 11, 2019","reviewText":"This is a great asset to my kitchen. I was able to keep it plugged as the on switch is located on the handle. So easy to use and heats up fast."},{"reviewerName":"Gary R. Vance","rating":"5.0 out of 5 stars","reviewTitle":"Great hot water kettle.","reviewDate":"October 15, 2019","reviewText":"Great design and attractive product. Works great, easy to clean and love the stainless on the top and bottom of the carafe. Did initial boil per the instructions. No aftertaste, quick heating and the unit looks great."},{"reviewerName":"J. Skidmore","rating":"5.0 out of 5 stars","reviewTitle":"Decent inexpensive electric kettle","reviewDate":"October 12, 2019","reviewText":"Easy to use, brings water boiling within a few minutes. Seems to be made of real borosilicate glass (same stuff as in pyrex) so it won't chip/crack easily."},{"reviewerName":"No NAME","rating":"5.0 out of 5 stars","reviewTitle":"Very easy to use!","reviewDate":"October 15, 2019","reviewText":"Very nice, stylish tea kettle, the lid opens wide which makes it accessible to put water easily! Looks good in the interior, super simple to use! I times the boiling time, it was 8 min"},{"reviewerName":"Zyla Lucky","rating":"5.0 out of 5 stars","reviewTitle":"It's a light show with this kettle!","reviewDate":"September 19, 2019","reviewText":"This kettle is an easy set up. I like the look and the feel of it. It's well made... comfortable for in my hand and the light show when it's on is really pretty. It adds a little bit of pizazz to my kitchen and I love it!"},{"reviewerName":"DrCat","rating":"5.0 out of 5 stars","reviewTitle":"No plastic in boiling water","reviewDate":"October 27, 2019","reviewText":"IT IS GLASS AND METAL ONLY. That all I wanted. No PLASTIC in boiling water."},{"reviewerName":"Samantha Matthews","rating":"5.0 out of 5 stars","reviewTitle":"Great!","reviewDate":"September 21, 2019","reviewText":"I am glad I bought this. It's easy to use, easy to clean, and quick to heat water. I am satisfied with this purchase."},{"reviewerName":"Ibo","rating":"5.0 out of 5 stars","reviewTitle":"Elegant design","reviewDate":"October 5, 2019","reviewText":"This is a nice stainless looking kettle. Does the job fairly quickly."},{"reviewerName":"Domi","rating":"5.0 out of 5 stars","reviewTitle":"Beautiful, fast water kettle","reviewDate":"October 24, 2019","reviewText":"I love that the kettle itself is glass. All metal stays cool to the touch and the LEDs warn from touching. It has auto shut off. It looks beautiful and I made my tea right in it after the water boiled. I really like it."},{"reviewerName":"Rodriguez","rating":"1.0 out of 5 stars","reviewTitle":"It just stopped working....","reviewDate":"November 8, 2019","reviewText":"Didn't have it long and it just stopped working...."},{"reviewerName":"Linda Carter","rating":"5.0 out of 5 stars","reviewTitle":"Fast and healthy cup of tea!","reviewDate":"October 11, 2019","reviewText":"I love this tea kettle! It heats the water very fast. I love that there is no plastic to worry about."},{"reviewerName":"k.h.","rating":"5.0 out of 5 stars","reviewTitle":"Great working, great looking","reviewDate":"September 25, 2019","reviewText":"Great upgrade from our last pot, nice + big too. Fast shipping!"},{"reviewerName":"Fiona","rating":"5.0 out of 5 stars","reviewTitle":"Boils Quickly","reviewDate":"October 1, 2019","reviewText":"This is a beautiful kettle. The water boils fast. I am happy with this product. I recommend it."},{"reviewerName":"Ek-ta","rating":"5.0 out of 5 stars","reviewTitle":"Instant Boil in less than 3 minutes","reviewDate":"September 6, 2019","reviewText":"Instant boil in less than 3 minutes! And auto turn off and super easy to use. Love the look, the led light and is light weight and BPA free. Auto off is also amazing"},{"reviewerName":"Ylber Xhelili","rating":"5.0 out of 5 stars","reviewTitle":"Pretty straight forward!","reviewDate":"October 14, 2019","reviewText":"Easy, simple operation. Build quality seems to be good no complaints so far."},{"reviewerName":"Cata","rating":"5.0 out of 5 stars","reviewTitle":"It holds more water than my old pot!","reviewDate":"October 7, 2019","reviewText":"It is what the reviews showed the pot to be!"},{"reviewerName":"Mark S.","rating":"5.0 out of 5 stars","reviewTitle":"So far, so good .","reviewDate":"November 5, 2019","reviewText":"I like it. Only have had it for a month. But is good if It lasts."},{"reviewerName":"Marie Madrigal","rating":"5.0 out of 5 stars","reviewTitle":"Exceeds expectations","reviewDate":"October 25, 2019","reviewText":"The large capacity is exactly what I needed. Easy to operate. There is NOT a funny taste to the water. This kettle exceeds expectations."},{"reviewerName":"Dylan Hernandez","rating":"5.0 out of 5 stars","reviewTitle":"Water Heated Quickly!","reviewDate":"September 8, 2019","reviewText":"This kettle is very convenient and quick. I was surprised how quick the water got warm, and use it every morning for my coffee. Doesn’t feel cheap either."},{"reviewerName":"Ashley Harris","rating":"5.0 out of 5 stars","reviewTitle":"Great quality!","reviewDate":"September 6, 2019","reviewText":"I LOVE LOVE LOVE this product!!! perfect for making tea and doesn’t take up much counter space at all. It also comes with a three year warranty Which is a mega bonus! Such great quality at an affordable price."},{"reviewerName":"Em Symons","rating":"5.0 out of 5 stars","reviewTitle":"Highly recommend","reviewDate":"October 28, 2019","reviewText":"Love this product for anything that requires hot water. Functionally awesome and aesthetically pleasing."},{"reviewerName":"Irine Koval","rating":"5.0 out of 5 stars","reviewTitle":"I like my Glass Electric Tea Kettle.","reviewDate":"October 28, 2019","reviewText":"I like my Glass Electric Tea Kettle."},{"reviewerName":"A. Dahms","rating":"5.0 out of 5 stars","reviewTitle":"Glass carafe!","reviewDate":"October 16, 2019","reviewText":"So excited for this product!! I like that the whole carafe is glass. Perfect size for easy counter access!"},{"reviewerName":"Anna","rating":"5.0 out of 5 stars","reviewTitle":"Cute and cheap","reviewDate":"October 28, 2019","reviewText":"I purchased it for my mom. She adores by this Kettle. I would recommend this item!"},{"reviewerName":"Bruzza Brooks","rating":"5.0 out of 5 stars","reviewTitle":"Good kettle","reviewDate":"October 31, 2019","reviewText":"I haven't cleaned it yet but it work good and I like the blue light"},{"reviewerName":"Pine Animal Hospital","rating":"5.0 out of 5 stars","reviewTitle":"Looks great and works very well!","reviewDate":"October 10, 2019","reviewText":"This is a great tea kettle. It looks really great and does the job well - boils water really quickly."},{"reviewerName":"Tex","rating":"5.0 out of 5 stars","reviewTitle":"Quick and Efficient!!!","reviewDate":"September 21, 2019","reviewText":" This is perfect for the office or home...anytime of the year!! Heated in minutes."},{"reviewerName":"Eilis Crean","rating":"5.0 out of 5 stars","reviewTitle":"Looks attractive. Fast shipping","reviewDate":"September 20, 2019","reviewText":"Great product. Hold a lot of water. Attractive look with transparent glass. Love it."},{"reviewerName":"Ilia Popov","rating":"5.0 out of 5 stars","reviewTitle":"Like it","reviewDate":"September 20, 2019","reviewText":"Very nice design, was surprised how silent it is, quick, durable, no any dislikes so far"},{"reviewerName":"johnny0723","rating":"5.0 out of 5 stars","reviewTitle":"Very nice Kettle for your kitchen or office!","reviewDate":"September 17, 2019","reviewText":" This looks very fancy with the food grade stainless steel and glass materials. It quickly can boil up to 7 cups of water for your tea, coffee, etc.\n\nTop features:\n1. Water touches glass and food grade stainless steel.\n2. Easy pour spout to guide water into cups\n3. LED blue lights come on to warn folks that water is boiling and not to touch!\n4. large 7 cup capacity\n5. Easy to use, with just a single button to control on/off\n6. Thick gauge wire from outlet to the Kettle's base"},{"reviewerName":"Banana Anachronism","rating":"4.0 out of 5 stars","reviewTitle":"Accurate Descriptions","reviewDate":"November 3, 2019","reviewText":"As far as I can tell, after a few uses all the details listed for this item are accurate and I have rated it overall 4 stars. Some improvements can be made by the next model but I am not an engineer so I can't quite pinpoint what they should be. But I am happy with it so far!"},{"reviewerName":"Dharma","rating":"5.0 out of 5 stars","reviewTitle":"I love it","reviewDate":"September 30, 2019","reviewText":"I love it.It is perfect and also is really cool."},{"reviewerName":"SM","rating":"5.0 out of 5 stars","reviewTitle":"Great look for a good price","reviewDate":"November 13, 2019","reviewText":"We have a modern kitchen and this kettle looks great on the counter. It works well. The top you just have to remember to push down to close but zero issues so far. Very happy."},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"To hot to handle","reviewDate":"November 13, 2019","reviewText":"The unit was fine but I tried to get on there site to get the free coffee mugs and it wouldn't let me in"},{"reviewerName":"sunil","rating":"5.0 out of 5 stars","reviewTitle":"Good product!!","reviewDate":"November 13, 2019","reviewText":"Great quality and easy to clean !!"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Clean, fast, no smell","reviewDate":"November 12, 2019","reviewText":"Good quality product. Works fast and looks good. It is blue light when you turn it on. I like it!"}],"qAndA":[{"question":"Are there any plastic parts which come into contact with the boiling water?","answer":"No there are no plastic parts that touch the boiling water. the lid and handle have some plastic, but does not touch the boiling water at all. We really enjoy the efficiency of this pot and the fact that is has an added filtration system to it. I hope that helps :-)"},{"question":"How long does the guarantee last","answer":"It has a 3 year gurantee"},{"question":"Can anyone tell me if the electric kettle is bpa free?","answer":"It is BPA Free. All of the plastic is outside the glass kettle, which will not directly contact with water."},{"question":"Where is it made?","answer":"Made in China"},{"question":"Can you get your hand inside to clean the electric kettle?","answer":"Yes, it's a wide opening. I can fit my hand inside, cleans well with the descaler."},{"question":"How tall is this teapot from the base to the top?","answer":"9 inches"},{"question":"How long is the cord?","answer":"The cord is 28 inches including the plug."},{"question":"Does this kettle have a glass base over the heating element or does it a metal base with glass sides?","answer":"It’s a metal base with glass sides."},{"question":"Does this kettle have any plastic or silicone parts that touch water during boiling, or when water's poured from the spout, or through condensation?","answer":"No, bottom the of the lid is stainless steel"},{"question":"Does the water touch any silicone? Is there a silicone layer where the glass connects with the metal?","answer":"No, Glass sides with a Metal Bottom."},{"question":"What is the guarantee on this electric kettle?","answer":"Instruction explains that it comes with 3 year warranty."},{"question":"Does this version have a EU wall plug?","answer":"No it does not have an EU plug. Good"},{"question":"How many watts is it?","answer":"According to the bottom power unit, it is 1000 - 1200 W"},{"question":"How long is the lead of this electric kettle? please","answer":"2.46ft from base to plug!"},{"question":"Where is the product made?","answer":"It says Made in China. But the product ships pretty quickly!"},{"question":"input 110v? 220v? I need 220v??? thank you","answer":"I am pretty sure it is 120v"},{"question":"Is this kettle made in China?","answer":"Yes"},{"question":"Does anyone had problems with the cord? How can I contact the seller?","answer":"No problem with the cord after several months of regular use. If you meet some problems, I would suggest contacting Seller and they will suggest how to proceed."},{"question":"Hello, looks really smart I just purchased one. But can you tell me how long its guaranteed for. Thank you","answer":"3 year warranty. You should have a brochure with it that shows the contact information. You can reach out to them for assistance."},{"question":"Is this electric kettle cordless?","answer":"The base has a cord but the kettle is cordless"},{"question":"Will there be scale in this kettle?","answer":"There was scale yes, but I live in a very hard water area, and it could still be cleaned off with white vinegar"},{"question":"Any problem using this electric kettle for boiling medicinal leaves inside?","answer":"No"},{"question":"How is this a cordless unit?? i very much love the tea pot, but i was under the impression that it was cord less. please help!!","answer":"The base is plugged in with a cord but the teakettle is removed from the base to pour and has no cord attached."},{"question":"After it's boiled does the LED illuminaton switch off, or does it still have some colour on?","answer":"When the electric kettle has finished boiling the water it switches off and light goes out at same time"},{"question":"Is this electric kettle made completely of stainless steel on both the base and the lid?","answer":"The inside top and bottom are stainless steel and decanter is glass. The water does not come in contact with the plastic."},{"question":"does it have keep warm feature?","answer":"It does not."},{"question":"What is the least smallest minimum tiniest amount of water you can safely boil in this kettle? Can it boil only 8 oz?","answer":"120z"},{"question":"What is the minimum volume of water that can be boiled?","answer":"The capacity of it is 7 cups of water or 1.7 Liters."}]}