{"title":"Chefman PerfecTea Programmable Electric Glass Kettle w/Temperature Control & 8 Preset Steep Times Auto Shut Off, Removeable Tea Infuser Included, 6+ Cup Capacity, 1.5 L, Stainless Steel","manufacturer":"Chefman","currentPrice":"$79.99","rating":"4.1 out of 5 stars","totalRatings":"41 ratings","features":["\n         Make sure this fits\n                by entering your model number.\n        \n","Programmable steep times: the Chefman perfectea electric kettle has a digital touch display with programmable steep times and boils water faster than traditional methods. 8 presets included make it easy to get the perfect hot water for your needs; oil, black, herbal, oolong, French press, white, green, and delicate.","For any hot water need: great to make the perfect temperature water for Hot or Iced tea, Coffee, instant oatmeal, baby bottles and more; has an option to keep water at the desired temperature for up to 60 minutes. Bonus tea infuser is included with purchase for brewing your favorite loose-leaf or bagged teas directly in the stain-resistant high-quality borosilicate glass kettle.","Safety features: This kettle has added safety features such as a stay-cool handle to prevent your hand from burning and provides added safety by shutting off the kettle automatically once water reaches a boil. No need to worry about This kettle boiling dry, The boil-dry feature automatically turns the kettle off when there is little, or no water left.","Easy clean: Just unplug the kettle, remove lid, and wipe down with a soft, damp cloth. The kettle has a filter to keep the water/tea clean and only needs to be rinsed with hot water. The tea infuser can be washed in warm soapy water and rinsed thoroughly.","Resources: cetl approved with advanced safety technology for long lasting durability, & 1-year warranty provided by Chefman, so you can purchase worry-free - We've got your back! For information on how to use your product, scroll down for a PDF user guide. 1300 watts/120 Volts"],"reviewsAspects":["keep warm","french press","loose leaf","electric kettle","easy to clean","easy to use","hot water","tea infuser","stainless steel","warm function","different types","steep times","boiling water","glass kettle","control knob","digital touch","tea basket","tea and coffee","cup of tea","leaf tea"],"productInformation":[{"Package Dimensions":"10.4 x 10.2 x 8.9 inches"},{"Item Weight":"4.4 pounds"},{"Shipping Weight":"4.4 pounds (View shipping rates and policies)"},{"Manufacturer":"Chefman"},{"ASIN":"B07TYGG2S3"},{"Item model number":"PerfecTea Programmable Electric Glass"},{"Customer Reviews":"4.1 out of 5 stars\n    41 ratings\n4.1 out of 5 stars"},{"Best Sellers Rank":"#21,738 in Kitchen & Dining (See Top 100 in Kitchen & Dining)\n#123 in Electric Kettles\n"},{"Date first listed on Amazon":"July 8, 2019"}],"productDescription":["With Digital Touch Display has accurate digital temperature control for optimal brewing of various beverages. Boils water faster than the microwave or the stovetop methods, so you spend less time waiting for your delicious hot beverages. Great to make the perfect temperature water for hot tea, coffee, instant oatmeal, baby bottles and more; has an option to keep water at the desired temperature for up to 60 minutes. Bonus tea infuser is included with purchase for brewing your favorite loose-leaf or bagged teas directly in the stain-resistant borosilicate glass kettle. The keep-warm function lets you keep your tea or water hot, so you can have another cup without having to re-boil!","\n","\n","\n","This kettle has added safety features such as a stay-cool handle to prevent your hand from burning and provides added safety by shutting off the kettle automatically once water reaches a boil. No need to worry about this kettle boiling dry, the Boil-Dry feature automatically turns the kettle off when there is little, or no water left.","Digital touch LED display with programmable steep times and boils water faster than traditional methods. 8 presets included make it easy to get the perfect hot water for your needs; oil, black, herbal, oolong, French press, white, green, and delicate.","Bonus tea infuser is included with purchase for brewing your favorite loose-leaf or bagged teas directly in the stain-resistant high-quality borosilicate glass kettle."],"reviews":[{"reviewerName":"C.","rating":"2.0 out of 5 stars","reviewTitle":"Lazy Company = Bad Product","reviewDate":"The manufacturer commented on the review below","reviewText":"Oh boy, where do we start? In theory and on paper, this seems like a 5-star product, but in reality, it is unfortunately an overpriced, cheap product that was pushed out before it was ready by a company that couldn’t care regardless.\n\nLet’s start this off with some PROS/Positives:\n-Overall Visual Appeal\n-Keep Warm w/ Count-up Timer\n-Thick Glass Pitcher\n\nNow the CONS/Issues:\n-No Customer Service\nThe biggest issue is with this company’s customer service, is it’s non-existent. I have emailed them regarding the product as well as issues I have been facing more than I’d like to admit, including reaching out via Instagram DMs, yet not a single response to date. Tip to sellers, most negative reviews (hello there) can easily be avoided by checking emails.\n\n-Blatant Lying/Misinformation\nAs other reviewers have mentioned, this product is labeled and marketed as being 1500 watts when it is only 1300 watts, which is obviously quicker/better than 1200 watts, but nowhere near the speed of 1500 watts. The mislead is a huge deal for those looking for that 1500 watt Godspeed.\n\n-Quality Control/Not Ready Product\nMany people have issues with products made in China, while I understand some can be low quality, these days almost everything is made in China and I have many cheap Chinese products that have outlasted made in USA products, so that’s not the issue. This issue is in the company’s rush to get the product out as soon as possible, without any or very poor QC, allowing a number of errors to slip by and the customer to deal with those consequences, in my case that was missing all rubber feet for the burner, resulting in a base that feels as if my counter top is a production of Disney on Ice. There was also no safety or informational labels (ie wattage, etc.), which is required by law. The product feels naked almost, like a canvas that has a base layer painted, but Bob Ross forgot to paint the trees, clouds, or anything really. There are simple mistakes like leaving out something here or there, maybe no manual, and then there are chunks of simple quality control steps completely disregarded to make a quick buck, this product is unfortunately the latter.\n\n-Overall “Cheapness”\nThe specifications and look of the product, plus being one of the most expensive, non-high end brand (i.e.Breville) Glass Temperature Control Electric Kettle, one would expect to be purchasing a mid-level product, yet what you actually receive is a low-tier, lightweight, inexpensive to produce product with a massive markup, which is unfortunate. The internal “computer” is no different than other similar glass temperature control electric kettle around, it’s almost a complete recycle.\n\nOverall, this product functions, quite literally speaking, but beyond that, its faults come from the company’s laziness, and the inability to deliver a product that functions in reality as it does on paper, even semi-remotely. If you can wait a bit, a handful of Chinese manufacturers/sellers will release products quite similar in look/function as this one, but they will improve majorly on the laziness of this company and include a few other bells and whistles and a better internal computer/functions.\n\nTo end this I’d just like to remind every business owner out there, from startup to small to large, please check your emails, your customers are here to help, listen to what they have to say, even if it may be negative, and use it to improve your company and/or products.\n\nThank you."},{"reviewerName":"Darrick M.","rating":"3.0 out of 5 stars","reviewTitle":"When it works..","reviewDate":"The manufacturer commented on the review below","reviewText":"When this tea maker works it works well, unfortunately it doesn't like to work consistently. The controls don't work very well. It doesn't get to set temp and when it does sometimes it will go to seep mode other times not. Usually I have to do it twice to register and for it to finally go to seep mode. Even then it sometimes just resets and erases seep mode. The pot is easy to clean and when it does work I have no complaints. Perhaps I got a buggy model but it can be very frustrating to just heat water for tea."},{"reviewerName":"Lolina","rating":"5.0 out of 5 stars","reviewTitle":"Terrific Tea Kettle!","reviewDate":"August 29, 2019","reviewText":"As an avid tea drinker, I am very pleased with the Chefman PerfecTea Kettle. Easy and safe to use, programmable for various tea types, boils water quickly, and the built-in infuser is a great plus for brewing loose tea. Beautiful see-through glass, aesthetic delight for the eyes too. Strongly recommend it!"},{"reviewerName":"Tdt","rating":"5.0 out of 5 stars","reviewTitle":"Exactly what I wanted!","reviewDate":"August 21, 2019","reviewText":"This is perfect for brewing tea at my office! The water heats super quick and the steep function is great. Perk that it also looks super cute."},{"reviewerName":"PHIL C","rating":"5.0 out of 5 stars","reviewTitle":"excellent product","reviewDate":"August 12, 2019","reviewText":"The commodity meets all my expectations resulted from the extensive research."},{"reviewerName":"Drew S. Ellenwood","rating":"5.0 out of 5 stars","reviewTitle":"Great tea in minutes","reviewDate":"September 5, 2019","reviewText":"Easy to clean, quiet, sometimes too quiet when you go off and forget the timer. Several selections for kind of tea and steep time. Basket for loose tea easy to clean."},{"reviewerName":"GERMAN FERNANDEZ","rating":"5.0 out of 5 stars","reviewTitle":"Make your own tea and save a buck.","reviewDate":"October 27, 2019","reviewText":"Wow, impressed.\n\nNo more buying tea at work.\n\nAmazing quality of product and tea tastes so good I can't believe it. Best product to have and savings will pay for itself in no time. I spent $2.75 plus tax per tea in downtown NYC almost everyday.\n\nI recommend it if you spend money on breakfast drinks. Make your own and save a buck.\n\nThanks"},{"reviewerName":"Soheila","rating":"5.0 out of 5 stars","reviewTitle":"Cute and efficient and fast!!","reviewDate":"September 2, 2019","reviewText":"I loved the fact that it bright the water to boil so\nQuickly! And the lid\nWould\nCome\nOff for easy cleaning ,It’s a little complicated with the delay button but i still haven’t had the chance to\nRead the manual"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Great Kettle","reviewDate":"October 12, 2019","reviewText":"Tried several other kettles and this one was the best has a timer boils relatively fast and maintains temp for a hour just love it!!!"},{"reviewerName":"Tigerlillian","rating":"4.0 out of 5 stars","reviewTitle":"Essential appliance for tea aficionados and French press drinkers!","reviewDate":"The manufacturer commented on the review below","reviewText":" This kettle is wonderfully equipped with well-thought out features. It's perfect for brewing all kind of teas and coffee. I had purchased a programmable tea kettle not so long ago, also stainless and glass with removable basket, and was looking for a second unit for my workspace, since I drink coffee, oolong, rooibos and green tea regularly, all requiring different steep temperatures and times. Since that purchase, I came across this Chefman and liked the features that my other didn't have:\n\n- FAST AND POWERFUL BOIL: this one rates at 1300W, more powerful than my other 1200W, but it's not 1500W per the listing description. I was a bit disappointed with the misinformation but it's still faster than my other kettle. Additionally, there is no third grounding line in the cord ** UPDATE: wattage has been corrected in listing since initial review **;\n\n- PREPROGRAMMED STEEP TIME: after your water boils, you can time the steep by pushing in the control knob. You can also change these preprogrammed recommendations;\n\n- CUSTOM SETTING: The very last programmable option can be set for your own desired temperature and steep time. I found that the steep time has to be set every time, but the temperature remains in memory. I love drinking French press coffee every morning and the preset here for FP doesn't have a programmed steep time (as it will vary with different types of coffee), so I use the custom setting for my morning brew and program the steep for 4m 30s (with the recommended 200 degree F boil). Unfortunately, I have to set the custom steep timer every morning unlike the preprogrammed steep times, but it's a handy feature I still utilize ** EDIT 8/9: somehow the custom steep time was kept in memory this morning when I went to prepare my coffee, when it hadn't until today. I'm not sure what I did different, but I'm very happy with this! Will update if I figure it out or if anything changes **;\n\n- KEEP WARM: this function will stay active for up to one hour after the steep time has lapsed, or straight after boiling is done if there is no steep time activated. It will continue to keep warm even if you remove the kettle from the base to serve or otherwise, and then replace. My other kettle's keep warm function deactivated as soon as the kettle was lifted from the base. Just press Start/Stop to terminate this function;\n\n- DELAY BOIL TIMER UP TO 24 HOURS IN ADVANCE: There is no clock built into the kettle, so you can't program it to boil at a specific time, but you can set a countdown to start. My other has an autostart of only 12 hours in advance;\n\n- SAFE LID: Only need to remove the center part of the lid to attach the tea basket, not the whole lid, which makes this safer after the water has boiled.\n\nI do find myself wishing that the lid seated a little more securely as the rubber seal seems to fit rather shallow in the glass. Also the lid's center piece is a little loose if the tea basket isn't attached, but I don't anticipate it will fall out when pouring -- there is a just a little play after the lid center is locked in place. The looped silver handle on the lid is plastic. I guess this is safer to handle after boiling as it doesn't get hot like metal, but it feels a little less substantial than the rest of the materials. The main side handle is also plastic, and the silver part of it is not heavy weight material either. The black plastic parts feel a little better quality.\n\nThe lid fitment, silver plastic, and the misrepresented wattage compelled me to reluctantly deduct a star. Otherwise, I think this appliance is the best featured programmable kettle that I've found to date, that any tea aficionado will truly appreciate having in their kitchen."},{"reviewerName":"Mark Y","rating":"5.0 out of 5 stars","reviewTitle":"Nice looking, super fast kettle","reviewDate":"August 12, 2019","reviewText":"This is a very nice kettle and works perfectly. You can heat up to 8 cups at a time (make sure not to overfill too avoid spillover). There are multiple pre programmed settings that you can customize by temperature and steep times such as boil, black, green, oolong, delicate and custom. This kettle is fast! Once you turn in ot you can see the water rapidly heating and when it comes to a full boil it's stronger than boiling water in a pot on the stove. It comes with a teainfuser that snaps into tree lid for steeping tea. (Do not add tea until it prompts you to or it will foam up and boil over when it hits temp). The keep warm feature is also a nice touch keeping tea at temperature for up to 4 hours. The unit has auto shut off, activated either 4 hours after brewing or when fluid levels become too low. It looks great with my other stainless appliances and is very easy to clean.\n\nThere are a few discrepancies in the product listing. The wattage is slightly lower but you'd never know it and most disappointing, though the ad states the pot and the handle light up they DO NOT! The only led lights are around the controls. At first I thought maybe I had a defective one but there's nothing in the product manual. After checking the manufacturer's website I confirmed this unit doesn't light up, they offer a different model that does."},{"reviewerName":"Doc H","rating":"5.0 out of 5 stars","reviewTitle":"Perfect Tea Kettle","reviewDate":"August 11, 2019","reviewText":"For cost, performance and value this product rates a 5. It does everything you need in an electric tea kettle - auto-programming, auto-shutoff, multiple automatic settings, delayed turn on, keep warm, easy to use and clean - it's a very well thought-out device.\n\nAs far as heating, it brought 5 cups of RO (reverse osmosis) water - no dissolved solids or minerals - to a full boil from 78 degrees in just over 5 minutes. It has automatic temperature program settings for five different varieties of tea or French Press coffee, boiling, or a custom setting you personally can set for time and temperature, and the temperature is displayed on the control panel as it changes. The recommended steep time automatically comes up for the type of tea you select, and you can easily increase or decrease that with the control knob. The keep \"warm\" function is actually a misnomer, because it keeps the water heated - including boiling - to the exact temperature you set. It comes on automatically after it reaches the set temperature, and turns off after an hour, with a \"count up\" feature on the display to show you how long it's been on. The glass carafe gets hot of course, but the insulated handle and the lid ring stay cool to the touch. It will automatically shut off if the water gets too low before the kettle burns. The kettle, lid and strainer are all easily separated for cleaning, and only glass, silicone or stainless steel ever touch the water. And 1300 watts probably won't overload most kitchen circuits.\n\nIt's a feature-rich appliance, more remarkably because of the price, and you could buy three of these for the same price as a famous brand-name competitor with very similar functions. Maybe not as robust, and time will tell on durability, but it's an incredible bargain for what it does. Highly recommended."},{"reviewerName":"Adam in the SF Bay Area","rating":"5.0 out of 5 stars","reviewTitle":"Thoughtfully designed, easy to use, and even has clear instructions!","reviewDate":"September 8, 2019","reviewText":"This kettle has been a delight to set up and use!\n\nPROS:\n- Well packed\n- Clear getting-started and main documentation... and all in well-written English! No need to skip through multiple languages. Why don't more companies do this?!\n- Kettle is comfortable to hold, easy to clean\n- Display is easy to read, with fairly large type\n- Beeps make it clear when the kettle is securely placed on the heating element and when it's removed.\n- Kettle has nicely clear measurement lines (2 cups, 3 cups, etc.)\n- Temperature and delay time setting is convenient and granular.\n- Lights around the action buttons make it clear when things are activated (e.g., red for heating, etc.)\n- Rubber feet secure the unit securely, so light bumps don't result in spills.\n\nMEH OR THUMBS DOWN:\n- Doesn't heat quite as fast as my older, simpler kettle\n- I don't see any way to actually turn this thing off; display is always on unless it's unplugged.\n- Could do a better job indicating current status in some ways... e.g., instead of just showing current temperature (120), show 120 --> 160. Same with delay (e.g., \"Heating at 7:30am\" would be nice).\n\nTea infuser and the well-marked cap that the tea infuser replaces... all very straightforward! Both click into place securely and clearly."},{"reviewerName":"Sagewood","rating":"4.0 out of 5 stars","reviewTitle":"Good change from traditional kettles","reviewDate":"August 28, 2019","reviewText":"When I got this Chefman PerfecTea programmable electric glass kettle I thought it was just going to be a normal glass kettle but then I pleasantly surprised to find out it was way more than just a glass kettle. It comes with a digital touch screen display that has a digital temperature control which I really like a lot. I was able to test out the functionality of the kettle and was just boiled the water and tea to my desired and pre-set temperature. It is very unlike the traditional kettles that just boils the water until the water starts to spill over, indicating that it was at a boiling point. The kettle also has an option for brewing a variety of beverages, not only does this kettle have a bunch of cool features it also has a good capacity of 1.5L which is a lot more than the old styled kettles that I’ve owned previously. I didn’t test or compare if it does better than microwave or stovetop ( maybe in the future and if that happens, I will update this review), but for now, it does meet my basic needs."},{"reviewerName":"Rayleigh Gray Setser","rating":"4.0 out of 5 stars","reviewTitle":"A great kitchen asset!","reviewDate":"August 26, 2019","reviewText":"This electric kettle is so neat! I had been looking for a kettle just to boil water in for my tea, but this one has a tea steeper that can attach to the lid, so it can work similarly to a French press (just without the press). So I figured I'd give it a try!\n\nIt's very easy to use and works very quickly. Once you turn it on and choose your setting (boil, herbal teas, french press, etc) it immediately begins heating up and it has the water boiling in about 2 minutes (the most water I ever put in it was 6 cups, so that was only half full). It also has a feature that once it reaches the temperature of your setting, it will keep it at that temperature until you turn it off and it sets a timer, so if you want your tea to steep for precisely 2 minutes after the water began boiling, you can program it to let you know :)\n\nI really like it because you can make tea in a pot that doesn't take up space on the stove. When I cook I don't like having more than one burner on, because my counter is so small that I typically have to use part of the stove as a counter. So since we usually make sweet tea to go with dinner, having this kettle in the corner has really helped to speed up dinner, plus the tea is finished much quicker in this kettle than the traditional way on the stove.\n\nMy only complaint is that the shiny finish on the (inside) bottom of the kettle began to look worn after only two or three uses. I don't have a dishwasher, so it was washed by hand after both uses and it has lots of spots where it's beginning to look rough. I know that it would begin to show it's use after a while, I just wish the shiny finish would have lasted a little longer than it did.\n\nBut overall, I've really enjoyed using this electric kettle and I think it's a great buy!"},{"reviewerName":"Blake Fraina","rating":"5.0 out of 5 stars","reviewTitle":"Multi-Functional","reviewDate":"September 1, 2019","reviewText":"When I was in college, a British friend always kept his Russell Hobbs electric kettle on the kitchen counter for tea. A big tea drinker myself, since then I've always coveted one of my own. I recently acquired a no name brand kettle that boiled water quickly and turned off automatically but pretty much did nothing else. It was extremely basic but I liked having it and knew I'd never be without one again.\n\nThis Chefman programmable kettle is a big upgrade. First of all, it's so much more attractive. It's clear glass (with measure markers on the outside) as opposed to cheap metal. It includes a diffuser basket so, if you desire, you can steep tea (or coffee!) directly in the pot. Since I don't want to discolor the inside of the glass, I haven't tried this yet, but appreciate the fact that the pot is programmable so that you can steep different beverages (Oolong, Black, Herbal, White, Green, Delicate and French Press) at the optimal time and temperature. There is also a basic \"Boil\" setting, which is what I've been using. The digital read-out displays the temperature, so you can see how close you are to a good boil at any point in the process. And once the water is boiling (which is lightening fast) it beeps to let you know. But, possibly the best thing about this kettle is that it continues to keep the water boiling (for a maximum of 40 minutes, I believe) unless you manually switch it off. For someone like me, who enjoys multiple cups of bagged tea on the weekends, that's a big plus.\n\nThis is a great kettle with a lot of upgrades from the more basic models out there. Definitely worth it for anyone who enjoys a good cup of tea."},{"reviewerName":"Ma'ama","rating":"5.0 out of 5 stars","reviewTitle":"A kitchen essential that safely heats up water.","reviewDate":"August 17, 2019","reviewText":"This has become an essential piece in my kitchen. I use this to make coffees, teas, oatmeal, and instant noodles. This is so much better than having to boil water on the stove or in the microwave. It seems safer because the handle stays cool, so I don’t worry about burning myself. I like that this automatically shuts itself off."},{"reviewerName":"Katharine R. Mueller","rating":"5.0 out of 5 stars","reviewTitle":"Functional and Modern","reviewDate":"November 11, 2019","reviewText":"Beautiful tea pot! Appearance is vary sharp and modern. I love fresh brewed hot tea and this product gets each cup right! Proper temp control for steeping different types of teas makes a big difference. I highly recommend to anyone who cares to enjoy their tea!"},{"reviewerName":"Infinite Mind","rating":"4.0 out of 5 stars","reviewTitle":"Nice Innovation and Programmable","reviewDate":"September 18, 2019","reviewText":"Big container brew tea without having to use stovetop or microwave. Loose tea in center input that is programmable and can brew several hours."},{"reviewerName":"Mitchel Stivason","rating":"4.0 out of 5 stars","reviewTitle":"Great $70 tea kettle, don’t expect $200 quality.","reviewDate":"August 26, 2019","reviewText":"I have made 10+ pots of tea including earl gray, white peach, and English breakfast using both loose leaf and tea bags. Loose leaf teas taste very good. The timer for each kind of tea is great to make sure you are steeping at the preferred amount of time and temp. I do like that it will keep your tea hot for one hour after brewing, but wish that could be adjusted.\n\nThe bottom of it did spot as others have noted, however, it is not tangible rust or anything that could distort the flavor of the tea. This is a $70 tea kettle that cut corners by using thinner grade stainless steel than you would find in a $200-$300 brand tea pot. If you don’t want the spots, buy a more expensive kettle."},{"reviewerName":"Joe Mannor","rating":"3.0 out of 5 stars","reviewTitle":"Best of the worst","reviewDate":"November 8, 2019","reviewText":"Base unit: 5/5 stars\nLid and tea filter: 2/5 stars\n\nPros:\n- Attractive, doesn't look cheap, nice lighting\n- Nice interface, temperature seems precise\n- All metal and glass contact with water\n- Keep warm performs well without intervention\n\nCons:\n- Not a flip top\n- Center top is loose and rickety\n- Tea basket is worthless: holes are way too big for any reasonable loose leaf tea. The basket is also loosely connected to the already loose top. It seems like it could fall at any moment.\n\nConclusion: I'll probably keep the unit, not use the tea basket, and just pour my perfectly heated water into another teapot. I haven't found anything better for <$100 on amazon."},{"reviewerName":"Honest Shopper !","rating":"1.0 out of 5 stars","reviewTitle":"Mine was defective","reviewDate":"The manufacturer commented on the review below","reviewText":"The first time I filled this it leaked. I sent it back after I argued with the Amazon rep. for 20 minutes"},{"reviewerName":"Rachel","rating":"3.0 out of 5 stars","reviewTitle":"Used?","reviewDate":"The manufacturer commented on the review below","reviewText":"Looked like it was used."},{"reviewerName":"Charles C. Caporiccio","rating":"5.0 out of 5 stars","reviewTitle":"purchased as a gift","reviewDate":"September 28, 2019","reviewText":"My daughter says the kettle is \"perfect\",makes good brewed drinks easily . She loves it!"},{"reviewerName":"H. Bina","rating":"4.0 out of 5 stars","reviewTitle":"Turns off too fast","reviewDate":"September 28, 2019","reviewText":"Perfect function. The only issue I have is the timer which maximum setting is one hour. It would be better ifI could have set it at a longer time."},{"reviewerName":"dnkb","rating":"4.0 out of 5 stars","reviewTitle":"For the tech enthusiast who adores tea...","reviewDate":"August 19, 2019","reviewText":"So here's the thing: I adore tea and coffee. At my house, we make tea and coffee by the bucketload every day. One of the members of the household is even a barista (and has taught us all to make relatively decent drinks), so we are kind of coffee and tea snobs.\n\nAnd the way we always made tea is by boiling water, and pouring that boiling water over either tealeaves in a teapot, or teabags in a teacup.\n\nSo this Chefman Programmable Electric Glass Kettle added a whole new dimension of excitement to the tea-brewing morning ritual. It brings water to the exact temperature that your particular tea requires--delicate teas, white teas, green teas, good 'ol black teas, etc. Then it can hold the water at exactly that temperature while it steeps the tea.\n\nYou steep the tea by pouring the appropriate amount into a metal mesh basket that connects to the inside of the kettle. After the water has heated, you insert the basket into the lid, and lower the basket into the water, infusing the water with the tea leaves. You can program the kettle to steep the tea for whatever time you wish, or use the pre-programmed steeping times.\n\nI had a perfect cup of tea steeping to my own temperature and specifications. Smooth and flavorful. The thing is, sometimes I feel that everything is so...technical nowadays. My friends and I go to teahouses on a very regular basis. We enjoy the ritual of pouring boiling water over tea leaves. We even use tea cosies!\n\nBut I have to say that using this kettle to boil water is amazing--it heats up water extremely quickly. I'd be hard-pressed to put a tea cosy on top of it, however.\n\nI know that plenty of people will love this kettle. I find it extremely useful to use, making the perfect cup of tea: no bitter taste of tannin, yet strong, the way I like it. All the pre-programmed settings can make it easy to find the correct settings for other everyday uses, as well."},{"reviewerName":"Inked Phoenix","rating":"5.0 out of 5 stars","reviewTitle":"A really nice, easy to use, multi-option kettle (a review with pictures)","reviewDate":"August 14, 2019","reviewText":"I am a big fan of tea- I do both loose and bagged. I know that using the wrong temperature of water can cause a tea to become bitter or not taste the way it should. Beyond your typical stovetop water kettle I also have an electric kettle that simply boils water quickly and was not made to also brew the tea or to be set at any particular temperature. When I was offered this to try I was very excited about finally having a way to correctly brew my tea (and beyond).\n\nOne of the features about this particular product that I think they don't make enough of is the use of borosilicate glass. This is the type of glass that is used in labs and is less subject to thermal stress. This is the kind of glass that USED TO (because the new stuff doesn't use it anymore) make Pyrex a fridge-to oven-to table glass. That being said it's not a heavy kettle- which in my opinion is a good thing since it's not going to make for a super heavy kettle to carry when full- and because of the glass it will retain the heat just a bit better than your typical plain glass coffee pot, and be quite a bit more durable as well.\n\nI used the quick start guide to brew my first pot of loose leaf white tea. The instructions are simple and there are a lot of preset options. I set it for white and it takes the water up to temp, THEN you take off the inner lid (simple twist and pull from the center stainless lid ring- that once locked operates as one whole lid) place and twist your tea infuser, then press the button for your steep tme. It will beep when steeping is done. The instructions recommend a lift (of the kettle) and swirl before removal of the tea basket (and if you're not brewing a lot like me, I only did 3 cups, swirling is a good thing). Once you remove the basket and pour your cup- place the kettle back and it starts a count UP timer for 60 minutes for the keep warm function. When 60 hits it beeps when it turns off. I will also point out the beeping is not obnoxious in any way.\n\nThe only things that I'd point out that may bother some is that while it is on the keep warm function it \"clicks\" on/off (heating element I'd bet), but it did it's job and kept the tea at exactly the right temperature.\n\nThough lightweight overall this kettle does not feel or look cheap at all. Actually the design is quite pleasing and it's very easy to operate. The instruction guide itself is not much bigger than the quick start guide it just has a few further bits of information about it (cleaning, trouble shooting, etc- and no you cannot submerge the bottom of this kettle- hand wash!). It boasts your typical electric appliance 1 yr warranty. I will be plugging/unplugging when I want to use it but it can also keep time and be programmed to start your boil. The base had a keeper for the cord so if you're storing it can be wound or if you're leaving on the counter it can be lengthened or shortened as needed. It has a lot of nice features and a good look about it. I'm excited about its future use in my household."},{"reviewerName":"bjjoggs","rating":"5.0 out of 5 stars","reviewTitle":"This Tea Kettle I love It!!!!!!!!","reviewDate":"August 7, 2019","reviewText":" All I can say is modern, classic, and unique.\n\nLet’s start with the Glass Kettle. It is beautifully designed. It will blend in with any kitchen decor or should I say it will be a statement piece. It is stain resistant. It is recommended to use filtered water for the best tasting results. This kettle heats up so fast.\n\nThis kettle also has a lot of great safety features built-in. Do not worry about leaving it on because it automatically cuts off when keeping warm time expires in 60 minutes. Also, you do not have to worry if the kettle becomes dry or very low on water, it will cut itself off automatically.\n\nThere is also a bonus tea infuser included. It is so easy to attach to the kettle lid. Just a twist and a turn and it is ready for my loose leaf tea or hot water. Just 1-2-3.\n\nThe.stainless steel base is user-friendly. It has a Lighted Digital Touch 8 presets programmable steep times for all different type of teas and hot water. It is so easy to select a program. Not a lot of steps to set up. Just turn the control knob on base and choose. That's it. Once it reaches the temperature you select, it will illuminate on the base. Then it will go into warming mode for an hour. Then it automatically turns off. You can manually shut off also.\n\nAlso, it has a program for boiling hot water for tea bags, instant coffee, instant oatmeal or grits, and so much more.\n\nI love how the short cord has a storage holder. It is located the underside of the base. Keep cord neatly tucked away while not in use.\n\nThe best part for me is, it has a delay timer. I am in a rush all the time. Also forgetful too. You just program it on the base. If you want it to start it before you get out of bed or just before you go to bed, it will be ready whenever you are ready.\n\nThis Stainless Steel 6+ cupsTea Kettle and the Base are easy to clean. Do not submerge the underside of kettle or base in water or any liquid as instructed. Descaling for the kettle is also recommended once a month with white vinegar.\n\nThis is a great programmable tea kettle with base. A lot of built-in safety features. I love that I can preset times when I want the tea-kettle to start meaning it can be ready at any time with my tea or hot water. Best part if I leave home quickly and worried about if I left it on. My mind will be at peace because I know that it will turn itself off.\n\nI would buy this as a gift for my friends or family members."},{"reviewerName":"Lashello","rating":"4.0 out of 5 stars","reviewTitle":"Quality Kettle","reviewDate":"September 2, 2019","reviewText":"As someone who drinks large quantities tea, this kettle has changed the game for me. I typically use my electric kettle, boil water and then forget about it. This kettle is great since it steeps the tea and keeps it warm if you forget about it, it’s a nice feature if you're forgetful like me. It had safety lid features which is nice, and it's rated 1300 watts/120 Volts\nwhich is fast.\n\nIt is great if you enjoy several cups of tea at a time, but it may be too much for people who enjoy single cups. In that case using this kettle for just hot water also works. The water temperature feature has worked wonderfully for my herbal teas and the LED lights are a nice aesthetic touch.\n\nOverall, Really nice-looking and well-functioning kettle! I’m really loving it. Highly recommended"},{"reviewerName":"Jennifer","rating":"5.0 out of 5 stars","reviewTitle":"Excellent Tea maker","reviewDate":"August 13, 2019","reviewText":"I really love this tea maker. I have had a variety of tea makers in the past and have found them all useful, but this tea maker is a cut above. It does heat very quickly to the perfect temperature for the type of tea. It also has a stay warm button that is fantastic. It is chick and modern with a wonderful stainless steel base, glass kettle. The base also has easy to read, use buttons and is small enough to fit on the counter without being obtrusive.\nYou can either just boil the water or use a few TBS of loose leaf tea to make up to 6 Cups.\nI am very happy with this product and plan on purchasing another for my daughter.\nFrom the manufacturer:\nProgrammable steep times: the Chefman perfectea electric kettle has a digital touch display with programmable steep times and boils water faster than traditional methods. 8 presets included make it easy to get the perfect hot water for your needs; oil, black, herbal, oolong, French press, white, green, and delicate.\nFor any hot water need: great to make the perfect temperature water for Hot or Iced tea, coffee, instant oatmeal, baby bottles and more; has an option to keep water at the desired temperature for up to 60 minutes. Bonus tea infuser is included with purchase for brewing your favorite loose-leaf or bagged teas directly in the stain-resistant high-quality borosilicate glass kettle.\nSafety features: This kettle has added safety features such as a stay-cool handle to prevent your hand from burning and provides added safety by shutting off the kettle automatically once water reaches a boil. No need to worry about This kettle boiling dry, The boil-dry feature automatically turns the kettle off when there is little, or no water left.\nEasy clean: Just unplug the kettle, remove the lid, and wipe down with a soft, damp cloth. The kettle has a filter to keep the water/tea clean and only needs to be rinsed with hot water. The tea infuser can be washed in warm soapy water and rinsed thoroughly."},{"reviewerName":"Myra","rating":"5.0 out of 5 stars","reviewTitle":"ALMOST perfect","reviewDate":"August 28, 2019","reviewText":"I am so excited to have this pot. Glass (transparent) pots are the best for loose leaf and flowering teas!! And any tea that’s pink/red.\n\nI also have a Chefman waffle maker that I love so I was hoping for that same quality. As far as basic functions, it’s great, I love it. It’s easy to use, it heats up the water, the tea infuser actually works.\n\nWhen we get into the fine point of keeping warm, however, it is frustrating.\n\n“Stay warm”, which it will do automatically after steeping, is not keeping it warm. It’s keeping it at the same temperature you set it to steep the tea. Meaning for black teas, that’s 212°. That’s not warm, that’s tongue-burning.\n\nTo get around that, after your tea is ready, you can set the kettle to a custom temperature, then let it stay warm from there. However, you can't do it right away.\nIf it’s already heated up for 1 setting, it won’t let you set for another. e.g. I set it to black and it’s at 212, it stops. I want to change it to green and have it reset the steep timer, so I set to green, set the steep, and hit start… nothing happens. You have to wait until the temperature drops below what you want to set it to. (This is what prevents you from setting it to stay warm at a reasonable temperature immediately. You have to come back later.)\n\nLast little pet peeve, the max is 1.5L which is halfway up the thing. So the pictures that show the water so far up are not accurate. But it gives it room to boil.\n\nSo it’s ALMOST perfect. I wish it let you set a lower temperature. But overall, the ability to set different temperatures, the ease of boiling water and making tea in the same pot, the pretty transparency of the pot—these are all appealing. Everyone at work likes the new pot, and I think people are more inclined to drink the tea when they can see it!"},{"reviewerName":"David Bradshaw","rating":"5.0 out of 5 stars","reviewTitle":"Love this kettle","reviewDate":"August 29, 2019","reviewText":"This kettle is super easy to use and works great. Just add water and hit start to boil. Turning the dial lets me pick different types of tea if I am making tea. The tea holder works great and I just pour some loose leaf tea in and add at least like 3 cups of water and I get great tea. I wish it would auto steep once it got to the temperature without me hitting ok, but otherwise super easy to use and no issues. Cleaning is easy, just dump used tea leaves in the trash and wash rest down drain. It boils super quick in about 3 minutes which is awesome. It looks great in the kitchen and has keep warm feature which is nice for large pots of tea. Im super happy with this and it makes brewing tea simple and effortless and is great for ramen."},{"reviewerName":"G. M. C.","rating":"5.0 out of 5 stars","reviewTitle":"I LOVE TEA AND THIS IS THE PERFECT LITTLE POT TO MAKE IT IN ! ! !","reviewDate":"November 9, 2019","reviewText":"This is a beautiful little tea pot, with the controls all on a panel in the front, easy to see and work. A neat feature is that it comes with a removable tea infuser and if you like using loose teas, this is one benefit you will use often. While it has a 6 cup capacity, you don't have to make that much. It is sort of unique, because it has 8 preset options as to the type of teas being used and how you want to make them (example: delicate). Two great features are that 1) It has protection so that you cannot boil the pot dry (big feature) and 2) It has a \"keep warm\" function (which I use often). Prior to this pot, I made all my tea in the microwave and after getting this pot, I can't believe the difference. Forget the \"fast and easy\" feature to using the microwave and adapt to using this pot for my tea from now on!!"},{"reviewerName":"Repro63","rating":"5.0 out of 5 stars","reviewTitle":"Cool hot Kettle","reviewDate":"August 12, 2019","reviewText":"What will Chefman think of next. I am a fan of Chefman products, and this Kettle is cool. It is not just for boiling water. If fits our lifestyle perfectly. I drink different tea's, my wife drinks coffee and uses a French Press. This Kettle allows you to boil the water, and through the opening in the lid you can put your tea into the infuser, snap it to the lid and program a steep time for various teas. It will let you know when it is ready, and it keeps your tea warm too. Great for tea drinkers. You can set it for French Press and it boils the water to the perfect temperature for it. Whether you drink is tea, coffee, or you need to quickly boil water, this Kettle will serve you well. it is a great quality product that looks great as well. We love it."},{"reviewerName":"WT","rating":"5.0 out of 5 stars","reviewTitle":"Makes excellent tea","reviewDate":"August 15, 2019","reviewText":"I'm not a hardcore tea drinker but I do drink it on occasion. When I do make tea, I simply boil some water, pour it over the tea and let it seep. I didn't know anything about temperatures and seep times until I got this kettle. Boy, it sure makes a difference in how the tea tastes. When I received this kettle I read the manual, removed the it from the packing and washed it. After letting it dry thoroughly, I followed the instructions to make 6 cups of green tea. It's very fast and the programmable temperature and seep time made it foolproof. When it was done, I got to enjoy some of the best tasting green tea I've ever had. This kettle gets two thumbs up."},{"reviewerName":"DelusionalAngel","rating":"5.0 out of 5 stars","reviewTitle":"I love it","reviewDate":"September 6, 2019","reviewText":"I’ve tried three or four kettles since becoming a tea drinker. This is by far my favorite so far. I had a nice ceramic one by Bella, it had temperature control but no steeping basket and died after three weeks of use and the company never responded. So I tried a more simple generic kettle that just boiled. Nothing fancy. Then I discovered this one.\n\nBeen using it for months with no issues. In addition to presets, you can customize temps/steep time. Easy to use. Makes tea perfectly. I have zero complaints. Will update this if that changes, but so far, it’s amazing."},{"reviewerName":"kbb","rating":"5.0 out of 5 stars","reviewTitle":"Makes the perfect cup of tea","reviewDate":"September 7, 2019","reviewText":"This is very easy to use and makes an excellent cup of tea! It comes preprogrammed for the different types of tea so only a button needs to be pushed for the perfect cup. It heats water faster then anything else I have so is great anytime hot water is needed such as soups or oatmeal. This can be programmed to start anytime you would like so it’s easy to have your tea first thing in the morning."},{"reviewerName":"Jaime G","rating":"5.0 out of 5 stars","reviewTitle":"Very nice electric kettle","reviewDate":"August 12, 2019","reviewText":"This is a beautiful electric kettle and will make a great gift for someone. Or put it on your counter and make yourself tea or some coffee."},{"reviewerName":"Mia","rating":"5.0 out of 5 stars","reviewTitle":"Heats up quick.","reviewDate":"October 7, 2019","reviewText":"Good electric kettle. Works great.\nHeats up quick.\nEasy to clean.\nLove it!!!"}],"qAndA":[{"question":"Is this product made of plastic and glass or metal and glass?","answer":"Some plastic parts in the base and handle, but everything that touches water is either glass, silicone or stainless steel, very easy to clean. The lid ring actually is some sort of light plastic, but that prevents it from being too hot to touch when you lift it off to attach the infuser - some parts SHOULD be plastic.… see more"},{"question":"Does the tea holder contain aluminum?","answer":"Yes. It does."},{"question":"Dual voltage? 110-220v?","answer":"No. 110v only"},{"question":"What's the delay button for?","answer":"Set it to start at a later time"},{"question":"does this kettle has daley start function?","answer":"yes"},{"question":"What kind of material is the lid made of? Plastic? Aluminum? Steel?","answer":"It’s made of steel."},{"question":"Can you make coffee?","answer":"probably not but for tea its perfect"},{"question":"What the lowest temperature I can get?!","answer":"The manual says the lowest temperature is 106 degrees. The temperature is set by the type of tea you’re brewing or it can be set manually."},{"question":"Can you set a time for it to start boiling on its own?","answer":"Yes. You can program when to start boiling, when to shut off and also able to control and maintain set temperatures as needed."},{"question":"Can we change the steep time?","answer":"Yes you can it’s adjustable"},{"question":"Does this contain lead or anything else carcinogenic? Does plastic or aluminum come in contact with the water?","answer":"The only things that contact the water are the glass carafe, the stainless steel basket and the silicone seal."},{"question":"Is it 110-220V?","answer":"110 Volts"},{"question":"Is this dual voltage? 110-220V?","answer":"110 -v only"}]}