{"title":"Dezin Electric Kettle Water Heater Upgraded, 2L Stainless Steel Cordless Tea Kettle Boiler, Fast Boil Water Warmer with Auto Shut Off and Boil Dry Protection Tech for Coffee, Tea, Beverages","manufacturer":"DEZIN","currentPrice":false,"rating":"4.6 out of 5 stars","totalRatings":"73 ratings","features":["\n         Make sure this fits\n                by entering your model number.\n        \n","Classic Design - The classical mirror polish of the appearance makes the tea kettle unique and aesthetic, which can match any type of kitchen design. Also, the simple one-touch on/off switch button is easy for operating.","Cost-Effective - We strive for high quality with affordable price. The tough pure metal stainless-steel build makes it very sturdy and the inside part is only made from premium food grade stainless steel that keep your water out of the contamination from plastic materials and chemicals.","2L Capacity - The electric kettle has a total capacity of 2 liters and consumes 1,000 watts of power but only for a short period so it can save more time for boiling in the long run. You can easily and quickly use it to prepare your coffee, hot tea or milk at anytime and anywhere.","Safety Design - Equipped with auto shut off and boil-dry protection safety engineering technology with the three-prong plug. This water heater can be lifted off the base for use without the hazard of cords and the handle comes with a soft non-slip material and a heat resistant design.","Sincere Service - Dezin electric kettle is manufactured under strict quality standards to give our customers the best experience. For any problems, you could contact our customer service team and we will reply to you immediately to solve any of your worries."],"reviewsAspects":["electric kettle","stainless steel","easy to clean","easy to use","hot water","value for money","highly recommend","happy with this purchase","drink hot","water quickly","worth the money","works well","use and clean","worked great","great price","great electric","long time","great quality","money love","good quality"],"productInformation":[{"Product Dimensions":"6.3 x 8.3 x 8.6 inches"},{"Item Weight":"2.05 pounds"},{"Shipping Weight":"2.05 pounds (View shipping rates and policies)"},{"Manufacturer":"Dezin"},{"ASIN":"B07VKT561K"},{"Customer Reviews":"4.6 out of 5 stars\n    73 ratings\n4.6 out of 5 stars"},{"Best Sellers Rank":"#1,111 in Kitchen & Dining (See Top 100 in Kitchen & Dining)\n#15 in Electric Kettles\n"},{"Date first listed on Amazon":"November 12, 2019"}],"productDescription":["\t\t\n\tDezin Stainless Steel Electric Kettle\tDezin Glass Electric Kettle\nPower\t1000W\t1200W\nBase\t304 Stainless Steel\t304 Stainless Steel\nCapacity\t2L\t1.5L\nThermostat\tPremium\tPremium\nBoil Dry Protection\t✓\t✓\nAuto Shut-Off\t✓\t✓\nIndicate Light\t✓\t✓"],"reviews":[{"reviewerName":"Hellen Nguyen","rating":"5.0 out of 5 stars","reviewTitle":"Great Electric Kettle with Great Price!","reviewDate":"October 4, 2019","reviewText":"I was little bit hesitate before buying this electric kettle because the price is cheaper compared to the other electric kettle, but after reading the product descriptions, I decided to check it out. I’ve had it a week now and I am very happy with my purchase. It makes with stainless steel, and It boils water extremely fast. I don’t need to wait for a long time to have boiled water for my coffee in the morning as I used to with my regular kettle in the gas stove. It is small, but it holds over 4 cups of water. Highly recommend to everyone."},{"reviewerName":"Simon L","rating":"5.0 out of 5 stars","reviewTitle":"So worth the money,I love it!","reviewDate":"October 7, 2019","reviewText":"The kettle boils very hot water quickly for instant coffee, tea and soups.. Fits enough water for serving many cups of tea/coffee at once, heats up fast and is pretty easy to clean. Nothing too special, but works great! I think the price is very reasonable and I definitely am happy with this purchase. Packaging comes with a little booklet with using/cleaning tips. One tip was very useful: boil the kettle with some loose tea leaves to get rid of new kettle smell. I tried it, and it worked great!I would absolutely recommend this to a friend, and I would absolutely purchase again if needed."},{"reviewerName":"Reginald Smith","rating":"5.0 out of 5 stars","reviewTitle":"Best electric heater ever","reviewDate":"October 27, 2019","reviewText":"Amazing water heater. I make my own coffee daily and this kettle is one of my favorite. On the inside there are indicators for the minimum and maximum for the water level. Once turned on it takes about 4 minutes for the water to reach high temperature. The stainless steel looks flawless right out of the box. Overall I am very pleased with this product and would recommend to anybody looking for an electric kettle."},{"reviewerName":"Memis","rating":"5.0 out of 5 stars","reviewTitle":"Decent price","reviewDate":"October 10, 2019","reviewText":" It’s a good electric kettle water heater. Very reasonable price. Stainless steel body. I liked it."},{"reviewerName":"Jason","rating":"5.0 out of 5 stars","reviewTitle":"Taste so much better than microwave heating!","reviewDate":"September 18, 2019","reviewText":"I’m an avid tea drinker. Ever since I discovered this type of kettle in Europe on holiday I have been obsessed with its ease and quickness of heating water. This kettle is everything I could have wanted and at a great price! It was packaged well and they were very “kind” set of inserts, offering replacements, extra warranty time, etc.\nif you’re a tea drinker, or instant soup fan, this just made your day a lot easier."},{"reviewerName":"SaRa","rating":"5.0 out of 5 stars","reviewTitle":"Good Qulaity","reviewDate":"October 21, 2019","reviewText":" I love this product!!Very good price and quality!!and this kettle works so good and great🙏🙏👌👌👌 Very good for winter!!!loved it👌👌"},{"reviewerName":"Arvind Lothe","rating":"5.0 out of 5 stars","reviewTitle":"Happy to have kettle for kitchen needs","reviewDate":"September 24, 2019","reviewText":"I liked this small but much needed kettle for kitchen needs. With two kids in my home, it's always a firefight when they need milk to drink and my wife finds this kettle very helpful for quick boiling of water or milk. The bigger opening makes it easy to clean. It looks good with a mete make and bigger and strong handle."},{"reviewerName":"Dennis McGee","rating":"5.0 out of 5 stars","reviewTitle":"Light weight, unbreakable, easy to clean, good for traveling, love it.","reviewDate":"October 6, 2019","reviewText":"Shiny. Heats up in minutes. Easy to clean. This is the second time I purchase this brand. It is a few dollars cheaper than competitors and work perfectly well I’ve had them for a long time. I like the fact that they hold quite a bit of water since I like a few cups of coffee in the morning.I had glass ones in the past and they broke some time to just from the hot water in them. I can also use it when I’m traveling because it’s lightweight."},{"reviewerName":"kevin","rating":"5.0 out of 5 stars","reviewTitle":"Overall an awesome kettle!","reviewDate":"October 2, 2019","reviewText":"This electric kettle has been excellent. I’ve had it a few weeks now and I love the temperature control. My only complaints are that I wish the lid would open wider to make it easier to fill at the faucet, and I also wish the handle was less wide and more rounded. The thickness and squared edges of the handle make it difficult and uncomfortable to hold when it’s full of water. But you don’t hold it for very long when it’s full anyway, so no huge deal."},{"reviewerName":"EclecticKnitter","rating":"4.0 out of 5 stars","reviewTitle":"Seems to be good, although I had to get the first one replaced","reviewDate":"October 10, 2019","reviewText":"My old electric kettle died after a good seven years of daily and frequent use, so I ordered this one as it was similar to the old one. I received the kettle in one day as a Prime member but the thing did not work at all. The dead one was replaced and I had it the next day. This time it worked. It's slightly larger than my old one and the inside part of the lid is fully stainless rather than plastic. Improvement, definitely. This unit is a bit louder than my old one (by Chrystaline, no longer available) but it also seems to heat water more quickly. So far so good. Since the first one was DOA, though, I'm holding my breath on this one. There is leaflet in the box to extend the warranty. Not sure if that is free or not, but I will check into it. For the price, if it lasts a couple years, I'll be happy. I would give this 5 stars if I had more confidence in how long it will last."},{"reviewerName":"M","rating":"5.0 out of 5 stars","reviewTitle":"Works great!","reviewDate":"October 16, 2019","reviewText":"I have used it only once and it works beautifully. Heats a whole kettle of water in about 3 minutes. I love the wide mouth as it can be cleaned easily. Great value for money as well. I need to use an electric kettle only once or twice a month so this was perfect as I didn’t want to drop a lot of money on a fancy kettle. It works better than the more expensive ones that I have bought from Amazon with added features."},{"reviewerName":"rong1984","rating":"5.0 out of 5 stars","reviewTitle":"highly recommended","reviewDate":"October 7, 2019","reviewText":"higher quality match this price，the details were well，include the edge of kettle and the handle。whatever，it is a good purchase。just my old one bought from Costco doesn't work。"},{"reviewerName":"Clothes Monkey","rating":"5.0 out of 5 stars","reviewTitle":"It's good","reviewDate":"October 29, 2019","reviewText":"Looks nice and works well. Half the price of the one I bought before. (I still have them both, in different locations.) Less plastic, fantastic - stainless steel on the inside where it touches the water, as promised. The only drawback is the cord. It has a 3-pronged cord that is way too short, so I couldn't plug it into the most convenient spots. I hate the new sort \"safety\" cords because I have an old house, with inconvenient outlets. But I comparison shopped, and this was the best one."},{"reviewerName":"SS","rating":"5.0 out of 5 stars","reviewTitle":"easy to use","reviewDate":"September 23, 2019","reviewText":"I move my office, I need a electric water heater upgraded, this is the perfect one for me!!!"},{"reviewerName":"oncidium Littlejohn","rating":"5.0 out of 5 stars","reviewTitle":"Good Electric Kettle","reviewDate":"November 9, 2019","reviewText":"This hot pot holds about 1.7 liters (0.45 gallon) of water and has a slick oval appearance on top. It is large enough for any household purposes. Although it does not have a viewing window to see the water level inside the pot, I do not find it being inconvenient at all. The top cover does not have a spring and must be pulled open to pour water in. It must be closed and shut securely by pressing it to prevent hot water from splashing out while dispensing the boiling water. At 1000 watts, the heating speed is reasonable and comparable to others that I have used. It comes with an attached heavy gauge wire so that the wire and plug will never overheat"},{"reviewerName":"Maggie wu","rating":"5.0 out of 5 stars","reviewTitle":"Worth money","reviewDate":"October 6, 2019","reviewText":"I love my new tea pot, no more waiting for the old one to boil the water,it's so quick to boil water.i have been looking for a kettle for a while,this is very helpful to me. So easy to use and clean,and just the right size to me,and great price, it’s my option."},{"reviewerName":"Blue Nova","rating":"5.0 out of 5 stars","reviewTitle":"Great value for money","reviewDate":"November 3, 2019","reviewText":"I love that it's stainless steel, it makes it sturdy. This kettle may look small but it holds a lot of water. I was surprised when taking it out from its box as it was actually bigger than I thought it would be. This saves me so much time in the morning as it boils water really fast. It is very easy to clean and use and I find this really convenient. Finally... no more pot and stove! No more long waiting when having my starter coffee. The fact that it has an auto-shut off setting makes it way even better. I am very happy for getting this at a very fair price!"},{"reviewerName":"Tammy","rating":"5.0 out of 5 stars","reviewTitle":"Loved the kettle","reviewDate":"October 28, 2019","reviewText":"I received my kettle today. Tested for boiling water. It works fine.I like the light indicator, the top button for opening the kettle to fill water and the fact that it turns itself off when the water has boiled.I only wish it could keep the water warm for a longer period. And I thought it took long to boil.It takes about 5 minutes to bring to a rolling boil.\nI will be updating after using it for some time. Very good for winter as i drink hot water all the time and easier for me to boil the water."},{"reviewerName":"Suzanne","rating":"5.0 out of 5 stars","reviewTitle":"Perfect to carry","reviewDate":"October 2, 2019","reviewText":"Before this thing I would just be able to have my tea in the morning before work. I absolutely love this thing. I can take it to school and make myself a cup in between class breaks. It boils water super fast. I love the look of it, the stainless steel looks amazing on my desk. Awesome!!"},{"reviewerName":"Jenny","rating":"5.0 out of 5 stars","reviewTitle":"Very good item to purchase","reviewDate":"October 5, 2019","reviewText":"heating the water quickly.only take 2 minutes to boiling the hot water! I like that it turns off automatically so I can flip it on and walk away and not have to worry about it boiling dry. Very neat outside and very compact, only takes little space I can bring it to my office."},{"reviewerName":"Jainam Shah","rating":"5.0 out of 5 stars","reviewTitle":"Great","reviewDate":"November 5, 2019","reviewText":"Another great product I came across amazon. Can be used to warm water, soup, milk, coffee, tea, etc. It works very quickly. It is very handy, easy to use and clean. It also has the cable storage place so requires very less place in pantry. I am happy with the product. Once, I used it to warm partly solid food items when microwave was not accessible, and it worked just fine."},{"reviewerName":"Ivy","rating":"5.0 out of 5 stars","reviewTitle":"very convenient","reviewDate":"October 10, 2019","reviewText":"It is very convenient to use and clean, the kettle is the right size, suitable for home use, I like it."},{"reviewerName":"Sherry","rating":"5.0 out of 5 stars","reviewTitle":"Good product!","reviewDate":"October 27, 2019","reviewText":"This kettle is great overall !It’s very easy to use and clean.Sturdy design.This kettle had become a favorite at all locations for its quick heat,ear of use and temperture abilties!This is a very good buy!"},{"reviewerName":"ruijuan","rating":"5.0 out of 5 stars","reviewTitle":"Great electric kettle","reviewDate":"October 20, 2019","reviewText":"This electric kettle works great and safe to use. I like to have hot water every morning and this kettle boils very fast. The size is also great for daily use."},{"reviewerName":"Stephen","rating":"5.0 out of 5 stars","reviewTitle":"Nice-looking and effective","reviewDate":"November 8, 2019","reviewText":"This is a great electric kettle that hates water up quickly and gets it very hot. It's also very easy to clean, you can fit your hand right down inside describe it. It's very easy to use all you have to do is fill it and flip the switch. This is a very good price for a very good product."},{"reviewerName":"Felicia","rating":"5.0 out of 5 stars","reviewTitle":"Good quality and low price","reviewDate":"October 25, 2019","reviewText":"I selected this electric kettle because my friend bought one and strongly recommended it. After I received it, I was surprise. Firstly the speed is fast. I seem to receive the day after I ordered it. I am really surprised by amazon. Secondly the price is acceptable. I compared with other brand but I could merely get a plastic material kettle with the same price. It is stainless and huge capacity."},{"reviewerName":"Zalia","rating":"3.0 out of 5 stars","reviewTitle":"Works great","reviewDate":"October 2, 2019","reviewText":"Mine came with some dents but other wise works good i order it to have hot water during my surgery recovery since i can only eat and drink hot stuffs."},{"reviewerName":"Suresh Kedas","rating":"5.0 out of 5 stars","reviewTitle":"Very nice and easy to use","reviewDate":"November 10, 2019","reviewText":"As the winter started this electric water heating kettle was super useful, water gets heated so quickly and we are using it daily to mix the hot water with cold water from the filter to drink. I suggest this is really good one to buy."},{"reviewerName":"Christina Spadafino","rating":"5.0 out of 5 stars","reviewTitle":"Works fast!","reviewDate":"October 26, 2019","reviewText":"I use these to heat water for hot cocoa for my Homeroom. Works fast and is doing a nice job. Inside bottom already showing signs of rust but I found as long as it’s dried out immediately, no problems. Vinegar works well too."},{"reviewerName":"zhongtao ou","rating":"5.0 out of 5 stars","reviewTitle":"Large capacity and heat up quickly","reviewDate":"October 29, 2019","reviewText":"I like drink hot water.I everything use this kettle pot more than 3times. easy clearn ,It has a large capacity (2.0L) and heats up quickly.perfect for my morning tea time and coffee wake me up.I recommend purchase this large electric kettle.enjoy use everyday."},{"reviewerName":"caroline zhang","rating":"5.0 out of 5 stars","reviewTitle":"Heating fast!","reviewDate":"October 14, 2019","reviewText":"I like this water heater! Very fast and simple operation. Not complicated to use!"},{"reviewerName":"Brandi Devore","rating":"5.0 out of 5 stars","reviewTitle":"Love this kettle","reviewDate":"November 10, 2019","reviewText":"I have been wanting a kettle for a while now for my tea obsession and finally decided to buy one. I'm really happy with this purchase. It holds enough water for multiple cups of tea and is quick to boil water. It is really easy to clean and doesn't take up alot of space on my counter. Also, I really like that is has an auto shutoff feature. Definitely recommend this kettle to anyone wanting a budget friendly but great quality kettle."},{"reviewerName":"Laoona","rating":"5.0 out of 5 stars","reviewTitle":"Great Electric Kettle","reviewDate":"September 30, 2019","reviewText":"It's a simple tool to boil 2L water within 10 minutes. Super easy to use. Affordable price."},{"reviewerName":"Larry W.Leffew","rating":"5.0 out of 5 stars","reviewTitle":"Good","reviewDate":"October 17, 2019","reviewText":"Good fast boiled"},{"reviewerName":"Kels","rating":"5.0 out of 5 stars","reviewTitle":"My first electric kettle","reviewDate":"October 4, 2019","reviewText":"I bought for my mom because she likes to brew tea and coffee a lot. She seems pretty satisfied with it. We gave it a little test run and made a nice pot of coffee :D"},{"reviewerName":"Momoko","rating":"3.0 out of 5 stars","reviewTitle":"not recommend","reviewDate":"November 6, 2019","reviewText":"When I got this kettle it worked great. But I could only use it for about 1 month, and it died. I expected longer use out of it."},{"reviewerName":"S. Broadway","rating":"5.0 out of 5 stars","reviewTitle":"HEATS FAST!!","reviewDate":"November 8, 2019","reviewText":"works well and heats fast!! I was hesitant about this purchase and I should have bought one long ago!! LOVE!!"},{"reviewerName":"John","rating":"5.0 out of 5 stars","reviewTitle":"Best Quality","reviewDate":"November 6, 2019","reviewText":"This kettle is best quality. Heats up and boil quickly. İt is easy to clean.\nI highly recommend this product"},{"reviewerName":"Fareeda","rating":"5.0 out of 5 stars","reviewTitle":"Good quality","reviewDate":"November 7, 2019","reviewText":"This electric kettle has been excellent. I used week now and I love the temperature control. Easy full, easy clean, good quality, good size."},{"reviewerName":"Radhe Shyam Yadav","rating":"5.0 out of 5 stars","reviewTitle":"Great price value","reviewDate":"October 26, 2019","reviewText":"I liked it. Very fast delivery. I used it and makes hot very fast. Great quality product and great price value."},{"reviewerName":"dan","rating":"5.0 out of 5 stars","reviewTitle":"Good electric kettle","reviewDate":"October 24, 2019","reviewText":"The electric kettle is easy to use and clean. The size is perfect for my daily use. Love it!"},{"reviewerName":"xiaoduirenshenghua","rating":"5.0 out of 5 stars","reviewTitle":"Good","reviewDate":"October 17, 2019","reviewText":"The kettle is good and the boiling water is fast."},{"reviewerName":"Francis","rating":"5.0 out of 5 stars","reviewTitle":"Cost-effective products","reviewDate":"November 8, 2019","reviewText":"I always wanted to buy an electric kettle,pretty good,finally I can have drink hot tea in the winter.If you like drinking hot beverages,this is an appliance that I would highly recommend for your home."},{"reviewerName":"Norton","rating":"5.0 out of 5 stars","reviewTitle":"Extremely high price/performance ratio","reviewDate":"November 6, 2019","reviewText":"Compared with a lot of stores, Finally i chose this shop , the price is cheap, the quality is not bad.The kettle is heated very fast and it is very convenient to clean."},{"reviewerName":"Samehabdelwahabramadan","rating":"5.0 out of 5 stars","reviewTitle":"It easy to use and safe and very good dezine","reviewDate":"October 26, 2019","reviewText":"It's very nice one I like it very good size for my family ,very fast to heat up the water and very easy to clean, highly recommend"},{"reviewerName":"Selina","rating":"5.0 out of 5 stars","reviewTitle":"Boil water quickly","reviewDate":"November 6, 2019","reviewText":"It's very fast to boil water.The stainless steel she'll and the inside are also stainless steel.The water will stop burning automatically.Don't worry about drying!"},{"reviewerName":"Said","rating":"5.0 out of 5 stars","reviewTitle":"I love it","reviewDate":"October 26, 2019","reviewText":"Very fast and easy to use and clean\nVery nice color\nHelps a lot in kitchen"},{"reviewerName":"OLGA DOLGIKH","rating":"5.0 out of 5 stars","reviewTitle":"It’s a very convenient kettle","reviewDate":"October 30, 2019","reviewText":"It’s a very convenient kettle, just the right size, easy to pour and handle. It’s stainless steel and I like the value for money so much."},{"reviewerName":"Char H.","rating":"5.0 out of 5 stars","reviewTitle":"Good","reviewDate":"October 28, 2019","reviewText":"Thanks!"},{"reviewerName":"Parth Desai","rating":"1.0 out of 5 stars","reviewTitle":"Damage","reviewDate":"October 26, 2019","reviewText":"Damage"},{"reviewerName":"Anne","rating":"3.0 out of 5 stars","reviewTitle":"It died after just 11 months of use.","reviewDate":"October 31, 2019","reviewText":"When I got this kettle it worked great. And I loved it. But I could only use it for about 11 months. It died this morning. RIP. I expected longer use out of it. I'll be trying a different brand after this one."},{"reviewerName":"sarah17blue","rating":"5.0 out of 5 stars","reviewTitle":"Great kettle","reviewDate":"November 6, 2019","reviewText":"I used it on vacation and it was very helpful........ it worked great and was convenient\n\nI would recommend it to anyone who is looking for a great electric kettle"},{"reviewerName":"darius","rating":"1.0 out of 5 stars","reviewTitle":"defective product","reviewDate":"October 22, 2019","reviewText":"I bought this kettle, and after the warantee ran out, its no longer working, wont buy these products through amazon again. I left another review, but it was taken down."},{"reviewerName":"Joyce B.","rating":"3.0 out of 5 stars","reviewTitle":"The good and the bad","reviewDate":"October 12, 2019","reviewText":"Pro:\n\nThe unit does what it's supposed to do.\n\nCons:\n\n1. The warranty is 100 days and can be extended for an additional 90. However, freight under the warranty is paid by the consumer. That always bothers me. Also, replacement parts can be reconditioned; that REALLY bothers me.\n\n2. There are no markings to show how much water is in the pot."},{"reviewerName":"Shaswat","rating":"5.0 out of 5 stars","reviewTitle":"Warms up water quickly","reviewDate":"September 29, 2019","reviewText":"I wasn’t sure before buying how it effective it would be. However after using it, I am amazed to see how quickly it warms up water. We tried milk as well..lol. Outer steel gives a classy look. Value for money"},{"reviewerName":"Julia","rating":"5.0 out of 5 stars","reviewTitle":"Nice and modern kettle","reviewDate":"September 29, 2019","reviewText":"This kettle is so cool. On the stainless steel no finger prints, that is good. Looks nice and modern. Works perfect!!! Not need to wait for a long time to have boiled water. Highly recommended!!!"},{"reviewerName":"Nancy Martinez","rating":"5.0 out of 5 stars","reviewTitle":"Super affordable and great quality","reviewDate":"September 28, 2019","reviewText":"I simply love this electric kettle. This is the second one I buy. I have people over all the time and we all love to drink coffee so one is not enough. I love the the water heats up super fast, I love that the power cord swivels and it’s storable. It’s super inexpensive for the great quality. Over all it’s just very functional."},{"reviewerName":"Zina","rating":"1.0 out of 5 stars","reviewTitle":"Received dent kettle","reviewDate":"October 13, 2019","reviewText":"I am not pleased with the kettle I just received and it's a gift I decided to open the box and there's a huge dent in it terrible it's a good thing I checked"},{"reviewerName":"Siyu Chen","rating":"5.0 out of 5 stars","reviewTitle":"very good","reviewDate":"September 30, 2019","reviewText":"This electric kettle is very easy to use. The water is very fast. The quality is very good. The price is also very cheap. Very good."},{"reviewerName":"fla.gal","rating":"4.0 out of 5 stars","reviewTitle":"I like everything except the electric cord.","reviewDate":"November 2, 2019","reviewText":"This kettle works perfectly. No complaints with that. The only thing I don’t like is that the cord is so stiff that it won’t relax. When I push the kettle towards the backsplash the cord touches the kettle. That’s not good if the kettle is still hot."},{"reviewerName":"sudarshan","rating":"5.0 out of 5 stars","reviewTitle":"good!!","reviewDate":"October 7, 2019","reviewText":"heats up pretty quick . excellent capacity. its perfect for hot tea n instant coffee. impressed with the product!!"},{"reviewerName":"Nick","rating":"3.0 out of 5 stars","reviewTitle":"Kettle size is misleading. Extremely small.","reviewDate":"October 2, 2019","reviewText":"Kettle looks average but it's extremely too SMALL ! for my family."},{"reviewerName":"Iuliia Trekhlib","rating":"5.0 out of 5 stars","reviewTitle":"Water boils very quickly","reviewDate":"October 30, 2019","reviewText":"The kettle is of very good quality. It has no smell inside. Water boils very quickly. It is washed very easily. Worth the money spent. Packed in a presentable box, suitable for a gift."},{"reviewerName":"J Cash","rating":"5.0 out of 5 stars","reviewTitle":"Love!!","reviewDate":"October 19, 2019","reviewText":"It’s so easy to use and a great value"},{"reviewerName":"Hookem Horns","rating":"1.0 out of 5 stars","reviewTitle":"Died on 3rd use. Burning plastic smell.","reviewDate":"November 11, 2019","reviewText":"Kettle is dead after 3rd use. Light does not come on and Burning plastic smell when plugged in. Item did not last 3 weeks. Took a chance on this brand and regret it."},{"reviewerName":"Shovelhead Lady","rating":"4.0 out of 5 stars","reviewTitle":"Nice Kettle","reviewDate":"October 24, 2019","reviewText":"Like the kettle...gave it a four stsr rating because it seems to take a bit longer to boil than my previous one. Works well, good value for price."},{"reviewerName":"Guldana","rating":"5.0 out of 5 stars","reviewTitle":"Very high quality","reviewDate":"November 5, 2019","reviewText":"Very high quality electric kettle. Nice design and good color. Very quit to use. And after this kettle I am saving for electrycity."},{"reviewerName":"tatsFaulkner2911","rating":"5.0 out of 5 stars","reviewTitle":"Great product","reviewDate":"November 9, 2019","reviewText":"It boils the water very fast! Also it has stylish design, I’m very happy with this purchase. Definitely recommend"},{"reviewerName":"Hope","rating":"5.0 out of 5 stars","reviewTitle":"Electric kettle","reviewDate":"November 3, 2019","reviewText":"Thank you. I love my new electric kettle. Perfect size and high performance."},{"reviewerName":"Mandy Warwick","rating":"5.0 out of 5 stars","reviewTitle":"Best kettle ever!","reviewDate":"October 24, 2019","reviewText":"This is the best kettle I’ve ever used!! Came with instructions for cleaning and setting up. Heats up my water so fast and it’s easy to clean. I love it!"},{"reviewerName":"Flor Menjivar","rating":"5.0 out of 5 stars","reviewTitle":"Electric kettle","reviewDate":"November 11, 2019","reviewText":"This kettle exceeds my expectations. It has generous volume without being bulky. The design is visually attractive and functional. I especially like the on/off switch at the thumb placement on the handle. Works great!"}]}