{"title":"Cordless Electric Kettle, 1.7L Double Wall 304 Stainless Steel Hot Water Boiler, 1500W Fast Boiling Coffee Pot & Tea Kettle, Auto Shut-Off & Boil Dry Protection, 2-Year Warranty","manufacturer":"Habor","currentPrice":"$29.99","rating":"4.8 out of 5 stars","totalRatings":"321 ratings","features":["\n         Make sure this fits\n                by entering your model number.\n        \n","[More Safely & Healthier] Kettle's inner lid, spout and filter are made of food-grade 304 stainless steel. No plastic contaminates water due to the BPA-free and FDA-approved Material. Advanced auto shut off and boil dry protection function ensure 100% electrical safety and save more energy than induction cooker or stove.","[Double Wall Structure] Constructed with double walls, this electric kettle not only prevents your hands being scaled while touching, but also keeps water warm much longer. Inner stainless-steel surface is for 100% water drinking safety, exterior matte finish layer is for heat insulation and offers stylish looking.","[Fast-Boiling & Large Capacity] With 1500 watts of power, this stainless steel electric kettle can quickly heats up water within 5-6 minutes, effectively shortening waiting time. 1.7L electric kettle can provide about 8 cups of water for your whole day drinking. Perfectly use it to make coffee, tea, milk, oatmeal, etc.","[Easy to Clean & Store] A wide mouth is easy for cleaning and filling, allowing you to totally reach into the bottom of the stainless steel kettle to clean inside limescale. The cord can be stored into the power base when not use, and the slender body is suitable to place on counter top without occupying too much area.","[Worry-Free Warranty] No need to worry about quality problems, we offers 45-day refund and 18-month replacement risk-free after-sales guarantee for you. Please feel free to contact us when you meet any questions or problems. [Warm Tips： It's recommended to keep the water volumn between the Min. and Max. waterline, so once the water is boiled the mechanism can automatically shut off for safety and avoid spilling]"],"reviewsAspects":["easy to use","stainless steel","easy to clean","heats up water","hot water","highly recommend","hot chocolate","boiling water","water quickly","value for money","boils fast","french press","everyday","heats up quickly","automatic shut","blue light","good quality","high quality","less than 5 minutes","heats up fast"],"productInformation":[{"Product Dimensions":"7.3 x 7.9 x 10.2 inches"},{"Item Weight":"2.95 pounds"},{"Shipping Weight":"2.95 pounds (View shipping rates and policies)"},{"ASIN":"B07YFTDQYB"},{"Customer Reviews":"4.8 out of 5 stars\n    321 ratings\n4.8 out of 5 stars"},{"Best Sellers Rank":"#892 in Kitchen & Dining (See Top 100 in Kitchen & Dining)\n#11 in Electric Kettles\n"},{"Date first listed on Amazon":"May 10, 2019"}],"productDescription":["Habor is a brand passionately specializes in delivering high-end and most valuable household appliances and supplies in the market. We talk & listen to our customers and value every constructive feedback to improve our products and services.","\n","\n","\n","Equipped the newest water circling heating technology and 1500W high power, this electric kettle heats up water faster and quieter than some other water pots on the market. Only takes about 7 minutes to boil 1.7L water. No more long time waiting. It will shuts ff when the water is fully boiled or if boil-dry, don't worry about any safety problem even people leave it alone.","It has a double-wall construction, which has two advantages: one is the outer layer of plastic stays cool to the touch even as the water boils inside. The other one is that this double wall structure can help keeping warm for half an hour after the power off.","Designed with advanced inbuilt thermostat control, the stainless steel kettle has a built-in auto shut off when the water is fully boiled or if boil-dry to stop accidents from occurring, saving you the headache of monitoring. It is an excellent choice for replacing microwave ovens, stoves or old kettles.","\n","\n","\n","Study skidproof handle enables you to fill and pour the hot water safely, also it is convenient for you to hold the kettle while cleaning. The 360-degree swivel base is a new upgraded design that is possible for your kettle connecting to the power base at any angle.","Equipped with the blue led indicator, this electric kettle can remind you of the working status. It is on working status when the light on and it will turn off after it boiled","The way of removing scale & Cleaning："],"reviews":[{"reviewerName":"NailsbylatrinaAR","rating":"5.0 out of 5 stars","reviewTitle":"CORDLESS KETTLE. Make teas or seal box braids lol","reviewDate":"August 5, 2019","reviewText":"I’m impressed. The kettle itself isn’t attached to the cord. You put it on the base and simply lift and pour when ready to use. It’s essentialy CORDLESS. I’ve never had a electric kettle before. Loving the double walled structure because I’m accident prone lol. So I don’t feel the hot water inside. Heats up super quick. Had tea ready in less than five minutes. Yes yes yes. Highly recommend. Make sure you clean the kettle per instructions first.\n\nEspecially for braiders/hair stylists. Great for curling or sealing ends on braiding hair since you can move the kettle to the client without having to worry about a cord."},{"reviewerName":"Antonea Peterson","rating":"5.0 out of 5 stars","reviewTitle":"Nice looking and fast heating kettle.","reviewDate":"August 8, 2019","reviewText":"Nice looking kettle and seems like very good quality. Comes with a manual, but is way easy to use. Poor water into kettle, press bottom lever, lift kettle from stand and you’re good. Heats up water really fast; full around 7 minutes. Interior is stainless and high quality. Looks great on my counter. I love it."},{"reviewerName":"Atul Gupta","rating":"5.0 out of 5 stars","reviewTitle":"Good quality kettle, Subtle design","reviewDate":"September 21, 2019","reviewText":"I was looking for a kettle to prepare coffee and tea, and this fit the bill quite nicely.\nOriginally I was looking for a variable temperature model, but after looking at the limited offerings\nand their quality, this kettle looked like a better fit. It boils water quickly,\nand keeps it around boiling for a minute or two then powers off. It's just the right amount of time for\nme to set up my french press and coffee grounds while it boils. Lifting the kettle bumps the switch to\noff so it doesn't start up again after it is set on the base again. Minimum capacity is 2 cups or 16 ounces,\nwhich comes out to a well-sized coffee mug for me. Outside stays cold-warm unless it's used more than\ntwo times in a row which would be unusual outside of the first-time use prep.\n\nEase of use is great, with only one switch with a light and a button on top to raise the lid.\nThe interior is all stainless steel, though after the first-time use prep I did find the markings\nother reviewers have seen appear at the bottom. The power chord also wraps around\nnicely inside/under the base. The finish is matt black, but not too shiny and it fits quite nicely\nnext to the black/stainless oven range. After a month of steady usage it still\nlooks as good as new and no rust buildup. Of course never store this wet, as that would promote oxidation."},{"reviewerName":"Curtis","rating":"5.0 out of 5 stars","reviewTitle":"Portable tea!","reviewDate":"September 16, 2019","reviewText":"This came fast and well packaged - it fits A lot of water and heated up in about 10 minutes to make tea. Nice to be able to take this in my garage or to a friends back yard."},{"reviewerName":"Krishna Anisetty","rating":"5.0 out of 5 stars","reviewTitle":"High quality kettle!","reviewDate":"September 25, 2019","reviewText":"Excellent product. I brought it to use in my home for assorted instant things (Tea, coffee) that I enjoy. And BPA free is the main reason I selected this model.\nSo far I love this kettle, with important features being the stainless steel construction, the shiny black exterior appearance, the high quality of manufacture, and the value for money it represents. The cordless feature is essential in my view for any modern kettle.\nThe kettle is beautiful and it gets not hot to the touch due to it's double wall. It's attractive and easy to handle. It definitely boils the water. I would definitely use it for my tea every day.\nOverall this is excellent quality, well-featured and a great value! I highly recommend."},{"reviewerName":"luckyck","rating":"5.0 out of 5 stars","reviewTitle":"Love my new electric kettle","reviewDate":"August 13, 2019","reviewText":"My mom has one of these, and I've always been eyeing hers. Finally pulled the trigger and got one of my own. It is a little bigger than I thought it would be. I imagined taking it along on trips for my husband who loves having his drip coffee, but it is a little on the larger side for that. But it works great, and it's super easy to use. Just one button, and the water heats up pretty quickly. Love the black color. Looks sleek and works great."},{"reviewerName":"JoyKM","rating":"4.0 out of 5 stars","reviewTitle":"Boils fast but not a fan of how the lid opens up.","reviewDate":"August 14, 2019","reviewText":"Design is simple and I really like the fact that you can get the whole kettle boiling in just 5 minutes. What I'm not a fan of is the lid will not open all the way. If you lift the lid, it is angled at a 45 degrees opening. This makes cleaning the inside a little difficult and I had to be careful so I don't break the lid. That's my only complaint. Otherwise, it is a good, fast boiling kettle."},{"reviewerName":"Saurav Dhar","rating":"5.0 out of 5 stars","reviewTitle":"Fast boiling big kettle","reviewDate":"August 17, 2019","reviewText":"The interior is fully stainless steel which is super durable. Takes very little time to start boiling. Capacity is enough for 5-6 cup. But inspite of being well constructed it's very light. It also has a auto power off method for safety."},{"reviewerName":"Eric Lobenstein","rating":"1.0 out of 5 stars","reviewTitle":"False Advertising! Contains plastic","reviewDate":"November 2, 2019","reviewText":"I cant believe that even the seller is answering questions here stating this kettle is plastic free. While there is mainly made of stainless steel, there are two pieces which are plastic: 1) a plastic button that attaches the handle and 2) a piece of the lid is plastic and will be kept inside the jar once the lid is close.\nEven if these two parts are not supposed to touch the water, they will sure be affected by the steam of boiling water.\nThe seller should not advertise this as plastic free! Shame! It's going back"},{"reviewerName":"Leo Kang","rating":"5.0 out of 5 stars","reviewTitle":"Easy to use & Clean & portable","reviewDate":"September 21, 2019","reviewText":"Shorter than comparable plastic bodied products, this kettle boils 1.7L of cold water in 5 minutes. It features a stainless steel body which means no viewing the water scale build up on the inside. Instead of heating cup by cup of water in the microwave or for the whistling kettle on the range top, this electric kettle is the way to go. This is an awesome way to REALLY heat up THOROUGHLY water for tea, hot chocolate, ramen noodles and the like. Easy instructions to follow. Love that the electric cord wraps around the underside of the heating plate when not in use. After heating several pots of water to rinse it, I was set to go. Would have preferred cups measurements (especially since it says the capacity is 7.2 cups) and not liters on the kettle but I'll live."},{"reviewerName":"RedStar","rating":"5.0 out of 5 stars","reviewTitle":"Must buy !!!!","reviewDate":"November 4, 2019","reviewText":"I LOVE THIS PRODUCT! I DONT KNOW WHAT TOOK ME SO LONG TO BUY!! .. its out of the way, i can use it in my bedroom, office or anywhere i can plug it in. I dont have to worry about my boiling water into a pot and pouring into a cup. Washing dirty dishes just to boil water. It takes less then 3 minutes to boil. It is safe for my ten year old to use to make her got chocolate. It doesnt take much room and you hear it working INSTANTLY.. YES I AM IN LOVE WITH IT AND ALL MY FAMILY USES IT. I USED IT FOR TEA( WHICH I LOVE) MY HUSBAND FOR HIS COFFEE AND MY DAUGHTER FOR HER HOT CHOCOLATE.. AND I KNOW I CAN USE IT FOR OTHER ITEMS LIKE CUP OF SOUP, BROTH ETC..."},{"reviewerName":"MiPo","rating":"5.0 out of 5 stars","reviewTitle":"Boils water quickly, is clean, perfect for students!","reviewDate":"September 16, 2019","reviewText":" The Habor electric kettle has an elegant look and a stainless steel interior that boils water throughly and leaves no plastic taste. I love how it can be removed from the base with ease if you want to pour the steaming water into a mug or bowl. The electric kettle is extremely intuitive as there is only 1 on/off switch. Also, inside the boiler, there are measurements for 1/2, 1, and 1 1/2 Liters. The water boils relatively quickly, in around 3 minutes for half a liter and 5 minutes for a liter, so it's really convenient in mornings. This is perfect for students because it can be easily used to boil water for tea, oatmeal, and instant noodles. The all stainless steel interior and wide opening make it very easy to clean. The kettle looks elegant with an all black finish, and is not hot to touch after the water boils."},{"reviewerName":"J","rating":"5.0 out of 5 stars","reviewTitle":"Winter Won't Stop Me!","reviewDate":"October 19, 2019","reviewText":"Im super excited about this purchase! I work in a warehouse where it is super cold in the winter months, and you want nothing more than something HOT to drink. I brought a pack of hot chocolate as well as some tea to work for this occasion. It comes with instructions, but it's super easy! Make sure to follow the cleaning instructions. You NEVER feel the heat on the outside of the kettle, water only touches the stainless steel. I pour some water in and turned it on, in about 5-7 min BOOM Hot water! While my nose is red, hands are icicles, my belly and heart is warm in this frigid warehouse! Def recommend! Winter wont stop me this year!"},{"reviewerName":"Eva","rating":"5.0 out of 5 stars","reviewTitle":"Great kettle","reviewDate":"September 28, 2019","reviewText":"I usually just microwave water for tea, but apparently that's not the \"right\" way to do it and kept getting flack from my friends for it. I finally decided to buy an electric kettle and chose this one cuz it's well priced and has good reviews. I love it! Boils water quickly even when filled to max capacity which is almost 2 liters. There's no weird taste or anything used straight out of the box, but I did clean it by boiling 3 cycles before using the water for tea. I also used it to clean my garage disposal and makes boiling water for pasta quicker and easier! I don't know why I waited so long to buy a kettle, I love this thing!"},{"reviewerName":"sh5r","rating":"5.0 out of 5 stars","reviewTitle":"quick boil, electric kettle","reviewDate":"October 30, 2019","reviewText":" This cordless electric kettle is amazing. I am looking forward to using it more. It boils water really fast, depending on how much water you put to boil. I put about half a liter and it boiled super quick, within a few minutes. I like that the kettle has a light up switch to turn the kettle on and off, also how it has auto turn off setting in the kettle, great for busy and forgetful people. Can't wait to keep using this and making my life easier. Great kettle, lovely addition to your kitchen small appliances."},{"reviewerName":"A. Brown","rating":"4.0 out of 5 stars","reviewTitle":"Can't See How Full","reviewDate":"November 5, 2019","reviewText":"Just got this kettle to replace a burned out one. They seems to last about 3 years. It's good but 2 problems.\n\nThere's no way to see from the outside how full it is, you have to open the lid and look inside. When I opened the lid I got a few drops of hot water on my hand so be careful.\n\nThe lid only opens to about 45 degrees so peeking inside to see how full it is means tilting it. It may make cleaning a bit harder too.\n\nI'll probably keep it but look for a better one in 3 years."},{"reviewerName":"Nikkie","rating":"5.0 out of 5 stars","reviewTitle":"Heats up fast!","reviewDate":"September 19, 2019","reviewText":"Not only is this very stylish but it also works magic! It heats up REALLY fast and it’s super easy to keep clean. I love that the bottom part doesn’t get hot so I don’t have to worry about my kids reaching on the counter and accidentally touching it and burning their fingers. Definitely a big plus for me because I’m always scared of that happening. I love that I can have my tea ready in minutes because usually I’m crunched for time! I would definitely recommend this to anyone who enjoys a good cup of tea"},{"reviewerName":"Felix Elias","rating":"5.0 out of 5 stars","reviewTitle":"Boils water quickly and it shuts down automatically","reviewDate":"October 24, 2019","reviewText":"Very happy with my kettle. I bought the glass one before finding this one and was in love with it, but for aesthetic and convenience reasons changed to all metal. I like this one a lot better. Not too heavy yet very sturdy. Boils water very quickly and it has an auto-off function for when is done boiling water. It looks nice over my counter so I don't even need to store it and can leave it outside.\n\nDefinitely recommend"},{"reviewerName":"CheWei Chen","rating":"1.0 out of 5 stars","reviewTitle":"Rusted quick","reviewDate":"November 6, 2019","reviewText":"I feel like this is not stainless more like a metal but not sure what it is made of. After using few times, it’s a bit rusted inside and the water doesn’t taste well. The positive thing for the kettle is that it will boil your water fast."},{"reviewerName":"Kuan Liu","rating":"5.0 out of 5 stars","reviewTitle":"Easy to put together and use!","reviewDate":"November 11, 2019","reviewText":"This electric kettle works great. It heats up water very quickly which means it’s both energy and time efficient. I love the polished black color of the kettle. It is quite easy to put together and use. The only minor concern is that water level mark is inside the kettle so it’s a bit hard to gauge where the water level is. Overall, really enjoyed the convenience of having a electric kettle, especially this one."},{"reviewerName":"SuperHerO","rating":"5.0 out of 5 stars","reviewTitle":"Fast boiling electric kettle","reviewDate":"October 18, 2019","reviewText":"It has that matt black chic look to it. Fits perfect with my modern kitchen. Very easy to use, just plug in tab the button down, when its boiled it stops automatically. Its a good size kettle which is great cuz we eat cup of noodles all the time and i always had to go second round but you can just boil it once and it makes few cup of noodles and some tea. It boils fast too."},{"reviewerName":"Vikash Kumar","rating":"5.0 out of 5 stars","reviewTitle":"Large capacity, very efficient, stainless steel inside","reviewDate":"November 3, 2019","reviewText":"Does very efficiently what it is meant to do. I use it for multiple purposes because it boils very fast, is high powered and durable. I boil milk in it, eggs sometimes and water for my black tea most of the time.. it takes very less time, is high powered, good quality, beautiful outside and stainless steel inside. Working really fine till now, has high capacity."},{"reviewerName":"shruti","rating":"5.0 out of 5 stars","reviewTitle":"useful kitchen addition","reviewDate":"September 18, 2019","reviewText":"didn't know an electric kettle would be this useful for a kitchen. Cooking tea or coffee is easier & faster with this kettle. Seems very convenient to operate, water boils real quick, and found the blue light indicator an additional feature, light turns off when water boils and the kettle turns off automatically. it has ample storage with 1.7 litre capacity. nice look."},{"reviewerName":"Chris H","rating":"5.0 out of 5 stars","reviewTitle":"I make tea twice as fast now!","reviewDate":"August 14, 2019","reviewText":"This electric kettle makes hot water extremely fast and the best part is that it auto shuts off so if I ever forget it on, it won't cause any harm. I've forgotten the stove on many times and this is great so I never forget. It's made form awesome material and the inside is all stainless steel. It has a blue indicator light near the switch. Great electric kettle over all!"},{"reviewerName":"wanda","rating":"5.0 out of 5 stars","reviewTitle":"Looks great and works fast","reviewDate":"October 15, 2019","reviewText":"This is my second one....my sister borrowed mine so I went ahead and got a new one. I have owned many kettles bc they are great for everything...even cleaning when you need hot water fast. I really like the way this one looks on my counter. I had a stainless one and constantly had to shine it and the clear ones you see water stains. This always looks nice."},{"reviewerName":"SarahElle","rating":"5.0 out of 5 stars","reviewTitle":"Great product, affordable price","reviewDate":"October 8, 2019","reviewText":"First off, this kettle is quick. I received it today. After washing it, I used it right away. I had boiling water within 5 minutes (didn't fill out up all the way). I loved how simple it was to operate and that the kettle itself is cordless. I also enjoy the double wall carafe. Im using this one for camping in a few weeks and looking forward to hot tea!"},{"reviewerName":"tttn","rating":"5.0 out of 5 stars","reviewTitle":"Perfect for making tea and hot cocoa","reviewDate":"September 17, 2019","reviewText":"Perfect for making tea and hot cocoa. Just fill up the water and turn it on. I don’t have to worry about forgetting it when the water is boiled since it will turn the unit off automatically. Another nice feature is the boil-dry protection which turn the unit off when there is no water inside the kettle. I recommended this electric kettle to my friends and family members."},{"reviewerName":"EMMA","rating":"1.0 out of 5 stars","reviewTitle":"bad","reviewDate":"November 4, 2019","reviewText":"It tastes great and seems to have been used. I submitted the first comment failed, but I must ask for the second time. The reason is that this is the worst product I have purchased."},{"reviewerName":"Thu-Hanh Tran","rating":"5.0 out of 5 stars","reviewTitle":"Get boiling water within 5 minutes!","reviewDate":"November 9, 2019","reviewText":"First of all, it looks absolutely stunning! It got a full-body black armor, with a shiny diamond-like hat. The inside, along with the heating plate is made of 100% food-grade stainless steel.\nSecond of all, it heats up fast. It took less than 5 minutes to boil about 1.5L of water. And even when it reaches the boiling point, the outside is only slightly warm to the touch.\nFor this price, I'm happy with it."},{"reviewerName":"Ruchnit","rating":"5.0 out of 5 stars","reviewTitle":"Well made - Perfect for hot water","reviewDate":"September 8, 2019","reviewText":"I bought this a few weeks ago and was skeptical because of the price. I liked the shape of this which looked more like a tea kettle. Great Product, does exactly what the description says it does. Use it every day, and Love that auto shut off feature. Quickly heats water to a boil and makes a perfect cup of tea. Highly recommend this product."},{"reviewerName":"Gurpreet Singh","rating":"5.0 out of 5 stars","reviewTitle":"Works as expected. Convenient to use","reviewDate":"September 10, 2019","reviewText":"The product perfectly matches the product description. I have triied heating water in it many times and have not seen any problems yet. The kettle is quite big as advertised and is super convenient to use. The body of the kettle looks really sturdy and the build quality seems to be much better than what I was expecting in this price range. The only complain I have with this product is that the wire length is not that adequate but everything else about it is absolutely perfect."},{"reviewerName":"Esteban Perez","rating":"5.0 out of 5 stars","reviewTitle":"Great electric kettle!","reviewDate":"September 20, 2019","reviewText":"This is a nice electric kettle. It heats quickly, and shuts off once it reaches boiling. The design is simple and good looking. The cord is not attached to the kettle, but instead to a base that the kettle docks to, it’s nice to not have a cord to deal with while pouring from the kettle. I really like this electric kettle."},{"reviewerName":"Jorge Melendez","rating":"5.0 out of 5 stars","reviewTitle":"The Kettle you,ve been waiting for. All Electric","reviewDate":"October 12, 2019","reviewText":"Great water heater. It eliminates the need for gas because it's all electric. Nice cover release button. This product is very easy to use and would recommend to anyone looking for water boiler. Heats water quick and can home lots of it. It can hold plenty water for 12 cups of tea. Or more depending on cup size. A+"},{"reviewerName":"Jason Cole","rating":"5.0 out of 5 stars","reviewTitle":"Great Electric Kettle","reviewDate":"October 10, 2019","reviewText":"This kettle is great. A nice matte black outer appearance and a nice stainless steel inside. Simply fill with water (between the min and max lines) and press the button to start. The water boils and then stays hot for a long time in the kettle. It is perfect for pouring over my pour over coffee maker."},{"reviewerName":"Trudy","rating":"5.0 out of 5 stars","reviewTitle":"Great kettle!","reviewDate":"October 15, 2019","reviewText":"Got this today and couldn’t wait to open it and make some tea. The kettle heated quickly and I live the heating base is separate from the kettle. I turned it off and then the kids wanted hot chocolate so I went back about 20 minutes later and the water was still hot. Absolutely love this product!"},{"reviewerName":"Robert","rating":"5.0 out of 5 stars","reviewTitle":"outstanding!","reviewDate":"August 19, 2019","reviewText":"This thing is amazing! Even more amazing for traveling! If you have an RV or any type of traveling home then this is a must have! Even in a regular house it is great. Boils the water super fast and you can pour it very easily. It was designed to be as convenient as possible and you can tell! Highly recommend!"},{"reviewerName":"Oan Nguyen","rating":"5.0 out of 5 stars","reviewTitle":"Safe & efficient, for quick hot water!","reviewDate":"September 8, 2019","reviewText":"It heats water quickly & efficiently, automatically turn off when it done. It is easy to fill, either on the counter or at the sink. I also enjoy the modern look of it. I just wish the lid can open all the way so it's easier for me to wash it. Other than that, it is a good product for the price"},{"reviewerName":"Edward O'donnell Jr.","rating":"5.0 out of 5 stars","reviewTitle":"Great Hot Water Heater","reviewDate":"November 5, 2019","reviewText":"Similar design to one I had for several years. The pluses: retains heat much longer, good volume, quick heating and easy on-off toggle. It turns itself off pretty quickly (good when you walk away).\n\nNot-so good: lid is hard to open and is fixed (I like this feature), will bubble over/spill if you fill beyond fill line (my old one did the same).\n\nOverall I like it better than my old one that died. I just find the button to open the fill lid is hard...but it really is a nice insulated hot water heater for the price."},{"reviewerName":"Florence","rating":"5.0 out of 5 stars","reviewTitle":"Good kettle, fast heating","reviewDate":"October 21, 2019","reviewText":"This is on the spendier side of kettles from what I was looking at, but the sleek design and fast heating elements makes it worth it! I bought this for my work desk with winter coming, I drink a lot of tea and pour over coffee. This is great size lasts me most the day!"},{"reviewerName":"Suika","rating":"5.0 out of 5 stars","reviewTitle":"Amazing cordless kettle","reviewDate":"October 17, 2019","reviewText":"I used to use an electric kettle to make my tea, and would always be inconvenienced by the cord getting in the way. This cordless kettle makes pouring so much easier, and cleaning as well. It also insults better than my plastic one, which is great. I wish the lid could come off so I could clean easier, but it's a good tradeoff."},{"reviewerName":"Greg Shedlock","rating":"5.0 out of 5 stars","reviewTitle":"Great quality, easy to use","reviewDate":"September 17, 2019","reviewText":"I make tea and/or pour over coffee every morning - this has helped me with that process. I no longer have to get out pots and pans to heat up my water. The kettle heats up water quickly and effectively. Easy to clean and a great quality. Additionally, it loosk great on the countertop!"},{"reviewerName":"TexasMommy","rating":"5.0 out of 5 stars","reviewTitle":"It's Stainless Steel!","reviewDate":"October 21, 2019","reviewText":"I was looking for something which is not plastic to boil the water, Found this better for this price and ordered it. It works great and value for the money I paid, It's heating faster than Plastic and no harm. Having a satisfied feeling of replaced a plastic."},{"reviewerName":"Andrew & Tara Brown","rating":"5.0 out of 5 stars","reviewTitle":"Quick, Clean and Easy","reviewDate":"August 8, 2019","reviewText":"This electric kettle is perfect for tea drinkers. Heats water very quickly, the kettle is insulated and holds the warmth. Water comes at out a perfect not quite boiling heat. Very easy to reheat if you chose to leave water on the kettle for awhile. Has an automatic shut off and will sensor to ensure it does not over-boil to a dry kettle. Very pleased with our purchase."},{"reviewerName":"Jepay","rating":"5.0 out of 5 stars","reviewTitle":"Love this kettle!","reviewDate":"August 20, 2019","reviewText":"This kettle is a must in every household! It is stainless steel.\nIt only takes a few minutes to boil the water. I love its double wall insulation. The outside is safe to touch even which is a plus for me. Sturdy but lightweight. I highly recommend this product!"},{"reviewerName":"marcmsj","rating":"5.0 out of 5 stars","reviewTitle":"Simple and easy","reviewDate":"September 23, 2019","reviewText":"This is a great cordless electric kettle. Only the base has a cord but the kettle itself just sits on top of the base. Takes only a few minutes to boil a full kettle and turns off when it's done. Outside of kettle gets warm but not hot which is really nice."},{"reviewerName":"Elsie Persaud","rating":"5.0 out of 5 stars","reviewTitle":"Great find","reviewDate":"October 11, 2019","reviewText":"Love this kettle and the price is just perfect. The cord stores underneath the base and simple to use. Heats up super quick. Had tea ready in less than five minutes. Highly recommend. Please make sure you clean the kettle, first before using it."},{"reviewerName":"Pierson Rivera","rating":"5.0 out of 5 stars","reviewTitle":"Very helpful since I don't have a kitchen!","reviewDate":"November 6, 2019","reviewText":"This electric kettle so so easy to use! I don't have a kitchen in my apartment so having a way to quickly and easily heat water is super helpful. Whether I'm making tea, coffee, or ramen noodles this kettle has been super clutch!"},{"reviewerName":"Danny","rating":"5.0 out of 5 stars","reviewTitle":"Useful for around the house","reviewDate":"September 7, 2019","reviewText":"I like the fact that the outside stays cool while the inside holds boiling water makes this a safe and effective appliance for my home. It also has an automatic shut off feature which is also a great safety feature. It boils water quickly and is a sharp looking kettle."},{"reviewerName":"tina schmucker","rating":"5.0 out of 5 stars","reviewTitle":"Super convenient","reviewDate":"August 12, 2019","reviewText":"I had never used an electric kettle before. I love making fresh tea and have hated using my gas stove in the summer. This has solved all my problems. No unnecessary heat being thrown into the house and it heats the water quick! Great product!"},{"reviewerName":"Beast Master","rating":"5.0 out of 5 stars","reviewTitle":"Unique and Smart..!","reviewDate":"November 5, 2019","reviewText":"This product looks unique and stylish. Heats well and great indicator of the temperatures. Worked Great and great quality. Auto shut off feature is great that i am not worried for over heating my tea anymore."},{"reviewerName":"Harsh Shastri","rating":"5.0 out of 5 stars","reviewTitle":"Awesome Electric kettle for everyday use","reviewDate":"September 17, 2019","reviewText":"This is by far the best electric kettle. Boiles water fast and it's easy to use. The design is slick. Cleaning the kettle is quick and easy. It also automatically switches off once the water is boiled. Highly recommended product."},{"reviewerName":"Alisha Gould","rating":"5.0 out of 5 stars","reviewTitle":"Back for current kettle, but using it instead!","reviewDate":"October 13, 2019","reviewText":"I needed a back up for my old kettle as it is getting to the end of its life. When this arrived I took a look at it and decided to bin the old one. This looks cool, matches my kitchen and heat quickly."},{"reviewerName":"Graham Foster","rating":"5.0 out of 5 stars","reviewTitle":"Great Purchase!","reviewDate":"August 20, 2019","reviewText":"This electric kettle is awesome! My fiance and I are both tea-drinkers and until this purchase, we had been using the microwave or podless Keurig to heat water. Now, we can simply fill the kettle, press a button, and wait a minute for the water to boil. This kettle is not only convenient, but it's also very stylish. It has a textured design around the top and along the bottom edge. Plus, it is large enough to brew several cups of tea at once and it's super easy to use. I will never go back to my old ways of microwaving a cup of water to brew my tea!"},{"reviewerName":"Sonia","rating":"5.0 out of 5 stars","reviewTitle":"Must have","reviewDate":"October 13, 2019","reviewText":"this kettle is high efficient with quick heating features. It is well insulated and can be shut down automatically. I loved the overall experience of using this product. Must have for the kitchens."},{"reviewerName":"Tushar","rating":"5.0 out of 5 stars","reviewTitle":"Fancy water kettle","reviewDate":"August 6, 2019","reviewText":"Black Stains less steel finish feels good to the hand and very pretty. Water heats up quickly. Is easy to clean and maintain. Detached from base, big plus point here. Heating coils aren’t in direct contact with water."},{"reviewerName":"MU family...","rating":"5.0 out of 5 stars","reviewTitle":"Look so modern!!","reviewDate":"September 16, 2019","reviewText":"This electric kettle is cordless. It is easy to use and heats up so fast. I don’t need to set up a temperature and shut off automatically. By the way, with stainless steel not difficult to clean at all!"},{"reviewerName":"greg m.","rating":"5.0 out of 5 stars","reviewTitle":"Very nice and fast hot water.","reviewDate":"September 19, 2019","reviewText":"We have a plastic one of these and it does ok but this one is faster and feels luxurious compared to plastic. Water seems hotter much quicker. I like that it is metal. Has a boil over shut off."},{"reviewerName":"PETER","rating":"5.0 out of 5 stars","reviewTitle":"Great product!!!","reviewDate":"November 5, 2019","reviewText":"Super light and super fast!! I could have my morning tea in less than 5 minutes. The interior is stainless which make it so easy to clean and use each time. I could pack this to work or camping and not have to worry about breaking it. Highly recommended!!!"},{"reviewerName":"Reece","rating":"4.0 out of 5 stars","reviewTitle":"Durable, nice material, but not the easiest to clean","reviewDate":"August 26, 2019","reviewText":"A nice solid water heater. Good size for use by up to 4 people. The stainless steel finish is nice and seems very durable. One minor thing that bothered me was that the cover does not come completely off and does not flip over completely, making cleaning the inside with a brush a bit harder than I would have liked."},{"reviewerName":"Vanessa","rating":"5.0 out of 5 stars","reviewTitle":"A must have for tea lovers","reviewDate":"October 13, 2019","reviewText":"After years of boiling water in a pot on the stove for tea I finally decided to invest in this gem. I love it. My tea tastes so much better now. I wish I would’ve purchased this sooner."},{"reviewerName":"Kim Nguyen","rating":"5.0 out of 5 stars","reviewTitle":"Perfect size for my kitchen","reviewDate":"September 3, 2019","reviewText":"I’ve only had it for a few weeks, but so far I’m happy with my purchase. this small electric kettle is perfect to stick in a corner of my tiny kitchen but it’s very handy. It is simple to use and heats up water fast in about 4-5 mins. I only boil water so there’s not really a reason to clean it that often, I just rinse it with water everyday."},{"reviewerName":"Quratul Ain","rating":"5.0 out of 5 stars","reviewTitle":"Excellent kettle","reviewDate":"October 14, 2019","reviewText":"I like the plastic body of the kettle because it doesn't get hot from outside and the water remains hot for longer time due to the inner stainless steel body. It has auto-shutoff function so that you don't have to wait with it to turn it off. Just come back later and find your hot water. Highly recommended."},{"reviewerName":"Tabitha","rating":"5.0 out of 5 stars","reviewTitle":"Maintaining heat for those who are forgetful!","reviewDate":"October 10, 2019","reviewText":"Heats fast. The lid doesnt open all the way making cleaning a little difficult. Bit only water goes in there and if you dump it and air dry it shouldn't be too bad. Steel so maintained temp of water for a good while. Overall great product!"},{"reviewerName":"P","rating":"5.0 out of 5 stars","reviewTitle":"Electric kettle heats up quickly.","reviewDate":"August 8, 2019","reviewText":"This electric kettle is great. It heats just as quickly as my microwave and keeps the water hot for quite a while. I’d rather the kids use this for their ramen noodles than a pot on the stovetop. It takes up very little counter space."},{"reviewerName":"Sudhir","rating":"5.0 out of 5 stars","reviewTitle":"Safe & Easy to use","reviewDate":"September 21, 2019","reviewText":"This one heats up the water pretty soon. It is a double layered which makes it safe to use.\n\nDesign is also simple ,efficient & nice looking.It looks great on my counter too"},{"reviewerName":"Aayat","rating":"4.0 out of 5 stars","reviewTitle":"Great buy for smart work.","reviewDate":"August 6, 2019","reviewText":"It’s a cute lil but great addition to my kitchen. The power cord is short on purpose to keep the cord from tangling up when in use. Just fill the kettle with water and plug it in the outlet. It heats up a full pot in a few minutes and the kettle turns off after boiling."},{"reviewerName":"dracullus","rating":"5.0 out of 5 stars","reviewTitle":"good product","reviewDate":"August 5, 2019","reviewText":"Just received it and tried it out today. Works as intended, seems like a nice quality product. I am very happy with it. Makes tea and boils water so much faster than conventional methods. Would recommend."},{"reviewerName":"Minnie","rating":"5.0 out of 5 stars","reviewTitle":"The perfect electric kettle!","reviewDate":"September 11, 2019","reviewText":"I highly recommend this Elecrtic kettle! Double wall so it keeps the water hot inside and we can touch the outside stays cool. It boils the water so quick! Overheating protection. I just love it!"},{"reviewerName":"Amazon Customer","rating":"3.0 out of 5 stars","reviewTitle":"Not as expected","reviewDate":"September 2, 2019","reviewText":"I chose it because of those good reviews. When I got it, I was disappointed. The power base is made of very thin plastic. The boiled water still has obvious plastic taste till now."},{"reviewerName":"Beth","rating":"5.0 out of 5 stars","reviewTitle":"Compact and functional","reviewDate":"August 13, 2019","reviewText":"I purchased this item as a gift for a college student. It is a wonderful way to heat water with just an electrical outlet. Many of my friends use this in their kitchen for tea and coffee."},{"reviewerName":"Crazy Shopper","rating":"5.0 out of 5 stars","reviewTitle":"Works!!!","reviewDate":"August 6, 2019","reviewText":"I love using this. I like having hot working on hand at all times. This is perfect for that. I use it for tea, or anything honestly. Works great for a small office with no kitchen."},{"reviewerName":"M online profile","rating":"5.0 out of 5 stars","reviewTitle":"Very helpful and useful","reviewDate":"October 20, 2019","reviewText":"Easy to clean and use. Perfect for every day use for many things. I use this for tea, coffee and other drinks. Looks good on the kitchen shelf and does the job well."},{"reviewerName":"Lenysa R.","rating":"5.0 out of 5 stars","reviewTitle":"Beautiful, well made and effective.","reviewDate":"November 6, 2019","reviewText":" Im in love with this kettle, first of all is very stylish. The design is pretty cool, i love the lid. I love the open button for the lid. It doesn’t feel cheap, heats up the water really quick. No more microwave or stove to heat up water. Excellent product, nothing to complaint about."},{"reviewerName":"Stephanie Y.","rating":"5.0 out of 5 stars","reviewTitle":"Looks Sharp, Works Well","reviewDate":"September 16, 2019","reviewText":"This kettle looks amazing and works well! I am definitely a fan of it. The kettle itself is easy to clean, though I would like the lid to lift up a little higher. I do recommend this product :)"},{"reviewerName":"Rohan Ojha","rating":"5.0 out of 5 stars","reviewTitle":"Say hello to fast and efficient water kettle","reviewDate":"September 18, 2019","reviewText":"This is an excellent product for heating up water for green tea or generally. Its quick, efficient and top it off less space consuming... with the winter coming up it couldn't have been more useful... and to top it off the price is quite competitive too.."},{"reviewerName":"RX0123","rating":"5.0 out of 5 stars","reviewTitle":"High quality electric kettle","reviewDate":"September 16, 2019","reviewText":"I absolutely love this electric kettle. It works great for my needs and makes excellent boiled water. It is convenient, looks modern and stylish and is very easy to clean. I highly recommend it to others!"},{"reviewerName":"J WANG","rating":"5.0 out of 5 stars","reviewTitle":"Love it","reviewDate":"August 9, 2019","reviewText":"Very good water heater. Heats water faster than my regular stove top. Very easy to use. Makes making my pour over coffee easier and faster to make. Fits plenty of water."},{"reviewerName":"KWANGCHUL JUNG","rating":"5.0 out of 5 stars","reviewTitle":"Good Black electric kettle!!!!","reviewDate":"September 10, 2019","reviewText":"I like this kettle, simple black design and enough capacity. Easy to make boiling water Just put some water and press switch. Non slip handle is safe."},{"reviewerName":"VV","rating":"5.0 out of 5 stars","reviewTitle":"Easy pour","reviewDate":"October 16, 2019","reviewText":"This electric kettle makes a good gift for a college freshman moving into the dorm. It heats water very quickly. I was impressed with how quiet and quick it is."},{"reviewerName":"Tracey","rating":"5.0 out of 5 stars","reviewTitle":"Nice kettle","reviewDate":"September 6, 2019","reviewText":"This is a nice kettle. Easy to use and easy to clean. Great for travel or camping.. gets the water the right temp and also cools down qickly"},{"reviewerName":"MohitR","rating":"5.0 out of 5 stars","reviewTitle":"Beautiful black hot water kettle","reviewDate":"October 5, 2019","reviewText":"Awesome kettle for daily use. We use it for preparing tea and boiling water for making instant foods like oatmeals and noodles. It has a stainless steel body which makes it sturdier then other glass kettles available in the market. Heats the water instantaneously within minutes with no mess. It auto shuts off when water is boiled. Highly recommend it if you are looking for a good quality kettle."},{"reviewerName":"Sam Tayeh","rating":"5.0 out of 5 stars","reviewTitle":"Electric kettle","reviewDate":"October 15, 2019","reviewText":"Works great a full pot will boil in about 5-7 minutes it also has automatic shutdown when the water is boiling and ready to use"},{"reviewerName":"Cindy Chang","rating":"1.0 out of 5 stars","reviewTitle":"plastic taste.","reviewDate":"November 12, 2019","reviewText":"I'm returning this kettle. I've boiled and thrown out the water at least 10 times and it still has a weird plastic taste."},{"reviewerName":"Daniel Younger","rating":"5.0 out of 5 stars","reviewTitle":"Works great looks great.","reviewDate":"October 13, 2019","reviewText":"This kettle works great. Very happy with it. Ready to use right out of the box. Hot water in under a minute. Stylish and sturdy."},{"reviewerName":"Victoria","rating":"5.0 out of 5 stars","reviewTitle":"Good purchase","reviewDate":"November 5, 2019","reviewText":"Super nice and looks great on my counter and it’s a perfect size! Added bonus easy to clean and works amazing :) very happy"},{"reviewerName":"Trong Dinh","rating":"5.0 out of 5 stars","reviewTitle":"Quick and easy","reviewDate":"September 22, 2019","reviewText":"Nothing crazy or rocket science simple and easy to use... boil the water within minutes instead of the traditional burner.."},{"reviewerName":"Ryan McNamara","rating":"5.0 out of 5 stars","reviewTitle":"Easy to use, quick heat up time","reviewDate":"September 27, 2019","reviewText":"The perfect kettle for your tea! It heats up fast, so easy to use, just plug in and you’re good to go! Makes drinking tea that much easier."},{"reviewerName":"Clare DiPhillilpo","rating":"5.0 out of 5 stars","reviewTitle":"Quick and convenient","reviewDate":"October 10, 2019","reviewText":"This is so quick and convenient! It will also keep my water hot for a while. Easier than boiling on a stove! Love it!"},{"reviewerName":"Thomas","rating":"5.0 out of 5 stars","reviewTitle":"Beautiful kettle which is must have one for a small family","reviewDate":"October 20, 2019","reviewText":"Beautiful kettle which works really well. Exactly the one I was looking for my replacement. Double sided wall protection and auto shutoff is amazing"},{"reviewerName":"rgil21","rating":"5.0 out of 5 stars","reviewTitle":"Easy to clean and great quality","reviewDate":"September 27, 2019","reviewText":"Easy to assemble and clean, love that the cord is connected to the base and not the kettle. Gets the water hit within minutes."},{"reviewerName":"Andy A.","rating":"5.0 out of 5 stars","reviewTitle":"Love it..","reviewDate":"September 28, 2019","reviewText":"Easy to clean, easy to operate, easy to use.. auto off which is great. Fast and reliable. I highly recommend this"},{"reviewerName":"Mohammed Elganainy","rating":"5.0 out of 5 stars","reviewTitle":"Great size","reviewDate":"October 11, 2019","reviewText":"The kettle is great the size of it is perfect. Also the color is really nice and its fits in perfectly with my kitchen"},{"reviewerName":"Joseph D Yip","rating":"5.0 out of 5 stars","reviewTitle":"Great purchase!","reviewDate":"September 13, 2019","reviewText":"Great for everyday use. Looks clean and modern. Best of all is safe to touch when it is at full boil so no accidents. Definitely recommend"},{"reviewerName":"Holly Walker","rating":"5.0 out of 5 stars","reviewTitle":"Worth the price!","reviewDate":"October 18, 2019","reviewText":"This was much larger than I expected and I mean they in a good way! Definitely beyond worth the money!!!"},{"reviewerName":"TN","rating":"5.0 out of 5 stars","reviewTitle":"Love it","reviewDate":"September 29, 2019","reviewText":"Love the design and functionality. I like the material, it doesn’t get too hot when the water is boiling."},{"reviewerName":"Mary","rating":"5.0 out of 5 stars","reviewTitle":"Liked it.","reviewDate":"November 1, 2019","reviewText":"Boils water in short time. Handle doesn't get hot, and wide cap makes it easier to clean from the inside."},{"reviewerName":"Mit Desai","rating":"5.0 out of 5 stars","reviewTitle":"Awesome kittle for work","reviewDate":"September 16, 2019","reviewText":"Great little kittle. I wanted something for my work place to boil the water and this exactly does that."},{"reviewerName":"Jamie","rating":"5.0 out of 5 stars","reviewTitle":"Top Notch Kettle","reviewDate":"September 14, 2019","reviewText":"This was a great purchase! It works so well and I like how you can take the kettle off the hot plate and not have to worry about the cord! I also like how the blue light comes on when the kettle is hot. A great purchase!"},{"reviewerName":"Meghan H.","rating":"5.0 out of 5 stars","reviewTitle":"Christmas Present for Dad","reviewDate":"November 8, 2019","reviewText":"I got this for my boyfriend for his Christmas gift so he can make his pour-over coffee without a microwave in his apartment. This should let him do all that. I'm a fan of these kettles"},{"reviewerName":"Mitch Tiedke","rating":"5.0 out of 5 stars","reviewTitle":"Quick and Easy","reviewDate":"October 31, 2019","reviewText":"Love using these for easy tea and ramen as well. Heats up the water relatively quick and is easy to use. Also looks sleek and fits in my kitchen well."},{"reviewerName":"Himanshi","rating":"5.0 out of 5 stars","reviewTitle":"Easy to clean and perfectly portable","reviewDate":"September 15, 2019","reviewText":"I am very happy with this kettle. It looks cool, is easy to clean and I can carry it anywhere"},{"reviewerName":"Jared M.","rating":"5.0 out of 5 stars","reviewTitle":"Boils quickly.","reviewDate":"October 10, 2019","reviewText":"Nice kettle with high capacity. Boils water very quickly. It is very nicely designed too."},{"reviewerName":"Barry K","rating":"5.0 out of 5 stars","reviewTitle":"Amazing price","reviewDate":"November 12, 2019","reviewText":"Amazing price, the best quality. I like that this kettle heats water quickly."},{"reviewerName":"Hawk","rating":"5.0 out of 5 stars","reviewTitle":"Good looking kettle!","reviewDate":"September 7, 2019","reviewText":"Good looking kettle and seems like very good quality. Comes with a manual, but is way easy to use. Poor water into kettle, press bottom lever, lift kettle from stand and you’re good. Heats up water really fast; full around 7 minutes. Interior is stainless and high quality. Looks great on my counter. I like it!"},{"reviewerName":"S","rating":"5.0 out of 5 stars","reviewTitle":"Very Happy","reviewDate":"October 30, 2019","reviewText":"Very happy. Didn't realize it came off the base. Bonus surprise!"},{"reviewerName":"William","rating":"5.0 out of 5 stars","reviewTitle":"Quick and easy to use!","reviewDate":"August 8, 2019","reviewText":"Quick and easy to use! Water boils quickly depending on the amount of water. A simple and easy button to flicker on to start boiling and it turns off automatically once it reaches the boiling temperature. No issues so far!"},{"reviewerName":"Eduardo Mei","rating":"5.0 out of 5 stars","reviewTitle":"Great purchase","reviewDate":"October 16, 2019","reviewText":"Has a modern look and does have a coil like traditional electrical kettles. Which makes it easy to use and clean."},{"reviewerName":"Hai H.","rating":"5.0 out of 5 stars","reviewTitle":"Kettle is good for steeping lose tea","reviewDate":"September 26, 2019","reviewText":"This kettle boils fast and wide opening great for steeping tea"},{"reviewerName":"Rhett Sorrow","rating":"5.0 out of 5 stars","reviewTitle":"Awesome","reviewDate":"September 20, 2019","reviewText":"This is a awesome product the best one that I have got"},{"reviewerName":"Jessica Brendlinger","rating":"5.0 out of 5 stars","reviewTitle":"Perfect for Camping.","reviewDate":"August 24, 2019","reviewText":"Love it!! We use this for camping and it is perfect! Heats up quickly and works quietly."},{"reviewerName":"Akhil","rating":"5.0 out of 5 stars","reviewTitle":"Good quality and does the job","reviewDate":"August 7, 2019","reviewText":"Heats up water for tea real quick and the kettle is sturdy"},{"reviewerName":"Bannu Gadu","rating":"5.0 out of 5 stars","reviewTitle":"Best kettle and easy to carry,just loving it","reviewDate":"October 14, 2019","reviewText":"In love with this Cordless Electric Kettle, this saves my time a lot. It is easy to carry anywhere like for vacations,travelling and work place. This kettle can be used for many purposes. Just loved this product."},{"reviewerName":"Cam","rating":"5.0 out of 5 stars","reviewTitle":"Good quality kettle.","reviewDate":"October 15, 2019","reviewText":"Great product easy to use. I’m very happy with my purchase."},{"reviewerName":"Sheri Robenstine","rating":"5.0 out of 5 stars","reviewTitle":"Quick heat up","reviewDate":"August 7, 2019","reviewText":"This kettle has a sleek design and heats up quickly. It is very quiet and you can only hear the water boiling. It has an automatic shut off when the water boils. The outside does not get super hot and you are able to touch it, which is different from other kettles I have had."},{"reviewerName":"Monica Williams","rating":"5.0 out of 5 stars","reviewTitle":"Great quality for a great price!","reviewDate":"September 13, 2019","reviewText":"I am in love with my new electric kettle it heats super fast, I love the grip on the handle, cleaning looks much easier than my old electric kettle and love the look of the product."},{"reviewerName":"Maria Lourdes Cappleman-Bajet","rating":"5.0 out of 5 stars","reviewTitle":"Practical","reviewDate":"November 3, 2019","reviewText":"Just the right item for my kitchen."},{"reviewerName":"Pamela Howe","rating":"5.0 out of 5 stars","reviewTitle":"Electric kettle","reviewDate":"November 6, 2019","reviewText":"Love this. It heats to boiling in less tha 5 min. I like the idea that the only thing that gets hot is the water.\nSuper easy to use."},{"reviewerName":"Ann Merrell","rating":"5.0 out of 5 stars","reviewTitle":"Great size and easy to use. Great value for the money.","reviewDate":"November 5, 2019","reviewText":"I yet got this and I love the size and how easy it is to use. I used it right away to make hot chocolate."},{"reviewerName":"Sumera","rating":"5.0 out of 5 stars","reviewTitle":"Nice hot hesting kettle","reviewDate":"October 14, 2019","reviewText":"Convient now to boil water.. i like it.. no more waiting.. its quick"},{"reviewerName":"Ahri","rating":"5.0 out of 5 stars","reviewTitle":"Easy to use (:","reviewDate":"September 8, 2019","reviewText":"It is easy to figure out and use since all you have to do is press a button for boiling and to open/close lid! The design is sleek and simple and it doesn’t take long to boil."},{"reviewerName":"Justin M","rating":"5.0 out of 5 stars","reviewTitle":"Easy to use","reviewDate":"November 6, 2019","reviewText":"It heats up fast, it’s easy to use"},{"reviewerName":"Kelvin Huang","rating":"5.0 out of 5 stars","reviewTitle":"Easy to use","reviewDate":"October 10, 2019","reviewText":"Nice looking and easy to use. I can boil some eggs in there for convenient"},{"reviewerName":"Allison Kymer","rating":"5.0 out of 5 stars","reviewTitle":"French press coffee approved","reviewDate":"October 10, 2019","reviewText":"Heats up water much faster than on the stove and looks nice in the kitchen"},{"reviewerName":"Regina","rating":"5.0 out of 5 stars","reviewTitle":"Quick and easy to use","reviewDate":"November 8, 2019","reviewText":"This product is super easy to use and heats up to full temperature within just a few minutes."},{"reviewerName":"cory","rating":"5.0 out of 5 stars","reviewTitle":"Great product","reviewDate":"August 10, 2019","reviewText":"Outstanding quality! Highly recommend"},{"reviewerName":"Victoria M","rating":"5.0 out of 5 stars","reviewTitle":"Sleek and efficient","reviewDate":"October 12, 2019","reviewText":"Great product! Very sleek looking but efficient. Well presented and easy to use. Definitely recommend."},{"reviewerName":"Kayla","rating":"5.0 out of 5 stars","reviewTitle":"Cord isn’t very long","reviewDate":"October 12, 2019","reviewText":"I like the color and size of this kettle! Inside is stainless steel and has the measurements so don’t worry!"},{"reviewerName":"Sowmini","rating":"5.0 out of 5 stars","reviewTitle":"Value for money and quality","reviewDate":"October 15, 2019","reviewText":"The product is very helpful for all over heating use, uses very less power and works just the way mentioned in the description"},{"reviewerName":"Lenna Mitchem","rating":"5.0 out of 5 stars","reviewTitle":"Great kettle","reviewDate":"August 6, 2019","reviewText":"Heats up quickly. Nice, sleek look."},{"reviewerName":"Brenden Trussell","rating":"5.0 out of 5 stars","reviewTitle":"Packed great, and works spendidly","reviewDate":"October 10, 2019","reviewText":"This item came quickly in the mail, and was packed professionally. Nothing was damaged at all. It's perfect, and works great and quickly."},{"reviewerName":"Michael Early","rating":"5.0 out of 5 stars","reviewTitle":"Durable and easy to clean","reviewDate":"September 25, 2019","reviewText":"Generic outside box. Heats fast and easy to clean. Seems durable. Works with standard USA plus."},{"reviewerName":"Qball","rating":"5.0 out of 5 stars","reviewTitle":"Great kettle","reviewDate":"August 4, 2019","reviewText":"Sleek design heats water quickly. Great pour spout and cool to the touch"},{"reviewerName":"ghada alsayed","rating":"5.0 out of 5 stars","reviewTitle":"great one!","reviewDate":"October 10, 2019","reviewText":"really nice purchase. excited to share it with my office mates!"},{"reviewerName":"Robin Soni","rating":"5.0 out of 5 stars","reviewTitle":"Its very convenient and easy to use. Lots of benefits","reviewDate":"October 10, 2019","reviewText":"Its a awesome product , which i was looking from years. I want to give it 5 stars. It will be very useful in winters."},{"reviewerName":"Shyam Sashank Karri","rating":"5.0 out of 5 stars","reviewTitle":"Go for it!!!!","reviewDate":"October 9, 2019","reviewText":"Product is amazing, could get things heated in no time. Works like a champ."},{"reviewerName":"Na","rating":"5.0 out of 5 stars","reviewTitle":"Great electric kettle","reviewDate":"November 11, 2019","reviewText":"It is nice kettle. It heats quickly and good for my office."},{"reviewerName":"alpha","rating":"5.0 out of 5 stars","reviewTitle":"Nice water pot","reviewDate":"November 7, 2019","reviewText":"Just what I wanted. A good balue"},{"reviewerName":"Rose collins","rating":"5.0 out of 5 stars","reviewTitle":"Safety and price","reviewDate":"November 11, 2019","reviewText":"Tea. Works fine and shuts of safely. What every old hag needs!"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"hot water fast","reviewDate":"November 10, 2019","reviewText":"The lid doesn't open completely up which makes cleaning harder."},{"reviewerName":"Mi Chung","rating":"5.0 out of 5 stars","reviewTitle":"Great","reviewDate":"November 5, 2019","reviewText":"Would recommend this one. Very good"},{"reviewerName":"Leo Williams","rating":"5.0 out of 5 stars","reviewTitle":"Wife loves it","reviewDate":"October 2, 2019","reviewText":"Quick and easy to use"},{"reviewerName":"virginia","rating":"5.0 out of 5 stars","reviewTitle":"quick and easy to use","reviewDate":"November 9, 2019","reviewText":"Love the ease of using this - have a friend that wants one for her birthday -"},{"reviewerName":"Kirsten McQueen","rating":"5.0 out of 5 stars","reviewTitle":"Quick","reviewDate":"September 10, 2019","reviewText":"Quick heat up and great auto power off"},{"reviewerName":"Scott McDonald","rating":"5.0 out of 5 stars","reviewTitle":"Everything went great","reviewDate":"November 10, 2019","reviewText":"All as expected"},{"reviewerName":"Chen-Hua Wang","rating":"5.0 out of 5 stars","reviewTitle":"good","reviewDate":"September 30, 2019","reviewText":"it is a valuable product."},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Good looking","reviewDate":"November 11, 2019","reviewText":"Like everything about this."},{"reviewerName":"Teresa","rating":"5.0 out of 5 stars","reviewTitle":"Love it.","reviewDate":"October 21, 2019","reviewText":"Love it! Easy to use and heats up fast!"},{"reviewerName":"Vijaykakara","rating":"5.0 out of 5 stars","reviewTitle":"Worth the price","reviewDate":"October 11, 2019","reviewText":"Good product. Easy to use"},{"reviewerName":"sja_cwm","rating":"5.0 out of 5 stars","reviewTitle":"Does its job.","reviewDate":"November 9, 2019","reviewText":"It boils water really well."},{"reviewerName":"JKIM","rating":"5.0 out of 5 stars","reviewTitle":"Simple design","reviewDate":"October 14, 2019","reviewText":"Simple and works great"},{"reviewerName":"Olivia","rating":"5.0 out of 5 stars","reviewTitle":"Great addition to my kitchen","reviewDate":"August 18, 2019","reviewText":"Great quality and looks modern!"},{"reviewerName":"Helen Guo","rating":"1.0 out of 5 stars","reviewTitle":"Poor quality","reviewDate":"October 16, 2019","reviewText":"The bottom of the kettle has got a rusty stain after a few days use. Very poor quality"},{"reviewerName":"Dustin A","rating":"5.0 out of 5 stars","reviewTitle":"Tea party time!","reviewDate":"October 15, 2019","reviewText":" I have to say, I am rather impressed at how quick water does boil inside this electric kettle. After the recommended cleaning with vinegar & a few rinses it was ready to go. The base has a convenient cord wrap built into the bottom of it & the kettle sits firmly in place on the base. I started with .5 liter (2 cups) of water & it boiled in less than three minutes & the power automatically shut off ten seconds after of a good rolling boil. The kettle is effortless to remove from the base & pouring out hot water through the spout didn't create any leftover drips. The switch is on when you flip it and a blue light appears. When water starts heating up, it sounds like a volcano so you definitely know it is working. Press the button on the handle to open the lid & be careful, as steam will rise out.\nHot water does stay hot for quite a bit, and the kettle dried itself when empty. The outside of the kettle was slightly warm at best.\nWater boiled alot quicker in this kettle than it does in the microwave & stove combined. Especially when everyone wants oatmeal for breakfast in the morning & rushing to get out the door. The power of hot water is good for tea, hot chocolate & sometimes getting rid of ants, and this kettle easily heats up water in a short amount of time."},{"reviewerName":"Tara","rating":"5.0 out of 5 stars","reviewTitle":"Works Well, Easy to Use","reviewDate":"September 28, 2019","reviewText":" It is a great kettle. It is well-made and durable.\nYou can boil plenty of water sufficient for the whole family.\nAuto shut off function takes care of worries of spilling.\nThe lid opens pretty wide so it is very easy to clean.\nYou can use it for hard boiling eggs too.\nA reliable and easy to use kettle.\nFive stars performance."},{"reviewerName":"J. Reid","rating":"1.0 out of 5 stars","reviewTitle":"Yes! Electric kettles are generally awesome! This one is not!","reviewDate":"October 15, 2019","reviewText":"Anyone who has ever used an electric kettle before (which does not seem to include most reviewers) will be disappointed by the shoddy workmanship and weird design decisions of this kettle.\n\nFirst off, the thing doesn't have a fill gauge, so you can't tell how much water is in it. That's a pretty major deviation from kettle standards and it's stupid. Secondly, both the kettle and the base are made of such flimsy material that it's virtually impossible to sit the kettle flat on the counter when it's empty. It feels cheap. Lastly, if you pour the water out at any real rate, the lid half opens and boiling water comes out of the top.\n\nThere are probably more fun and dangerous flaws out there for us to find, but after the first boil, we packed it up and sent it back.\n\nYes, electric kettles are fantastic! But keep your standards higher, people!"},{"reviewerName":"Mitymom","rating":"5.0 out of 5 stars","reviewTitle":"Electric Kettle - It's fast","reviewDate":"August 5, 2019","reviewText":"This electric kettle heats up water pretty fast. Faster than the microwave. It will hold a max of 1.7 liters, which is a little over 7 (8 oz) cups. The only unfortunate thing is that the lid doesn't completely open which makes it a little difficult to fill, but otherwise it works well.\nI am a tea drinker, and i use a specialty loose tea. I prefer loose tea because whole tea leaves give a better flavor than ground up tea leaves and tea bags have a funny taste. So the electric kettle is a great thing to have at the house and at work. I heat up my water, put it and the tea leaves in my french press and let it steep. The tea tastes perfect, and it's much faster than a kettle on the stove, microwave, or heating bunches of water in the keurig."},{"reviewerName":"Brenda barton","rating":"5.0 out of 5 stars","reviewTitle":"Love it","reviewDate":"September 9, 2019","reviewText":"Nice looking\nCan leave in counter or put away\nSo simple to use\nWorks great"},{"reviewerName":"avega","rating":"5.0 out of 5 stars","reviewTitle":"Simple, fast and effective","reviewDate":"October 16, 2019","reviewText":"This kettle is really fast and simple. There is no setup or complicated buttons to press; there is only 1 'lever' that doubles as a light indicator, it will turn blue while heating and will turn off after boiling the water.\nJust fill it with water (maximum capacity is 1.7 liters) and in a few minutes you will have boiling water to prepare tea, coffee, hot cocoa, ramen noodles, oatmeal or anything else.\nI'm a coffee drinker and I always use my coffee maker. Since I got this electric kettle I have been drinking more tea. The temperature is perfect and much better than heating water in the microwave.\nI mentioned before that it is fast. I would say 3-5 minutes and you have boiling water ready to go.\nThe inside is stainless steel and has a double wall structure. The water has no strange flavors. The electric cord wraps around the underside of the heating plate when not in use.\nThings to improve: I wish the base was made out of steel and that the lid can be completely removed for better cleaning."},{"reviewerName":"Southwest Lady","rating":"5.0 out of 5 stars","reviewTitle":"Less Chance of Burns With Cool Exterior","reviewDate":"August 8, 2019","reviewText":"This is the third electric kettle that I have owned and it is the best of the three. The last one I had was stainless outside, which looked nice, but with single-wall construction the exterior got hot and I had to be careful when lifting the kettle and pouring out the hot water. This one has a nice insulating layer on the outside which prevents burning myself. I like the cord storage under the base so it's out of the way when not in use. It's nice having the kettle cordless so I can carry it to the kitchen table to make myself another cup of tea. The markings on the inside make it easy for me to fill with the amount of water I need. These kettles can develop scale, so I use distilled water and I don't have to clean out the kettle and it stays nice. This kettle delivers hot water fast, much better than boiling on the stove in a conventional whistler teapot or in the microwave."},{"reviewerName":"Calvin Cheng","rating":"4.0 out of 5 stars","reviewTitle":"Great value, simple-to-use, and safe","reviewDate":"October 19, 2019","reviewText":"First off—the design of this kettle is quite sleek, and makes for an attractive piece in the kitchen.\n\nIn terms of functionality, I am very happy with how quickly the kettle is able to raise the temperature of the water to a boil, and the double-wall construction allows for much safer operation. No need to worry about burning my hands by accidentally touching the sides of the kettle!\n\nThe kettle itself is quite simple to fill, with a wide mouth. I have had poor experiences wit kettles with cords in the past, so I am very pleased with the ability to simply pick up the kettle without having to worry about managing the cable.\n\nOverally, I am very pleased with this kettle, and would be very happy to recommend this to anyone looking for a great kettle for a decent price!"},{"reviewerName":"Yausio","rating":"5.0 out of 5 stars","reviewTitle":"This electric kettle is totally worth the money!","reviewDate":"October 19, 2019","reviewText":"The BEST thing about this electric kettle is the outer surface won’t get hot while boiling.\nI’ve two cats which they won’t get hurt because of the heat of the surface.\nI have a stainless steel kettle before and my cats always lean on it. I’m afraid that they might get hurt one day.\nMaximum volume of water is 1.7L which I think is really good.\nAlso, while boiling, it has a blue indicator (I think blue light is way better than the traditional red light) on telling you that it’s boiling.\nThe interior of the kettle is stainless steel which I think is safe to drink the water.\nOverall, I think this electric kettle is totally worth it big reason because the surface won’t get hot while boiling."},{"reviewerName":"Francis Chau","rating":"5.0 out of 5 stars","reviewTitle":"Sleek, Modern & Worthy Tea Kettle!","reviewDate":"August 20, 2019","reviewText":"I have always used Electric Tea Kettles because they heat water more efficiently and effectively than on the stove.\nThis one has been one of my favorites.\n\nI love that it is black on the outside vs just the stainless steel look. It has more of modern look to it. and the whole Cylindrical shape make is more modern looking vs anything that is rounded.\nIt heats up water fast, too!\n\nI really like that it has the volume markings on the inside so it takes the guess work out of measurement. My previous water tea kettle had a viewing chamber but the paint had worn off and it was hard to see.\n\nOverall, really looking forward to using this for a long time!"},{"reviewerName":"Alex G.","rating":"5.0 out of 5 stars","reviewTitle":"Really puts time back in my schedule","reviewDate":"September 26, 2019","reviewText":"When your wife is pregnant and you want to survive, you do whatever you can to make her comfortable. Bring blankets, rub feet, make late night grocery store runs. Above all that, you bring her tea. Now, with pregnancy, the teas vary. It’s not always the same comforting chamomile. Frankly, I got sick of making multiple cups a night I. The microwave and this little Swedish kid on the news made me second guess my heating apparatus of choice. So I got this electric kettle and joy of joys woes be gone! It’s so easy to set up and use and once you make the first pot you’re done for the night. Now I have time to rub my own feet and the kettle stays warm cup after cup"},{"reviewerName":"Karencurlz","rating":"5.0 out of 5 stars","reviewTitle":"Great sleek-looking kettle","reviewDate":"September 17, 2019","reviewText":"This kettle is stylish and functional. The pot sits on the round base for heating and then you just pick up the kettle to pour. The base is connected to the electrical cord which makes it very easy to manipulate the kettle. Other kettles I have owned have the cord connected to the kettle which makes it a little awkward when trying to pour the hot water or trying to bring it to the table. The lining of the kettle is stainless steel and it cleans very easily. The water heats up very quickly and the kettle stops heating once the water reaches the correct temperature. I really like the black color which adds a certain sophistication to the product."},{"reviewerName":"Mauro Clemente G.","rating":"5.0 out of 5 stars","reviewTitle":"Heats fast, looks nice, cleans even easier","reviewDate":"September 20, 2019","reviewText":"As it says in the instructions, the less the water the fastest it heats up. Two big cups of water will normally heat up to a decent chamomile tea temperature in about 3 minutes. The measurement scale is inside the canister so there are no extra cleaning spaces when it comes to mineral deposits. The other nice touch is the electrical cord’s storage space in the base, no need to have the cord dangling around."},{"reviewerName":"Fred","rating":"5.0 out of 5 stars","reviewTitle":"Electric kettle that's fast and won't break your wallet","reviewDate":"September 18, 2019","reviewText":"I've been using this for 2 days at my house. My parents like to drink their tea and coffee with very hot water. I'm quite surprised how fast this kettle can boil water. I read the reviews first and like everyone says it's a good wishing kettle. It takes about 6 minutes or so to boil a full picture of water in the kettle. You don't have to boil a full of pitcher. I've heated half to quarter full and it takes less time. What's great about this is the inside is all stainless steel. There is no plastic part inside. And it looks great on my center kitchen island counter. Just take a look at the photo."},{"reviewerName":"JITHIN J THOMAS","rating":"5.0 out of 5 stars","reviewTitle":"awesome","reviewDate":"August 7, 2019","reviewText":"We really like this kettle. It was a replacement for our Sunbeam Hot Shot which we thought we could never live without. But the reviews were not good on that product anymore so we purchased this. We like this pot a lot! It takes up only a small space on the counter and heats the water up very fast. The 2 foot cord wraps in a coil and his hidden in the bottom so you pull out only the length you need -- no long cords on the counter-top anymore. It is lightweight and pours easily with no spilling or dripping. It also looks very handsome and appears to be more expensive than it is. This is a very good buy."},{"reviewerName":"Ryan RC Rea","rating":"5.0 out of 5 stars","reviewTitle":"A well built kettle","reviewDate":"October 21, 2019","reviewText":"I'm so glad I found this kettle, I had one before but it was completely plastic and cheaply built. This kettle on the other hand is well built AND has stainless steel inside.\n\nI also love the fact that the base rotates 360 and lifts off very easily. I've used this for tea, instant ramen and max and cheese. It provided water that more than hot enough.\n\nMy only suggestion is that the blue light on the switch be brighter when it's on... But that's only an visual issue.\n\nOverall, this a wonderful replacement to my old kettle."},{"reviewerName":"Andrea","rating":"5.0 out of 5 stars","reviewTitle":"Safe kettle for your home!","reviewDate":"August 19, 2019","reviewText":"There are several things that stand out and impress me with this kettle. The fact that the outside stays cool while the inside holds boiling water makes this a safe and effective appliance for my home. It also has an automatic shut off feature which is also a great safety feature. It boils water quickly and is a sharp looking kettle. This product would make a great gift."},{"reviewerName":"Sheena","rating":"5.0 out of 5 stars","reviewTitle":"Easy to use","reviewDate":"November 7, 2019","reviewText":"This kettle arrived just in time! When the temp drops like it did this week, we enjoy hot tea. This kettle works very easily and quickly.\nYou plug in the bass, fill the kettle to at least .5L, no more than 1.7L (markings on the inside) and flip the switch at the bottom (the blue light will come on). In a few minutes you have boiled water. Once the blue light clicks off, it is up to temp. You can hear it boil and see the steam, then you can pour your water.\nI like that it is lined with stainless steel, no plastic touches the water."},{"reviewerName":"Kayla","rating":"5.0 out of 5 stars","reviewTitle":"Life is so much easier","reviewDate":"October 12, 2019","reviewText":"I was drawn to this because I dont have a range in my kitchen. So during the summer it's hot as crap in there. I love hot tea and pour over coffees so am always using a kettle with my stove. Which is gas so like I said that kitchen gets HOT. this is a game changer. It heats up water faster than my kettle does. I dont risk burning myself since the outside doesnt get hot at all. It sits on the charging base to get hot then you lift it off. No unplugging is needed and theres no cord from the actual kettle to the base."},{"reviewerName":"goldengopher929","rating":"5.0 out of 5 stars","reviewTitle":"Great for tea drinkers","reviewDate":"August 29, 2019","reviewText":"I'm a big tea drinker. Unfortunately, at work we don't have a stove to boil water, only a microwave. It doesn't quite get the water warm enough, or if you set it too long it boils over and makes a mess. This was a great solution. I can get my hot water to make tea in the kettle - it doesn't take that long to get it hot enough and it will even stay warm in the kettle for a while. I have been using it for tea every day and am looking forward to using it all fall and winter for making hot chocolate too. Nice for use in the office or even a dorm room."},{"reviewerName":"Sara A.","rating":"5.0 out of 5 stars","reviewTitle":"month","reviewDate":"August 6, 2019","reviewText":"I bought this a month ago because I needed a solution to a stove water kettle. This was a solution to have safe, fast hot water. I had a tea kettle and the enamel cracked within 2 years of use and I didn’t know it until I saw black flakes in my tea. I am pretty sure that enamel I was drinking which could be toxic. This water kettle is see through glass and beeps when the water is hot enough. Plus there are multiple temperatures for tea brewing. I use this kettle in the morning for pour over coffee. I love this water kettle. Highly recommend!"},{"reviewerName":"CC","rating":"5.0 out of 5 stars","reviewTitle":"Simple and easy to use electric kettle","reviewDate":"November 7, 2019","reviewText":"I had to buy this electric kettle because my regular one died on me. This one is very simple to use, just one on off button. It is a basic one. It only has one boiling temperature unlike others that have different settings for different temperatures to make different kinds of tea. Nevertheless, this kettle serves my purpose. I like that it is black in color and is sturdy instead of having a glass container. It is sleek looking and looks nice on the counter top. Looks modern."},{"reviewerName":"Mark","rating":"5.0 out of 5 stars","reviewTitle":"Wors great!","reviewDate":"September 19, 2019","reviewText":"Bought this because I was tired of boiling water for my French press. This turned out to be much better than anticipated. Its super easy to clean and super easy to use. You literally add the water, or whatever you want to boil, and in 2-4 minutes its boiling. Sure beats heating it on the stove. It was impressed on how fast it came to a boil. I think it works similar to how a K-Cup coffee maker works when it warms the water. It sounds a lot like it too. Great buy!"},{"reviewerName":"Keeper of the zoo","rating":"5.0 out of 5 stars","reviewTitle":"Great looking kettle","reviewDate":"September 23, 2019","reviewText":"I bought a similar product last year for my camper. I’ve been wanting to get another for my house and finally made the purchase. This one works great, heats the water quickly plus it looks nice on the counter. I’ve used this so far to make tea and oatmeal. The water gets hot enough quickly to make both of these with no problems. It comes in handy for quick school breakfast. It is really easy to use and cleanup was a breeze (granted it was just water in the kettle)."},{"reviewerName":"John M.","rating":"5.0 out of 5 stars","reviewTitle":"Hot water coming up!","reviewDate":"November 9, 2019","reviewText":" This kettle is very easy to use, boils water quickly, and fast to clean. It is very light weight and the overall quality is excellent. This can compare to any name brand kettle and gets the job done.\n\nAfter the water boils, the automatic switch turns off, and ready to pour. The hot water stays hot for quite awhile.\n\nI really liked my purchase and would recommend this kettle!"},{"reviewerName":"MANU J.","rating":"5.0 out of 5 stars","reviewTitle":"What a fantastic kettle - Love it !","reviewDate":"September 7, 2019","reviewText":"As soon as we opened the box, we were immediately impressed by the quality of the kettle. It feels really expensive and good quality. The material is stainless steel with very elegant black coating / look. It works very well and operation is simple. Put water and place on the base, plug it in and that's it. Water will be boiled in minutes. If you are considering buying a kettle, look no further.\n\nAlso, shipping and packing was great."},{"reviewerName":"Maheshkumar","rating":"5.0 out of 5 stars","reviewTitle":"Helpful and great quality!!","reviewDate":"September 22, 2019","reviewText":"It’s very light weight and compact. Easy to use howeve manual has been included in product. I wanted to get this to make hot water quality and wanted to avoid using microwave.\n\nNice looking kettle and seems like very good quality. Poor water into kettle, press bottom lever, lift kettle from stand and you’re good. Heats up water really fast; full in few minutes. Interior is stainless and high quality. Looks great on my counter."},{"reviewerName":"Hearth","rating":"5.0 out of 5 stars","reviewTitle":"A little heavy but its beautiful and works great.","reviewDate":"August 9, 2019","reviewText":"I love the simple and elegant design of this electric kettle, very nice and matches the modern design of my kitchen. Its easy to use and works great, though a little heavier than my old one. It boils water faster and automatically turns off when done. It isnt loud compared to my old electric kettle. With being stainless, its easy to clean. I have been using this kettle for a week now and Im still happy with this purchase. Overall, im very satisfied."},{"reviewerName":"JetSetDior ","rating":"5.0 out of 5 stars","reviewTitle":"Cool to the touch sold me!","reviewDate":"August 20, 2019","reviewText":"This is by far the fastest water boiler I have ever used the one click button is very easy and the outer plastic feeling is surprisingly better because I don't burn when touching i this is by far the fastest water boiler I have ever used the one click button is very easy and the outer plastic feeling is surprisingly better because The outer cover stays cool in case you use a second hand on the actual boiler. Its aweosme!"},{"reviewerName":"Tibu John","rating":"5.0 out of 5 stars","reviewTitle":"Heats up water in a few minutes. Better alternative to heating water in stove top and microwave","reviewDate":"October 26, 2019","reviewText":"It is winter and everyone in the family likes to drink warm water. Kids wake up at night asking for water when sick and getting to the microwave and heating up water has been a pain. With this i can heat up water at night and it remains warn through the night. The water boils in 6-7 minutes and the good thing is there is no plastic parts in contact with water, which makes it safe to drink"},{"reviewerName":"Het Banker","rating":"5.0 out of 5 stars","reviewTitle":"Nice little kettle","reviewDate":"September 18, 2019","reviewText":"This kettle also has unusual and useful features such as an automatic keep warm setting which activates as soon as the water reaches temperature and continues to run for up to an hour. It is well designed. I have to say that this does heat up the water rather quickly. This kettle is not only convenient, but it's also very stylish. It has a textured design around the top and along the bottom edge."},{"reviewerName":"Tom","rating":"5.0 out of 5 stars","reviewTitle":"Great price & Easy to use","reviewDate":"September 23, 2019","reviewText":"So easy to use. I'm amazed at how quickly it heats up water. So easy to clean. I can make tea with no time now. I love how it has the button to open the top. It auto shutdown when the water is boiled so I don't have to watch every time I boil the water. I wish I bought the one that I can see the water level so that I can see the water level. Other than that, I'm very happy with this kettle."},{"reviewerName":"LB","rating":"5.0 out of 5 stars","reviewTitle":"Great Electronic Kettle","reviewDate":"August 19, 2019","reviewText":"I primarily bought this to boil water for Tea and making Coffee using a French Press. It boils water very quickly and is easy to use; just pore water and press the button down. Water will get to a boiling point pretty quick. Really economical considering the capacity of this kettle. So much easier than manually heating water with a regular kettle. I would definitely recommend this to a friend."},{"reviewerName":"Aleirita.","rating":"5.0 out of 5 stars","reviewTitle":"Is tea time!","reviewDate":"October 18, 2019","reviewText":" Nice electric water kettle! Great to have especially in this cold fall/winter days! . super easy to install, just take out of the box, wash and plug it in!. . and even more easy to use, add water, turn on, wait till is done and voila! , the little lever where you turn it on will pop out once the water is boiling. Not heavy to handle."},{"reviewerName":"keerthi","rating":"5.0 out of 5 stars","reviewTitle":"Wonderful option for busy life","reviewDate":"September 19, 2019","reviewText":"Works great . Large capacity good for boiling water , milk . Stainless steel is the good for these boiling things . In my family we prefer having hot water daily in the mornings .\nTill now we used stove to do such activities. This one is very handy .During these cold weathers it is a good option to have electric kettle . Nice one to carry in trips long travels .Highly recommend ."},{"reviewerName":"Anuj Tewari","rating":"5.0 out of 5 stars","reviewTitle":"best in capacity and value for money","reviewDate":"October 11, 2019","reviewText":"I simply love the capacity and quality of this product. Also, If you heat water on a regular basis to make hot beverages or instant foods, but do not want to use a noisy microwave or wait for your stove to heat up, this is the perfect addition to your kitchen. It conveniently boils water directly in a matter of minutes. A great deal overall. -Value for money."},{"reviewerName":"Ali","rating":"5.0 out of 5 stars","reviewTitle":"Good looking Electric kettle","reviewDate":"August 18, 2019","reviewText":"This kettle looks really good and after a few days of use has been functioning very well. Works fast, gets 5-6 cups of water to boiling temperature in less than 2min. So far satisfied.\nThe main issue with most electric kettles is long term durability, which I can't comment on for now. But I will update this review in a few month if it broke down."},{"reviewerName":"LT_us","rating":"5.0 out of 5 stars","reviewTitle":"Good looking kettle works well","reviewDate":"October 13, 2019","reviewText":"This kettle works just as expected. It is a larger than the normal kettle (1.7L) so that is convenient. I have never used a kettle that was not cordless so the cordless aspect did not stand out much for me. Functionally it is not different from any other electric kettle I’ve used, but the matte black body looks minimalistic and modern."},{"reviewerName":"Eric J","rating":"5.0 out of 5 stars","reviewTitle":"Nice, Clean-looking Water Heater","reviewDate":"September 20, 2019","reviewText":"The water heater looks very nice and does its job. The water stays hot for a while after it boils and the stainless steel body won't burn you if you accidentally touch it. It's very easy to clean and doesn't rust.\n\nThe base looks a little lower quality compared to the actual kettle, but that's not a big issue since the kettle is going to be sitting on the base most of the time anyway."},{"reviewerName":"aw3","rating":"5.0 out of 5 stars","reviewTitle":"Lifesaver","reviewDate":"October 13, 2019","reviewText":"This was a godsend when I was sick! It is anytime but I was bedridden and couldn’t walk to the kitchen to keep making tea and this was so convenient I had it right by me and didn’t have to heat the stove up over and over again. I’m so excited to keep finding more and more uses for this, it will make your life much easier"},{"reviewerName":"Sesundor","rating":"5.0 out of 5 stars","reviewTitle":"Great electric kettle","reviewDate":"August 11, 2019","reviewText":"Hor health safety reason, we always worried with our old kettle that has plastic material inside the kettle. Now, this product solves the problem. The kettle is quite big which is a plus and it looks very modern. I would recommend this product to anyone that has similar concern with us about plastic material inside the kettle."},{"reviewerName":"Ken Izawa","rating":"5.0 out of 5 stars","reviewTitle":"Boils fast, compact and nice design!","reviewDate":"October 28, 2019","reviewText":"I like that this is not like the other water kettles that are of higher capacity. This is perfect for any home. I use it myself for coffee and tea but also bring it to my family's home when I travel as it boils water quickly but is also light and convenient enough to use on trips. Highly recommended, boils fast!"},{"reviewerName":"Kyle B.","rating":"5.0 out of 5 stars","reviewTitle":"Heats up fast and has great design","reviewDate":"September 19, 2019","reviewText":"This kettle has an amazing boil time. Water began to boil within less than 5 minutes if switching on. The design is simple and the cord is attached only to the base allowing for the kettle itself to be cordless. It has measurement markings on the inside for an easy pour and instructions included make for a quick learn."},{"reviewerName":"Joe Chen","rating":"5.0 out of 5 stars","reviewTitle":"Nice Kettle!","reviewDate":"September 28, 2019","reviewText":"This electric kettle is durable, sleek, and easy to use. Heats water up quickly without annoying noises and it has a good capacity for water. Maintains temperature well and has no leaks. The design makes it easy to pour and this is a good price point. For those who love to drink tea or make ramen, this is great."},{"reviewerName":"Sheela S","rating":"5.0 out of 5 stars","reviewTitle":"Useful kettle Elegant design!","reviewDate":"October 16, 2019","reviewText":"This kettle is so useful. It has a large capacity if 1.7l so I don’t have to refill it frequently. I love it’s elegant black matte exterior. The double walled steel interior makes sure that the water temperature remains hot for a long time and plastic does not come in contact with the water. Love it!!"},{"reviewerName":"Trung Tran","rating":"5.0 out of 5 stars","reviewTitle":"No more fire hazard!!","reviewDate":"October 9, 2019","reviewText":"This saved our lives! My husband was notorious for leaving our old school kettle burning until all the water evaporated and smoke appeared. Having this kettle with the automatic off features prevents fire in our home. The water heats quickly ( I think just 5 mins) and stays warm for a good amount of time."},{"reviewerName":"Christian L","rating":"5.0 out of 5 stars","reviewTitle":"Don't have a stove, this is a must have!","reviewDate":"November 10, 2019","reviewText":"I currently am without a stove, and a friend recommended I pick up an electric Kettle, and they sent me this one.\n\nIt's awesome for the price, and I've been very happy with it. Seems to get the water boiling just fine, and there isn't anything I'd really consider to be a down side!"},{"reviewerName":"evelyn rivera","rating":"5.0 out of 5 stars","reviewTitle":"Cordless kettle","reviewDate":"October 16, 2019","reviewText":"Great electric kettle, it’s cordless which allows you to lift off the base and serve you tea easily. Heats up super quick so preparing tea ,instant coffee , or chocolate doesn’t take long. The quality is awesome , BPA free , and double walled structure is a plus.\nRecommend this kettle highly."},{"reviewerName":"maria menendez","rating":"5.0 out of 5 stars","reviewTitle":"Great electric kettle!","reviewDate":"August 7, 2019","reviewText":"This is a very nice kettle. It is large and easy to use. The interior is stainless steel and the heating unit is the base where the ac cord is located. It heats up the water quickly and the kettle can be moved off the base to serve the hot water. I love tea and this kettle makes it very simple to make a cup or two."},{"reviewerName":"amy warnick","rating":"5.0 out of 5 stars","reviewTitle":"works great","reviewDate":"October 11, 2019","reviewText":"I got this for our breakroom and it was a good purchase. we can make tea or hot chocolate or instant anything in 5/6 minutes. this kettle looks very well constructed. it would also be great for a dorm room or an apartment that had limited space. this kettle looks good and works good."},{"reviewerName":"Greenfae30","rating":"5.0 out of 5 stars","reviewTitle":"Great for an Avid Tea Drinker!","reviewDate":"August 11, 2019","reviewText":"I have been trying to drink more tea and someone suggested that I get an electric kettle. I love the convenience of this. I put water in, press the button and minutes later I have hot water! Easy to pour and love that I can bring it to the table if I have guests over and not be tethered by a cord."},{"reviewerName":"Munsu","rating":"5.0 out of 5 stars","reviewTitle":"Safe and fast heating kettle","reviewDate":"September 11, 2019","reviewText":"This is a high quality electric kettle. Best part is water only comes in contact with the interior stainless steel. Operation is very simple and your water will be boiled in matter of minutes. Heats up water very fast; full capacity in 7 minutes. Looks great on my counter. Love it."},{"reviewerName":"Sam Wicks","rating":"5.0 out of 5 stars","reviewTitle":"Great quality. Its sturdy. Boils water quick!","reviewDate":"October 13, 2019","reviewText":"Great quality.\nIts sturdy and big.\nIt boiled the whole pot in under 6 minutes.\nI love that it only needs to be plugged in while boiling and then you can just take it right off and pour.\n\nThis could also work great for a students dorm or a breakroom."},{"reviewerName":"Destiny","rating":"5.0 out of 5 stars","reviewTitle":"Great kettle.","reviewDate":"October 29, 2019","reviewText":"Great kettle. Easy to use. Good for boiling water for my cocoa or tea. Or my little one's formula water. Make sure you clean before using. Cordless. I think I'm going to get my mom one for Christmas. She needs her coffee everyday. Comes with an instruction manual."},{"reviewerName":"Ilovesummer","rating":"5.0 out of 5 stars","reviewTitle":"Cordless kettle","reviewDate":"October 19, 2019","reviewText":"This is a great quality stainless steel kettle. It boils very fast and it is very easy to use. This is perfect for every day use. Good value for the money. This will also make a great birthday or Christmas gift. I am very happy with this product and I highly recommend it!"},{"reviewerName":"Carolina","rating":"5.0 out of 5 stars","reviewTitle":"Easy, fast, good!","reviewDate":"September 24, 2019","reviewText":"I have been using this kettle daily for more than a week and we love it. We love taking tea and this one is super fast to heat the water and very easy to clean. I have not heated anything else but water. It is a must for our house now, so easy to get use to it"},{"reviewerName":"Roath Lim","rating":"5.0 out of 5 stars","reviewTitle":"Been using this for 3 days and we are loving it.","reviewDate":"August 19, 2019","reviewText":"Usually in the morning, I would go and fill the kettle and heat it on the stove. This pot is no difference but the portability of it, is nice. In the morning, i would just heat it and make my coffee. Then my wife would come later and flip the switch and it was pretty quick."},{"reviewerName":"Vicky","rating":"5.0 out of 5 stars","reviewTitle":"My go to for hot water.","reviewDate":"October 28, 2019","reviewText":"Super fast water heating and doesn’t make much noise, if using it early morning or kate night cup of hot chocolate. The color and material is good, the plastic part doesn’t touch water, that is what I was always worried about, not with this electric kettle anymore."},{"reviewerName":"Marie Leigh","rating":"5.0 out of 5 stars","reviewTitle":"Quick and easy hot water","reviewDate":"September 30, 2019","reviewText":"Finally an easy way to get hot water without having to boiling it on the stove. The kettle is very sleek and im able to get hot water within minutes. The great part about this kettle is that it's cordless and also has an auto shut off just in case you forget."},{"reviewerName":"TD C.U.S.T.O.M.E.R","rating":"5.0 out of 5 stars","reviewTitle":"Works great!","reviewDate":"October 9, 2019","reviewText":"This Habor kettle is great overall. For the price, this is an excellent value. It takes approximately 3 - 4 minutes to boil a full kettle of water from room temperature. My point of view are Quick boiling, Great value, Easy to use, Sturdy design, Easy to Clean."},{"reviewerName":"Bobbi","rating":"5.0 out of 5 stars","reviewTitle":"Great for everything","reviewDate":"November 8, 2019","reviewText":"The kettle is great for heating up water quick. It syats hot for several hours off the burner.\nIt also heats up soup and any liquid.\nWould recommend to anyone.\nI like it has its own wammer. Does hot get hot of you touch the outside."},{"reviewerName":"Justin M.","rating":"5.0 out of 5 stars","reviewTitle":"Trendy modern **stainless steel*** kettle!!","reviewDate":"October 10, 2019","reviewText":"Didn’t realize how trendy kettles could be - this one is super cute AND ITS STAINLESS STEAL. Plastic kettles gross me out, so this one is a solid stainless steal one for a solid price. And the outside is black, so it’s super easy to clean and stays sleek."},{"reviewerName":"Jo Honaker","rating":"5.0 out of 5 stars","reviewTitle":"Loving it!!!!","reviewDate":"October 11, 2019","reviewText":"I love to drink green tea in the afternoon or after eating my meal. For the price, this kettle is an excellent value. All you have to do is put some water and turn it on and done. Amazing and I' m loving it!!! No more microwave hot water for me."},{"reviewerName":"AJ","rating":"5.0 out of 5 stars","reviewTitle":"Great quality kettle with stainless steel walls","reviewDate":"October 21, 2019","reviewText":"This is a great quality kettle with stainless steel walls inside and looks great from outside. sturdy and firm design and looks durable. its very quick and boils water in no time. i hate using microwave so this is perfect option for boiling water."},{"reviewerName":"Vivekanandan","rating":"5.0 out of 5 stars","reviewTitle":"Easy to use","reviewDate":"September 25, 2019","reviewText":"This kettle is Helpful for me, since I use it for my coffee, tea routine every morning, it’s so easy to use, and i don’t have any issues with the cord or the kettle itself.\nIt cooks the water quite fast and the warmth is ok!\nWorth for sure!"},{"reviewerName":"zuzuk","rating":"5.0 out of 5 stars","reviewTitle":"Safe kettle","reviewDate":"October 10, 2019","reviewText":"So, for me the most important thing is kettle have is automatically shutoff option and this one automatically shutoff after it boiled the water. Also, the exterior part doesn’t get hot so you are safe to touch without burning yourself"},{"reviewerName":"Jason","rating":"5.0 out of 5 stars","reviewTitle":"Quick and hot. Just what I needed.","reviewDate":"August 6, 2019","reviewText":"Needed something to get water hot enough to brew tea without boiling water on the stove. This gets the water to a good temp in less than 5 minutes without leaving a hot pot or burner exposed to kids or pets. Very happy with my purchase."},{"reviewerName":"ickkys","rating":"5.0 out of 5 stars","reviewTitle":"Hot water Hot!","reviewDate":"October 17, 2019","reviewText":"Works great! Makes my water hot in minutes and I don't have to occupy the microwave when my colleagues are all trying to heat up their lunch and I'm trying to make my ramen! Feels very sturdy and safe on the counter."},{"reviewerName":"Rich","rating":"5.0 out of 5 stars","reviewTitle":"You dont need to fill it. If you need a little water just add a little and it will heat faster.","reviewDate":"September 16, 2019","reviewText":"Heats up fast. Nice size if you ate have tea for a party. Shuts off automatically."},{"reviewerName":"Viswa","rating":"5.0 out of 5 stars","reviewTitle":"Good water kettle","reviewDate":"August 20, 2019","reviewText":"It is well designed. I use it for tea water. It heats up very fast. Very helpful in the morning. It is sturdy and durable. As it is double walled it is safe to hold outside. It can hold a lot of water. It is very easy to clean."},{"reviewerName":"Jaffer Ali","rating":"5.0 out of 5 stars","reviewTitle":"Fast-boiling","reviewDate":"October 13, 2019","reviewText":"This kettle is great! It is super fast at boiling water. It also looks really nice and sleek, and the best part is that it is stainless steel from the inside, so no mold! It's also a good size. Would recommend!"},{"reviewerName":"Stephanie","rating":"5.0 out of 5 stars","reviewTitle":"Sleek design, clean taste","reviewDate":"September 9, 2019","reviewText":"The Habor Electric Kettle heats quickly, and doesn't give off a metal taste in your drink. I tried it for a cup of tea as soon as it was delivered! I will be sure to use this for the kids oatmeal and bottles! Also, I love the design!"},{"reviewerName":"jasonack","rating":"5.0 out of 5 stars","reviewTitle":"Good size kettle","reviewDate":"November 8, 2019","reviewText":"I have used this a couple of times since receiving & I’m very happy with how well it works.\nIt’s a size nice for serving multiple people or when you need a lot of water heated & it heats up quickly."},{"reviewerName":"Shayna N.","rating":"5.0 out of 5 stars","reviewTitle":"Large capacity quality kettle","reviewDate":"August 7, 2019","reviewText":"Works super well. Our last kettle broke and I wanted a replacement that was larger than my last. This holds so much water and heats up quickly too. I really like it. I cant wait for fall to make lots of hot chocolate for the kiddos!"},{"reviewerName":"Theresa","rating":"5.0 out of 5 stars","reviewTitle":"Highly recommend","reviewDate":"September 12, 2019","reviewText":"I love this product I have always used Electric Tea Kettles because they heat water more efficiently and effectively than on the stove.\nThis one has been one of my favorites and highly recommend making the purchase."},{"reviewerName":"Cynthia Lowery","rating":"5.0 out of 5 stars","reviewTitle":"heats water almsot instantly!","reviewDate":"October 10, 2019","reviewText":"The electric teakettle is just what you need to make that cup of hot tea! It heats up before you know it! Safe food-grade materials made to be safe- no scalding, yet keeps liquids hot. Automatic shut off."},{"reviewerName":"Jake E","rating":"5.0 out of 5 stars","reviewTitle":"efficient and quick use","reviewDate":"August 8, 2019","reviewText":"I have to say that this does heat up the water rather quickly. It's essentially a cordless kettle because the interior kettle doesn't even touch the base that has the cord that heats it up. It's pretty awesome, we love it."},{"reviewerName":"Mrs. Cruz Ortega","rating":"5.0 out of 5 stars","reviewTitle":"Just what you want in an electric kettle.","reviewDate":"October 15, 2019","reviewText":"I've used electric kettles before and this one is by far the best one I've bought. It is sturdy and comfortable to touch and hold and, of course, it boils water rapidly. What else can you ask for."},{"reviewerName":"Vyas","rating":"5.0 out of 5 stars","reviewTitle":"Quick Boiling tool","reviewDate":"September 23, 2019","reviewText":"We had a smaller kettle and when we are drinking water all at a time or need or large quantity hot water it was not enough and bought this Kettle. This is super quick on getting the water heat and easy for clean and use."},{"reviewerName":"Em","rating":"5.0 out of 5 stars","reviewTitle":"very happy","reviewDate":"August 19, 2019","reviewText":"does exactly what its supposed to. boils quickly, holds plenty of water and doesn't take up much counter space. very easy to clean since the inside is nice smooth metal and it doesn't leave any metallic aftertaste."},{"reviewerName":"Libni Gonzalez","rating":"5.0 out of 5 stars","reviewTitle":"Easy to use","reviewDate":"October 16, 2019","reviewText":"I was looking for a kettle to make coffee and tea, and this fit perfectly. It boils water quickly and keeps it boiling for one or two minutes and then turns off. The capacity is a good size for me."},{"reviewerName":"Josh","rating":"5.0 out of 5 stars","reviewTitle":"Easy to use","reviewDate":"September 30, 2019","reviewText":"Very much enjoy using this!! Has great overall flavor without a doubt!! So easy to use that anyone can and cleaning was an absolute breeze.. I have tried others in the past and this is the best by far!"},{"reviewerName":"Alberto","rating":"5.0 out of 5 stars","reviewTitle":"Impressed","reviewDate":"September 10, 2019","reviewText":"It heats up the water for my tea so fast. This is going to make my life so much easier. I also love that it holds a lot of water inside so I don’t have to boil multiple times. Good value ! Would defensively recommend"},{"reviewerName":"Maggie","rating":"5.0 out of 5 stars","reviewTitle":"Perfect Way to start the morning","reviewDate":"September 17, 2019","reviewText":"Finally found an affordable large enough water boiler. Love the color and how it compliments my kitchen. Water boils fast and easy clean up. I use it almost everyday especially for my pour over coffee."},{"reviewerName":"Bob U","rating":"5.0 out of 5 stars","reviewTitle":"Very fast!","reviewDate":"September 6, 2019","reviewText":"We like hot tea and hot chocolate in our house. It's nice to not turn on the gas stove to get the water boiling, especially in the warmer months. Also convenient if you go camping. I'd recommend."},{"reviewerName":"RJJ","rating":"2.0 out of 5 stars","reviewTitle":"Lacking in quality","reviewDate":"September 29, 2019","reviewText":"Poor build. The bottom of the kettle arrived sticking out and was not properly fitted. I was able to pop it back in but it is still feels loose on one part. Look elsewhere for a quality electric kettle."},{"reviewerName":"TheAltron","rating":"5.0 out of 5 stars","reviewTitle":"Love the simplicity","reviewDate":"September 21, 2019","reviewText":"I love the simple design. It is able to boil water relatively fast. This can hold more than 1 liter of water which is plenty when it comes to cooking. Overall, this is a very good product."},{"reviewerName":"Patel Anmol","rating":"5.0 out of 5 stars","reviewTitle":"Electric keetle","reviewDate":"September 19, 2019","reviewText":"Great product, nice quality material, easy to use,easy to clean. You can get the water heated within couple of minutes and best to use while traveling. Its light weight and works amazing."},{"reviewerName":"Miss Daisy","rating":"5.0 out of 5 stars","reviewTitle":"Easy to use and attractive design","reviewDate":"August 7, 2019","reviewText":"This has a sleek design to it and also holds a pretty good volume of liquid. Great for heating up a cup of tea when you’re sitting around with your friends and not having to stand by the stove"},{"reviewerName":"Aaron","rating":"5.0 out of 5 stars","reviewTitle":"Love the Quality & Design","reviewDate":"November 8, 2019","reviewText":"Works as a kettle should - excellent design. It works just like a kettle should and is about the same size as your average kettle, just taller and skinnier, which i prefer"},{"reviewerName":"Kenny Nguyen","rating":"5.0 out of 5 stars","reviewTitle":"Cool!","reviewDate":"September 18, 2019","reviewText":"Perfect electric water heater! At 1.7L, it can hold enough water to fill up multiple things at a time! For example, I can fill up multiple noodle bowls or cups of tea! Easy to use!!"},{"reviewerName":"Rana Muhammad Ali","rating":"5.0 out of 5 stars","reviewTitle":"Fully satisfied...!","reviewDate":"August 6, 2019","reviewText":"The product arrived fast! Its sleek in design and I drink a lot of hot tea this is perfect for it, it heats up fast! And has an automatic shut off so when I lose track of time it shuts off by itself once its reached a certain temperature.\nIts not expensive but seems like really good."},{"reviewerName":"Arthur","rating":"5.0 out of 5 stars","reviewTitle":"Simple setup","reviewDate":"September 11, 2019","reviewText":"Simple setup. Plug in, pour water and toggle the button at the bottom. Kettle looks neat in its design and color. Been using it for couple of days now and so far it’s been perfect"},{"reviewerName":"rafalkashat","rating":"5.0 out of 5 stars","reviewTitle":"Great pot!","reviewDate":"October 15, 2019","reviewText":"I love this! I use it every single day to use my coffee. I love that it’s cordless and very easy and fast to use. This has become an essential everyday item for me. I definitely recommend."},{"reviewerName":"Pramod Khadka","rating":"5.0 out of 5 stars","reviewTitle":"Easy to use kettle.","reviewDate":"August 11, 2019","reviewText":"This electric kettle does the job right. Boils water under 5 mins. I see the performance comparable to the tiger ones found in amazon and Walmart. I like the product and recommend it."},{"reviewerName":"Charlotte H","rating":"3.0 out of 5 stars","reviewTitle":"A Bit Cheaply Made","reviewDate":"October 18, 2019","reviewText":"For the price and based on the picture it was a lackluster upon opening. After unboxing I noticed mine seemed used had marks on it and I’m not sure if it was from previous use or if it’s just the material of the item."},{"reviewerName":"Miss.lala999","rating":"5.0 out of 5 stars","reviewTitle":"I really like this kettle!","reviewDate":"October 19, 2019","reviewText":"I really like this kettle. It’s so easy to use and clean up is a breeze. It takes a short amount of time to heat up water for my tea. It’s also very pretty!"},{"reviewerName":"Lisa M Carter","rating":"5.0 out of 5 stars","reviewTitle":"Heats water fast","reviewDate":"October 11, 2019","reviewText":"Perfect tea kettle, heats water fast and easy to handle. I was very impressed with the sleek look and a great price, very happy with product and highly recommend."},{"reviewerName":"Michael Horner","rating":"5.0 out of 5 stars","reviewTitle":"Sleek electric kettle!","reviewDate":"September 20, 2019","reviewText":"Sleek and easy to use kettle. My old one broke after many years of service, and this one seemed reasonable and looks good on countertop. Boils fast as promised."},{"reviewerName":"Aurora Garcia","rating":"5.0 out of 5 stars","reviewTitle":"Love my electric kettle","reviewDate":"August 20, 2019","reviewText":" Got my electric kettle and i am amazed on how efficient it is, super big and a very modern style...5 star to this product."},{"reviewerName":"Abhishek Joshi","rating":"5.0 out of 5 stars","reviewTitle":"Nice electric kettle","reviewDate":"October 13, 2019","reviewText":"Bought this electric kettle as a gift and my friends loved it. They told me it’s very useful and works so well. It’s very well made and will last long."},{"reviewerName":"Andy","rating":"5.0 out of 5 stars","reviewTitle":"Excellent!","reviewDate":"October 16, 2019","reviewText":"Super easy to use it! Size is perfect! I use it for make my coffee and tea. The water boils very quickly and is very easy to clean. The price is good."},{"reviewerName":"Tricia Vix","rating":"5.0 out of 5 stars","reviewTitle":"Quick boiler","reviewDate":"August 14, 2019","reviewText":"I use a french press so need to boil water daily. No need for a tea kettle or pot on the stove. It heats up very quickly and takes up little space on the counter."},{"reviewerName":"Latrice James","rating":"5.0 out of 5 stars","reviewTitle":"Absolutely perfect!","reviewDate":"August 5, 2019","reviewText":"What an awesome invention! Boiling water in under 5 minutes. And automatic shut off once complete! AND I can make enough water for 4 cups of tea. Truly satisfied!"},{"reviewerName":"John","rating":"5.0 out of 5 stars","reviewTitle":"Perfect for quick mornings","reviewDate":"September 18, 2019","reviewText":"My wife LOVES this for her coffee. She uses this with a French press and it did a quick job of heating up the water for it. Great quality and feels sturdy!"},{"reviewerName":"Craig Hill","rating":"5.0 out of 5 stars","reviewTitle":"Great for my office coffee station","reviewDate":"October 15, 2019","reviewText":"My office coffee looks cool now. It has a modern feel with a clean sleek look. Not too big which is great for me. Cordless makes it easy to use."},{"reviewerName":"FourBasePair","rating":"5.0 out of 5 stars","reviewTitle":"Love","reviewDate":"October 19, 2019","reviewText":"Love this kettle! I initially wanted a glass kettle but decided on this since it reminded me of being in Europe. No regrets. Super simple to use and is my everyday kitchen product."},{"reviewerName":"Moustafa idris","rating":"5.0 out of 5 stars","reviewTitle":"Boils fast","reviewDate":"October 9, 2019","reviewText":" Very durable\nBoils fast, which is very important to me!\nI love how the led opens as well, feels futuristic. Lol"},{"reviewerName":"MT","rating":"5.0 out of 5 stars","reviewTitle":"nice looking electric kettle","reviewDate":"September 17, 2019","reviewText":"The quality of this electric kettle is superb. looks really nice. it boils the water quick. have used it for several weeks now and still working good."},{"reviewerName":"Satya Kovvali","rating":"5.0 out of 5 stars","reviewTitle":"Want something heat in seconds","reviewDate":"September 25, 2019","reviewText":"Want something hot in seconds Tada..! Electric kettle that’s quick in heating the water or Milk & Hot chocolate. Large kettle can be utilised for parties or travelling. Easy to clean and does not touch the heat outside the plastic. Am enjoying every day hot milk in seconds."},{"reviewerName":"Raul","rating":"5.0 out of 5 stars","reviewTitle":"Very good quality.","reviewDate":"October 10, 2019","reviewText":"Very good product. Me and my wife are coffee lovers and with this electric kettle we can have water ready any time for that coffee."},{"reviewerName":"Natalia","rating":"5.0 out of 5 stars","reviewTitle":"Happy with purchase","reviewDate":"September 16, 2019","reviewText":"I like the design. Solid and simple! (I was tired of my clear glass kittle. I like I don’t see rust and spots on a glass anymore :)"},{"reviewerName":"Valentina","rating":"5.0 out of 5 stars","reviewTitle":"Easy","reviewDate":"September 17, 2019","reviewText":"needed something to take with me when i go camping and this worked out well. I like drinking coffin the morning and this did the trick"},{"reviewerName":"Kishore Sanka","rating":"5.0 out of 5 stars","reviewTitle":"Complete stainless steel!! Love it !!","reviewDate":"October 4, 2019","reviewText":"This is having complete steel inside till the outlet of water as a single piece, making it to be easily clean and faster heating."},{"reviewerName":"Jessica","rating":"5.0 out of 5 stars","reviewTitle":"Kettle","reviewDate":"September 6, 2019","reviewText":"This electric kettle is just perfect very light and the material is sturdy. Very easy to assemble and use. Heats the water pretty fast."},{"reviewerName":"Anne","rating":"5.0 out of 5 stars","reviewTitle":"Good office kettle","reviewDate":"October 30, 2019","reviewText":"bought for the office now that it's getting colder. nice to have and saves us buying hot drinks elsewhere! good volume!"},{"reviewerName":"Madhukar","rating":"5.0 out of 5 stars","reviewTitle":"Kettle heats pretty fast","reviewDate":"November 7, 2019","reviewText":"I like this product which is very useful for making tea and also the hot water..I recommend this product to every one."},{"reviewerName":"RG","rating":"5.0 out of 5 stars","reviewTitle":"Very easy to use","reviewDate":"September 22, 2019","reviewText":"Works as kettle and warmer at the same time. Its way bigger than expected with a large capacity. Works well. Totally worth it."},{"reviewerName":"Brittany Kelly","rating":"5.0 out of 5 stars","reviewTitle":"Perfect for office tea","reviewDate":"September 23, 2019","reviewText":"This is a great kettle for my office. It is quick and easy to use. My last one gave off a plastic taste and this one does not."},{"reviewerName":"srini","rating":"5.0 out of 5 stars","reviewTitle":"Very useful and good quality","reviewDate":"October 10, 2019","reviewText":"It is very iseful escepcially for the hot water and it automatically shutofff and it has a indication and the quality is really good"},{"reviewerName":"beth","rating":"5.0 out of 5 stars","reviewTitle":"Fast heated water kettle","reviewDate":"September 16, 2019","reviewText":"I bought this for my sister in law who loves it. My SIL is English and lives her tea and this comes in handy. Great purchase"},{"reviewerName":"RnB","rating":"5.0 out of 5 stars","reviewTitle":"Great kettle!","reviewDate":"September 14, 2019","reviewText":"Really nice electric kettle. Very happy with my purchase. It’s easy to use and quick to warm up water. Definitely satisfied."},{"reviewerName":"Lizett","rating":"5.0 out of 5 stars","reviewTitle":"Water boil","reviewDate":"August 25, 2019","reviewText":"Love the color and how fast the water gets hot. Easy to have an the office or home. I think everyone should have one of these."},{"reviewerName":"Tosha","rating":"5.0 out of 5 stars","reviewTitle":"Keeps liquids Hot","reviewDate":"August 9, 2019","reviewText":"This kettle is high quality and heats up very quickly. I used for coffee and it kept it hot for our entire brunch session."},{"reviewerName":"Jessica","rating":"5.0 out of 5 stars","reviewTitle":"obsessed","reviewDate":"October 17, 2019","reviewText":"this is the kitchen appliance i didn’t even know i needed! boils water in a breeze! i use it every day now!"},{"reviewerName":"Susan Reilly","rating":"5.0 out of 5 stars","reviewTitle":"No more boiling my hot chocolate water!","reviewDate":"September 20, 2019","reviewText":"Heats up my water super fast! It holds alot too! Water comes out the perfect perfect temp to drink right away"},{"reviewerName":"Dalal Marei","rating":"5.0 out of 5 stars","reviewTitle":"Boils Fast And Is Easy To Use.","reviewDate":"October 20, 2019","reviewText":"Looks Very Nice, And Isnt Cheap. It Boils Very Quickly, And Is Easy To Use. Plus, Its Easy To Clean"},{"reviewerName":"abu salim","rating":"5.0 out of 5 stars","reviewTitle":"good for making Hot tea","reviewDate":"August 26, 2019","reviewText":"Very good very heating water for hot tea and other uses.\nEasy to clean\nDurable and fits under cabinets."},{"reviewerName":"K&M La Integrite Group","rating":"5.0 out of 5 stars","reviewTitle":"Love it","reviewDate":"October 11, 2019","reviewText":"I love coffee at work and i used this yesterday and i loved it. It got it very hot and taste fresher also."},{"reviewerName":"HAndrew","rating":"5.0 out of 5 stars","reviewTitle":"One Fine Hot Pot!","reviewDate":"October 22, 2019","reviewText":"This quality product is easy to use, made well and heats the water super fast. It is an impressive product."},{"reviewerName":"Sumit","rating":"5.0 out of 5 stars","reviewTitle":"Loved it!! Efficient and easy to clean!","reviewDate":"September 25, 2019","reviewText":"Very efficient at heating water and the mouth is so wide that it is so easy to clean. Really loved it."},{"reviewerName":"JB","rating":"5.0 out of 5 stars","reviewTitle":"Excellent value!","reviewDate":"November 10, 2019","reviewText":"This kettle heats water faster than I can grind up beans for my morning coffee, very satisfied."},{"reviewerName":"Manish","rating":"5.0 out of 5 stars","reviewTitle":"value for money; trendy","reviewDate":"October 13, 2019","reviewText":"I am using it for a week now.. good quality product with reasonable price. must buy this winter"},{"reviewerName":"Narayan Bhandari","rating":"5.0 out of 5 stars","reviewTitle":"Works very fast","reviewDate":"August 12, 2019","reviewText":"Very happy with this product. it works really fast. Perfect size and easy to handle.definitely recommended!!"},{"reviewerName":"BINH THANH BEN TRE","rating":"5.0 out of 5 stars","reviewTitle":"Good quality.","reviewDate":"October 9, 2019","reviewText":"Very useful to make the coffee every morning. Very fast and hot enough for the coffee maker."},{"reviewerName":"Olga R.","rating":"5.0 out of 5 stars","reviewTitle":"Electric kettle","reviewDate":"October 11, 2019","reviewText":"I love my new electric kettle it works really good!! Excellent price and excellent quality!!"},{"reviewerName":"DonaDona486","rating":"5.0 out of 5 stars","reviewTitle":"My new electric kettle!","reviewDate":"August 14, 2019","reviewText":"It's better than my old electric kettle\nAnd I like the design and the color! A satisfied buyer!"},{"reviewerName":"Neha Karthikeyan","rating":"5.0 out of 5 stars","reviewTitle":"Perfect and fancy kettle.","reviewDate":"September 12, 2019","reviewText":"The kettle looks really fancy and cool. It works good and does its job perfect. I will use it in my work place."},{"reviewerName":"Sara","rating":"5.0 out of 5 stars","reviewTitle":"Good one","reviewDate":"August 20, 2019","reviewText":"Works fine, and I like how it doesn’t get hot when the water is boiling. Nice sturdy material."},{"reviewerName":"Xu Xu","rating":"5.0 out of 5 stars","reviewTitle":"Great product","reviewDate":"August 15, 2019","reviewText":"This product is boiling the water very fast ... nice looking and safety to use ... i love it"},{"reviewerName":"MARTHA IVONNE","rating":"5.0 out of 5 stars","reviewTitle":"Great product","reviewDate":"October 17, 2019","reviewText":" EASY TO USE, SIMPLE AND ELEGANT"},{"reviewerName":"nivedida","rating":"5.0 out of 5 stars","reviewTitle":"Good value","reviewDate":"August 7, 2019","reviewText":"Ordered this as a gift. Great it has stainless steel interior. Good value for the money"},{"reviewerName":"Bashar","rating":"5.0 out of 5 stars","reviewTitle":"Great kettle","reviewDate":"October 13, 2019","reviewText":"Very good kettle. I like its design. Fits almost 2 liters and boils fast."},{"reviewerName":"Tricia","rating":"5.0 out of 5 stars","reviewTitle":"Nice kettle for tea","reviewDate":"October 17, 2019","reviewText":"So far I've really been liking this kettle. It heats the water up quickly for my tea and is east to use. It looks like it should be easy enough to clean too."},{"reviewerName":"Sean Pell","rating":"5.0 out of 5 stars","reviewTitle":"Great Buy","reviewDate":"October 12, 2019","reviewText":"Very quick to boil, very handy kettle. Recommended to all my friends."},{"reviewerName":"Secret","rating":"5.0 out of 5 stars","reviewTitle":"Thumbs up!","reviewDate":"August 23, 2019","reviewText":"Love this! Making my french press coffee just got a lot easier"},{"reviewerName":"Neha M.","rating":"5.0 out of 5 stars","reviewTitle":"Warms up quickly","reviewDate":"October 6, 2019","reviewText":"Works great. Has simple design and button so great"},{"reviewerName":"YU","rating":"2.0 out of 5 stars","reviewTitle":"Just used 4 times, stared rusting.","reviewDate":"November 7, 2019","reviewText":"Just used 4 times, stared rusting already."},{"reviewerName":"Tiffanie Alley","rating":"5.0 out of 5 stars","reviewTitle":"👍","reviewDate":"August 5, 2019","reviewText":"Works great! Was bigger then I expected, that's a good thing!"},{"reviewerName":"Kathy J. Guevara","rating":"5.0 out of 5 stars","reviewTitle":"Fast to heat up!","reviewDate":"September 6, 2019","reviewText":"I love this little kettle for my tea. It heats up fast is so easy to clean. Highly recommend!"},{"reviewerName":"Emy","rating":"5.0 out of 5 stars","reviewTitle":"easy to use, portable, makes water hot fast","reviewDate":"September 23, 2019","reviewText":"so easy to use and heats water up fast."},{"reviewerName":"Brittany Daniel","rating":"5.0 out of 5 stars","reviewTitle":"Love this product! Highly recommend!","reviewDate":"November 9, 2019","reviewText":"Convenient and time saver! Easy to use!"},{"reviewerName":"Phong Truong","rating":"5.0 out of 5 stars","reviewTitle":"Stainless steel and easy to clean","reviewDate":"August 8, 2019","reviewText":"Work great for heating up water to make tea or coffee"},{"reviewerName":"Sarah Grabill","rating":"5.0 out of 5 stars","reviewTitle":"Convenient and easy to use.","reviewDate":"October 25, 2019","reviewText":"Convenient and easy to use."},{"reviewerName":"Ashutosh Wadhwa","rating":"5.0 out of 5 stars","reviewTitle":"Perfect for hot water!!!","reviewDate":"August 6, 2019","reviewText":"Very Good style and works great!!!!"},{"reviewerName":"Mariam Abrar","rating":"5.0 out of 5 stars","reviewTitle":"Love this item","reviewDate":"August 5, 2019","reviewText":"Love the kettle very useful item"},{"reviewerName":"DeFoe","rating":"5.0 out of 5 stars","reviewTitle":"Good pit","reviewDate":"August 9, 2019","reviewText":"Works great, heats up fast"},{"reviewerName":"Key","rating":"5.0 out of 5 stars","reviewTitle":"Good value.","reviewDate":"August 4, 2019","reviewText":"Great one. I like it a lot."},{"reviewerName":"Dorsanne","rating":"5.0 out of 5 stars","reviewTitle":"Hot Hot Hot!","reviewDate":"October 30, 2019","reviewText":"I love my kettle. It is very convenient. The water very hot the way I like it. I got rid of my Keurig because the liquid was never hot enough."},{"reviewerName":"Katie G","rating":"5.0 out of 5 stars","reviewTitle":"Workhorse and beautiful.","reviewDate":"October 20, 2019","reviewText":"Love the look and a reliable workhorse"},{"reviewerName":"ChuckG24","rating":"5.0 out of 5 stars","reviewTitle":"Great looking kettle","reviewDate":"October 2, 2019","reviewText":"Quick and easy"},{"reviewerName":"Thomas Cook","rating":"5.0 out of 5 stars","reviewTitle":"Great kettle","reviewDate":"August 31, 2019","reviewText":"Good"},{"reviewerName":"Robert S","rating":"5.0 out of 5 stars","reviewTitle":"Electric kettles are super popular in europe but I'm happy to have one in America","reviewDate":"October 8, 2019","reviewText":" I think they're more common in europe do to the higher voltage electricity here. But that's a minor difference when compared with how convenient this makes your tea making. I kind of hate waiting for water to boil and have an aversion to microwaved water. This solves both those problems, and has made my tea drinking far more efficient. I like the look and design of this particular kettle as well. It's got a quality metal feel to it."},{"reviewerName":"Yasmin Hussein","rating":"5.0 out of 5 stars","reviewTitle":"Beautiful black finish!","reviewDate":"October 15, 2019","reviewText":"I love how clean this kettle looks. The black finish is so beautiful especially when it sits on my counter. Super simple to use and boils the water exactly as I need it. Def worth it!"},{"reviewerName":"Carlos G","rating":"5.0 out of 5 stars","reviewTitle":"The size of this kettle is perfect.","reviewDate":"November 11, 2019","reviewText":"This kettle works very well and heats very fast, its materials are very good quality, inside it is made of steel and it has a scale to measure the amount of water, it is not heavy and its size is perfect, it also looks great in black."},{"reviewerName":"Janny_phan","rating":"5.0 out of 5 stars","reviewTitle":"Work good","reviewDate":"November 13, 2019","reviewText":"Bought it to change my old kettle, work a charm, make water hot faster."}],"qAndA":[{"question":"How to descale a kettle?","answer":"If it have, please follow the tips below and say goodbye to limescale easily:\n1，Cut up one whole lemon, add the pieces to the kettle.\n2，Add about 500ml water to the kettle, boil then unplug. … see more"},{"question":"Can you boil milk in the kettle?","answer":"I don’t see why not. I don’t know if it would burn the milk though."},{"question":"How do you know when its hot?","answer":"Hi there. It turns off when it’s hot."},{"question":"From the picture shown here, the kettle lip/ cover doesn’t open wide, won’t it break easily while cleaning?","answer":"The kettle doesn't open all the way. I clean mine with boiling a bit of vinegar. I only use mine for heating water so there is not much else to clean."},{"question":"Where is it made","answer":"China"},{"question":"How long is the cord?","answer":"Not sure because I never received the item."},{"question":"Is the inner lid plastic or stainless steel?","answer":"Dear customer, the inner lid is stainless steel."},{"question":"Where is it made and what is the heating element made of?","answer":"Refer to the description."},{"question":"What’s the amperage?","answer":"Dear customer,\n\nThanks for your interests. The rated voltage is 120V, 60Hz and rated power is 1500W."},{"question":"Does the side stay cool to the touch ?","answer":"Yes"},{"question":"I saw a review on another kettle and have a related question. Is there anything on the box indicating a cancer warning for this kettle?","answer":"Dear customer,\n\nThanks for your inquiry. There is no this warning on the box. Don't worry, this kettle is BPA free and it has FDA certification. Any further questions, please go to your Amazon order detail page and contact seller. We will reply you via email to follow up your case."},{"question":"The inside, filter and the surface that the water touches, is all stainless steel?","answer":"Actually there is a small bit of plastic where the lid is connected to the inside of the kettle."},{"question":"Hi, in our country is using 220V, is it ok to use in 220v?","answer":"Not sure but I don’t think so"},{"question":"i boiled water once and now it wont boil also theres a burnmark inside the kettle what should i do?","answer":"Try contacting the seller if you get no response then try contacting Amazon customer service"},{"question":"How much does it weigh?","answer":"It is fairly reasonable (not sure of the exact weight, but it is neither what I would call light or heavy for a pitcher of this size). Obviously, it feels quite heavy when full. It holds a lot more water than I thought (because I did not really read the specs before buying)."},{"question":"Does any plastic inside contacts with water while boiling?","answer":"Dear customer, no plastics will contact with water while boiling process because all materials ( inner lid, spout and pot ) are made of 304 stainless steel , which are safe and harmless enough to contact with water."},{"question":"Is it temp regulated? Can i set it to heat to a specific temp?","answer":"No, it gets to boiling and turns off."}]}