{"title":"Canon Digital SLR Camera Body [EOS 80D] and EF-S 18-135mm f/3.5-5.6 Image Stabilization USM Lens with 24.2 Megapixel (APS-C) CMOS Sensor and Dual Pixel CMOS AF (Black)","manufacturer":"Canon","currentPrice":false,"rating":"4.4 out of 5 stars","totalRatings":"130 ratings","features":["\n         Make sure this fits\n                by entering your model number.\n        \n","Merging power, precision, and operability, the EOS 80D is a dynamic SLR camera for anyone's creative vision","Providing a comprehensive view, the EOS 80D camera’s Intelligent Viewfinder helps bring the thrill of SLR photography with each use","The Intelligent Viewfinder displays AF points and AF mode, has a grid display, a horizontal electronic level, plus numerous other points of information, all of which can be hidden","For AF operation, the EOS 80D camera has a wide-area, 45-point, all cross-type AF system with low luminance performance to EV -3 and 4 types of AF area selection modes","The  24.2 Megapixel (APS-C) CMOS sensor captures high-resolution images and has refined individual pixels that enable high ISO speeds (16000 for still photographs, 12800 for movies)","Fast and incredibly quiet, the EF-S 18–135mm f/3.5–5.6 IS USM’s  NANO USM AF system not only delivers high speed AF, but also makes quiet, fast, and smooth AF transitions","Focuses incredibly fast thanks to its  NANO USM motor, a clear advantage for action photography and for working on the fly"],"reviewsAspects":["low light","love this camera","image quality","usm lens","battery life","rode mic","autofocus","better image","stabilization usm","touchscreen","image stabilization","highly recommend","full frame","video quality","nano usm","great camera","video recording","zoom adapter","lens kit","power zoom"],"productInformation":[{"Product Dimensions":"7 x 9.6 x 5.3 inches"},{"Item Weight":"1.61 pounds"},{"Shipping Weight":"4.3 pounds (View shipping rates and policies)"},{"ASIN":"B01BUYJX6G"},{"California residents":"Click here for Proposition 65 warning"},{"Item model number":"1263C006"},{"Batteries":"1 Lithium Metal batteries required. (included)"},{"Customer Reviews":"4.4 out of 5 stars\n    130 ratings\n4.4 out of 5 stars"},{"Best Sellers Rank":"#5,961 in Camera & Photo (See Top 100 in Camera & Photo)\n#207 in DSLR Cameras\n"},{"Date first listed on Amazon":"February 18, 2016"}],"productDescription":["Whether raising your game to SLR level photography or having fun with a versatile SLR you can use pretty much anywhere, the EOS 80D camera is your answer. It features an impressive 45-point all cross-type AF system*, an Intelligent Viewfinder and more to help realize your creative vision.","Watch and get the action shot you want thanks to the wide-area, 45-point, all cross-type AF system*.","The Dual Pixel CMOS AF features fast focusing speed and smooth tracking in Live View.","A 24.2 Megapixel CMOS (APS-C) sensor provides high-resolution images and the DIGIC 6 Image Processor delivers excellent processing speed. A wide ISO range means brilliant low-light performance.","Built-in wireless technologies lets you shoot remotely using the Canon Camera Connect app**."],"reviews":[{"reviewerName":"Jill Bolger","rating":"1.0 out of 5 stars","reviewTitle":"Best not to buy this through Amazon. Camera is fine, accessories are not.","reviewDate":"October 17, 2018","reviewText":"I don't recommend purchasing this product (at least through Amazon as it creates too much red tape if you have an issue). The RODE mic came to me broken and to get it fixed is a logistical nightmare in which Amazon sent me to Canon, Canon sent me to Rode, Rode says they will fix it, but are not responsible for the repair shipping costs because it's a third party sale. So it's costing me more money to fix a product that came to me defective. Frustrating."},{"reviewerName":"P.K. Frary","rating":"5.0 out of 5 stars","reviewTitle":"Wonderful DSLR for general photography and YouTubers","reviewDate":"March 27, 2016","reviewText":"I replaced my well worn 70D with a shiny new 80D and, although they look and feel similar, I found the 80D laden with new features and image quality improvements over its predecessor.\n\nCONTROLS: Buttons and wheels feel sturdy and may be used while looking through the viewfinder. Exposure modes are set with a topside knurled dial: manual, semi-auto modes and assorted full auto modes. Menus are easier to navigate than the 70D: five icons (reduced from the 70D's fifteen) and organized by category. If you've owned prior EOS models, the interface will be familiar and you’ll barely need to crack the manual.\n\nThe VIEWFINDER is a joy to use: bright and clear and, with 100% coverage and .95x magnification, an improvement over Rebels and the 70D. I love the transmissive LCD display (transparent LCD over the focusing screen) as it’s almost like using an EVF: display of icons, AF and metering patterns, grid and plain matte screens and an electronic level.\n\nAUTOFOCUS: The 45-point cross type AF array is fast and sure-footed in low light, besting my 70D in most situations. It has the same AF modes as the 70D—single-point AF, zone AF and automatic selection AF—plus a fourth mode, large zone AF. I was surprised how much more “human aware” auto select mode is compared to the 70D. If a human enters the frame, it locks on them like glue.\n\nLiveView has a new AF mode: AI Servo. Tap the subject on the touchscreen, half-press the shutter button and it does a great job of tracking the subject across the screen. It’s perfect for low level shooting of moving critters or kids.\n\nIMAGES show pleasing detail, color and impressive control of noise. Specifically, there is a significant reduction in shadow noise over the 70D, allowing aggressive lifting of shadows should the need arise.\n\nVIDEO: HD video quality is excellent: less moire artifacts, cleaner in low light and smoother and more film-like compared to 70D files. I’m disappointed 4K HD wasn’t included. However, 1080P is fine for YouTube since audiences mainly watch on phone and notebook screens.\n\nMovie servo is faster than 70D servo and less prone to “hunting” in low light. Focus-pulls are a snap with the touch screen. Movie servo with face recognition works great, allowing me to both shoot and perform in video clips.\n\nWI-FI: Diddle settings, fire shutter, upload images and monitor LiveView and video on an iPhone/iPad, Droid or computer with the Canon Connect app. Wi-Fi eats batteries crazy fast, so carry spares. Video and LiveView are also available via wired USB or HDMI connection and are smoother and less battery draining.\n\nThe 80D kit ships with the Canon EF-S 18-135mm f/3.5-5.6 Image Stabilization USM Lens (Black) lens. It’s a wonderful optic and I wrote a detailed review on it here.\n\nFINAL BURB: The 80D is a nimble and capable camera, and an impressive upgrade over the 70D in terms of AF, resolution and control of shadow noise. The bottom line is the many small improvements add up to an enjoyable experience and excellent images and videos."},{"reviewerName":"Chuck","rating":"5.0 out of 5 stars","reviewTitle":"Great midrange DSLR that gives you alot of flexibility no matter the use case","reviewDate":"March 26, 2018","reviewText":" Excellent camera. I bought this for my new Blog and also for some vlogging as well. The camera is very well built and I found myself purchasing additional lens almost immediately. I do love the touchscreen monitor thats also fully articulating as well. I didn't do a good job of demonstrating this in my video but just know that it fully rotates which is nice for vlogging. The kit lens 18-135mm is good but not ideal for vlogging unless your using a tripod or something like that. Highly recommend. I also did a brief review so you can check that out as well."},{"reviewerName":"escavideo","rating":"5.0 out of 5 stars","reviewTitle":"Don't hesitate to get this kit if you're buying the camera and lens kit alone.","reviewDate":"June 12, 2018","reviewText":"Love it!!! The zoom controller and the mic work great, the zoom controller acts as if I had a handheld video recording camera, a little awkward the location of controls, I am right handed, but still I can not shoot as magnificent pictures with a video camera as I can with this one and the video quality is really good shot with the original 18-135 mm lens included in the kit. When shot with a high end lens f 2.8 stop, the video quality improves but only for the trained eye, as did the pictures, but again the zoom controller only works with the included lens, the microphone added a ton of clarity to the audio compared to the on-camera mic and very comparable to a zoom mike bought eight years ago priced three times this one Rode included. The camera itself is no surprise in quality and controls, I've owned the 40D, the 60D, and the 70D prior to this one, the audio monitoring jack is a plus long needed. As a note; the mic and zoom controller cost $100 more as compared with price of the same camera paired with the same lens as a kit, when these two items bought separately they cost over $250 more."},{"reviewerName":"Oldlakers","rating":"5.0 out of 5 stars","reviewTitle":"Canon Created Memories","reviewDate":"February 22, 2018","reviewText":"A tremendous upgrade from my previous Canon EOS Xsi, which I had used extensively and loved. Nice to be able to use most of the same lenses even though had to go with at least one new one of them, also! Am learning many new capabilities with this model and so far am very pleased with the results of a multitude of taken images. It has been a very exciting learning experience and there just does not seem to be enough hours in the day to go get more.\n\nExtremely good camera."},{"reviewerName":"Tae S. Shin","rating":"3.0 out of 5 stars","reviewTitle":"Like the camera except for the lens 18-135mm IS USM","reviewDate":"October 6, 2018","reviewText":"It's been about 2 years since I bought this camera as my first DSLR. So far, the camera hasn't disappointed my expectations. I will leave its pros and cons to the other reviewers.\n\nBut I didn't expect low quality of lens 18-135mm IS USM that came with the camera for additional $500. After less than 2 years of very rare use, I found last week that its auto/manual focus did not work at all - no sound of lens motor nor focus improvement in viewfinder and live view with half-pressed shooting button. Of course, I followed full cycle of checking with battery and menu options with other lens to find out that it's really the lens with no focus.\n\nNo surprise why its warranty is just 1 year."},{"reviewerName":"Vrain","rating":"5.0 out of 5 stars","reviewTitle":"Love. This. Camera.","reviewDate":"November 1, 2018","reviewText":"I’m still learning and new to the hobby, but this camera is perfect for everything I needed it for!\n\nAuto focus is insanely fast, I was able to take pictures of bees moving all over the place at the botanical gardens recently. The lcd back rotating display helps me get those awkward angle shots.\n\nI freaking love this thing! It comes everywhere with me. It’s s little overwhelming to learn, but I am really glad I chose this as my first camera entry to the hobby. 5 stars!"},{"reviewerName":"Ryan Schukei","rating":"5.0 out of 5 stars","reviewTitle":"Great camera","reviewDate":"December 10, 2017","reviewText":"I love this camera. It has many wonderful features. I do most of my photo editing on my iPhone. This camera can download its pictures to the iPhone X without any cables or cards. The view finder is excellent as well. Pictures are superb. It's only drawback is the number of features. It is hard to use them all and to know when to use them. I made a wise decision to get this amera. If you are serious about photography then you should look at this one."},{"reviewerName":"M. Speth","rating":"5.0 out of 5 stars","reviewTitle":"Excellent camera fro the price","reviewDate":"July 9, 2018","reviewText":"Excellent camera fro the price. Performs well in low light. My wife and I own a photography business and We use this as our second camera/backup to our 6D. Works very well. This camera would be very appropriate for a hobbyist or someone just starting a photography business. Great video too. It set it up on a tripod and recorded a wedding ceremony just last weekend. Video and audio where both very clear."},{"reviewerName":"SimplyMe","rating":"5.0 out of 5 stars","reviewTitle":"I love this camera","reviewDate":"December 16, 2017","reviewText":"I love this camera. To me, this camera is a fusion of my old Canon Rebel Xsi (Yes, it's very old but still works!) and Canon PowerShot SX710 HS (with a good powerful zooming lens and video recording capability, very great for travel). I love this camera with 18-135mm f/3.5-5.6 Image Stabilization USM Lens and video capbility-it's a grab and go camera gear. The touch screen feature is great where I can immediately zoom in and out of the images to see detail of the shots. I like how screen can be flip in to face the camera body to prevent any scratches. The pictures and video recording qualities are great so far. I highly recommended it - from a photo hobbyist"},{"reviewerName":"Amazon Customer","rating":"4.0 out of 5 stars","reviewTitle":"Great set up for beginners!","reviewDate":"May 26, 2018","reviewText":"I really like this set up! The 80D is great for the auto focus in video, the flip out screen, and takes decent pics. The Rode mic works well, but had to buy a dead cat to block out some of the wind in outdoor settings... even that didn't block everything out in moderate wind. This is a great set up for beginners, but I really wish the photo quality was a littler sharper. 1080p comes out fine with the included lens. I wish I would've went for the 6D and the upgraded Rode mic, but that wasn't in my budget. Like I said, great set up.. just don't quite love it. Only 4 stars."},{"reviewerName":"Mike","rating":"5.0 out of 5 stars","reviewTitle":"Great DSLR for a wide range of environments","reviewDate":"December 30, 2016","reviewText":"Great DSLR in a wide range of environments from city landscapes, animal macros, nighttime shots, etc. The articulated LCD screen is the real winner compared to many other similar DSLRs in this range - having the flexibility to tilt the screen up or down helps when either using a tripod or holding it above your head in a crowd. Combined with a 18-135 USM lens, this is a very versitile camera."},{"reviewerName":"Nina Monobe","rating":"4.0 out of 5 stars","reviewTitle":"Seems to be great!","reviewDate":"May 22, 2018","reviewText":" I just got my canon and I never had professional camera so I’m not the best person to write a review. It’s not a friendly use camera, I’ve been reading the manual and watching YouTube channels and still couldn’t figure out some of its function. But the pictures in general look nice. I will update my review whenever I get to know better the camera"},{"reviewerName":"James","rating":"5.0 out of 5 stars","reviewTitle":"BLOWS AWAY THE THREE PREVIOUS SLR's I'VE OWNED!","reviewDate":"March 30, 2017","reviewText":"Excellent - even more than I had hoped it would be. Unqualifiedly recommend this camera, and Canon-brand lenses and Speedlite flashes, because they all WORK with the EOS80D, and are worth every penny extra when compared to low-price no-name brands. It has been my experience with such brands that there are ALWAYS compromises in performance you have to\" learn to live with\", due to the lower price, and when this happens, what seemed like a savings almost always winds up being a bitter disappointment."},{"reviewerName":"Gil S","rating":"5.0 out of 5 stars","reviewTitle":"Awesome camera","reviewDate":"December 3, 2018","reviewText":"Perfect positioning from Canon marketing - the right features for the right budget intermediate level camera. Has some improvements over the 70d and this kit comes with a lens that most users will never need to take off. An upgrade to an L series lens in the future would be a good idea and if you're buying this and don't have an external flash I would say that should be on your top list of accessories if not the first thing on that the list."},{"reviewerName":"Jim","rating":"5.0 out of 5 stars","reviewTitle":"Best camera I ever owned.","reviewDate":"November 16, 2017","reviewText":"Best camera I ever owned. Fast, impressive photos. There are other options for quite a bit more. Dollar for dollar I’ll put this against anything though. Fast when needed, video is better than anything else on the market."},{"reviewerName":"GJM","rating":"5.0 out of 5 stars","reviewTitle":"Can't say enough good about this camera and of all Canon products","reviewDate":"May 13, 2017","reviewText":"Can't say enough good about this camera and of all Canon products. Excellent, professional and user-friendly in every way!! The follow-focus video is absolutely worth the camera's weight in gold!! I have only begun to utilize its potential. It is a beautiful catalyst for expanding one's creativity and imagination."},{"reviewerName":"JD","rating":"5.0 out of 5 stars","reviewTitle":"Love this setup","reviewDate":"July 18, 2018","reviewText":"Love this setup! Got this to shoot video for my Midlife Draftee youtube channel and have nothing but great thing to say. Not only is it great for video but apparently it can take photos as well. Now I have two new passions."},{"reviewerName":"Mark","rating":"5.0 out of 5 stars","reviewTitle":"This was my first DSLR and I am happy with the results and the functions that it has","reviewDate":"December 30, 2016","reviewText":"This was my first DSLR and I am happy with the results and the functions that it has. The pictures and videos are amazing and very user friendly. I do wish I would have purchased a full frame camera but I am happy with these capabilities."},{"reviewerName":"Mitz P","rating":"5.0 out of 5 stars","reviewTitle":"Love this camera!","reviewDate":"March 25, 2017","reviewText":"This is a great camera, especially for a beginner like myself. Three functions and menu is easy to manage, after learning some things from online, I'm starting to learn how to use it in manual mode, and great pics coming out. The app interfaces well with the camera and the pics get downloaded to your phone quick."},{"reviewerName":"SpecialK","rating":"5.0 out of 5 stars","reviewTitle":"This is a great little crop sensor","reviewDate":"January 14, 2018","reviewText":"This is a great little crop sensor. The RODE mic was a little disappointing, but its better than the camera mid. Ive yet to use the power focus adapter, but if you shoot a lot of video and was a smooth zoom it may be useful to you. If I were to redo it I'd prob just get the camera and purchase a higher quality mic, although this is a pretty good deal for what you are getting."},{"reviewerName":"Colton Johnson","rating":"5.0 out of 5 stars","reviewTitle":"Great device all the way around.","reviewDate":"November 18, 2017","reviewText":"A better quality microphone would've been appreciated, and I still haven't really found use for the power zoom adapter, but the camera works brilliantly, and the audio quality is exceptional once I master it in post."},{"reviewerName":"PK","rating":"5.0 out of 5 stars","reviewTitle":"Try it you will like it.","reviewDate":"October 4, 2017","reviewText":"I really felt like Austin Powers I had lost my mojo when taking digital pictures. I mean I would look through the viewfinder of my other camera (that cost twice as much) and never felt I was getting the picture I saw in the viewfinder. Right out of the box with the first picture I took was what I saw in the viewfinder. I purchased this as my last desperate move to get back into DSLR photography. I literally gave away a Sony full frame DSLR with all my lenses I was that unhappy. I have my mojo restored and am taking pictures again and enjoying it."},{"reviewerName":"Denise","rating":"5.0 out of 5 stars","reviewTitle":"Great camera","reviewDate":"December 27, 2017","reviewText":"I upgraded from a canon rebel xti, this is a very good camera. I would highly recommend it to anyone."},{"reviewerName":"Nur A Farabi","rating":"5.0 out of 5 stars","reviewTitle":"Excellent","reviewDate":"July 1, 2019","reviewText":"Come on!!! This is canon 80D. One of the best camera for Photographer. But, should learn how to use it. As it has lots of function....watch tutorial video for canon 80d. Good for video..."},{"reviewerName":"Senen Salvador","rating":"5.0 out of 5 stars","reviewTitle":"It's a great Canon camera","reviewDate":"March 20, 2018","reviewText":"This is my 2nd Canon DSLR camera. I have the Rebel 3Ti before this.\nCanon 80D is just so perfect for me.\nI love it.\nI now enjoy using the full manual mode because of Canon 80D.\nIt gives me so much self confidence with my compositions."},{"reviewerName":"Julia Wolf","rating":"5.0 out of 5 stars","reviewTitle":"Great for makeup tutorials!","reviewDate":"December 12, 2018","reviewText":"I switched to this camera from my Nikon D3200 for the primary purpose of filming makeup tutorials. This has excellent autofocus zoom, something that my Nikon lacked immensely. I am extremely happy with my purchase."},{"reviewerName":"Werner Strydom","rating":"5.0 out of 5 stars","reviewTitle":"A perfect upgrade for a Canon 20D","reviewDate":"December 28, 2017","reviewText":"My Canon 20D finally kicked the bucket and refused to be resurrected. Since I have several lenses, I upgraded to an 80D, and I have been pleasantly surprised by its capabilities. I should have done this earlier. I'd recommend you buy a protective filter for the lens like B+W 67mm XS-Pro Clear UV Haze with Multi-Resistant Nano Coating (010M) since its much cheaper to replace the filter than the lens."},{"reviewerName":"Dhruvesh","rating":"5.0 out of 5 stars","reviewTitle":"Canon EOS 80D","reviewDate":"August 21, 2018","reviewText":"This product is beyond my expectations.\nIf you are in photography and want to spend around 1500$ this product comes first in the order.\nI am really satisfied with product."},{"reviewerName":"gtrayler","rating":"5.0 out of 5 stars","reviewTitle":"LOVE It","reviewDate":"July 10, 2017","reviewText":"Cant say enough good about the camera and kit. I do videos and take photos and I love the camera. My old camera was a Canon EOS 20D so they have come a long way from my old one. Love it"},{"reviewerName":"James and Valerie","rating":"5.0 out of 5 stars","reviewTitle":"I love the quality and all the features the camera has","reviewDate":"July 8, 2018","reviewText":"Camera kit works amazingly. I love the quality and all the features the camera has. No complaints, just need more time to learn everything!"},{"reviewerName":"Kiama","rating":"5.0 out of 5 stars","reviewTitle":"A great Chance","reviewDate":"January 1, 2019","reviewText":"Thanks amazon for allowing me to bu such a priceless camera ;canon 80D in installments. I have a splendid moment to use the camera in unimaginable possibilities. Thanks amazon"},{"reviewerName":"TaxMan","rating":"5.0 out of 5 stars","reviewTitle":"Super fast focusing DSLR under $2K with nearly all the bells and whistles","reviewDate":"April 4, 2016","reviewText":"I received my 80D on 3/28/16 and have become familiar with its capabilities. (Owned T2i and T4i for years.) Without repeating other very accurate reviews I will just say that the 80D meets or exceeds every expectation I had after reading \"virtually\" everything available on-line including extremely detailed hands-on reviews posted in last several days. The 80D hits a huge sweet spot for experienced DSLR shooters who don't want the weight or cost of a 7DmkII or full frame. I have 5 other Canon lens and was happy to find a Canon that solved my sports focus issues and provided numerous other upgrades. I have the new nano 18-135mm lens. Bottom line is that the 80D is a fantastic product for under $2K. Although the Nikon supposedly has better image quality, the 7200 cannot do many things that I enjoy with the 80D. Great decision for me.\nUpdate 4/11/16: Finally used the 80D to photograph a regulation soccer game on a sunny but bitter cold (27F)morning. I took over 1000 images with the new 18-135 nano USM, my old faithful 55-250 IS, and my new 70-200 f4 L lenses. The 80D is INCREDIBLY FAST focusing in the AI servo mode using the centered 9 point area focusing points setting. The large area center would work about the same. Shot mostly at 1/1500, ISO 800, f7, 7fps. The results are stunning for fast focusing relative to the T4i I used for dozens of soccer games in the past. If the camera missed the first frame of a sequence it was locked on by the 2nd frame. The accuracy of the focus point was excellent and when it was not, the reason was easily recognized with the desired player being off center or blocked by another closer player. My \"in-focus\" percentage was the highest I have ever achieved. Bottom line for those considering the 80D and requiring extremely fast focus is that every review says the 80D is superb and my results totally confirm those reviews. Hard to believe that the $3K and $6K Canon pro models are faster.\n4/16/16 update: I have 1700 images taken with the first charge on the Canon LP-E6N battery. Half were taken at 27 degrees F a week ago. Battery menu shows 50% capacity. Wow! Now I will see how a fully charged STK LP-E6 does."},{"reviewerName":"J. Honea","rating":"5.0 out of 5 stars","reviewTitle":"Excellent for sports","reviewDate":"August 23, 2018","reviewText":"The camera and lens are great for taking high school sports photos. I hate that I waited until my son’s senior year to splurge. The camera and lens are perfect. I don’t have to bring multiple lenses with me. And it gets great pictures in the poor gym lighting. Highly recommend!"},{"reviewerName":"Ashley Jiménez","rating":"5.0 out of 5 stars","reviewTitle":"Está totalmente nueva, ES COMO COMPRARLA EN LA TIENDA CANON","reviewDate":"September 5, 2019","reviewText":"Mi cámara llego completamente nueva en su caja sin abrir con todo lo prometido, el lente también se encontraba nuevo y todo estaba en perfectas condiciones."},{"reviewerName":"Phuong Nguyen","rating":"5.0 out of 5 stars","reviewTitle":"Love this 80D","reviewDate":"November 8, 2018","reviewText":"1. Hand down the best mid range dslr I've ever owned.\n2. Not 4k but the 1080p is good enough. However, canon 1080 is better than some mid range 4k cameras out there.\n3. Bought it from SSE photo and service was fast and reliable. Tracy, the lady from customer service was easy to communicate. I am happy with the service."},{"reviewerName":"Danny","rating":"5.0 out of 5 stars","reviewTitle":"Perfect!!","reviewDate":"July 22, 2018","reviewText":"Perfect!!! I filmed an entire feature film and it turned out beautifully. Looking forward to filming more script stories with my new found love."},{"reviewerName":"jarcon","rating":"5.0 out of 5 stars","reviewTitle":"Great camera","reviewDate":"March 3, 2017","reviewText":"After searching in many blogs, videos, opinions and more, I decided to buy it and I'm really happy with it. It's not cheap, and perhaps that's the reason why it took me so long to buy it, but the photo quality help you to forget that."},{"reviewerName":"Susan O","rating":"5.0 out of 5 stars","reviewTitle":"Perfect camera!","reviewDate":"July 29, 2018","reviewText":"I’m in love with this camera. So much to learn about all it’s functions but can take great pictures from first picking it up. I shoot a lot of nature shots. Awesome with nature."},{"reviewerName":"amazon-paradox","rating":"5.0 out of 5 stars","reviewTitle":"Canon's mid line camera is a great choice for those looking to move up from the entry level models","reviewDate":"September 21, 2017","reviewText":"I wasn't really looking for this model at first. I was thinking of the Rebel T6s with the 18-135 lens kit. But this kit went on sale & the fact that it was more weather proof than the Rebel line, plus some features that were available on 80D but the T6s convinced me to pull the trigger. Now that I've had a chance to use this body, I can honestly say that it was the right choice. The small details that differentiate the T6s from the 80D are greatly appreciated. The only thing that I find that the T6s has an advantage is that the T6s body is smaller and lighter. So, if you are sensitive to weight, get the T6s (or T7i). For traveling, it's not bad until you carry a T6 body. Noticeably lighter & smaller. However, after trips to Iceland, Joshua Tree, Seattle, Nor Cal, and the 2017 USA Total Eclipse, I have no regrets. The heavier weight is due to the more robust construction of the 80D and for the rigors of travel (weather, bumps & bruises), I'll take a little more weight for the durability of metal vs. plastic."},{"reviewerName":"fkey541","rating":"5.0 out of 5 stars","reviewTitle":"For me? Perfection!","reviewDate":"August 8, 2017","reviewText":"Amazing camera, it's my second one. For once I have an identical backup just in case."},{"reviewerName":"Justin Mertes","rating":"5.0 out of 5 stars","reviewTitle":"The continual AF in video really is as good as they say it is","reviewDate":"April 25, 2017","reviewText":"The continual AF in video really is as good as they say it is. Stepped up from my t2i for the past 7 years to this, and I am so, so pleased. I do 70% video, 30% photo."},{"reviewerName":"Albin","rating":"5.0 out of 5 stars","reviewTitle":"Muy buena cálida.","reviewDate":"February 12, 2019","reviewText":"Excelente cámara, brinda muy buena calidad de imagen y resulta genial para la elaboración de videos, es la primera cámara que compro y pues estoy muy contento con ella"},{"reviewerName":"knightcount69","rating":"5.0 out of 5 stars","reviewTitle":"Must have as DYI","reviewDate":"April 20, 2019","reviewText":"Awesome product!"},{"reviewerName":"Changing Lanes","rating":"5.0 out of 5 stars","reviewTitle":"Great bundle!","reviewDate":"August 6, 2017","reviewText":"Great bundle! Add a dead cat and a tripod and it's a great vlogging setup."},{"reviewerName":".:[ -BlueJhay- ]:.","rating":"5.0 out of 5 stars","reviewTitle":"Excellent buy!","reviewDate":"September 5, 2018","reviewText":"Excellent buy!"},{"reviewerName":"Spencer","rating":"3.0 out of 5 stars","reviewTitle":"Microphone","reviewDate":"August 8, 2019","reviewText":"Amazing camera for videos and pictures. Buut the RODE microphone just wont go on any of my cameras anymore? I have no idea how to fix it. I’ve tried contacting RODE but they aren’t replying."},{"reviewerName":"Dervin","rating":"5.0 out of 5 stars","reviewTitle":"Great Setup","reviewDate":"August 13, 2019","reviewText":"Really good set up. I took it on a trip had great picture and video quality. What surprised me the most was how good the sound quality was even when the microphone wasn't hooked up. Real fun run and gun set up."},{"reviewerName":"Mark P.","rating":"5.0 out of 5 stars","reviewTitle":"camera or glass","reviewDate":"November 17, 2018","reviewText":"with out a good lens pictures are good but a great lens will set you back 700.00 to 2000.00 $ depending the type pictures you want to take yesits worth buying"},{"reviewerName":"Edward N.","rating":"5.0 out of 5 stars","reviewTitle":"Great kit","reviewDate":"December 6, 2017","reviewText":"I love this camera and it was shipped fast."},{"reviewerName":"Weekend Woodworker","rating":"5.0 out of 5 stars","reviewTitle":"Excellent camera.....hard to take a bad picture","reviewDate":"July 8, 2016","reviewText":"Excellent video and pictures. I'm still learning how to use the camera, but it has been an excellent purchase. Even on automatic I have hardly taken a bad picture. Video is almost too easy. I did purchase a good Canon flash and have an external microphone for video, All in all very glad that I bought this. It is heavy if you are not used to a good camera and lens."},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Worth every cent!","reviewDate":"July 7, 2019","reviewText":"Absolutely love this camera, it does everything I need and more. Would highly recommend amateur or professional."},{"reviewerName":"Itza Kahlo","rating":"5.0 out of 5 stars","reviewTitle":"I'm just in-love with it.","reviewDate":"June 10, 2017","reviewText":"Amazing kit. Arrived sooner than expected, I'm very pleased with my purshase and slowly expanding my video gear there. Def recommend it."},{"reviewerName":"Zulu49","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"November 1, 2018","reviewText":"Excellent camera"},{"reviewerName":"James T","rating":"5.0 out of 5 stars","reviewTitle":"Just getting started with DSLR, but am so far VERY impressed","reviewDate":"March 4, 2017","reviewText":"The camera ia awesome and the kit has allowed me to up my video production quality. I am just really getting started with the DSLR. I haven't owned an SLR camera is almost 25 years, so a lot of adjustment is needed. The 80D does a great job with it's auto settings that create some great pictures and amazing depth of field.\n\nThe microphone is ok. It still picks up a lot of ambient noise, but is does it's job.\n\nThe Power Zoom adapter, love that it comes with a protective plastic cover when it is not in use and the fact it can be controlled with the Cannon iOS app is a HUGE plus."},{"reviewerName":"Ben Stark","rating":"4.0 out of 5 stars","reviewTitle":"Four Stars","reviewDate":"March 20, 2018","reviewText":"This is a great camera body with tons of features. It's a true workhorse of a camera."},{"reviewerName":"Jennifer McKinnon","rating":"5.0 out of 5 stars","reviewTitle":"I LOVE THIS CAMERA!","reviewDate":"February 1, 2018","reviewText":"I LOVE THIS CAMERA!"},{"reviewerName":"Dez-E-Lu","rating":"5.0 out of 5 stars","reviewTitle":"My upgrade... LOVE it!","reviewDate":"July 26, 2017","reviewText":"LOVE IT! I upgraded from a Canon T3i! I had to watch tutorials about the camera... I can not wait to get out a shoot!"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Great Camera","reviewDate":"October 24, 2017","reviewText":"Great Camera, good value for money"},{"reviewerName":"ledainghia","rating":"3.0 out of 5 stars","reviewTitle":"Wifi doesn't work as should.","reviewDate":"January 30, 2018","reviewText":"Good camera to learn photography.\nWifi and app do not work properly. Frequent stop annoying.\nBetter if having bluetooth instead wifi."},{"reviewerName":"J.S. Park","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"January 12, 2018","reviewText":"This camera takes excellent pictures without the flash."},{"reviewerName":"Shaun Combs","rating":"5.0 out of 5 stars","reviewTitle":"Excellent upgrade from Point and Shoot","reviewDate":"January 9, 2017","reviewText":"Excellent shooter with friendly controls. I'm not a pro but was looking to move to a superior \"prosumer\" grade camera. I wanted to find the right balance between cost and performance that offered a good value for my skill level. This has been great so far and has great picture quality. The ability to rapidly shoot with little to no shutter delay has made all the difference when taking pictures of my small children, and it is light enough to easily carry around all day while on vacation overseas. The controls are not intimidating, and I'm looking forward to learning more about the many features the camera offers."},{"reviewerName":"Rick McCulley","rating":"4.0 out of 5 stars","reviewTitle":"Solid","reviewDate":"July 27, 2017","reviewText":"So far so good haven't had it long but for what I've used it its a solid camera"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"March 4, 2018","reviewText":"Love the Camera does everything I expected"},{"reviewerName":"TC","rating":"5.0 out of 5 stars","reviewTitle":"Canon EOS 80D, a nice piece for hobbyist.","reviewDate":"April 16, 2016","reviewText":"I got the Canon 80D for a week. A happy upgrade from T3i. The 80D shoot significantly faster 7fps, longer battery life, larger viewfinder, higher true resolution, it has a fully flip out touch screen easy to navigate menu set up, more cross type focus, weather sealed, reduce shutter shaking, much less shutter lag, better image quality, mostly I use it to shoot still images as a hobbyist, occasionally I shoot video clips, I don't have neither a 4k TV nor 4k monitor, so the 1080p 60fps is good enough for me. I don't need to worry about the overheat issue during video shooting. I am thinking about to add a tele zoom lens to shoot landscape and wild life images. I love this camera.\nUPDATED: Set the camera on tripod at backyard patio @ noon 80F testing the video shooting 1080p @ 60fps, let it run 29 minutes and 59 seconds, NO overheat warning. Nice job Canon!\nUPDATED 5/14/2016 My Canon 80D with Sigma 150-600mm images."},{"reviewerName":"C. A. Martinez","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"January 25, 2018","reviewText":"I'm a beginner and it's an excellent camera."},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Love this camera.","reviewDate":"December 6, 2016","reviewText":"Love! Love! Love! I love my Canon 80D creator kit. This thing is a beast for the price range."},{"reviewerName":"brandon","rating":"5.0 out of 5 stars","reviewTitle":"Excellent Camera","reviewDate":"September 28, 2018","reviewText":"This is my first DSLR camera, I wanted a great camera to start off with and this camera delivered."},{"reviewerName":"z","rating":"5.0 out of 5 stars","reviewTitle":"Great Camera","reviewDate":"August 25, 2018","reviewText":"Great camera. Will update review once I make more videos and picture edits."},{"reviewerName":"Chran-Ham Chang","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"June 12, 2018","reviewText":"I like this product"},{"reviewerName":"Kiahna Engel","rating":"1.0 out of 5 stars","reviewTitle":"After 1 year, the camera will not power up.","reviewDate":"May 12, 2018","reviewText":"I handled this camera like a newborn baby and 8 days after the 1-year mark, the camera will not power up."},{"reviewerName":"Joshua Creech","rating":"5.0 out of 5 stars","reviewTitle":"Great deal!!!","reviewDate":"November 1, 2018","reviewText":"Looked brand new and takes amazing pictures."},{"reviewerName":"Jacob","rating":"5.0 out of 5 stars","reviewTitle":"Amazing camera!","reviewDate":"April 6, 2019","reviewText":"Absolutely amazing camera and picture quality"},{"reviewerName":"Chris","rating":"5.0 out of 5 stars","reviewTitle":"It's a great vlogging cam for the money","reviewDate":"October 26, 2017","reviewText":"Big fan so far. It's a great vlogging cam for the money. Does more than I could have anticipated."},{"reviewerName":"Raul Torres","rating":"5.0 out of 5 stars","reviewTitle":"Canon lo mejor","reviewDate":"June 9, 2019","reviewText":"100% recomendado"},{"reviewerName":"alec drayton","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"June 20, 2018","reviewText":"No problems once or ever"},{"reviewerName":"Paul","rating":"5.0 out of 5 stars","reviewTitle":"All you need to get going as a vlogger.","reviewDate":"February 21, 2018","reviewText":"Great set-up for people wanting to vlog on youtube."},{"reviewerName":"Amazon Customer","rating":"4.0 out of 5 stars","reviewTitle":"love it","reviewDate":"September 23, 2019","reviewText":"good one"},{"reviewerName":"James Austin","rating":"5.0 out of 5 stars","reviewTitle":"Impressive performance","reviewDate":"February 28, 2017","reviewText":"Wow - great upgrade from my Canon Rebel T5, which is still a fine entry-level DSLR. The 80d is not much bigger or heavier than the T5, but blows it away in performance and flexibility. I really appreciate the big, bright viewfinder, super-fast autofocus, and the touchscreen. Lots of new controls to learn, but it's fairly intuitive even for a relative beginner. I mainly shoot high school sports, wildlife and astrophotography, and the 80d is great at each. Great speed for catching stop-action shots in sports, outstanding IQ even in low light for those dawn/evening wildlife shots, and easy to set custom manual settings for catching great shots of the moon or the stars. The EF-S 18-135mm Nano USM lens so far is really impressive - super fast, silent focusing, and while it's not L lens quality glass, image quality is surprisingly good. The excellent zoom range also means I don't have to tote around too many lenses, too. Great job, Canon."},{"reviewerName":"Datadoc","rating":"5.0 out of 5 stars","reviewTitle":"Great camera and lens combination.","reviewDate":"May 26, 2016","reviewText":"Great camera and lens combination. Very versatile. Excellent picture quality and I love the wireless downloads to my computer using the EOS software. It's going to take months to explore all the features, but so far I am thrilled."},{"reviewerName":"RachelT","rating":"5.0 out of 5 stars","reviewTitle":"Great upgrade.","reviewDate":"March 12, 2017","reviewText":"I upgraded to this camera from the T1i. I was having issues with action shots and night shots. I am still learning to use this camera but so far its a great improvement over the t1i and takes super pictures."},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"... to the Canon 80D from the 60D and absolutely love it!","reviewDate":"June 10, 2016","reviewText":"I upgraded to the Canon 80D from the 60D and absolutely love it!!!"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"April 9, 2017","reviewText":"O mi goooooood"},{"reviewerName":"Katie Hester","rating":"5.0 out of 5 stars","reviewTitle":"Amazing for Film/Video","reviewDate":"June 4, 2017","reviewText":" I absolutely love this camera! I purchased it almost a month ago for my filmmaking and I have to say, it is the best purchase I have ever made! The autofocus is amazing and the quality of the video is perfect! There are so many different ways you can format your clips, so it will always work! Plus, the wifi makes it easy to send things straight to my phone for quick editing to be posted on Instagram or other social sites!"},{"reviewerName":"dhwhite","rating":"5.0 out of 5 stars","reviewTitle":"Great Camera","reviewDate":"March 31, 2016","reviewText":"Easy to use, excellent photos, highly recommend!"},{"reviewerName":"Nabin Gurung","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"April 22, 2017","reviewText":"very good"},{"reviewerName":"Antonio Sano","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"June 10, 2016","reviewText":"Great camera for a vlogger like me 😊👍🏼"},{"reviewerName":"Ms. Glo","rating":"4.0 out of 5 stars","reviewTitle":"Four Stars","reviewDate":"January 31, 2018","reviewText":"Good camera, easy to use."},{"reviewerName":"Mak","rating":"4.0 out of 5 stars","reviewTitle":"Nice camera trying to be a jack all trades","reviewDate":"October 29, 2016","reviewText":"Certainly this is better camera than 60D which I used for 5 years. 24 MP IQ is better, 45-point AF is better. Touchscreen LCD with a new nano USM lens are certainly great additions. Build quality is great. Battery life is awesome. Video features are great on this camera except no 4K video.\n\nDespite all these improvements, high ISO performance (3200 and onwards) is worse. So this is not useful in low light without flash. People might argue about getting RAW images being processed and getting good results, but in-camera JPEGs must be of great quality for this camera at this price point. Though AF performance in tracking moving subjects is better than 60D, it is seriously lagging behind other competitors.\n\nI can still recommend this camera to others who are looking for an upgrade from T/Ti series or 60D as this is a great all round camera. It puts everything into one package which no one has right now. I would recommend using L Lens, as kit lens is not very impressive when it comes to IQ. But kit lens 18-135mm is very silent and very quick to focus."},{"reviewerName":"Gerardo Delgadillo","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"August 2, 2017","reviewText":"Excelente!"},{"reviewerName":"Keenan Murphy","rating":"4.0 out of 5 stars","reviewTitle":"Great camera, but HDR only works in jpg format","reviewDate":"October 22, 2016","reviewText":"Love this camera. Wish I could take HDR photos while using RAW format though. As of now, you can only do this using jpg format"},{"reviewerName":"Logan Smith","rating":"5.0 out of 5 stars","reviewTitle":"Amazing deal! The camera body and lens alone would ...","reviewDate":"April 5, 2017","reviewText":"Amazing deal! The camera body and lens alone would have been the same price as what I paid, so I basically got the mic, Auto zoom, and memory card for free.\n\nAs for the camera itself, I love it. I'll let the pictures speak for themselves"},{"reviewerName":"Pablo Della Bella","rating":"4.0 out of 5 stars","reviewTitle":"The camera is amazing. 10/10 but it came out with a crappy ...","reviewDate":"February 2, 2017","reviewText":"The camera is amazing. 10/10 but it came out with a crappy mic input, and I had to send it for a repair right away."},{"reviewerName":"Amazon Customer","rating":"4.0 out of 5 stars","reviewTitle":"satisfied purchase","reviewDate":"September 29, 2016","reviewText":"after receiving a defective camera, the seller was very reasonable and worked with me so i could return it and get a new functioning camera. After sending the defective product back and receiving the new camera, everything was exactly how i expected and i was very satisfied."},{"reviewerName":"nmart","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"October 4, 2016","reviewText":"Incredible camera and the best Amazon seller."},{"reviewerName":"Nickey","rating":"5.0 out of 5 stars","reviewTitle":"I'm in love","reviewDate":"September 7, 2016","reviewText":"Best camera I've ever owned!"},{"reviewerName":"jarman","rating":"5.0 out of 5 stars","reviewTitle":"Great camera","reviewDate":"December 20, 2016","reviewText":"Camera came in perfect condition as promised. I like that ! 80D is amazing product to buy!!"},{"reviewerName":"Darian","rating":"5.0 out of 5 stars","reviewTitle":"Awesome Camera","reviewDate":"March 27, 2017","reviewText":"Amazing camera and super easy to run. I bought it for the video aspect and love love love it."},{"reviewerName":"Samay Nhey","rating":"5.0 out of 5 stars","reviewTitle":"Canon 80D","reviewDate":"March 27, 2017","reviewText":"Amazing camera! Thank you!!!"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"March 30, 2017","reviewText":"I love this camera!"},{"reviewerName":"Jeff and Charity","rating":"1.0 out of 5 stars","reviewTitle":"No Autofocus After 60 Days!!!","reviewDate":"July 3, 2017","reviewText":"Soooooo disappointed! I did a lot of research before investing $1500.00 in a body + lens kit. Based on numerous reviews and recommendations from friends who own other Canon cameras, I decided to purchase this 80D + 18-135 kit. I brought it with me to Mexico shortly after receiving it. No issues. Then it sat for several weeks until I brought it with me on family vacation. Everything was great until 2 days before we came home. I went to shoot pictures along the New Hampshire coast only to find that the camera would no longer autofocus. I am home only for a few days before I am headed out of town again. My plan was to bring the camera with me. Now it looks like it's going to go into the repair shop! When it comes out, it's going on eBay!"},{"reviewerName":"amazazing","rating":"5.0 out of 5 stars","reviewTitle":"recommend this camera","reviewDate":"March 31, 2016","reviewText":"i just love my new dslr camera..great photos and videos..fast shipping!"},{"reviewerName":"Jeff Schlesser","rating":"5.0 out of 5 stars","reviewTitle":"Amazing camera for the money","reviewDate":"October 31, 2016","reviewText":"Great camera!"},{"reviewerName":"Magic","rating":"5.0 out of 5 stars","reviewTitle":"Love my Canon EOS 80D Video Creator Kit","reviewDate":"September 23, 2016","reviewText":"Love my canon eos 80D, the microphone is ok, but the rest of the system is fantastic."},{"reviewerName":"David S","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"May 28, 2016","reviewText":"I love it"},{"reviewerName":"Patrick","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"March 12, 2017","reviewText":"Fantastic package, everything you need for learning video or photography."},{"reviewerName":"RaphLeitao","rating":"1.0 out of 5 stars","reviewTitle":"MISSING LENS","reviewDate":"August 2, 2018","reviewText":"I AM MISSING THE 18-135mm lens"},{"reviewerName":"671MicoPub","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"October 19, 2016","reviewText":"Nice back-up camera."},{"reviewerName":"Amazon Customer","rating":"1.0 out of 5 stars","reviewTitle":"I was extremely disappointed to find that the camera was not new","reviewDate":"July 11, 2018","reviewText":"I planned on using this camera on an upcoming trip. I was extremely disappointed to find that the camera was not new. It had an off brand battery in it and hairs on the shutter. Extremely disappointed to say the least."},{"reviewerName":"Michael","rating":"4.0 out of 5 stars","reviewTitle":"Four Stars","reviewDate":"April 3, 2017","reviewText":"you should own one"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Great camera, easy and fun to use!","reviewDate":"January 10, 2017","reviewText":"As someone who has always just made due with my iPhone or smartphone camera, finally getting a DSLR was a huge step for me and I am glad I took it. The EOS 80D was recommended to me by several people as I looked to start a YouTube Tech channel and it did not disappoint. Super easy controls, fantastic quality photos and best of all 1080p 60FPS video recording. At a hair over $1500 after taxes I had a true machine to capture the moments in my life and the opinions of tech gadgets that I wanted to post to the internet. It has yet to disappoint me and the point and shoot capabilities are awesome. It makes me feel like a pro photographer though I am only an amateur. Buy this camera if you can afford it, you won't regret it."},{"reviewerName":"Nick","rating":"1.0 out of 5 stars","reviewTitle":"Seriously?","reviewDate":"July 1, 2019","reviewText":"I was just about to pull the trigger and buy the 80D w/18-135mm lens and overnight they jacked the price by $200. Now I am having seconds thoughts. How unfortunate as I think this has got to be the best midrange DSLR available."},{"reviewerName":"Timothy M Ryan dds","rating":"1.0 out of 5 stars","reviewTitle":"One Star","reviewDate":"June 4, 2018","reviewText":"lcd swigs open"},{"reviewerName":"Rohan","rating":"5.0 out of 5 stars","reviewTitle":"mainly for the newer features and better image quality","reviewDate":"April 5, 2017","reviewText":"I spent many weeks reviewing cameras and finally decided on the Canon 80D.\nI finally narrowed down my decision to the 80D and the 7D mark ii and went with the 80D, mainly for the newer features and better image quality.\nI also purchased the Canon 18-200mm lenses and 50mm STM 1.8 prime lenses.\nI was blown away by the image quality! In one word, amazing technology.\nJust go for it."},{"reviewerName":"Guy K Kidd","rating":"5.0 out of 5 stars","reviewTitle":"This Camera is A1+","reviewDate":"May 19, 2018","reviewText":"I love my 80D!"},{"reviewerName":"A. Alshareedah","rating":"2.0 out of 5 stars","reviewTitle":"Sadly Canon is reminding me of Nokia, good hardware at their beginning and bad software","reviewDate":"August 31, 2017","reviewText":"Disappointed,\nSadly Canon is reminding me of Nokia, good hardware at their beginning and bad software, while not planing to move with the current developments.\n\nPros:\n- it takes great photos,\n- Auto focus is great and better than most of the competition\n- Battery life is good\n- good selections of lens in the market (though others are covering the needed segments)\n\nCons:\n- though it was designed with video in it's mind but you should avoid it for video, if that was your aim\n- other brands offer 4k video\n- bad microphone recording (as expected from DSLRs), and external mic. is a must (thus add to the price and the gear you cary)\n- expansive (for what you get)\n- heavy and large as it's a DSLR, the future seems going to mirrorless, as they are smaller in size, lighter and faster,\n- the wifi connection with the phone disconnects your phone from the world because you connect to the 80D as your wifi, thus your phone stops using data or any other wifi (disconnected, thus no sharing photos or uploading them while connected) and their app is very very slow"},{"reviewerName":"omar","rating":"5.0 out of 5 stars","reviewTitle":"👍🏼👍🏼👍🏼👍🏼👍🏼","reviewDate":"December 20, 2017","reviewText":"Fenomenal product. I was given one extra as a gift. Email me for listing"},{"reviewerName":"Erica Hosseini","rating":"5.0 out of 5 stars","reviewTitle":"Super clear photos","reviewDate":"March 31, 2019","reviewText":"Amazing camera. Works great!!!"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"I love this camera","reviewDate":"April 20, 2016","reviewText":"I love this camera. The thing is that i bought this camera for $1440 that is 95000 rs in india. I thought it is much cheaper in america, but that doesnt\nseem to be the case."},{"reviewerName":"Bruce A. Crippen","rating":"5.0 out of 5 stars","reviewTitle":"canon upgrade","reviewDate":"August 3, 2017","reviewText":"one step better than 70d"},{"reviewerName":"Robert Lassiter","rating":"2.0 out of 5 stars","reviewTitle":"Advertised as a significant improvement on the earlier Canon 70D in video quality and ease of use I was hugely disappointed. The","reviewDate":"April 19, 2016","reviewText":"These comments refer only to the video capabilities of the Canon EOS 80D Digital SLR Kit with EF-S 18-135mm f/3.5-5.6 Image Stabilization USM Lens (Black). In my career as a professional wedding photographer and videographer I've had over 30 years using Canon, Panasonic, and Sony cameras. Advertised as a significant improvement on the earlier Canon 70D in video quality and ease of use I was hugely disappointed. The low light capability of the camera, under all settings, both manual and automatic is very poor and compares negatively to dedicated video cameras from Canon such as the Vixia 10, 20, and 30, all of which I have used extensively for the last 4 years. And not surprisingly, audio is a major issue. Levels are low requiring post production enhancement. Auto focus tracking, which was hailed as a significant improvement does not even compare to any dedicated video camera I have used, both in low light and full sun, consistently searching and going out of focus. Battery power, even with genuine Canon batteries, is very short compared with dedicated video cameras. Weddings require long battery life and woe is the wedding videographer who does not have multiple spare batteries in his or her pocket. Finally, the annoying 29 minute record time is a nuisance when shooting a multiple camera church ceremony and you're hoping to sync multiple cameras in post production. Wish I had purchased another Canon Vixia 30 for $1250.00 rather than $1899.00 for a camera that almost out of the box is a back up camera to be used only in emergencies."},{"reviewerName":"Jack Blake","rating":"3.0 out of 5 stars","reviewTitle":"Three Stars","reviewDate":"April 19, 2017","reviewText":"Doesn't shoot in 4K.. :("},{"reviewerName":"Michala Powers","rating":"1.0 out of 5 stars","reviewTitle":"DON'T BUY","reviewDate":"September 2, 2017","reviewText":"I bought this thinking it was new and it wasn't! Everything was opened. From the big box to the camera it's self. It also did not come with the Power Zoom Adapter PZ-E1 and the 32gb memory card that is advertised. Absolutely disappointed with this purchase."},{"reviewerName":"Kindle Customer","rating":"3.0 out of 5 stars","reviewTitle":"Please take a seat, this is gonna be a while...","reviewDate":"April 13, 2016","reviewText":"I preordered the Canon 80D. The camera was sent to me, which was a bit of a fiasco (took a lot longer to get for logistic reasons, and do not factor into this review). After reading the manual front-to-back, the camera AF was not working on the new lens. I called Canon and advised of the issue. Per Canon, there's a lens or camera defect and needs to be returned. I returned the camera kit to Focus Camera for a new camera kit. So, this makes week 3 since the release date of the Canon 80D...without a working camera. So far It's been a dull and agonizing pain, but hopeful this will resolve with the new replacement. Update to come!"},{"reviewerName":"FIJISUN","rating":"3.0 out of 5 stars","reviewTitle":"Need to have better one","reviewDate":"May 14, 2016","reviewText":"I have been a Canon user for some time now but not a fanatic loyalist so I have a good experience with Nikon and Sony as well. Since I do print media and video shoot for quick uploads to social media, I have relied more on Nikon D7000 and Sony HD Camcorder both of which have the still picture and video shoot capabilities. It has been my hope to see Canon come out with something similar in less than $1500 price range. But from what I have just seen on the video, the 80D does not seem to possess all that. I may be wrong since I have not tried it. But I do not want to jump into buying it just to try it and go through the pain od returning. The short video clip to this AD leaves a lot to be desired for serious users an d critics like me who are in constant need of products in the constantly changing environment and fiercely competitive market as far as cameras go. Keep in mind that smartphones with over 20 megapixels and capability for instant uploads to Facebook and You Tube are a major challenge that I readily use at various press conferences."},{"reviewerName":"Stephen Saunders","rating":"5.0 out of 5 stars","reviewTitle":"Great camera!","reviewDate":"October 12, 2017","reviewText":"This camera is solid. The sensor is great in low light!!! I worked on a major book project using it and the photos were great. Using the WiFi to quickly get photos on my iPhone for social media is easy. Also the video camera is great. The lens attachment for zooming in/out is priceless!!! Love love love that I can use my eos system lenses! They are comparable."},{"reviewerName":"William","rating":"5.0 out of 5 stars","reviewTitle":"GREAT = 10 Stars","reviewDate":"March 7, 2018","reviewText":"GREAT = 10 Stars"},{"reviewerName":"travelbuff","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"May 3, 2017","reviewText":"Still learning all the details and all the features. Had a canon before but not with a video."},{"reviewerName":"abigaail","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"January 18, 2017","reviewText":"love it!"}]}