{"title":"Canon EOS Rebel T6 Digital SLR Camera Kit with EF-S 18-55mm f/3.5-5.6 IS II Lens (Black)","manufacturer":"Canon","currentPrice":"$399.00","rating":"4.5 out of 5 stars","totalRatings":"450 ratings","features":["\n         Make sure this fits\n                by entering your model number.\n        \n","18.0 Megapixel CMOS (APS C) image sensor and high performance DIGIC 4+ Image Processor for excellent speed and quality","ISO 100 6400 (expandable to H: 12800) for shooting from bright light to low light. Compatible with Eye Fi Cards. Multimedia cards (MMC) cannot be used","Built in Wi Fi and NFC connectivity provide easy sharing to compatible smart devices, select social media sites and the Canon Connect Station CS100 device","9 point AF system (including one center cross type AF point) and AI Servo AF provide impressive autofocus performance with accurate results. AF Assist Beam Effective range : Approx. 13.1 feet. / 4.0 meter. Periphery: Approx. 11.5 feet. / 3.5 meter","High performance Optical Viewfinder helps facilitate quick and accurate focusing by firmly framing and capturing the subject at hand"],"reviewsAspects":["easy to use","point and shoot","love this camera","manual mode","user friendly","entry level","picture quality","takes great","highly recommend","auto mode","great camera","eos rebel","great pictures","shutter speed","learn to use","get started","happy with my purchase","stopped working","takes wonderful","great starter"],"productInformation":[{"Product Dimensions":"6.5 x 8.7 x 5.4 inches"},{"Item Weight":"2.82 pounds"},{"Shipping Weight":"3.05 pounds (View shipping rates and policies)"},{"ASIN":"B01CO2JPYS"},{"California residents":"Click here for Proposition 65 warning"},{"Item model number":"T6"},{"Batteries":"1 Lithium Polymer batteries required. (included)"},{"Customer Reviews":"4.5 out of 5 stars\n    450 ratings\n4.5 out of 5 stars"},{"Best Sellers Rank":"#1,227 in Camera & Photo (See Top 100 in Camera & Photo)\n#27 in DSLR Cameras\n"},{"Date first listed on Amazon":"March 10, 2016"}],"productDescription":["The EOS Rebel T6 camera can be ideal for anyone looking to step up their imaging game. Equipped with an 18.0 Megapixel CMOS image sensor and many automatic and creative options, the EOS Rebel T6 is easy to use, simple to share wirelessly with and delivers impressive image quality to your audience.","Brilliantly clear and colorful images are at hand with the 18.0 Megapixel (APS-C) CMOS sensor and powerful DIGIC 4+ Image Processor, even in low light thanks to the camera’s wide ISO of 100–6400.","Built-in Wi-Fi* and NFC** capability allows for easy uploading to social media sites, remote shooting through the free Canon Camera Connect app*, image transfer to compatible devices and more.","The Optical Viewfinder allows quick, accurate focusing by firmly framing and capturing your subject.","Record Full HD video with superb quality and beautiful background blur, even under low-light conditions. The EOS Rebel T6 is compatible with all EF/EF-S lenses to help you realize the “movie director” in you. Try different lenses for fun and new perspectives.","For more creative shooting, simply twist the Mode Dial to try out modes like Portrait and Landscape."],"reviews":[{"reviewerName":"Chris Winter","rating":"5.0 out of 5 stars","reviewTitle":"A perfect Beginner's DSLR in a small and lightweight body","reviewDate":"April 11, 2016","reviewText":"BUILD QUALITY\n\nTo start off this review, let’s first take a look at the build quality of this lens.\nThe first thing you’re going to notice is just how small this camera is for a dslr. The T6 is one of the smallest DSLR’s you can buy from Canon and pretty much any company for that matter.\nBut to me, that’s not a bad thing. Being a very lightweight camera can sometimes mean you’re more inclined to pick it up and take it out with you, rather than being worried that’s it’s going to be too heavy.\n\nOn the top of the camera right here we’ve got all of the buttons that’ you’d expect to see on a beginner dslr and also this mode dial which allows you to select the mode you want to be in.\n\nOf course you’ve got all of the basic beginner modes, like sports and portraits etc, but also aperture, shutter and manual modes for when you want to get a little bit more advanced.\n\nThe buttons on the back are actually pretty nice. I would have preferred to have had the menu and display button on the top however as I use them pretty often.\n\nSo overall the camera’s build is good for what it is, a lightweight dslr, but i’d always be a little bit careful with this type of body.\n\nOh and guys if you want to see some sample images I’ve taken with the Canon t6, i’ll put a link in the description box below under this video and you can check them out.\n\nLCD SCREEN\n\nSo let’s turn this camera around now and talk about the screen.\n\nWe’ve got a 3 inch screen on the back which has 920,000 dots and after testing it out for a while, it actually looks pretty good.\n\nEven in bright daylight it was actually pretty easy to see.\n\nIt is however missing something that I really do like to see and that’s an articulating screen.\n\nWhereas on cameras like the Canon t6i and t6s, you can swivel your screen around to get better composition, with the t6 your kind of forced to take the photo even if you can’t see the screen.\n\nAnd that’s a bit of a pity to me and something I would have liked to have seen. I also would have liked to have seen a touch screen on the back of this camera, because they’re especially good for beginners.\n\nThe screen itself is actually pretty nice, but i’d like to see those improvements made in the next camera.\n\nMENUS\n\nSo let’s quickly talk about the menus on the T6.\n\nIf you’ve ever used a Canon camera before you’ll feel right at home with the menu system. It’s incredible easy to get around and change the settings you need.\n\nA little tip is that if you switch the dial on the top to manual mode, you’ll get a lot more settings that you can change which can be great.\n\nAgain it would have been nice to have a touch screen to make it quicker to change the settings not eh fly, but this little d pad right here isn’t too bad and it’s pretty responsvie.\n\nSo overall the menus are good, but make sure to check out more of the fearless in manual mode.\n\nWIFI & NFC\n\nSo one of the new inclusions to the Canon T6 is wifi & nfc.\n\nSo essentially what this allows you to do is connect your camera to your phone and do a number of things like transfer your photos and also get a live view of what your shooting.\n\nTo me this is the perfect camera to have this feature, because it’s targeting a younger generation of users who love to share their photos on instagram and Facebook.\n\nIt was pretty easy to setup the wifi, but not as intuitive as the 80d that i tested a few weeks ago.\n\nBURST MODE & AUTOFOCUS\n\nSo let’s talk about the burst mode of the Canon T6.\n\nSo essentially what this means is how fast the camera can take photos in a row per second.\n\nThe Canon T6 isn’t super quick and can only shoot 3 shots per second.\n\nNow most of the time when you take a photo you’ll only be taking one shot anyway so it won’t make a big difference, but if you want to take some photos at a sports game or of a bird, this might not be the best camera for you.\n\nAutofocus in stills mode is actually surprisingly good, it’s snappy and should be fast enough for most situations. Now the lens that comes with the camera isn’t great, and is noisy in autofocus, but if you can get passed the noise, which sounds bit like a bee, it’ll work pretty well in well lit situations.\n\nVIDEO\n\nSo let’s talk about using this camera for video.\n\nIt’s pretty basic for video and will be fine for day to day videos.\n\nUnfortunately though the autofocus in video isn’t great.\n\nThe lens that comes in the kit with the t6 isn’t an stm lens, which means it’s not going to have smooth and responsive af in video mode.\n\nMy tip would be to switch it over to manual focus o the lens and then just shoot like that.\n\nOne thing howver though which was good to see is that we have full manual control over our video and audio settings.\n\nWhere as on some older rebel cameras, you could only shoot in auto mode, the t6 does allow to have some manual control. We are missing a microphone jack though unfortunately, so if you are in need of some better audio, I might advise looking at the t6i and t6s.\n\nPRICE & VALUE FOR MONEY\n\nSo let’s talk about price and more importantly value for money.\n\nNow the T6 comes in at $549, which is one of the cheapest DSLR’s you can buy on the market today.\n\nYou also get a lens with that so all you need to get up and running after that is an sd card and you’re good.\n\nTo me it’s not a bad price, but there are definitely some very competitive options that I might look at, for example if you pay just a few hundred dollars more you can get a Canon t6i which is very good camera.\n\n-\n\nSo overall the Canon t6 isn’t a bad little camera, and for beginners, it’ll be a lot of fun to learn on. If you’ve never owned a dslr this is a good camera to learn on, but if you want to go a little further with your dslr, I’d definitely be looking at a camera like the Canon t6i or t6s."},{"reviewerName":"Mindy","rating":"5.0 out of 5 stars","reviewTitle":"A great camera with many features","reviewDate":"August 19, 2016","reviewText":"I'm a semi-pro photographer. I have a full frame camera that I use for professional shoots which I love dearly, however I wanted an \"everyday\" camera that I could take everywhere and not be devastated if it gets stolen/broken. Also, I wanted a camera that I could hand off to someone else (like my son or husband) without fear and one that they will actually be able to use. This camera fit the bill perfectly! So a few questions you might have:\n\nShould I get the T6 or T5?\n\nThey are basically the same camera. The only difference is that the T6 has wi-fi and has a Digic 4+ processor whereas the T5 has just the basic Digic 4 and no wi-fi. To me, the wi-fi was not a feature that I would use at all. I take so many photos that transferring them over wi-fi would be a joke. However, the fact that the Digic 4+ is faster and better was what prompted me to go with the T6. Plus, the screen in the back has a better resolution. However, if these features are not a big deal to you, the T5 does present a huge savings and it's basically the same camera.\n\nDoes it come with software?\n\nYes. But for some reason they didn't include it in the box, nor do they really mention it prominently in the instruction book that comes with it. The software is Canon's Digital Photo Professional (DPP) which is a raw image processor. It comes with a bunch of other software as well and they're pretty powerful/useful. You have to go on the Canon's website to download all this.\n\nDoes it come with a manual?\n\nYou would think the answer is an obvious \"yes\" but actually, no. It comes with a quick start guide that tells you how to use most of the automatic features and how to get started. The guide is great for beginners as it really breaks things down to basics. But you do not get the full camera manual. You have to download that from Canon's web site. (Which is a shame)\n\nShould I get this camera?\n\nI think if you're a beginner and want to explore photography, you can't go wrong with this. There are so many guided automatic modes that gently help you and the photos from these auto features actually come out really well. There's full automatic where the camera does everything, to semi-automatic where you control several things but the camera does the rest. There is shutter and aperture priority where you want to control most things but still need a helper for aperture or shutter speed. And then there is full manual for when you feel ready to control all things the camera is capable of.\n\nWhen I'm ready to upgrade, what is the next step?\n\nThe next step to is to get the 50mm 1.8 lens. This will enable you to work with lower available light and give you some awesome background blur. And it's probably the most affordable lens you can possibly buy.\n\nAll around great camera for a beginner, enthusiasts, or a pro who needs something smaller and lightweight."},{"reviewerName":"Kelly Hamilton","rating":"3.0 out of 5 stars","reviewTitle":"There is no way to change the ISO","reviewDate":"August 14, 2018","reviewText":"The ratings on this camera say that the ISO goes up very high, which is true. However, what they don't tell you is that the ISO is Automatic and there is no way to set it yourself in Manuel Mode. You can change the aperture and Shutter speed but it will automatically choose your ISO. Not a fan of that! Besides that the came is very user friendly and the wifi works great!"},{"reviewerName":"Ian Barker","rating":"5.0 out of 5 stars","reviewTitle":"Only Two Small Inconveniences","reviewDate":"July 26, 2017","reviewText":"The Canon EOS Rebel T6 is a great started DSLR, I've owned it for about a year and only have two complaints. First of all I wish the screen would flip out. It does not flip out or move at all but If you're fine with a fixed screen this is in my opinion is a great entry level DSLR. The only other problem I have with this camera is that there is no microphone jack. I bought the \"videomic go\" from Rode without thinking about it and when I went to put it on my camera I was super disappointed that there wasn't a mic jack. Other than those two minor inconveniences I love this camera!"},{"reviewerName":"mark hepburn","rating":"3.0 out of 5 stars","reviewTitle":"Good, solid camera with some disappointments too.","reviewDate":"September 27, 2016","reviewText":"I'm mostly a novice photographer with a specific interest: product photography for wood turnings I make and sell online. I purchased this camera after a couple of other failed attempts and overall, I'm pleased.\n\nThis is a basic camera and lens combo kit and if you're looking for some bells and whistles like an articulated LCD display, this isn't for you. However, the photos are outstanding, it has both a wide range of automatic settings as well as convenient access to more advanced controls if you want to set your own shutter speed, aperture, manual focus and so on.\n\nIt is comfortable to hold, but I have mine tripod mounted all the time.\n\nBuild quality is good and comparable to the Sony A3000 and the Nikon that I bought earlier. I do prefer this camera over these others, although I will say that the Nikon LCD interface is very intuitive. Having said that, it's basically what all low-end DSLRs are these days: plastic. That's not a bad thing, and it makes for a nice, lightweight camera if you're out in the field shooting. Likewise, the lens is also plastic and with a plastic mount so if you want something heavier you're better off with a bare camera and a separate lens.\n\nThe LCD screen on this camera is of decent but not huge size. Still, it is fine for displaying settings. In Live View mode it's pretty good in my \"studio\" but I can't comment on contrast and visibility outdoors. However, it is clear, seems to have a fine resolution and does the job. However, it isn't articulated like some people prefer so that may be a deal-breaker for you. For me, not so much.\n\nSoftware:\n\nOn-camera is good. It also has a \"feature guide\" that helps you along if you want to stray from the automatic settings. For example, you can change to aperture priority mode and it guides you through other settings. Very helpful for a newbie like me.\n\nBundled is non-existent. I went to the Canon site and downloaded a set of utilities (this camera is also known as the 1300D). Included are a sort of Lightroom clone, another editor that I haven't even loaded, and a tethered shooting utility that I use. A lot.\n\nSo for some reason Canon doesn't provide any software with the product, and not even a manual. That's mystifying to me but can all be found online. I got the manual and the utilities above. By the way, Canon is really aggravating about how you download software. Once you find it and choose to download, be prepared to provide your body serial number in order to link to the download. Sheesh!\n\nThe main thing I wanted was to be able to shoot tethered to my computer, and, since I've been using Photoshop forever, I also use Lightroom (and also Gimp and UFraw for those of you who know what those are :-)\n\nSo how is that going? Pretty well. However, you have to have a tethering cable and Canon will sell you a cable for twenty-five bucks, or you can get this: \"IFC-500U Compatible USB Cable\" right here on Amazon for $8.\n\nShooting tethered is great for me, because as I age, my vision is getting worse. I can now shoot products from my computer and use a 22\" monitor as a live view screen and then take the shot without touching the camera (after I've turned it on).\n\nLooking back, had I realized then what I now do, I'd have bought the T5 instead. Why? It's $100 cheaper, and really what I got for the difference is a slightly faster processor (don't need it), a better LCD screen (that I don't use), and WiFi (which sucks on this camera. Big time).\n\nWhy do I say the WiFi sucks? Well because it isn't really compatible with a standard computer OS. You can shoot and dump off to a phone or an iPad but really, not to a computer? So my hope was to fire up the camera, have it seen as another resource on my home network, and move the photos to my 2TB NAS. However, the camera will not work in WiFi if a cable is attached, and vice versa. Which really is rendered moot anyway by the fact that it doesn't work with a PC or a Mac OS. C'mon, Man!\n\nHow many photographers spend hundreds of dollars on a camera to put photos on their phone? I mean, you can just use your phone for that.\n\nHence the three stars. YMMV"},{"reviewerName":"Paul","rating":"5.0 out of 5 stars","reviewTitle":"Great entry level camera ...","reviewDate":"May 2, 2016","reviewText":"The Canon Rebel T6 is also known as the 1300D throughout the world. Without getting too technical, this model is a great entry level camera for novice photographers to learn the art of photography. The two lenses that are included provide the ability to take desirable photos near and far. It would be useful for anyone ordering this camera to remember lens filters, in order to protect the lenses from debris and damage. You will need a few memory cards and extra batteries are always useful. The wifi feature means easy uploading to your smartphone for social media posting or sending via e-mail. I have used the Canon Rebel series in the past and have had good luck with the model."},{"reviewerName":"Run Fanatic","rating":"5.0 out of 5 stars","reviewTitle":"Awesome camera for someone new to photography","reviewDate":"July 4, 2016","reviewText":"I am brand spanking new to photography and DSLR cameras. Thanks to a few hours at the University of YouTube, I think I have the hang of it. So my review is partial, but from the perspective of a total novice to photography and something other than a point and shoot camera.\n\nFeature guide\nI'm putting this first as this may be the most amazing and useful component of this camera for a complete newbie and the #1 reason this is an AWESOME camera for someone getting into photography. Since I didn't want to use my camera on auto mode (I could stick with a Coolpix if that's what I was looking for) and my goal was to learn how to use a DSLR in manual mode, the feature guide has been vital in helping me learn quickly. When changing modes (manual, aperture priority, Quick Control, etc), a brief description of the mode will pop up on the LCD. This is SUPER useful for a complete novice that has nearly ZERO knowledge (Thank You YouTube!) of what the different modes/controls are supposed to do. Seriously - best.feature.ever! For those that already know all of this like the back of their hand (I deeply admire you!), you can turn this feature off so it doesn't annoy you.\n\nCamera body\nThis is a heavy piece of equipment compared to the slim, simple point and shoot cameras (read: Nikon Coolpix). However, it is fairly comfortable to hold. The body has a nice curvature in the front with a rubbery grip which helps to keep it from slipping in my hand - for all I know, they all have this but again, I have little to compare it to. My son has a Canon EOS 30D (released in 2000?) and I can say that this model is significantly lighter than his.\n\nLenses\nI did some research on lenses and boy are these puppies expensive! I appreciate having both the 18-55mm and 75-300mm lenses with this kit. As a beginner, this will allow you to get all the basic pictures you could hope for all at once. I can take close up pictures and landscape pictures (the pictures I have included here were all taken with the lenses that came in this kit on my first few weeks using this camera). I'm sure there are much better lenses out there that come with a hefty price tag but for a beginner, this kit will give you everything you need to get started and take some pretty decent pictures.\n\nLCD monitor\nThe picture on the monitor is pretty clear and I used this a lot my first couple days. Instead of looking through the eye piece, I used the LCD display to shoot my pictures. As I became more familiar with the various ISO, F/S, and shutter speed settings, I switched up to shooting using the eye piece and used the display to quickly see/adjust my manual settings.\n\nPicture quality\nI'm pretty impressed. The pictures come out clear and sharp (assuming its correctly focused when on manual focus). The colors are bold and vibrant in my opinion. I don't think the pictures of my kids have ever turned out so good. Side note: I did start using the auto focus feature recently while on a road trip to be able to shoot faster and I am very please with how well the pictures turned out. It was quick to focus and will likely be using this feature often when I am out and about (with little time to set up the shot).\n\nI am incredibly happy with my purchase and if I had to do over again, I would pick this model. After purchasing this camera, I purchased a used Canon 30D for my son as he wanted to learn as well. In comparison, the Canon EOS has come a long way in terms of design, ease of use for a beginner, and features but if anything, I know based on having both a new and used (old) camera in the house now, that they can stand the test of time if cared for properly. Oh, and having a bag in the kit is also pretty handy."},{"reviewerName":"Majd","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"December 26, 2017","reviewText":"great Camera for everyday use!"},{"reviewerName":"Bob","rating":"5.0 out of 5 stars","reviewTitle":"Smile","reviewDate":"June 15, 2017","reviewText":"Love it. I haven't taken pictures in a while. I have a 35mm Canon AE-1 camera that I've been using since the early 80's. I use digital but mostly with an IPhone. This is my big move to DSLR.\nThe price was reasonable, due to the fact that the T6 is mostly plastic. There is a lot to get familiar with but having fun in the process.\nGood deal, good buy. Getting back into an old hobby. Loving it"},{"reviewerName":"Lawliet L.","rating":"5.0 out of 5 stars","reviewTitle":"Good option for Beginners","reviewDate":"April 10, 2018","reviewText":"Great option for beginners. Takes excellent pictures and like most DSLR cameras, it gives a lot of room for editing and post-processing (just make sure you're shooting in raw, not jpeg). Would recommend getting a prime lens to go with this if on a tight budget."},{"reviewerName":"Reddy","rating":"1.0 out of 5 stars","reviewTitle":"Product looks used","reviewDate":"October 16, 2018","reviewText":"When I opened the package I see this product is used and I felt like returning it back but I need it for my vacation.\nLenses is not properly covered with bubble wrap.\nThe worst part is the neck band is also missing some rubber lockers."},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Great pro camera for beginner","reviewDate":"December 19, 2016","reviewText":"Love that I can use the camera connect app to operate the camera and view photos on my phone instantly. Took a few tries to figure it out, but it works."},{"reviewerName":"Marie Guerierri","rating":"5.0 out of 5 stars","reviewTitle":"Takes great pictures...!","reviewDate":"February 3, 2018","reviewText":"I have owned Canon cameras all my life, and recently treated myself to this one. This camera is so easy to use, it features a large information screen with setting tips that make your shots effortless. A great camera for a beginning photographer. The quality of the images are fabulous, the ease of changing settings, lightweight, fits in the hand and just takes great pictures.\n\nIf I had one complaint it was the video settings... these were a bit difficult to find, and I had to practice a few times, so taking videos was a touch more difficult.\n\nLove the fact that the lenses and filters from my old camera (yes, the one that used film) work on this camera.\n\nThe ability to upload using wi-fi is also a plus - long battery life, and the mobile/computer apps are quite robust."},{"reviewerName":"Andrew Prince","rating":"5.0 out of 5 stars","reviewTitle":"Even getting great shots of the moon","reviewDate":"January 28, 2018","reviewText":"I've been using it constantly. Even getting great shots of the moon."},{"reviewerName":"Joy","rating":"5.0 out of 5 stars","reviewTitle":"What a camera!","reviewDate":"August 29, 2017","reviewText":"I love my new T6 - it's everything I've ever wanted. The body weight is just right to where I can have it dangling around my neck all day and my neck isn't sore. The details it picks up is incredible! My black pug is very difficult to photograph but this camera is able to do it with ease! I love it and highly recommend it's a purchase you won't regret!"},{"reviewerName":"oneninesevensix","rating":"5.0 out of 5 stars","reviewTitle":"Awesome entry level set up for the burgeoning \"Serious\" photog.","reviewDate":"March 1, 2019","reviewText":"Perfect intro level DSLR. Plenty of awesome source material out there to get going and get shooting. Tons of instructional videos on YouTube for free so no need to waste money on classes if there is a particular area of skill you want to \"focus\" on - sorry lol! Awesome quality given the brand and a veritable trove of accessories and lenses to pick from when you want to up your game. Remember it's not about the equipment at the end of the day, it's all about your own skill and know-how as a photographer. You could have the most expensive, mirrorless, digital, precision wrought camera in all the world that would still take shoddy photos if ones skill level was low. This camera is a perfect entry level to stepping up your game as a serious photog, as a youtube content creator and a plethora of other creative endeavours. If you're new to this type of camera set up the initial learning curve might feel a bit tough but its very adaptive and super easy to navigate once you do. One piece of advice would be this: buy and extra battery so you always have one on charge ready to pop since waiting around for a single rechargeable power pack to be ready will totally wreck your stride and other field testing, it sucks to have to cut short a really good project simply because you ran out of juice."},{"reviewerName":"Hiroshi Yague","rating":"3.0 out of 5 stars","reviewTitle":"It is a good camera to start in the world of photography","reviewDate":"December 24, 2017","reviewText":"It is a good camera to start in the world of photography.\nIt is not a good camera to start vlogging. The video autofocus is not good."},{"reviewerName":"Sean Roach","rating":"5.0 out of 5 stars","reviewTitle":"I love mine. I've now had it over a year.","reviewDate":"August 7, 2019","reviewText":"I got mine with the kit lens,...which I promptly damaged. I ended up buying a better telephoto for only a little more than I read it would cost to repair the old one, (hey, I'm the one who dropped it, I wasn't expecting it to be under warranty.)\nI have used it to take pictures of both fireworks and a lunar eclipse. Granted, autofocus did have some issues resolving under those light conditions, but it still managed to take good, sharp, pictures, despite being well outside of a \"normal\" use condition.\nThe video will only record for a little over 12 minutes, which is unfortunate, but it IS a \"Still\" camera. The microphone is actually pretty decent. I've managed to use it for at least 2 hours at a time, taking over a hundred photos, all using the screen on the back and the autofocus, which says something about the battery life. (Although, in that particular instance, I DID have the flash disabled, as I was trying to be respectful of others enjoyment of the event, so no flash might have saved a little battery,..but not as much as using the screen for a viewfinder must have cost.)\n\nIn short, I'm quite happy with mine, I would buy it again, and would heartily recommend it to anyone who was interested."},{"reviewerName":"Laura Ambrose","rating":"5.0 out of 5 stars","reviewTitle":"Great for a novice photographer","reviewDate":"January 3, 2019","reviewText":"We bought this for our son, who has had an interest in learning more about photography. He really likes the different options on this camera, as well as the WiFI capability. There are lots of special effects and settings to try out, and since it's digital, if it doesn't work, it's easy to delete and try again. He thought he wanted an old school 35mm, but now he says he's glad he has a digital instead."},{"reviewerName":"cheryl","rating":"5.0 out of 5 stars","reviewTitle":"SD Card format issues are common on this model","reviewDate":"June 5, 2019","reviewText":"611/19 Update..the card functions great. So far so good!\n6/6/19 Update: after researching I am finding this item to be a gray market item. There is a difference between the D and I version. Direct import vs Imported. This camera is a T6 1300D gray market. This is one of the reasons I am having a card issue. Page 5 of the manual indicates \"this camera can use UHS 1 cards but since it is not comparable with the UHS 1 standard, reading/writing will be equivalent to SD Speed Class 10 at most.\" Amazon has an obligation to inform it's customer. I am hoping the SanDisk I ordered today will work. Otherwise the camera gets returned :0(\n\n6/5/19 My camera will not format the SD card. Reading reviews online I'm trying to figure out if this is an international version and if that matters"},{"reviewerName":"Lobsang","rating":"5.0 out of 5 stars","reviewTitle":"AMAZING","reviewDate":"July 28, 2018","reviewText":"100% in love with this camera. It is perfect for beginners and professionals. Amazing photos at long distances and close up."},{"reviewerName":"Gerald Miles","rating":"5.0 out of 5 stars","reviewTitle":"AMAZING!!!!","reviewDate":"August 27, 2017","reviewText":"Really great camera all around, especially for beginners. I definitely recommend buying this camera, it’s easy to use and takes amazing shots. just so you get a clear understanding of the quality, there will be photos below"},{"reviewerName":"cristi","rating":"5.0 out of 5 stars","reviewTitle":"Cannon is a very nice camera, this camera has exceeded all expectations","reviewDate":"February 12, 2017","reviewText":"Cannon is a very nice camera, this camera has exceeded all expectations! It takes the best pictures and love the lens it comes with!"},{"reviewerName":"John S. Silver","rating":"3.0 out of 5 stars","reviewTitle":"At first I loved it but now I'm not so sure","reviewDate":"July 22, 2019","reviewText":"I like the two lenses that come with the set - it's very easy to change from lenses and both take really great pictures. However, the camera can be challenging to operate in anything other than automatic mode (I wouldn't call this a beginners camera). There are tons of different settings and the instruction manual is about 1/2 inch thick. Takes a lot of effort to figure out some of the more advanced features. My biggest complaint however is that the auto-focus function on the 18-55 mm lens has broken (less than 2 years after I bought the camera). I've seen this complaint on user boards and forums. Seems like pretty shoddy workmanship on an expensive device. I'm going back to Canon to see what resolution I can get and will update this post accordingly."},{"reviewerName":"Cletus31","rating":"5.0 out of 5 stars","reviewTitle":"Great starter camera","reviewDate":"January 11, 2017","reviewText":"We purchased this camera to take on our 30 year class trip. It has been a great camera for us. My wife and I are beginners in photography and from the reviews we read, this looked like the right camera for us. The kit came with everything we needed to get started. I would recommend purchasing another battery."},{"reviewerName":"Colin Mason","rating":"5.0 out of 5 stars","reviewTitle":"Nice intermediate camera","reviewDate":"December 24, 2018","reviewText":"I upgraded from an older, non-SLR Canon Rebel and I take a lot of youth soccer photos, but nothing professional. I found EOS Rebel T6 to be a nice step up from my previous model. I don't have to learn anything new and didn't have to shell out big bucks. It's perfect for what I use it for."},{"reviewerName":"Anna","rating":"1.0 out of 5 stars","reviewTitle":"low quality pictures","reviewDate":"April 18, 2019","reviewText":"this camera's pictures are really not worth it... For the same price you can get a new phone with all the extra functionality and pics just as good"},{"reviewerName":"Michael","rating":"5.0 out of 5 stars","reviewTitle":"Canon EOS camera","reviewDate":"September 9, 2017","reviewText":"Extremely happy with this purchase. I bought this for my son and he has used it a bunch. Like that it came with the two lenses as that allows for a variety of photo opportunities. It appears to be very well constructed and we're still learning about all the features. Really like this camera. The packaging was well done and the shipment arrived in just a few days. Nice piece of equipment and fun!"},{"reviewerName":"Aimee Rae Neveau","rating":"1.0 out of 5 stars","reviewTitle":"Don't buy on Amazon, go to a real camera store!","reviewDate":"October 9, 2018","reviewText":"I specifically wanted to purchase a brand new camera and received a refurbished camera. Sodisappointed. After a few photos the mirror stopped working. I'm returning and probably going to go with a different brand. Camera feels cheap as well."},{"reviewerName":"N. Lainez","rating":"5.0 out of 5 stars","reviewTitle":"Great Camera!","reviewDate":"November 29, 2017","reviewText":"Love my camera! Love everything about it! i needed a new camera for my family to take pictures on trips and or just for the holidays this is a great camera i don't know much but you tube is your friend when it comes to learning. pictures come out wonderful!"},{"reviewerName":"Douglas L. Dean","rating":"5.0 out of 5 stars","reviewTitle":"An excellent camera for beginners","reviewDate":"January 19, 2019","reviewText":"This is an excellent camera for beginners wanting to learn DSLR cameras. It provides automation that also allows for beginners to take photographs easily. This deal provides two lens both of which highly useful for photographs close in and far away. There is also the ability to add various Canon lens to extend that types of photos that can be taken. So this is a package that can grow with your abilities. I am well pleased with my purchase."},{"reviewerName":"Jane L. Wise","rating":"5.0 out of 5 stars","reviewTitle":"Greater MB/pixels","reviewDate":"February 17, 2018","reviewText":"I like the data improvement from my last camera. I went from 1-3 MB to about 20-25MB. I plan to use the improved pixels to improve my art images for online sales and in applying to art contests. I haven’t used all of it’s features yet. I’m mostly using auto mode and a few of the manual modes, when I have time to think about the lighting, etc."},{"reviewerName":"Honeybee","rating":"5.0 out of 5 stars","reviewTitle":"Love it","reviewDate":"November 21, 2018","reviewText":"Bought this for my son a year ago for his 18th birthday...he has loved it since day one! The picture quality is beautiful and he learned this camera very fast! This was his first true camera that wasn’t a point and shoot. For the price, this is an excellent choice!"},{"reviewerName":"Diana","rating":"5.0 out of 5 stars","reviewTitle":"Best buy ever!","reviewDate":"April 26, 2017","reviewText":"I'm a first time camera buyer/user and I absolutely love my Cannon T6. I did a lot of homework before buying and this was the brand and model that most appealed to me. It lived up to my expectations. The neck strap is not too comfortable but that's easily solved by changing it to maybe a cross body one like I did. The cam itself is very very good."},{"reviewerName":"Suz in Wenatchee","rating":"5.0 out of 5 stars","reviewTitle":"Great camera!","reviewDate":"January 13, 2017","reviewText":"Exactly what my husband needed for his new camera! He was surprised and delighted. It came so quickly and was exactly as described. He is learning how to use it - and looking forward to posting his fishing pictures! Thank you."},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Love love love this camera","reviewDate":"July 10, 2018","reviewText":"Love love love this camera!\nGreat picture quality and love the fact that you can download an app on your phone and upload the picture from you camera directly to you phone."},{"reviewerName":"LROD from AZ","rating":"4.0 out of 5 stars","reviewTitle":"Easily one of best cameras to get started with DSLR","reviewDate":"May 11, 2019","reviewText":"Camera is great. WiFi connectivity is great, simple and advanced options are really good. Lenses are ok, probably good enough for entry level (all photos have come out better than expected). Was even able to use old lenses from Rebel SLR with ease. Highly recommend it."},{"reviewerName":"Amazon Customer","rating":"4.0 out of 5 stars","reviewTitle":"look for packaged deals","reviewDate":"January 29, 2018","reviewText":"The camera, so far so good. Right after I get it and start using it, I see the package deals being offered. I could have got a lot more for not much more money. Tripod, filters more lens wow. I know I can return it and all that, but I will look closer at all packaged deals in the future."},{"reviewerName":"Alexis Alexander","rating":"5.0 out of 5 stars","reviewTitle":"Great quality camera","reviewDate":"May 8, 2019","reviewText":"This is honestly a great quality camera for beginners with DSLRs. I learned how to use it super easily and the picture quality is great!! The app however is pretty crappy. Crashes too much so I'd recommend buying a cable to hook it up to your computer."},{"reviewerName":"Alannah Michalski","rating":"5.0 out of 5 stars","reviewTitle":"Best purchase I’ve made this year!","reviewDate":"October 9, 2019","reviewText":"I love my new camera, I love both lenses, they are easy for me as I am a beginner enthusiast. I need more time in the manual to figure out all the features but I’m impressed and very happy so far, so it can only get better from here!"},{"reviewerName":"Alex Lyublinski","rating":"4.0 out of 5 stars","reviewTitle":"Excellent first DSLR for 2016","reviewDate":"January 4, 2017","reviewText":"This is a great little camera, and good replacement for T3/T4.. However, I would recommend adding new lense to the kit, not staying with the default, and older lenses could have some focus issues on the T6."},{"reviewerName":"Michael Casares","rating":"5.0 out of 5 stars","reviewTitle":"Worth the price !!","reviewDate":"May 29, 2017","reviewText":"Nice camera, easy to maneuver and great value for the money !!!"},{"reviewerName":"J. Weiss","rating":"5.0 out of 5 stars","reviewTitle":"I like this one much better","reviewDate":"December 8, 2017","reviewText":"My First DSLR, been using a Nikonos 35mm for years, I like this one much better, it's more demanding on batteries but not having to chase film containers makes up for that."},{"reviewerName":"J. Holtaway","rating":"3.0 out of 5 stars","reviewTitle":"Imposes patience and consious effort","reviewDate":"December 27, 2018","reviewText":"Went back to an SLR for control of light, shutter speed and optimum framing.....spoiled by automatic cameras that do it all in a smaller, lighter package. Even in auto mode must make several adjustments and hold up heavy camera."},{"reviewerName":"Katie Estelle","rating":"5.0 out of 5 stars","reviewTitle":"Order a T6, Received a T7i","reviewDate":"January 14, 2019","reviewText":"I ordered a T6 and received a T7i- quite the mini upgrade and was pleased with my purchase. I use these cameras as back-ups for my wedding videography business and they're nifty cameras for the price."},{"reviewerName":"Ily Tran","rating":"5.0 out of 5 stars","reviewTitle":"a great value and pack","reviewDate":"April 12, 2017","reviewText":"a great value and pack. very happy with this purchase. i had another canon rebel before this, but it didn't have the wi-fi connectivity. that connectivity has made me open up to so many new angles for photography and i'm really happy with it"},{"reviewerName":"Didimio Rios","rating":"5.0 out of 5 stars","reviewTitle":"Great Quality at affordable price.","reviewDate":"September 18, 2018","reviewText":"Canon is a trusted company who delivery magnificent products for all kind the consumers. The T6 is a great camera at affordable price to learn photography with extraordinary results."},{"reviewerName":"scott petrosky","rating":"5.0 out of 5 stars","reviewTitle":"Worth the price!","reviewDate":"April 6, 2017","reviewText":"I nost say this most be one of the best things i have ever bought. Very easy to use. I find myself taking lots more pictures again then i have in the past even then i did with my cellphone. I know its got one more thing to have to bring with you but when you see the pictures it takes makes it worth it in the end."},{"reviewerName":"Austin","rating":"5.0 out of 5 stars","reviewTitle":"Great Camera for a Great Price","reviewDate":"June 21, 2019","reviewText":"I have had this camera before, but it got lost in one of my moves. We ordered this one for an upcoming trip, and it's exactly what I remember. Shipping was fast and the product came in undamaged and in the original packaging. Would recommend for new photography enthusiast that are looking to take great photos with good user friendly features at a great entry price."},{"reviewerName":"Jim","rating":"5.0 out of 5 stars","reviewTitle":"Easy to take great pictures.","reviewDate":"December 27, 2016","reviewText":"Gave to my wife for Christmas. Started using immediately with excellent pictures in auto. Now she wants to take photography class. Easy setup for Wi-Fi and Bluetooth even as a novice. Nice start up kit."},{"reviewerName":"CCS","rating":"5.0 out of 5 stars","reviewTitle":"It is easy to use and takes great pictures","reviewDate":"April 11, 2018","reviewText":"My daughter loves her camera. It is easy to use and takes great pictures. She is a beginner and will continue to be able to grow into this camera learning what all the feature can do."},{"reviewerName":"Phil Serafini","rating":"5.0 out of 5 stars","reviewTitle":"Great camera for the money","reviewDate":"December 28, 2016","reviewText":"This is a great camera. You can really do a lot with the two lenses. Plus, the camerA can be as simple as putting it on automatic and pushing the button or you can individualize the settings to customize the shot."},{"reviewerName":"Tom Overman","rating":"5.0 out of 5 stars","reviewTitle":"Good starter camera","reviewDate":"December 5, 2017","reviewText":"This is a great starter kit with two good lenses for the price. I have mainly used the camera for nature photography and the larger lens allows great zoom for capturing wildlife from far. Image quality is very clear and with some nice Lightroom effects, you can get very professional pictures after your first shoot."},{"reviewerName":"sach","rating":"5.0 out of 5 stars","reviewTitle":"MI MEJOR INVERSIÓN","reviewDate":"July 30, 2019","reviewText":"lo mejor para empezar en la fotografía"},{"reviewerName":"MarvBoy","rating":"5.0 out of 5 stars","reviewTitle":"I made the right choice","reviewDate":"December 28, 2016","reviewText":"Fabulous package. Camera is excellent and easy to use. FAST. Great pictures. Switching lenses is a breeze. Padded case is great size. Very happy with this purchase!"},{"reviewerName":"Derrick Seales","rating":"5.0 out of 5 stars","reviewTitle":"My wife is very pleased and happy with it","reviewDate":"March 19, 2018","reviewText":"Definitely thankful I went with this (directly from Canon) instead of a larger package with more accessories. My wife is very pleased and happy with it!"},{"reviewerName":"Jen","rating":"2.0 out of 5 stars","reviewTitle":"Buy or not to buy....","reviewDate":"August 27, 2018","reviewText":"If you are not an expert photographer or have a lot of time to educate yourself, this camera is not for you. I kept thinking I would get the time to learn how to use and I missed the return date! Now I'm stuck with it. It would make beautiful pictures if you have time to learn to use it."},{"reviewerName":"linda","rating":"5.0 out of 5 stars","reviewTitle":"T6 cannon camera","reviewDate":"October 3, 2018","reviewText":"A lot of different functions will pull out great photos! Super happy to have this camera, I'm gonna take it everywhere!"},{"reviewerName":"Rex l. Richberger","rating":"5.0 out of 5 stars","reviewTitle":"Great kit for a great price!","reviewDate":"June 13, 2018","reviewText":"Had a Canon EOS Rebel T5 I gave to my oldest son, and he loves it. I was going through a gadget withdrawal, and this is an AWESOME kit at a great price!"},{"reviewerName":"Amazon Customer","rating":"4.0 out of 5 stars","reviewTitle":"My first DSLR camera and it seems like it is worth for the price","reviewDate":"January 2, 2018","reviewText":"My first DSLR camera and it seems like it is worth for the price. Very simple to use without compromising the quality of the photos."},{"reviewerName":"Lina River","rating":"5.0 out of 5 stars","reviewTitle":"Amazing!","reviewDate":"November 3, 2019","reviewText":"I love the quality! I was very impressed by this camera. very good to make my youtube videos and so simple to use. I used a YONGNUO lens with it and its great."},{"reviewerName":"Sebastian Falla","rating":"4.0 out of 5 stars","reviewTitle":"Awesome camera for the price","reviewDate":"October 4, 2017","reviewText":"GREAT camera... but! It does not have any mic input. You would have to record on a different device and sinchronize during editing - unless the built on mic is good enough for you."},{"reviewerName":"Farley","rating":"5.0 out of 5 stars","reviewTitle":"Great Camera","reviewDate":"August 17, 2019","reviewText":"Love this camera. Great pics, simple to use on auto, yet has many manual mode features. It does not have a touch screen which would have been handy though."},{"reviewerName":"Thomas E.","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"March 22, 2017","reviewText":"Best buy for the past year. Thank you!!!!"},{"reviewerName":"Bigrob808","rating":"5.0 out of 5 stars","reviewTitle":"Canon changed my life!","reviewDate":"March 13, 2017","reviewText":"OMG! I didn't know what I was missing and this camera is amazing to say the least! I take it with me everywhere I go. If you like taking pictures them get this camera!"},{"reviewerName":"Savannah","rating":"5.0 out of 5 stars","reviewTitle":"perfect from a beginner perspective","reviewDate":"March 27, 2017","reviewText":"works amazing. Everything fits together well. It was packaged well and nothing was broken when it came. You can keep the shorter lens on the camera when you keep it in the bag and have room for the longer lens, manual, extra cards, cables, and still have more space. Takes some awesome pictures. I am just getting started in photography so I don't know what to compare it to but as a beginner, I will say it is very user friendly. I am learning quickly and it's awesome having a camera I can actually play with the settings on instead of those normal point and shoot cameras. For the price, this is awesome. I feel like I really lucked out with a deal on this one. Worth the money. I think it's worth more but that's just my personal opinion."},{"reviewerName":"George","rating":"5.0 out of 5 stars","reviewTitle":"Gets the job done","reviewDate":"February 24, 2017","reviewText":"Wy wife who is a freelance writer got a gig that requires her to include photos with her text. She's only used a point a shoot and takes awful pictures. Using the presets on the Canon, she can take passable pictures that are good enough to be published. I don't know how many great photos it will produce, but it's the right tool for the job."},{"reviewerName":"Rudelis Martinez","rating":"5.0 out of 5 stars","reviewTitle":"Amazing for beginners","reviewDate":"July 20, 2019","reviewText":"I love love love this camera bundle. The photos are amazing... the auto focus is a tad bit annoying, it makes a sound every time it focuses on something but it’s not a huge deal to me. I still love it. It’s perfect for beginners wanting to get into photography. The videos are also very good. Overall would recommend. Definitely worth it."},{"reviewerName":"Kenneth Stuart","rating":"5.0 out of 5 stars","reviewTitle":"Best DSLR I've ever owned!","reviewDate":"August 24, 2017","reviewText":"Best DSLR I've ever owned!\nEasy to use! Excellent for video production! Easy lens change out!\nPRO Stuff for a decent price!\n\nWould prefer a 3.5 mm mic port.\n\nGreat for family portraits, weddings, EVERYTHING!"},{"reviewerName":"Barbara Martinez","rating":"4.0 out of 5 stars","reviewTitle":"... was apart of photography in school and I really loved it so I wanted one of my own","reviewDate":"December 22, 2017","reviewText":"I already had experience with this camera because I was apart of photography in school and I really loved it so I wanted one of my own. I got it a day before they said it was going to deliver but the only downside was that the memory card isn’t getting here until later, that’s the only reason I’m taking away one star. But everything came in perfectly, it had everything. I would highly recommend this camera even if you’re a beginner."},{"reviewerName":"Luisa","rating":"5.0 out of 5 stars","reviewTitle":"Love it","reviewDate":"August 29, 2017","reviewText":"Arrived in perfect condition, no damage, nothing. I absolutely love this camera! Perfect for my photography class. I hadn't read that it came with a strap so I bought one separately, but you DON'T NEED A STRAP, IT COMES WITH ONE!"},{"reviewerName":"Arnold Fines","rating":"5.0 out of 5 stars","reviewTitle":"Arrived perfect.","reviewDate":"October 4, 2018","reviewText":"Been using a lot."},{"reviewerName":"Becky Ewens","rating":"5.0 out of 5 stars","reviewTitle":"Nice Camera","reviewDate":"May 29, 2019","reviewText":"I've been using this camera for awhile now and really love it. It takes great photos and is fairly easy to use on auto focus."},{"reviewerName":"Xfrns","rating":"5.0 out of 5 stars","reviewTitle":"A good camera for a beginner at photography","reviewDate":"January 25, 2018","reviewText":"A good camera for a beginner at photography. Great quality pictures. If you want to use it to its full poetential you just have to put some effort into learning about its different features"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"I love this camera","reviewDate":"July 25, 2017","reviewText":"I love this camera, still playing around with it and learning. My daughter bought the same one and she loves it too. GREAT DEAL"},{"reviewerName":"marcos","rating":"5.0 out of 5 stars","reviewTitle":"The best !!!!","reviewDate":"August 2, 2017","reviewText":"I love my new canon t6 camera:) it my first one I own in what can I say I love it, the picture look amazing"},{"reviewerName":"Frank S.","rating":"5.0 out of 5 stars","reviewTitle":"it works awesome","reviewDate":"January 16, 2019","reviewText":"quick easy simple and awesome pics"},{"reviewerName":"Parvez","rating":"5.0 out of 5 stars","reviewTitle":"Best DSLR for beginner","reviewDate":"September 19, 2018","reviewText":"My first DSLR and loving it every moment still need to become an expert"},{"reviewerName":"Sheyla Lopez","rating":"1.0 out of 5 stars","reviewTitle":"Its ok","reviewDate":"June 19, 2019","reviewText":"A little disappointed I can't even get to connect the camera to the phone anymore for some reason"},{"reviewerName":"shayne lewis","rating":"5.0 out of 5 stars","reviewTitle":"Great starter Pro camera","reviewDate":"January 12, 2017","reviewText":"Great great starter camera pictures come out beautifully and love the add ons you can buy for this camera . Wifi and app for phone is the best feature"},{"reviewerName":"IhateApple","rating":"5.0 out of 5 stars","reviewTitle":"Good camera","reviewDate":"August 27, 2018","reviewText":"wife loves it, I know nothing about cameras."},{"reviewerName":"MW Miller","rating":"5.0 out of 5 stars","reviewTitle":"Great Deal and a Great Camera","reviewDate":"May 10, 2017","reviewText":"Totally satisfied with the product and the seller. Got her in 2 days even though it said it might be a couple of weeks. Totally brand new in the box. Happy happy!"},{"reviewerName":"Along0810","rating":"5.0 out of 5 stars","reviewTitle":"Love","reviewDate":"September 27, 2018","reviewText":"LOVE!!"},{"reviewerName":"Axel Flores","rating":"5.0 out of 5 stars","reviewTitle":"Quality and affordability","reviewDate":"January 18, 2019","reviewText":"Best camera to start"},{"reviewerName":"andy","rating":"5.0 out of 5 stars","reviewTitle":"Takes great quality pictures.","reviewDate":"May 22, 2019","reviewText":"Use this for a photo booth. Takes excellent pictures, but has troubles with auto focus in darker environments."},{"reviewerName":"Ann Hendricks","rating":"4.0 out of 5 stars","reviewTitle":"Great body, but needs better lenses to get great ...","reviewDate":"July 19, 2017","reviewText":"Great body, but needs better lenses to get great use out of it. Great basic set: just update the lenses."},{"reviewerName":"Roger A.","rating":"4.0 out of 5 stars","reviewTitle":"Good buy!","reviewDate":"December 25, 2018","reviewText":"Great camera for begginers like me, easy to start using, nice and intuitive connectivity to cellphone so you can share your photos quickly."},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Can I rate this more than 5 stars please :)","reviewDate":"December 30, 2016","reviewText":"I'm just starting into photography myself, and this fits the bill perfect. Its sturdy, very functional, and takes pictures with great clarity. Also it can wirelessly transfer pictures to my phone! Couldn't have picked a better starter camera."},{"reviewerName":"alih414","rating":"5.0 out of 5 stars","reviewTitle":"great quality","reviewDate":"April 24, 2019","reviewText":"LOVE my camera! I am a beginner and this is perfect! very easy to use and takes wonderful pictures!"},{"reviewerName":"Fleurette Soliven","rating":"5.0 out of 5 stars","reviewTitle":"Excellent beginner dslr","reviewDate":"January 13, 2019","reviewText":"not as many features as some of the more expensive models but photo quality really depends on the end user not the equipment"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"February 14, 2017","reviewText":"Best investment of all time!!!"},{"reviewerName":"JD","rating":"3.0 out of 5 stars","reviewTitle":"Be advised: No. Microphone. Jack.","reviewDate":"May 7, 2019","reviewText":"Bought this for my daughter to start her own Youtube channel. This camera has no jack to put an external microphone in. Really Canon? Not happy..."},{"reviewerName":"Elephagreen","rating":"5.0 out of 5 stars","reviewTitle":"This was given as a gift to my adult daughter ...","reviewDate":"February 11, 2017","reviewText":"This was given as a gift to my adult daughter. She's now taking a class to learn to use it to its fullest potential, but appreciates the quality and general ease of use."},{"reviewerName":"Kayla","rating":"5.0 out of 5 stars","reviewTitle":"Great camera!","reviewDate":"April 2, 2019","reviewText":"I’m new to the DSLR world, this camera is so user friendly. I didn’t have a hard time getting used to what button does what or how to transfer my pictures (being able to just send them to my phone is awesome!). It really came in handy during my Savannah trip 😍\n\nI’m already looking at new lenses to go with it 😅"},{"reviewerName":"Centaur","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"May 22, 2018","reviewText":"Camera kit has been perfect for my teenager learning to do professional photography."},{"reviewerName":"Dave Jay","rating":"5.0 out of 5 stars","reviewTitle":"Every Picture Tells A Story","reviewDate":"March 4, 2019","reviewText":"Nice buy for the price. Easier thank last camera (Nikon). Good interface with my laptop (Mac)"},{"reviewerName":"Armando S Vengoechea","rating":"5.0 out of 5 stars","reviewTitle":"Nice camera for the price","reviewDate":"October 19, 2017","reviewText":"Nice camera very nice quality images cool videos. perfect for the price"},{"reviewerName":"Sharon Joyce","rating":"4.0 out of 5 stars","reviewTitle":"Pretty solid beginners camera","reviewDate":"December 16, 2016","reviewText":"I received my camera yesterday and decided to take some photos today. I must say I am impressed… I have gotten some good pictures off of the stock pictures alone. It's easy to use and its exactly what I was looking for. I think the only downside I could think of is some of the pictures are kind of blurry. Other than that its a good, solid camera so far. Exactly what a beginner needs. I can't wait to get other lenses and try them out."},{"reviewerName":"James T. Urry","rating":"5.0 out of 5 stars","reviewTitle":"She takes amazing pictures with this","reviewDate":"December 7, 2017","reviewText":"My daughter loves this camera. She takes amazing pictures with this."},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Me encanta","reviewDate":"September 21, 2019","reviewText":"Ya no será solo para clases. También de hobbie!!!"},{"reviewerName":"David Lagomarsino","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"May 25, 2018","reviewText":"Great camera!"},{"reviewerName":"olson.thomas","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"April 24, 2018","reviewText":"great camera worth every dime"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Great!","reviewDate":"September 9, 2017","reviewText":"Great quality, really enjoy using it so far!"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Awesome","reviewDate":"March 16, 2019","reviewText":"You need this fantastic camera set"},{"reviewerName":"Jake L.","rating":"5.0 out of 5 stars","reviewTitle":"Great Beginner Camera","reviewDate":"March 24, 2019","reviewText":"I am a new photographer and I think this camera has everything you need to get started without spending a lot of money"},{"reviewerName":"DeAnna B.","rating":"5.0 out of 5 stars","reviewTitle":"I love this camera.","reviewDate":"March 16, 2018","reviewText":"I love this camera! The pictures it takes are so clear and amazing. Very simple to use and the telephoto lens is awesome. I would definitely buy again."},{"reviewerName":"Mike Smith","rating":"5.0 out of 5 stars","reviewTitle":"Great Starter Kit","reviewDate":"March 1, 2019","reviewText":"If someone is looking to get started with photography or wants to start up and learn this is an amazing product."},{"reviewerName":"Galen","rating":"5.0 out of 5 stars","reviewTitle":"Great amateur camera","reviewDate":"February 20, 2019","reviewText":"Great for amateurs! Easy to learn how to use it."},{"reviewerName":"Douglas S.","rating":"5.0 out of 5 stars","reviewTitle":"A useful, quality camera bundle","reviewDate":"August 31, 2017","reviewText":"Great camera, great price, great bundle. I couldn't be more happy with this purchase."},{"reviewerName":"Haley0584","rating":"5.0 out of 5 stars","reviewTitle":"Love it. I'm by no means a photographer","reviewDate":"January 10, 2017","reviewText":"Love it. I'm by no means a photographer, but wanted something for my upcoming birth/baby for the future. I would recommend photoshop and getting actions offline to help when you do not take the best pictures:)"},{"reviewerName":"Teresa P","rating":"5.0 out of 5 stars","reviewTitle":"The next step up from a flat easy digital camera","reviewDate":"February 16, 2018","reviewText":"Gave to my husband for christmas. The next step up from a flat easy digital camera. He has enjoyed it so far!"},{"reviewerName":"TreeHugger","rating":"5.0 out of 5 stars","reviewTitle":"Exactly as I had hoped","reviewDate":"January 5, 2017","reviewText":"The product met my expectations as a great beginner camera. I enjoy taking it out and the kids love it too."},{"reviewerName":"Imani F","rating":"5.0 out of 5 stars","reviewTitle":"great!","reviewDate":"September 28, 2017","reviewText":"yowzaa! what a great deal! i was surprised it actually arrived it was such a great deal... thank you!"},{"reviewerName":"Andrew McArthur","rating":"5.0 out of 5 stars","reviewTitle":"... for small projects and find it to be really useful. It has full manual functions which are great ...","reviewDate":"August 11, 2017","reviewText":"Got this as an extra camera for small projects and find it to be really useful. It has full manual functions which are great and it was a really low price. Love the wifi capability."},{"reviewerName":"Mimilee","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"October 11, 2017","reviewText":"Great camera, perfect pictures! They look professional. So many accessories to go with it! WORTH it!"},{"reviewerName":"Cold in albany","rating":"5.0 out of 5 stars","reviewTitle":"Excellent","reviewDate":"April 6, 2019","reviewText":"My daughter's first camera and she is taking amazing photos. For the price and a starter camera it cannot be beat."},{"reviewerName":"Than","rating":"4.0 out of 5 stars","reviewTitle":"Good camera","reviewDate":"August 17, 2019","reviewText":"Auto focus is sometime so slow but other than that, everything works well."},{"reviewerName":"Forenzikz","rating":"5.0 out of 5 stars","reviewTitle":"Easy to use and room to grow","reviewDate":"February 2, 2018","reviewText":"I bought this for my girlfriend who has always wanted a nice camera and it was definitely a great purchase. Takes great pictures on automatic and as we have started exploring the manual settings we have really started to see what this camera can do."},{"reviewerName":"John Edwards","rating":"5.0 out of 5 stars","reviewTitle":"What a deal","reviewDate":"December 28, 2016","reviewText":"Great Camera takes wonderful pics. What A deal\n@ that price great deal."},{"reviewerName":"Jaime B. Galvan-munoz","rating":"5.0 out of 5 stars","reviewTitle":"Great gift","reviewDate":"March 8, 2019","reviewText":"My wife loves it"},{"reviewerName":"Sloane","rating":"5.0 out of 5 stars","reviewTitle":"It’s overall great","reviewDate":"July 21, 2018","reviewText":"It is a wonderful camera. The instructions manual was a little intimidating, but I only had to use it very little and the times I used it, I had no trouble finding what I needed."},{"reviewerName":"Neil D","rating":"5.0 out of 5 stars","reviewTitle":"Highly recommend for starters into professional photography","reviewDate":"January 8, 2018","reviewText":"Greatly improved quality over previous model. Highly recommend for starters into professional photography."},{"reviewerName":"FRANK RODRIGO PACHECO CERDA","rating":"4.0 out of 5 stars","reviewTitle":"Buen precio","reviewDate":"January 12, 2019","reviewText":"Exelente precio"},{"reviewerName":"Wube Kumsa","rating":"5.0 out of 5 stars","reviewTitle":"Best camera.","reviewDate":"March 13, 2019","reviewText":"I liked it very much."},{"reviewerName":"James G. Anderson","rating":"5.0 out of 5 stars","reviewTitle":"A great Camera","reviewDate":"May 4, 2019","reviewText":"Takes great pictures."},{"reviewerName":"peggy campbell","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"February 14, 2018","reviewText":"Bought this as a gift for my daughter she loves it"},{"reviewerName":"Phoebe and Simon Grey","rating":"5.0 out of 5 stars","reviewTitle":"This is a very nice camera. Recommended for all photo hobbyists","reviewDate":"June 30, 2017","reviewText":"This is a very nice camera. Recommended for all photo hobbyists. Good lens options included. I added a 50 mm lens to the set for versatility."},{"reviewerName":"salisa whitley","rating":"5.0 out of 5 stars","reviewTitle":"It’s nice to use","reviewDate":"May 30, 2019","reviewText":"This is my first time ever using a Cameron Cameron I really like the camera because it has a wifi built in also I like it because I can pull all my photos up tomorrow phone for my business I am a hairstylist and I love this camera thanks Amazon"},{"reviewerName":"james e higgins","rating":"5.0 out of 5 stars","reviewTitle":"Digital SLR","reviewDate":"October 7, 2018","reviewText":"Great camera at a great price"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"great beginner camera","reviewDate":"January 18, 2018","reviewText":"great beginner camera. the autofocus is great. i dont know what else to say besides im happy with it. (photos were taken with 50mm lens)"},{"reviewerName":"Dale T.","rating":"5.0 out of 5 stars","reviewTitle":"This camera takes amazing pictures. The addition of the larger lens was ...","reviewDate":"January 17, 2017","reviewText":"This camera takes amazing pictures. The addition of the larger lens was a bonus. I'm sure this has way more features than we need but I'm hoping to learn more about it with time."},{"reviewerName":"Julie L. Smith","rating":"5.0 out of 5 stars","reviewTitle":"Nice camera. Great price","reviewDate":"June 4, 2019","reviewText":"Love this camera and its features. Well priced."},{"reviewerName":"ScooterK","rating":"5.0 out of 5 stars","reviewTitle":"Love it","reviewDate":"May 15, 2018","reviewText":"Love it. Fantastic pictures, great features, easy to use, great price"},{"reviewerName":"rachinee","rating":"5.0 out of 5 stars","reviewTitle":"First time buying a camera i love it","reviewDate":"March 10, 2018","reviewText":"Omg way more than i expected so happy it came before my brothers birthday going to take amazing pictures too happy"},{"reviewerName":"fiveifrenzy","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"January 25, 2018","reviewText":"Takes great pictures. Excellent cheap camera for a step up from point and shoot."},{"reviewerName":"ChunkyMonkey","rating":"5.0 out of 5 stars","reviewTitle":"I'm in love I wish it had touch and flip screen but ...","reviewDate":"December 27, 2016","reviewText":"It is everything I thought it would be !!!!\nI'm in love\n\nI wish it had touch and flip screen but I knew it didn't when I purchased it."},{"reviewerName":"dabo francis","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"August 6, 2018","reviewText":"nice product came locking good"},{"reviewerName":"THarrell","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"April 14, 2018","reviewText":"Great product for the price!"},{"reviewerName":"Tiger","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"December 31, 2017","reviewText":"Love this camera!!!’ Works well, good quality"},{"reviewerName":"Pugsly","rating":"5.0 out of 5 stars","reviewTitle":"Great camera at a great pricepoint.","reviewDate":"March 9, 2017","reviewText":"Bought this for my wife for Christmas and she really likes it."},{"reviewerName":"Buechernarr","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"April 22, 2017","reviewText":"Price was awesome. Now I can make videos with sound."},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"July 10, 2017","reviewText":"Excellent camera. I love it."},{"reviewerName":"Erika Garces","rating":"1.0 out of 5 stars","reviewTitle":"Just received the package. I only received one lens ...","reviewDate":"May 22, 2018","reviewText":"Just received the package. I only received one lens and the shoulder bag. THE CAMERA, battery pack, battery charger, neck strap, cable and the EF S 18-55 lens IS MISSING."},{"reviewerName":"Costumer","rating":"5.0 out of 5 stars","reviewTitle":"Raw files","reviewDate":"March 27, 2019","reviewText":"I like the way this camera works very easy for beginners just so you know the files the camera create will be raw and will need photo shop or light works to edit and view"},{"reviewerName":"Daniel Flerlage","rating":"3.0 out of 5 stars","reviewTitle":"Camera","reviewDate":"March 30, 2019","reviewText":"I love it. I'm having so much fun taking pics of wild life."},{"reviewerName":"Wendy Opperman-Shipman","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"March 16, 2018","reviewText":"Love it. Works great and is much lighter than my 20D."},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"September 19, 2017","reviewText":"Excellent starter Kit!"},{"reviewerName":"Jennifer","rating":"5.0 out of 5 stars","reviewTitle":"Highly Recommended!","reviewDate":"September 5, 2017","reviewText":"Perfect beginner camera! Just started up my own business and this has made things so easy! I love it!"},{"reviewerName":"Ashley","rating":"5.0 out of 5 stars","reviewTitle":"Love my new camera","reviewDate":"March 7, 2018","reviewText":"Love my new camera! I honestly am a newbie so learning as I go but it’s amazing so far."},{"reviewerName":"Einav","rating":"5.0 out of 5 stars","reviewTitle":"Great deal And perfect customer service!","reviewDate":"December 9, 2018","reviewText":"Great deal And perfect customer service!"},{"reviewerName":"Kentrella","rating":"5.0 out of 5 stars","reviewTitle":"OMG!!! This camera!","reviewDate":"April 30, 2019","reviewText":"I absolutely love my camera. I’ve never had one before but the quality of the pictures make me look like I’m a professional."},{"reviewerName":"Emanriquez","rating":"4.0 out of 5 stars","reviewTitle":"awesome quality","reviewDate":"February 25, 2019","reviewText":"As a beginning photographer, this was just what I was looking for. I like how the camera can be adjusted to give you the best picture quality recommended for the specific scenery."},{"reviewerName":"Lee Gray","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"August 14, 2018","reviewText":"Love it!!!!"},{"reviewerName":"Paulette A. Tubbs","rating":"5.0 out of 5 stars","reviewTitle":"CANON CAMERA BAG","reviewDate":"December 27, 2018","reviewText":"I brought this bag for my new Cannon Rebel. There is ample space to store camera and lenses. Good buy!"},{"reviewerName":"Joe","rating":"5.0 out of 5 stars","reviewTitle":"great camera","reviewDate":"January 11, 2017","reviewText":"Camera arrived on time and works great take stunning pictures"},{"reviewerName":"Abel","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"January 30, 2017","reviewText":"Great Camera with perfect adjustements!"},{"reviewerName":"Dominic cardozei","rating":"4.0 out of 5 stars","reviewTitle":"Four Stars","reviewDate":"February 9, 2018","reviewText":"Great camera"},{"reviewerName":"Kristen","rating":"5.0 out of 5 stars","reviewTitle":"Gift for my mom","reviewDate":"March 5, 2019","reviewText":"It was the perfect gift for my mom! She absolutely loves it!"},{"reviewerName":"Jack","rating":"5.0 out of 5 stars","reviewTitle":"H","reviewDate":"June 6, 2019","reviewText":"Look goods but I haven’t taste it you know not test I need how to see how bad it can kick 🦵"},{"reviewerName":"MJ Lane","rating":"5.0 out of 5 stars","reviewTitle":"Easy to use.","reviewDate":"June 24, 2019","reviewText":"Home use to capture my sheep. Works great. No problems figuring it out. Great for portrait shots of my sheep for registation. Clear photos from portrait to landscapes."},{"reviewerName":"GirlwithaView","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"September 28, 2017","reviewText":"Great camera. I love my zoom! Everything they said it would be."},{"reviewerName":"alton1906","rating":"5.0 out of 5 stars","reviewTitle":"If you are a beginner READ the manual","reviewDate":"December 29, 2018","reviewText":"Love the camera. It took a little bit to get use to the operation of the camera. No fault of the camera."},{"reviewerName":"DJ LOU","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"January 28, 2018","reviewText":"great camera."},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"money maker!!","reviewDate":"February 3, 2019","reviewText":"this is my life!!!!"},{"reviewerName":"Frank B Del Deo","rating":"4.0 out of 5 stars","reviewTitle":"The perfect gift","reviewDate":"December 25, 2018","reviewText":"My grand daughter was thrilled with the camera.it was a perfect choice."},{"reviewerName":"Colleen M.","rating":"5.0 out of 5 stars","reviewTitle":"Great","reviewDate":"June 26, 2019","reviewText":"Nice for beginners"},{"reviewerName":"HR","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"May 18, 2018","reviewText":"Great product. Very satisfied with it."},{"reviewerName":"Armando Carvallo","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"March 1, 2018","reviewText":"Excellent camera for my daughter"},{"reviewerName":"Gabriel Noronha","rating":"5.0 out of 5 stars","reviewTitle":"Great starter camera kit","reviewDate":"January 2, 2019","reviewText":"Only feature it doesn't have is HDR image creation, but you can do so through taking 3 photos at different exposure levels."},{"reviewerName":"Zac Mashaw","rating":"5.0 out of 5 stars","reviewTitle":"Great Camera, Low Price","reviewDate":"August 25, 2019","reviewText":"Love this camera, it is good especially for beginners."},{"reviewerName":"John Daniels","rating":"5.0 out of 5 stars","reviewTitle":"Takes really good Pictures","reviewDate":"July 15, 2019","reviewText":"took some adjusting to having to switch lens or to know what lens for what shot but I got it"},{"reviewerName":"Denis","rating":"1.0 out of 5 stars","reviewTitle":"No funciona!!","reviewDate":"August 30, 2019","reviewText":"No funciona!!! Camara dañada nu funciona el cambio de imajen parese usada!!!!"},{"reviewerName":"biswajit mishra","rating":"5.0 out of 5 stars","reviewTitle":"Satisfied","reviewDate":"December 30, 2016","reviewText":"Nice camera, great picture quality. If you know some basics of photography you can exploit more features out of it."},{"reviewerName":"Stacy S.","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"February 17, 2018","reviewText":"The perfect gift for y son for Christmas!"},{"reviewerName":"Jasmin","rating":"5.0 out of 5 stars","reviewTitle":"Fantastic Camera!","reviewDate":"April 9, 2017","reviewText":"Arrived right on time and in perfect shape. The camera takes wonderful photos especially if you know how to play with the settings. I am definitely in love with it and very well worth every dollar."},{"reviewerName":"Erica","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"November 4, 2017","reviewText":"I love my camera!"},{"reviewerName":"elton clarke","rating":"3.0 out of 5 stars","reviewTitle":"Three Stars","reviewDate":"February 28, 2018","reviewText":"No user manual included."},{"reviewerName":"Betsy G.","rating":"5.0 out of 5 stars","reviewTitle":"Love it: ) perfect for a beginner photographer","reviewDate":"January 3, 2018","reviewText":"Love it :) perfect for a beginner photographer"},{"reviewerName":"miles","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"March 1, 2018","reviewText":"Great starter camera. Great price point. I'm fully addicted to photography now. 10/5 would buy again"},{"reviewerName":"Arun","rating":"4.0 out of 5 stars","reviewTitle":"It is good, but having limitations of lower end camera","reviewDate":"February 10, 2018","reviewText":"It is good , but having limitations of lower end camera ,"},{"reviewerName":"Matilde","rating":"5.0 out of 5 stars","reviewTitle":"Excelente compra","reviewDate":"June 14, 2019","reviewText":"Excelente, llegó rapidísimo y en perfectas condiciones. Funciona todo perfecto, recomiendo. Muy contenta con la compra!!"},{"reviewerName":"Giselle B","rating":"5.0 out of 5 stars","reviewTitle":"Great","reviewDate":"April 20, 2019","reviewText":"It's just great for the price, I'm in love with it, I've been using it for 4 month and it's greeat"},{"reviewerName":"courtney","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"September 1, 2017","reviewText":"Great Camera and was just like described! Will buy from this seller again! It arrived earlier than I expected!"},{"reviewerName":"Yasin E.","rating":"5.0 out of 5 stars","reviewTitle":"My wife and I are very happy with the wi-fi function","reviewDate":"May 1, 2017","reviewText":"My wife and I are very happy with the wi-fi function. As far as I know, it's the only camera that has it within this price range."},{"reviewerName":"nicka","rating":"1.0 out of 5 stars","reviewTitle":"Battery does not charge. Knock off battery and charger!","reviewDate":"November 9, 2019","reviewText":"The charger kept on blinking and It took 4 days of blinking for it to charge 20% of it."},{"reviewerName":"janice Churchwell","rating":"5.0 out of 5 stars","reviewTitle":"Love it!","reviewDate":"May 9, 2017","reviewText":"I don't know how many cameras I looked at before deciding on this one. Many features...easy to use...nice clear pictures. The price was great, and came with two lenses. I am happy with my purchase."},{"reviewerName":"Samuel Jorgensen","rating":"4.0 out of 5 stars","reviewTitle":"Very easy to start taking pics using the automatic mode and ...","reviewDate":"January 31, 2018","reviewText":"Very easy to start taking pics using the automatic mode and nice large view screen on the back. Lots of manuals to read and peruse to get the most benefits of this package."},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"April 25, 2017","reviewText":"One of the best I've ever used."},{"reviewerName":"mbjones","rating":"5.0 out of 5 stars","reviewTitle":"Great Camera!","reviewDate":"October 16, 2019","reviewText":"I love everything about this camera! It takes great pictures and it is simple to use."},{"reviewerName":"Julie Truchot","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"February 20, 2018","reviewText":"It was given as a Christmas gift to my niece who loves it!"},{"reviewerName":"Alexis","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"April 12, 2018","reviewText":"Best camera!!!"},{"reviewerName":"Dennis Roach","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"July 18, 2017","reviewText":"Amazing Camera for the price. The package has all you need for an aspiring beginner in photography"},{"reviewerName":"robert david del porto","rating":"5.0 out of 5 stars","reviewTitle":"I wish the lcd screen was moveable","reviewDate":"December 15, 2018","reviewText":"Using this camera for night sky photos"},{"reviewerName":"omar williams","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"March 27, 2018","reviewText":"Great product"},{"reviewerName":"Gal Harari","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"July 27, 2017","reviewText":"great"},{"reviewerName":"Smitty Smith","rating":"5.0 out of 5 stars","reviewTitle":"Great camera for the price","reviewDate":"February 9, 2017","reviewText":"As advertised! Great camera for the price."},{"reviewerName":"Ken Young","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"January 30, 2018","reviewText":"So far this camera has exceeded my expectations, haven’t found any problems, takes incredible pictures!!"},{"reviewerName":"Wendall Martin","rating":"4.0 out of 5 stars","reviewTitle":"Four Stars","reviewDate":"July 31, 2017","reviewText":"Works great for an entry level SLR"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Nice camera","reviewDate":"December 26, 2018","reviewText":"Good camera for the beginner like me."},{"reviewerName":"Allen","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"July 17, 2017","reviewText":"Great Camera!"},{"reviewerName":"Benjamin Gonzalez","rating":"5.0 out of 5 stars","reviewTitle":"Great Refurbished Model!","reviewDate":"February 15, 2018","reviewText":"For being a refurbished camera it was really good on quality. Still working great after 4 months!"},{"reviewerName":"Carmela Abajian","rating":"5.0 out of 5 stars","reviewTitle":"Canon EO6 REBEL T6","reviewDate":"June 30, 2017","reviewText":"Camera came in time for us to present it as a gift. Camera and all attachments made for a great combo."},{"reviewerName":"Dennis Brandao","rating":"4.0 out of 5 stars","reviewTitle":"Great Camera","reviewDate":"March 15, 2019","reviewText":"Great camera. I'm a beginner so it fits me perfect."},{"reviewerName":"Susana Kyle","rating":"5.0 out of 5 stars","reviewTitle":"I just love my Rebel T6 !","reviewDate":"June 3, 2016","reviewText":"I just love my camera ! My husband has this expensive complicated camera that I don't understand, this is why I bought the Canon EOS Rebel T6 ! I wanted something that would take excellent pictures & was easy to understand. The manual is easy to understand and the pictures I took are fabulous ! I am hooked ! Will probably by more lenses now !"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Nice Cam","reviewDate":"July 5, 2019","reviewText":"Nice Cam recommended for beginners"},{"reviewerName":"Randy Osman","rating":"5.0 out of 5 stars","reviewTitle":"Camera works great. Still working on getting upgrades (tripod","reviewDate":"March 27, 2017","reviewText":"Camera works great. Still working on getting upgrades (tripod, extra battery and large lens)"},{"reviewerName":"Kindle Customer","rating":"5.0 out of 5 stars","reviewTitle":"Outstanding value.","reviewDate":"July 30, 2016","reviewText":"Outstanding value. Easy to use. Great photos. Would recommend to any aspiring, relative newcomer."},{"reviewerName":"María José","rating":"5.0 out of 5 stars","reviewTitle":"Excelentisimo","reviewDate":"February 27, 2019","reviewText":"Excelente producto"},{"reviewerName":"kenneth anderson","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"February 1, 2017","reviewText":"Great camera"},{"reviewerName":"V. Marcano","rating":"5.0 out of 5 stars","reviewTitle":"Great","reviewDate":"December 29, 2016","reviewText":"Great Entry Level SLR"},{"reviewerName":"Travis F.","rating":"5.0 out of 5 stars","reviewTitle":"It takes great photos for what I use it for","reviewDate":"February 2, 2017","reviewText":"I bought this camera knowing it is an entry level camera. I was tired of the photo quality I was getting off of my Galaxy S5 and this camera went on sale on Black Friday for $450 with an additional lens bundle. It takes great photos for what I use it for. I use it to take photos outside and it does a great job even on just automatic settings. I have still not had the time to sit and read through the instruction manual and watch videos online. I can only imagine what it is capable of once I learn all the ins and outs of the manual settings."},{"reviewerName":"Tom Ferriss","rating":"5.0 out of 5 stars","reviewTitle":"The camera just feels like it belongs in my hand !!!","reviewDate":"August 12, 2019","reviewText":"Some of the menu's can be a bit confusing."},{"reviewerName":"Rob Baxter","rating":"5.0 out of 5 stars","reviewTitle":"YOU NEED TO BUY ONE","reviewDate":"August 7, 2016","reviewText":"AMAZING CAMERA! The quality of the images it takes are absolutely breath taking and on par with higher end 1,000+ dslr's. Extremely pleased with my purchase"},{"reviewerName":"Happy life","rating":"5.0 out of 5 stars","reviewTitle":"This is perfect for my daughters first camera","reviewDate":"September 19, 2017","reviewText":"This is perfect for my daughters first camera, she has been using it and love it. It is so easy to transfer photos."},{"reviewerName":"Shawnm","rating":"5.0 out of 5 stars","reviewTitle":"I really like the video and WiFi","reviewDate":"February 4, 2017","reviewText":"Lots of features. I really like the video and WiFi. Still learning it, but so far, so good."},{"reviewerName":"Norma Reyes","rating":"5.0 out of 5 stars","reviewTitle":"Great!!","reviewDate":"December 31, 2018","reviewText":"Best camera"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"I love it. It's simple to use and takes beautiful ...","reviewDate":"February 19, 2018","reviewText":"I love it. It's simple to use and takes beautiful pictures."},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Love this camera","reviewDate":"May 12, 2018","reviewText":"Perfecto!!!"},{"reviewerName":"Alberto De Leon","rating":"2.0 out of 5 stars","reviewTitle":"It was not what I expected","reviewDate":"May 31, 2019","reviewText":"It was not what I expected"},{"reviewerName":"Maria A Rojas Botero","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"July 18, 2018","reviewText":"Love my camera!!!"},{"reviewerName":"L. Cote","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"January 13, 2017","reviewText":"Nice camera!!"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"I love this.","reviewDate":"March 7, 2018","reviewText":"Very lovely photos. I love this."},{"reviewerName":"alexx","rating":"5.0 out of 5 stars","reviewTitle":"Love this camera it's awesome for a beginner like myself","reviewDate":"October 9, 2016","reviewText":"Love this camera it's awesome for a beginner like myself. Here are a couple of pics I've taken so far. '"},{"reviewerName":"Tae","rating":"5.0 out of 5 stars","reviewTitle":"Good Condition.","reviewDate":"February 27, 2018","reviewText":"No Complaints. Good Condition."},{"reviewerName":"Angela Z.","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"January 3, 2017","reviewText":"Received as expected"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"September 23, 2017","reviewText":"good"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"January 18, 2018","reviewText":"Very good camera, at the best price anywhere..."},{"reviewerName":"Rosalynn Helmuth","rating":"5.0 out of 5 stars","reviewTitle":"Absolutely love it! I can easily hook up to wifi ...","reviewDate":"December 26, 2016","reviewText":"Absolutely love it! I can easily hook up to wifi and share my photos to my phone and my computer."},{"reviewerName":"Brittney Lackey","rating":"5.0 out of 5 stars","reviewTitle":"Love it!","reviewDate":"September 26, 2017","reviewText":"I’m definitely no expert! This is my first “adult” camera. I just got it today and have been playing around with pictures at my home. It is super easy to use! Each setting tells you (on screen) what it should be used for. I absolutely love it and can’t wait to see what kind of beautiful moments I can capture with this!"},{"reviewerName":"Janei L","rating":"5.0 out of 5 stars","reviewTitle":"Great!","reviewDate":"May 31, 2017","reviewText":"Love this camera so much"},{"reviewerName":"Erin Rogers","rating":"5.0 out of 5 stars","reviewTitle":"Very easy to use for a beginner!","reviewDate":"August 1, 2016","reviewText":"This is my first time purchasing a \"real\" camera. I have been very pleased so far and I am learning something new each time I use it. There are some very helpful guides and communities online to give you a crash course in shooting in manual. It takes great pictures in the auto setting. But I seem to get much more enjoyment out of taking pictures in manual and playing with the settings!"},{"reviewerName":"EllaBrown","rating":"5.0 out of 5 stars","reviewTitle":"Love this camera","reviewDate":"January 6, 2018","reviewText":"It a very go camera over all very easy to use too"},{"reviewerName":"Marina","rating":"3.0 out of 5 stars","reviewTitle":"Colors not accurate","reviewDate":"February 5, 2017","reviewText":"I had to return it. Bought to replace my old Nikon D3100, but it wasn't even close in quality. The colors were not accurate, too much red, and contrast too high. It does take beautiful pictures of nature though - makes it look even better than reality. But I needed a camera for product photography, and had to get precise colors and contrast. I bought Nikon D5200 instead, and very happy with it so far."},{"reviewerName":"roberttheb","rating":"4.0 out of 5 stars","reviewTitle":"Still reading up on the operations","reviewDate":"December 28, 2016","reviewText":"Still reading the manual and getting acquainted with it. Would have liked to have had at least a minimum card to learn to shoot with, but no big deal, I have others. Lots of information, very small book with very small print. It's going to take a while or I'm going to find a class.\nReferred this camera to a 20 year pro. she gave it excellent ratings/"},{"reviewerName":"Joseph K Cho","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"January 7, 2017","reviewText":"wonderful product"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Great beginner camera","reviewDate":"February 6, 2017","reviewText":"I got this for my son for Christmas and he loves it. Great beginner camera."},{"reviewerName":"Sonya Wilkins","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"November 20, 2017","reviewText":"I will really love it when I learn everything about it"},{"reviewerName":"migue1107","rating":"4.0 out of 5 stars","reviewTitle":"All fine","reviewDate":"July 4, 2018","reviewText":"All perfect ..."},{"reviewerName":"Valerie","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"January 12, 2018","reviewText":"Great beginners camera for the price!"},{"reviewerName":"Amanda","rating":"4.0 out of 5 stars","reviewTitle":"Four Stars","reviewDate":"January 28, 2018","reviewText":"Great camera at an amazing value."},{"reviewerName":"Stephen Aguey","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"March 2, 2018","reviewText":"Good nice camera for beginners."},{"reviewerName":"Kim Ledger","rating":"5.0 out of 5 stars","reviewTitle":"Love it","reviewDate":"January 1, 2017","reviewText":"My daughter absolutely loves this camera! Good starter one for just getting into photography! !!"},{"reviewerName":"Anickels","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"August 2, 2017","reviewText":"Easy to use, takes great pictures"},{"reviewerName":"Benjamin Jenkins","rating":"5.0 out of 5 stars","reviewTitle":"Great Beginner Camera!","reviewDate":"January 11, 2018","reviewText":"My fiancé loves it! I bought it for her as a Christmas gift. She especially liked the two lenses. Neither of us are camera experts by any means, but we were able to set it up and take very decent pictures. We even messed around with the settings and took great low light pictures of the moon and other objects at sunset. I can’t speak to the technical side of this camera, but for a novice who is wanting to get into photography I think this is a great beginner camera. I will update after 6-8 months with a better review"},{"reviewerName":"Kim","rating":"5.0 out of 5 stars","reviewTitle":"Highly recommend!!!","reviewDate":"September 28, 2017","reviewText":"Very crisp picture and for being a beginner in photography this is a very simple camera to learn and understand. I have yet to venture into getting more lenses, but the one that comes with this is great and was used for a D.C. trip and to practice pet photography. Highly recommend. My only issue was the intial battery charger that came with, but Canon was quick to replace at no charge to me through their warranty"},{"reviewerName":"TJ","rating":"5.0 out of 5 stars","reviewTitle":"What a wonderful camera and very user friendly","reviewDate":"July 2, 2017","reviewText":"What a wonderful camera and very user friendly! I also found YouTube video tutorials on this model which helped me further my understanding of all the great features it possesses."},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"September 6, 2017","reviewText":"The best camera I have purchased so far."},{"reviewerName":"J Hicks","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"January 23, 2017","reviewText":"outstanding product"},{"reviewerName":"A.lehr","rating":"3.0 out of 5 stars","reviewTitle":"The camera is amazing. However if you are going to get one","reviewDate":"July 30, 2017","reviewText":"The camera is amazing. However if you are going to get one. Buy new. I got this one and I loved it until I looked at the lens I was sent and saw scratches."},{"reviewerName":"joanna garcia","rating":"5.0 out of 5 stars","reviewTitle":"I'm very pleased on how fast I received this","reviewDate":"December 25, 2016","reviewText":"I'm very pleased on how fast I received this , still learning how to use my camera so far very happy thanks"},{"reviewerName":"Justin M.","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"December 28, 2016","reviewText":"SUPER FAST SHIPPING. AS EXPECTED, EXCEPTIONAL CANNON QUALITY."},{"reviewerName":"The colombian","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"December 30, 2016","reviewText":"Great camera for beginners!!! And budget friendly"},{"reviewerName":"Debi Buck","rating":"5.0 out of 5 stars","reviewTitle":"I love this camera!","reviewDate":"May 3, 2017","reviewText":"This was my first DSLR camera, and it is everything I wanted and then some. I bought it to take pictures on a trip to Europe, and it really delivered. Easy to use right out of the box for a novice like me, but it has plenty of bells & whistles to keep me learning new ways to shoot."},{"reviewerName":"Joselyn P.","rating":"2.0 out of 5 stars","reviewTitle":"less than ok.","reviewDate":"May 29, 2018","reviewText":"The camera was fine but the lens made a loud and unpleasant sound when try to focus. I had a kit lens before and it didn't made that sound.\nI wouldn't recommend this kit."},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"December 31, 2016","reviewText":"Takes wonderful pictures both up close and far away!\nBest one I have ever bought !!"},{"reviewerName":"Gaurav Pandey","rating":"5.0 out of 5 stars","reviewTitle":"working great..","reviewDate":"December 25, 2016","reviewText":"As expected... working great... value for money"},{"reviewerName":"beccy chapman","rating":"4.0 out of 5 stars","reviewTitle":"Four Stars","reviewDate":"September 25, 2017","reviewText":"Great camera, easy to use"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Best Camera I Ever Bought","reviewDate":"December 27, 2016","reviewText":"I love it. It works super. Its easy to use. The first time I printed pictures that I took with it I had to sign that I was the photographer. They looked to professional to the clerk. I'd definitely recommended it to anyone looking for a camera that takes great pictures. I admit I stalled a little at the price but after seeing how good it takes pictures I don't regret buying it."},{"reviewerName":"Charles Holden","rating":"4.0 out of 5 stars","reviewTitle":"Four Stars","reviewDate":"October 6, 2017","reviewText":"Very nice camera."},{"reviewerName":"Ratnesh","rating":"5.0 out of 5 stars","reviewTitle":"Order now..!!","reviewDate":"December 25, 2016","reviewText":"Get it and feel it..!! You wont get disappointed.."},{"reviewerName":"Liza","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"January 6, 2017","reviewText":"Great camera!"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"January 14, 2017","reviewText":"Very Good!"},{"reviewerName":"jamspen","rating":"5.0 out of 5 stars","reviewTitle":"Loved the camera but open to late to make a ...","reviewDate":"April 21, 2017","reviewText":"Loved the camera but open to late to make a claim CAUSE I JUST OPENED IT AND I DID NOT GET THE BATTERY THAT WAS SUPPOSE TO GET WITH IT..."},{"reviewerName":"James Quayle","rating":"5.0 out of 5 stars","reviewTitle":"The range of the lens was terrific.","reviewDate":"October 9, 2016","reviewText":"This camera exceeded my expectations. The camera had many features I was looking for. The range of the lens was terrific."},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"June 6, 2017","reviewText":"Great experience"},{"reviewerName":"Medy","rating":"5.0 out of 5 stars","reviewTitle":"Love this camera","reviewDate":"January 1, 2017","reviewText":"Exactly what I wanted. Love this camera"},{"reviewerName":"Vikkie","rating":"4.0 out of 5 stars","reviewTitle":"I love this camera","reviewDate":"April 28, 2017","reviewText":"I love this camera, the photo and video quality is amazing. My only issue is linking the camera to a display when filming, I downloaded all the apps recommended but I still can't see as i film, maybe I'm missing something."},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Pretty good","reviewDate":"December 28, 2016","reviewText":"Worth the money!"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Perfect","reviewDate":"December 27, 2016","reviewText":"Good product, awesome"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"December 31, 2016","reviewText":"I love this camera"},{"reviewerName":"Arnold","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"December 26, 2016","reviewText":"👍"},{"reviewerName":"ashleigh a.","rating":"5.0 out of 5 stars","reviewTitle":"Amazing camera!","reviewDate":"December 1, 2016","reviewText":"Amazing camera!! I sold my Nikon to purchase this one after my mom got this one and I had a chance to play around it and fell in love."},{"reviewerName":"NotTooMeanSheen","rating":"4.0 out of 5 stars","reviewTitle":"Finally taking the pics I want","reviewDate":"January 1, 2017","reviewText":"I love this camera, but the kit lenses have some limitations, so I replaced with a f1.8/50mm for everyday shooting and I'm fairly happy now. Still a beginner so trying to overcome some frustrations in landscape photography, which is my true love, but this will likely get me there as I learn more. Gave a lower review because I got gipped buying this kit over the kits that are more all-inclusive."},{"reviewerName":"Amazon Customer","rating":"4.0 out of 5 stars","reviewTitle":"This is not a camera for families.","reviewDate":"July 10, 2018","reviewText":"This is not a camera for families. If you’re tryna take a picture of your kid and they won’t stay still (every kid), good luck. Your pictures will always be blurry. It is easy to use which is a pro."},{"reviewerName":"Claudia J. Hinson","rating":"5.0 out of 5 stars","reviewTitle":"It was a gift for my grandson, and he ...","reviewDate":"June 8, 2016","reviewText":"It was a gift for my grandson, and he says he loves it. He sent pictures from a Memorial Day camping trip\nin the mountains, and the mountain ranges in the background were well defined and the boys in the foreground\nwere very clear."},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"December 25, 2016","reviewText":"Very grateful"},{"reviewerName":"Whitney Miller","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"May 25, 2017","reviewText":"LOVE LOVE LOVE this camera. Great value. First time \"fancy camera\" user/purchaser"},{"reviewerName":"Tom in Mo","rating":"3.0 out of 5 stars","reviewTitle":"but it would be nice for it to take a shot before the bird ...","reviewDate":"January 2, 2017","reviewText":"Maybe it's a learning curve, but it takes too long to finally focus and shoot even in daylight and general scenery. Put it manual mode and play with the focus ring, you can shoot faster. The manual doesn't explain terms. I know it's not a point and shoot, but it would be nice for it to take a shot before the bird leaves the feeder (example)."},{"reviewerName":"Amazon Customer","rating":"4.0 out of 5 stars","reviewTitle":"FREE not so FREE.","reviewDate":"December 5, 2017","reviewText":"I am quite pleased so far with the camera and lenses. I jumped at the chance to save a bit more during the Black Friday promotion so the advertised price was very good and I really liked the idea of getting a FREE SanDisk 16GB SD card bundled with the deal. The only problem with the result was that I was charged $9.77 + tax .64=$10.41 for the FREE SD card. Still got a great deal but a bit miffed about the sleight of hand."},{"reviewerName":"Customer","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"January 19, 2017","reviewText":"super quality, easy to carry, si not heavy at all, best of all that worth the price"},{"reviewerName":"Michel Mowery","rating":"5.0 out of 5 stars","reviewTitle":"Impressive","reviewDate":"July 30, 2016","reviewText":"This camera is the nicest one I have owned and everything I could ever want as a novice. Ease of use and quality of photos are superb."},{"reviewerName":"CiscoZon","rating":"5.0 out of 5 stars","reviewTitle":"Great value","reviewDate":"February 2, 2017","reviewText":"Cannon makes great cameras. Upgrading the wife from her Rebel T3. She loves it and especially loves the WiFi option for downloading the photos . The additional photo lense works perfectly and takes great photos!"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Incredible Purchase","reviewDate":"January 6, 2017","reviewText":"Purchased it as a replacement for my 5 year old Canon T3. Incredible difference between them. Downloaded the App on my iPhone and noticed that to take pictures with the phone is not very useful, but it is nice to be able to access the photos right away and share with friends via WhatsApp for example and not waste time attaching on emails. A really nice upgrade, very happy with my xmas gift."},{"reviewerName":"James M","rating":"5.0 out of 5 stars","reviewTitle":"I'm Very Happpy With It.","reviewDate":"January 17, 2017","reviewText":"Well after purchasing this canon eos rebel t6 camera kit i will say it is a very good camera. Well to be honest im not a professional photographer im just a regular guy a beginner no experience so i just bought this camera a month ago and well its my very first camera to buy this i wanted to take unique pictures and pictures of everything and including family to. So yeah when it arrive on the first day i open the box read the manual and follow the instruction but some of the parts of it are easy that i understand i kinda learn already and how to use it but there some parts i don't know so probably going to understand it in the coming months im still inexperience but i know and how do it at least. I took some pictures and it came out great and wonderful to think realistic picture and just wow very nice i took. Its been one month since i been using it and just wow the difference between pictures plus i switch the lenses to take far away picture very happy with it. Also i sometimes do half like auto mode to automatically take pictures and manual. So yeah Great Canon EOS Rebel T6 Camera Kit very happy with my purchase."},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Love it! I haven't had a chance to use ...","reviewDate":"February 23, 2017","reviewText":"Love it! I haven't had a chance to use it very much, but it's been nice upgrade from my Sony A200"},{"reviewerName":"CH","rating":"5.0 out of 5 stars","reviewTitle":"Great camera","reviewDate":"March 4, 2018","reviewText":"Great camera to replace my 10 year old Canon Powershot. Easy to use and take great photos. And of course it was a good price."},{"reviewerName":"C. Fisher","rating":"5.0 out of 5 stars","reviewTitle":"A good intermediate camera.","reviewDate":"December 6, 2016","reviewText":"I bought this camera to replace my Canon Rebel T2i that was water damaged irreparably. When choosing this model, I preferred the options of the T6 over the more expensive T6i. For example, I do not need stabilization because any lenses I have which may require it (mainly telephoto) incorporate that feature. I recommend any buyer carefully decide what features they'll actually use (not just what sounds good) before choosing between this model and the T6i. You may save yourself some money, and still get a good camera. Also, for anyone who may need it, this model is very good in low light. If you shoot natural light photos (no flashes here, I shoot insects and arachnids) you'll have more color range in lower light settings."},{"reviewerName":"Heydee Martinez Serra","rating":"5.0 out of 5 stars","reviewTitle":"I love it. Shipping very fast","reviewDate":"January 10, 2017","reviewText":"I love it. Shipping very fast. The camera is very simple to people like me that only wants a good camera with a good quality photos. This camera will be my new best friend for my travels."},{"reviewerName":"Tom","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"October 20, 2017","reviewText":"Friends are commenting on the clarity of detail captured. Only wish the telephoto lens had image stabilization."},{"reviewerName":"Kindle Customer","rating":"5.0 out of 5 stars","reviewTitle":"remote control","reviewDate":"May 2, 2017","reviewText":"It works great for the application we needed, the eos utility was handy in allowing us to take remote snapshots from while uploading them directly to the computer."},{"reviewerName":"Foto friendly","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"September 3, 2016","reviewText":"Love this camera."},{"reviewerName":"DD","rating":"5.0 out of 5 stars","reviewTitle":"Can't wait to tackle this awesome camera set-up","reviewDate":"December 10, 2017","reviewText":"Can't wait to tackle this awesome camera set-up. The package deal with Black Friday pricing was to good to pass up."},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"August 21, 2016","reviewText":"Great camera performs well for general photography. Should meet most of the needs of any novelist."},{"reviewerName":"Mr Mike","rating":"5.0 out of 5 stars","reviewTitle":"The camera and lenses are perfect. The hard part is learning all the bells ...","reviewDate":"January 27, 2017","reviewText":"The camera and lenses are perfect. The hard part is learning all the bells and whistles. I am working on it."},{"reviewerName":"Amira","rating":"5.0 out of 5 stars","reviewTitle":"Amazing purchase","reviewDate":"February 28, 2017","reviewText":"Perfect item!!"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"January 9, 2018","reviewText":"Great product, I would buy again"},{"reviewerName":"Heidi Cookson","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"February 24, 2017","reviewText":"Great Value"},{"reviewerName":"Lawrence C.","rating":"5.0 out of 5 stars","reviewTitle":"very pleased with camera","reviewDate":"August 14, 2017","reviewText":"excellent price and product"},{"reviewerName":"Bella boo","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"May 22, 2017","reviewText":"Love my new camera. It is a birthday and mother's day gift. Still learning how to use it."},{"reviewerName":"Prof. Dr. Lorin L Cranford","rating":"4.0 out of 5 stars","reviewTitle":"Four Stars","reviewDate":"July 28, 2017","reviewText":"generally works okay"},{"reviewerName":"Rob Wilhite","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"November 27, 2017","reviewText":"I absolutely love this camera! It takes great pictures and is very user friendly."},{"reviewerName":"virji1988","rating":"5.0 out of 5 stars","reviewTitle":"Great camera","reviewDate":"August 7, 2017","reviewText":"Great camera"},{"reviewerName":"Constance S.","rating":"5.0 out of 5 stars","reviewTitle":"I love it. Has very high","reviewDate":"December 15, 2016","reviewText":"I love it.Has very high quilty"},{"reviewerName":"Terry & Teresa Jones","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"July 6, 2017","reviewText":"love it"},{"reviewerName":"Mike","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"August 11, 2017","reviewText":"Works awesome. Very happy with the set."},{"reviewerName":"Steve Krum","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"December 13, 2016","reviewText":"Great camera"},{"reviewerName":"Czechchickie","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"December 21, 2016","reviewText":"Excellent camera, received 1 day earlier than expected!"},{"reviewerName":"Pedro Rabinovich","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"August 13, 2017","reviewText":"Excellent price vs perfomance relationship."},{"reviewerName":"Otis Freison","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"February 13, 2017","reviewText":"Loving it and great price too..."},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"November 6, 2017","reviewText":"perfect camera for the newbie! I have enjoyed taking pictures since day one!"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Really nice camera. I cannot give a very detailed review ...","reviewDate":"January 1, 2017","reviewText":"Really nice camera. I cannot give a very detailed review since this is my first camera, but the price-quality was excellent in my opinion"},{"reviewerName":"Matthew","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"January 4, 2018","reviewText":"Amazing my wife loves it"},{"reviewerName":"maydelin ramos","rating":"2.0 out of 5 stars","reviewTitle":"Unsatisfied.","reviewDate":"July 10, 2018","reviewText":"I bought this camera for my first trip , I was excited about it since it’s my first camera , such a disappointment to find out my camera was not taking pictures. The screen would go black and I couldn’t preview any pictures , I invested on a new battery and memory card and it still didn’t seem to work, such a disappointment."},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"my new baby","reviewDate":"January 1, 2017","reviewText":"100 % love my camera! especially the wifi function, that you can see what the camera sees on your screen, and that you can basically control EVERYTHING from your phone when it comes to taking photos. also that you can view all the pics on the camera on your phone, and download the ones you want to then upload on social media. its just fantastic. and the long lens that comes with the kit is amazing as well, I'm really glad i chose to take the one with it."},{"reviewerName":"M. Chambers","rating":"5.0 out of 5 stars","reviewTitle":"She loves the modern tech features like being able to connect it WIFI to her phone ...","reviewDate":"January 21, 2017","reviewText":"Bought for my daughter for Christmas. She loves the modern tech features like being able to connect it WIFI to her phone and quickly move pics to her phone and edit them. My wife has an older model and I'm afraid I'm going to have to buy her one of these now. Great product"},{"reviewerName":"fRANK jAHRLING","rating":"3.0 out of 5 stars","reviewTitle":"Basic Canon","reviewDate":"January 19, 2017","reviewText":"The Rebel 6 replaced my Rebel 1. It's basically the same thing, with upgrades. I don't notice any changes in performance, though. Generally reliable and easy to use. Lighter."},{"reviewerName":"Elias T.","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"May 14, 2017","reviewText":"Awesome Camera"},{"reviewerName":"John","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"August 5, 2017","reviewText":"Excellent package for family vacations and events! Easy to use!"},{"reviewerName":"Dee","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"December 27, 2016","reviewText":"Arrived timely and perfect as expected"},{"reviewerName":"Kindle Customer","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"September 20, 2017","reviewText":"Works great and takes very good pics!"},{"reviewerName":"Shaina Richards","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"March 15, 2018","reviewText":"Wonderful camera! Easy to use and range of options for transferring images"},{"reviewerName":"george","rating":"4.0 out of 5 stars","reviewTitle":"george","reviewDate":"November 17, 2016","reviewText":"great camera kit. price is very good"},{"reviewerName":"@RyanMoore","rating":"2.0 out of 5 stars","reviewTitle":"Not Great For Beginners","reviewDate":"January 31, 2018","reviewText":"Not great for beginners and not really any better than my iPhone. My interest is using it in full auto mode.\n\nMy issues:\n\n• The autofocus doesn't work well half the time.\n• The flash is terrible - to me if you can tell a flash was used it's not natural and looks bad.\n• The Close-Up mode does not work well - it often won't focus and sometimes won't take the picture at all.\n• If you are alone and need to take a selfie with the self-timer it's very difficult to get it to focus on the spot where you will be standing."},{"reviewerName":"Charles McLendon","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"March 27, 2017","reviewText":"Awesome product and value!"},{"reviewerName":"Roberta","rating":"4.0 out of 5 stars","reviewTitle":"Four Stars","reviewDate":"August 29, 2016","reviewText":"nice works fantastic"},{"reviewerName":"Ale Borba","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"December 27, 2016","reviewText":"Excellent cost benefit. If you wanna start in to the DSLR world, this is a good choice."},{"reviewerName":"Brian Whited","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"July 24, 2017","reviewText":"great product!"},{"reviewerName":"Tariq","rating":"5.0 out of 5 stars","reviewTitle":"Amazing Product!!!!!!!!","reviewDate":"May 25, 2016","reviewText":"This DSLR Camera is amazing. I loved it. When I took the pictures from it people asked me what Camera I used. I would highly recommend this camera to buy."},{"reviewerName":"Friedrich W. Holczer","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"October 7, 2017","reviewText":"OK"},{"reviewerName":"Alice Eastman","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"March 6, 2017","reviewText":"I love this camera"},{"reviewerName":"Jae","rating":"3.0 out of 5 stars","reviewTitle":"You guys sold me a camera that works fine but the lens are foggy/blurry and idk how to ...","reviewDate":"February 20, 2018","reviewText":"You guys sold me a camera that works fine but the lens are foggy/blurry and idk how to fix it"},{"reviewerName":"P. A. Hughes","rating":"5.0 out of 5 stars","reviewTitle":"I really like this camera very easy to use and takes great ...","reviewDate":"October 29, 2016","reviewText":"I really like this camera very easy to use and takes great pictures. Came in mint condition. I took this to NY a few days after I bought it and to the ocean here in CA. SSo nice and not heavy to carry around. Super fast shipping. Thank you"},{"reviewerName":"Tim MAimone","rating":"5.0 out of 5 stars","reviewTitle":"Great for starting out photographers that want a point and ...","reviewDate":"August 23, 2016","reviewText":"Great for starting out photographers that want a point and shoot option when unsure but can still operate the professional features a DLSR is meant for!"},{"reviewerName":"Karen L. Atlanta,Ga.","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"June 7, 2017","reviewText":"Very satisfied with my camera!!"},{"reviewerName":"oladepo olakunle","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"November 25, 2017","reviewText":"I have been using this camera for months and it's picture quality is superb"},{"reviewerName":"mamo28","rating":"5.0 out of 5 stars","reviewTitle":"Love my new camera!","reviewDate":"August 19, 2017","reviewText":"Shipment was on time, everything great quality, love my new camera!"},{"reviewerName":"Amanda Messina","rating":"5.0 out of 5 stars","reviewTitle":"Fabulous DSLR for beginner and advanced photographers at a great price.","reviewDate":"September 18, 2016","reviewText":"This is my third Canon Rebel camera and I have loved all of them. This camera can be as simple or advanced as you'd like. My old one was still taking great pictures but this has the added bonus of wireless connectivity, which I love. The price is just about perfect. It's worth every Penney because the picture quality far surpasses that of the phone. When you want to take some really special quality pictures to preserve one of those important life moments, you'll be so glad you bought this. You can change and upgrade lenses, a thoroughly addicting hobby.\n\nMy daughter has the more expensive and more heavy Canon 5d. That camera is a definite upgrade and she loves it, but at thousands of dollars, it's too much camera for me. I mostly use the auto function and the results are awesome. My daughter, on the other hand, is a photography and camera expert. She uses all the manual adjustments and knows everything there is to know about exposure and all that. Even she says this is a fabulous camera. There are plenty of fun tools as well!"},{"reviewerName":"Hayley Oliveira","rating":"4.0 out of 5 stars","reviewTitle":"User friendly!","reviewDate":"October 10, 2016","reviewText":"Love this camera. Easy to use and for my first expense camera, I can't find anything to complain about! Love the wifi connection!"},{"reviewerName":"Dilsat Uyguroglu","rating":"5.0 out of 5 stars","reviewTitle":"perfect","reviewDate":"May 24, 2017","reviewText":"perfect, i forgot remote connection kit to Dslr;-)"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"December 15, 2016","reviewText":"Great quality"},{"reviewerName":"Amazon Customer","rating":"4.0 out of 5 stars","reviewTitle":"Four Stars","reviewDate":"December 28, 2016","reviewText":"The Canon is everything we expected including good value."},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"December 18, 2016","reviewText":"excellent service.Good product.Recommend for you."},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"I am starting with photography and this camera is perfect for beginners Excellent pictures and very easy to use","reviewDate":"June 16, 2016","reviewText":"I am starting with photography and this camera is perfect for beginners\nExcellent pictures and very easy to use"},{"reviewerName":"kishan patel","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"December 26, 2016","reviewText":"very very good"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"March 15, 2017","reviewText":"Excellent"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"May 16, 2016","reviewText":"Fantastic buy ."},{"reviewerName":"william grady","rating":"4.0 out of 5 stars","reviewTitle":"Was a great kit, still haven't used everything","reviewDate":"February 21, 2017","reviewText":"Was a great kit,still haven't used everything,like the remote control,but soon ."},{"reviewerName":"Goldie","rating":"3.0 out of 5 stars","reviewTitle":"Three Stars","reviewDate":"March 5, 2018","reviewText":"Make sure that you want the T6 and not the T6i because I made that mistake. Oops."},{"reviewerName":"Emily Farris","rating":"4.0 out of 5 stars","reviewTitle":"Great Camera but Halo Effect on Focus Finder Dots","reviewDate":"October 11, 2016","reviewText":"Pretty happy with this camera — I upgraded from an older Rebel — but I'm really bothered by the red halo around half of the focus-finder dots on the manual setting. It's how I shoot (I photograph food and drinks). I returned my first order because it had the halo and the replacement had it even worse! I called Canon and they said it isn't supposed to look like that but I'm two for two. Thinking of returning one more time, as much as I hate to do that. Maybe third time's a charm?"},{"reviewerName":"Madison","rating":"5.0 out of 5 stars","reviewTitle":"Repeat buyer. Love this camera.","reviewDate":"August 1, 2016","reviewText":"I bought this camera because I dropped my version from 10 years ago. I loved my old one and I love this one even more. Well worth the money!\nCanon EOS Rebel T6 Digital SLR Camera Kit with EF-S 18-55mm f/3.5-5.6 IS II Lens (Black)"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"It was packaged so perfect and even came with a strap that I didn't ...","reviewDate":"August 3, 2016","reviewText":"It is stunning! It was packaged so perfect and even came with a strap that I didn't know it came with. I've used it many times already and it takes amazing pictures!"},{"reviewerName":"Brian W.","rating":"1.0 out of 5 stars","reviewTitle":"Great up until it stopped working 16 months after purchase","reviewDate":"May 31, 2018","reviewText":"Stopped working 16 months after purchase, so four months after the warranty expired. The camera was never dropped or damaged. Brought it to a local repair shop since this happened right before my twins first birthday, which I was obviously expecting to take photos of. They weren't able to repair it since it's likely a problem with the motherboard. Now my only option is to pay to ship it back to Canon. So basically I'm out a camera and have missed photographing this important milestone as a result. Pretty frustrating..."},{"reviewerName":"Kristin Maaninga","rating":"5.0 out of 5 stars","reviewTitle":"Great set","reviewDate":"November 29, 2016","reviewText":"Takes wonderful pictures. I still need to learn how to use it well but the auto functions are great for someone like me who doesn't know much about photography."},{"reviewerName":"K","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"June 23, 2016","reviewText":"Excellent, better than COSCO deal"},{"reviewerName":"Ana","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"August 12, 2016","reviewText":"awesome for begginers with a small budget"},{"reviewerName":"Kalhoon58","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"May 3, 2017","reviewText":"great!"},{"reviewerName":"Chris laurita","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"September 22, 2016","reviewText":"Beautiful pics and easy to use"},{"reviewerName":"Kyle Mcconney","rating":"5.0 out of 5 stars","reviewTitle":"... camera is my 1st professionally oned one and i love it sooo soooo much thanks guys for having","reviewDate":"December 6, 2016","reviewText":"im from the caribbean and this camera is my 1st professionally oned one and i love it sooo soooo much thanks guys for having thi"},{"reviewerName":"Sandra Ham","rating":"5.0 out of 5 stars","reviewTitle":"A good camera","reviewDate":"June 30, 2016","reviewText":"It's a good camera and it takes amazing photos."},{"reviewerName":"Sri Wahyudi","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"July 23, 2016","reviewText":"Positive :)"},{"reviewerName":"Heather Kassu","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"May 16, 2017","reviewText":"perfect! I love it!"},{"reviewerName":"ravi","rating":"5.0 out of 5 stars","reviewTitle":"Awesome Camera","reviewDate":"August 1, 2016","reviewText":"This is the great camera I have ever purchased."},{"reviewerName":"Ramiro Gamboa","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"July 12, 2016","reviewText":"Excellent."},{"reviewerName":"Lisa M.","rating":"5.0 out of 5 stars","reviewTitle":"GREAT !","reviewDate":"June 2, 2016","reviewText":"Awesome camera and I'm just a beginner !!"},{"reviewerName":"Giq","rating":"4.0 out of 5 stars","reviewTitle":"I love this camera but the lense is spaced out and ...","reviewDate":"November 12, 2017","reviewText":"I love this camera but the lense is spaced out and foggy like the two peices of glass on it are coming unglued. Please send a new lense. Thanks."},{"reviewerName":"A Marrero","rating":"4.0 out of 5 stars","reviewTitle":"Four Stars","reviewDate":"December 20, 2016","reviewText":"Great product"},{"reviewerName":"ElizNMurphy","rating":"5.0 out of 5 stars","reviewTitle":"This is my first camera that is beyond the point and shoot variety and it has been very easy to learn and use","reviewDate":"August 9, 2016","reviewText":"I have only had the Canon EOS for about six weeks but am thoroughly enjoying it. This is my first camera that is beyond the point and shoot variety and it has been very easy to learn and use. Takes wonderful pictures so far and I am continuing to learn how to get the most out of it."},{"reviewerName":"sandra m wucki","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"September 22, 2016","reviewText":"Live Canon cameras"},{"reviewerName":"Amazon Customer","rating":"4.0 out of 5 stars","reviewTitle":"its nice for the price (hey that rhymes)","reviewDate":"October 27, 2016","reviewText":"good as a basic camera, if you cant afford the T6s then this is the one for you. If you do video-ography the T6s is the one for you because of the rotating screen"},{"reviewerName":"Christina","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"June 23, 2016","reviewText":"Love it."},{"reviewerName":"brett","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"August 6, 2016","reviewText":"Great camera purchased as graduation gift."},{"reviewerName":"LadyO","rating":"5.0 out of 5 stars","reviewTitle":"Amazing camera!!!","reviewDate":"December 6, 2016","reviewText":"Awesome price and for Amazon prime members you got a camera back pack and memory card!! This is a Christmas gift for my mother in law and it's an amazing price for such a great quality camera!!! Thanks Canon!!!!"},{"reviewerName":"WorldTravelr","rating":"3.0 out of 5 stars","reviewTitle":"If I had it to do again, I wouldn't have bought (see pics)","reviewDate":"March 4, 2017","reviewText":"Bottom line ... I was expecting something amazing. I got something okay. Without photoshop, you'd actually do better using a point and shoot or cell phone camera with auto image correction. On manual mode or auto mode, I still have yet to take a photo that looks better than one filtered on instagram.\n\nSo, I should start off by saying I am probably the prototype of the consumer this camera is marketed for. I have a great eye for photography. I've won a few photo contests and anyone who has ever seen my Instagram feed cannot believe a smartphone user took the photos I post. However, I know nothing about photography. To me ISO sounds like a ticker symbol for a stock and Aperture sounds like a night club in Miami. My purpose in buying this camera was to get something I could learn photography gradually on but still be able to use as a novice on auto-mode in the meantime.\n\nThe first thing I will say that I hate about this camera is that on auto-mode, the blue sky will almost always wash out to a white color completely, or it will look very unnatural with a light blue/white haze that contains gradient pixels upon closer inspection. I asked a friend to show me some settings outside of auto-mode which I could use in manual to make the sky look blue. I was told that 'white washing' a blue sky was a flaw that Canon cameras, specifically, were known for. And that it can be somewhat corrected in photoshop ... going to manual mode did not help correct this. Nothing more frustrating than going out on a beautiful, clear, blue sky California day and seeing washed out photos that make it look overcast. I've also noticed that it tends to wash out the sand in beach shots as well.\n\nAnother thing I hate about this camera is that perhaps the way the camera is designed, many of my pictures seem crooked. I thought at first that I would eventually get used to this and compensate for it automatically when taking a picture, yet the slight tilt still persists. I do have big hands and the camera does feel a bit small in my hands ... I wish they had some kind of a stock you could buy to make it feel more substantial but alas, there is none I can find. The camera does not feel like it sits in my hands comfortably and the fact that it is very lightweight and not at all heavy doesn't help things out. I am not quite sure what to do to stop pictures from coming out slightly crooked. I find that if I take my time when shooting, they will be straighter but if its a natural instinct where I need to get a quick shot and don't have time to think and compensate, the tilt is there.\n\nThe lighting is also an issue with this camera. My smartphone camera does better at shooting in low light than this camera. And when you use the flash indoors, it tends to illuminate an object in white, bright light making the subject look washed out and the background look darker. I am sure once I am able to shoot better in manual mode, I will figure out ways to shoot in lower lighting. However in auto-mode, it is almost useless to use this and I find myself instead reaching for my cell phone camera. That's pretty sad. I have been playing around with the shutter speeds after doing some research and haven't had much luck shooting in darker situations yet. It seems like the learning curve is pretty high but I am not giving up.\n\nBe careful when using some of the 'semi-auto' settings ... I have found that using these modes gives you photos that look good on the little preview screen and then when I got back home and transferred them to the computer they were all blurry. What you see on the preview screen is not exactly what you will see on the large format picture from a computer monitor. Until you get out of auto mode into full-manual, I would be cautious about other settings. The same is true with auto-focus mode. While the photos you are taking may look clear on the small preview screen, they will likely be blurry and out of focus once you transfer them. The menus on this camera are not incredibly easy ... they are layered/stacked on top of each other and small buttons make it hard to navigate through them. Don't think you will pick this thing up and 'explore' your way around outside of auto-mode and easily learn. I feel like the old 35 mm cameras and their wheels and dials made things a lot more easy than on-screen menus which are layered on top of each other.\n\nIf you are doing portrait photography, you will want to pick up a 'nifty fifty' or a 50 mm lens. You will need to get a bit further away from your subject but it will give you the 'bokeh' look ... whereas the stock lenses will not give you the blurred background with the subject crisp and clear in the foreground. A friend of mine who is a professional photographer took it into manual mode and tried to get this look using the stock lens and could not. The zoom on this isn't all that great, so again, you will probably need to buy a lens for that as well. Very few of the telephoto lenses for Canon cameras at this level have image stabilization built in so its hard not to get blurry/chopping looking zoomed photos. Also, when using manual focus, it is hard to grasp the outside of the lens to turn the focus. I am much more comfortable with the focus being a band in the middle of the lens vs. the outer edge.\n\nPerhaps the most glaring thing about this camera is its severe shutter lag. There are faster speeds you can use for sporting events, etc. in manual mode but until you have some area of expertise, those settings always come out blurry for me. To use auto-focus is painfully slow even in good lighting. Expect to wait a full 5 seconds sometimes before a photo will take! At times in auto focus mode, the camera will constantly re-focus and not take the photo. Either the lens will just keep whirling ... or there will be a little beeping sound indicating that the camera cannot find the focus and you cannot take the picture. This is often true in darker lighting, in situations where there might be movement (waves crashing, sunlight shining on water, cars going by, etc.) Again ... something that makes me go to my smartphone when I need a quick picture. The manual focus sometimes looks clear on the preview screen until you blow it up and see that it's blurry. Also, this camera has a lot of difficulty finding range ... meaning that its very hard with the stock lens to put subjects in the foreground and get them in focus without completely losing the background. Even in manual mode.\n\nOverall, don't think this is a camera you will buy and be amazed with in manual mode. And don't think it will be easy to pick up and 'learn as you go' in manual mode. It's probably best to buy this if you plan on taking classes ... or if you have a friend who knows what they are doing and can teach you as you go. If that friend has a different make than a Canon, things get more difficult because the camera itself has different menus/settings. I maybe expected too much from the image quality. Even in manual mode, the pictures aren't as crisp and clear as I would like them to be. They look like pictures (even outside auto-mode) that you'd take with a point and shoot camera. This has showed me that until you get good at photography, there is no substitute for a $1,000+ camera. This is basically a point and shoot which has a lot more modes and features which help you learn photography.\n\nI'm very disappointed with this camera based on my expectations. There is nothing professional about it but at the price point, I should have guessed."},{"reviewerName":"Steven","rating":"4.0 out of 5 stars","reviewTitle":"Don't hesitate to buy for photography!","reviewDate":"May 24, 2017","reviewText":"Great camera! Love all the features on it! I would highly recommend this camera all the way from beginning to expert. I am a beginner at DSLR photography and I was able to take these pictures with my T6.\nMy only gripe is that there is no Jack for audio and there is no 1080p 60fps. Since I was to use my dslr for mainly cinematography, I exchanged my T6 for a Nikon d3400.\nThe battery life is alright, I got about 750 photos on a full charge which is just right for events such as family gatherings or sports.\nOverall, if your main goal is photography, then go for this camera. If you're aiming for videography, then look at the d3400. Attached are some pictures of my cat I took on full auto mode with the T6."},{"reviewerName":"Michael Crowder","rating":"4.0 out of 5 stars","reviewTitle":"Four Stars","reviewDate":"May 25, 2017","reviewText":"Ok"},{"reviewerName":"Teri L.","rating":"4.0 out of 5 stars","reviewTitle":"Still learning, but for a youth challenged woman (senior) ...","reviewDate":"March 4, 2017","reviewText":"Still learning, but for a youth challenged woman (senior), I'm making progress."},{"reviewerName":"Amazon Customer","rating":"3.0 out of 5 stars","reviewTitle":"good product quality - wifi functionality to send pictures to ...","reviewDate":"July 24, 2016","reviewText":"good product quality - wifi functionality to send pictures to a smartphone is not easy to handle and is not compatible with all phones.\nI found out the hard way as my phone cannot connect to the camera either to action through the phone or to receive pictures taken by the camera.\nI whish I had known this beforehand so I could think about choosing a different camera (Nicon d5500 for instance)."},{"reviewerName":"Lars Warkentien","rating":"3.0 out of 5 stars","reviewTitle":"Three Stars","reviewDate":"February 6, 2018","reviewText":"Haven't had an opportunity to put it through its paces. Looking forward to using it during my European vacation."},{"reviewerName":"SamiiM","rating":"5.0 out of 5 stars","reviewTitle":"Great camera for those on a budget!!","reviewDate":"December 7, 2017","reviewText":"This camera is GREAT for a beginner. I’m currently in school for photography and had to upgrade to a dslr from a Nikon coolpix point and shoot. That camera was cool and has the same functions as my rebel but the quality is far better with it being a dslr. It is so amazing when you’re in a budget. I’m constantly getting told by classmates how amazing, clear and crisp my shots are.\n\nThere are going to be people complaining about the quality and the fact that the camera cannot do what they need it to. Well, if your picture quality sucks on auto that’s your fault. Switch to manual and learn your camera! Your pictures will be far better on manual. If you can’t do manual then shoot with aperture priority or shutter priority. This camera is fantastic and takes great pictures for a crop sensor. It’s not going to do what a full frame camera can do. It’s not. But for a crop sensor it’s pretty freaking amazing and takes fantastic pictures.\n\nAlso, the lens will not always give you crisp professional photos like you’d expect. It’s a kit lens and they don’t always take professional pictures but they can get the job done. I’ve taken great pictures with my kit lens. I even bought a 75-300 mm kit lens to explore. I don’t expect to get unbelievably amazing shots but I do know I can get some pretty dang good ones with it. Because I saved money on my camera body I was able to invest in a different lens other than the kit lenses. With this body and a better lens your picture quality will be even better! Get this camera, get a 50 mm prime lens and see how great your pictures look. That’s a great beginner lens on a budget. Get yungnuo it’s even cheaper than the one canon has. But with this body you can invest more in better lenses and when you do that man! This will bring yourbphotography level to a whole other level. I plan to buy more lenses that aren’t kit lenses and once I do I already know I’ll have some shots that’ll amaze everyone.\n\nPhotos were taken WITH my kit lens on manual saved on RAW not JPEG. See how great these are? For a beginner! Buy this camera!"},{"reviewerName":"Sam Smart","rating":"3.0 out of 5 stars","reviewTitle":"I am very satisfied with the camera and items received but upon receiving ...","reviewDate":"January 8, 2017","reviewText":"I am very satisfied with the camera and items received but upon receiving the camera bag the strap on it was ripped. For such a large price item I wasn't happy about receiving the bag in the condition it was is in"},{"reviewerName":"Jennifer F","rating":"5.0 out of 5 stars","reviewTitle":"Honest review from a new DSLR user!","reviewDate":"January 26, 2019","reviewText":"I have owned Canon cameras all my life and recently received this DSLR one for Christmas. It’s my first camera of this kind. I expected it to be difficult to learn to use but was pleasantly surprised that I was able to open the box, charge a bit, and start taking photos! I was pleased when I turned on the camera and it walks you through setup screens! The image quality is fabulous, the settings are easy to change, its lightweight, and fits in the hand easily. The carrying strap makes it even easier to carry. I am using a 32GB memory card and that allows for approximately 3,200 photos.\n\nIt was a tad difficult to find the video setting on the dial. Videos needed a bit of practicing as the first few came out blurry. This is the only minor downfall but with some practice the videos come out wonderful!\n\nThe battery life is wonderful and it’s easy to upload photos using WiFi! Gone are the days of cords to the computer (although it does come with cords in case you prefer that way!) I was very pleased with the apps that are available for free with it - wonderful and easy to use.\n\nThe package comes with the camera, two interchangeable lenses, a carrying strap, a carrying bag, cord to connect to computer, and manual.\n\nOverall, this is a very easy to use camera for beginners. It offers professional quality photos with ease. Affordable option for a high end camera and the package is a great bargain! Definitely recommended!"},{"reviewerName":"Amazon Customer","rating":"4.0 out of 5 stars","reviewTitle":"Four Stars","reviewDate":"June 23, 2016","reviewText":"everything is fine but it is hard to rator the lens"},{"reviewerName":"Brenda","rating":"5.0 out of 5 stars","reviewTitle":"Amazing beginner camera!","reviewDate":"August 18, 2018","reviewText":"This camera is a must for anyone beginning to dive into professional cameras! It is very user friendly and you can find some great mid range lens for great prices to deliver even sharp images. I personal have the Canon EF 85mm f/1.8 that these pictures were taken with. Also recently invest in the Canon EF-S 17-55mm f/2.8 which has been a game changer for my sessions and events. The lens that this comes with is a good beginner one but if you will be using for portraits or events you definitely will need to invest in a good lens. I love Canon and their products and you can't go wrong with this camera as your first DSLR!! If you think my review was helpful let me know!"},{"reviewerName":"john nguyen","rating":"4.0 out of 5 stars","reviewTitle":"Four Stars","reviewDate":"February 14, 2017","reviewText":"good buy ..."},{"reviewerName":"gus","rating":"2.0 out of 5 stars","reviewTitle":"Canon misrepresents this feature disappointed that a simple feature is crippled by software will ...","reviewDate":"December 27, 2016","reviewText":"NOT a wifi camera\n\nwill not connect to a desktop or laptop via wifi, Canon misrepresents this feature\n\ndisappointed that a simple feature is crippled by software\nwill connect to a smartphone but not a pc"},{"reviewerName":"sweetness","rating":"5.0 out of 5 stars","reviewTitle":"VERY GOOD CAMERA","reviewDate":"April 16, 2018","reviewText":"This is an excellent camera! You cannot beat this price. I bought this camera this last Christmas and have used it for my son's basketball games, and also for my daughter's cheering. I also used it for my son's senior pictures. It takes amazing pictures and is easy to use. If you are comparing prices, this price cannot be beat!"},{"reviewerName":"E. Talerico","rating":"5.0 out of 5 stars","reviewTitle":"A great entry level DSLR - with a lot of flexibility and a wide range of wifi capabilities.","reviewDate":"December 27, 2016","reviewText":"I've been using my EOS Rebel T6 for about two weeks now and have to say that it is a terrific base level DSLR. It offers the full flexibility of settings, with easy to navigate menus which allow easy access for quick changes during a session. The camera is equipped with both a traditional viewfinder and a spacious and colorful easy to read/view 3\" LCD screen.\nThere is a broad selection of shooting resolution and format options - my preference is always to shoot in RAW at the highest quality setting, but you can shoot in JPEG format too with lower quality settings to conserve disk space. The 18MP sensor produces images with excellent detail and a wide color gamut.\nThis kit comes with two lenses - the standard 18-55mm and a 75-300mm for zooming in closer - I'd recommend getting a good wide angle lens to fill in the lower range, as the 18mm setting is a bit limiting. Both lenses will focus nicely, but it can take some time. They are not nearly as fast as the higher end Canon lenses. The 18-55mm lens is equipped with shake reduction, but it is only marginally reliable - so keep a steady hand, or tripod up!\nThere is a good range of ISO settings, but anything above 400 produces more noise than I like to see. (Revision: there are some excellent settings under the Custom Settings menu for dealing with noise both for long exposures, and/or ISO related. Its not a 100\n% solution, but coupled with a good program like Photoshop, you can pretty much eliminate noise from your image without losing sharpness!)\nThis camera is wifi equipped - which means that you can connect wirelessly to upload images to a smartphone or tablet - it also means that, if you download the free Camera Connect app for IOS or Android, you can control your camera from the comfort of your mobile device. I like using my iPad because it gives me an enormous view surface, so I can really see what I'm shooting - and this more than makes up for the lack of an LCD swivel feature - you can control the camera and see your framing from almost anywhere in the shooting area. If you want to put yourself in the picture you can set up either a two or ten second delay - there is a flashing amber light onboard to give you a countdown!\nThe flash is basic popup.\nThe video quality is excellent too. Get yourself the biggest SD card you can afford if you plan to be doing any serious moviemaking.\nThe T6 gives you a lot of options as to how to make your settings. Most settings can be accomplished with buttons on the surface but you have the option of navigating the menu to get to them too.\nA few minor issues I should mention. When shooting in continuous mode, I find that three shots is the max for efficiency. More than that and your camera starts giving you the \"busy\" signal between shots. When I fire off five shots, there is a minute or more wait while the camera clears the data.\nIf you are accustomed to using a small infrared remote, you are out of luck with this model. Remote shooting is done via mobile device or with a cable release.\nThe shutter sound is pretty loud so you might not want to use this one for concerts.\nOverall, this is an excellent entry level DSLR. If you are moving up from Smartphone photography, or from a point and shoot digital its a great first step. You can shoot simply to start but have the luxury of custom settings when you are ready to learn to use the camera more efficiently.\nI'd recommend a few spare batteries. The rechargeable made for this camera gives me about 300 shots on a charge - so for longer shoots I'm careful to bring a few spares with me."},{"reviewerName":"Ajani","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"October 31, 2016","reviewText":"It is amazing! 🙌🏾😵❄️️🤘🏾"},{"reviewerName":"ALBY","rating":"4.0 out of 5 stars","reviewTitle":"Get cannon 6i not just T6","reviewDate":"July 25, 2016","reviewText":"Good but the cannon 80d or the T6i is a better option than this, if want the T6, get the T6i not this one."},{"reviewerName":"JDH","rating":"2.0 out of 5 stars","reviewTitle":"Not Real WiFi Capable So Read Fine Print In Manual First","reviewDate":"January 14, 2018","reviewText":"Exterior packaging is deceiving. Don’t fall for WiFi/NFC claim with this camera. To move photos to your PC an old-style cable is required, or an optional almost $300 unit for NFC. Wireless works for a smartphone & printing. If you want “real” wireless capability, move on. Camera quality is pretty good, although there is typical Canon complexity even with this basic model. If ruggedness and material matter, the case is plastic."},{"reviewerName":"ggbdf","rating":"1.0 out of 5 stars","reviewTitle":"The camera is great, if it works","reviewDate":"March 17, 2017","reviewText":"The camera is great, if it works. Mine came with a defective circuit board and wouldn't even turn on. I had to pay to ship the product back to Cannon for repair. Cannon straight up refused to refund me the money for shipping the product in for repair, even though the product was DOA."},{"reviewerName":"Michaela","rating":"5.0 out of 5 stars","reviewTitle":"Easy to use!","reviewDate":"February 25, 2017","reviewText":"Very pleased with this camera! It came promptly, and all pieces and everything I needed to get started shooting were in the box.\n\nI purchased this for casual photography, I wanted to be able to take photos of my son that were better than smartphone quality, and this did just that. I wasn't so sure about jumping into getting a DLSR camera with no practice, but this really is quite easy to use once you spend some time playing around with it.\nI chose this camera specifically for its wifi capabilities, I wanted to be able to instantly connect my photos to my smart phone and be able to edit there on the go if I so chose to. It connects like a dream, you DO have to download an app to get connectivity, but its simple to operate.\nThe 18-55mm Lens is a great starter, I have no complaints so far about using it to capture the photos I am wanting.\n\nIf you are on the fence about which camera to get, I recommend joining a Facebook group for the cameras you are interested in, or just a beginner photography group, and look at the photos posted there and see if they are the quality you are looking for.\nOverall, Its the person behind the camera that will affect how they look in the end, but it gives you a good idea what to expect.\n\nHowever, I would unequivocally recommend this camera if you are a beginner to using a DLSR camera."},{"reviewerName":"T Ray","rating":"1.0 out of 5 stars","reviewTitle":"Not as pictured. Send a t6 when a t6i is pictured","reviewDate":"December 18, 2018","reviewText":"Pictures are misleading. Read ad carefully. Switcheroo"},{"reviewerName":"Max","rating":"5.0 out of 5 stars","reviewTitle":"Amazingly awesome!","reviewDate":"December 7, 2016","reviewText":"This is a great camera for a beginner! I only been shooting for a month and now people are asking and willing to pay me to take pictures of them(: i am planning to upgrade soon to the Sony camera series because i like the video options better on Sony! Anyways this definitely fits me as a peter parker personality person lol, I totally recommend this for a first camera and soon I'll be getting pictures of the northern lights(:"},{"reviewerName":"Cole Riddle","rating":"5.0 out of 5 stars","reviewTitle":"Great beginners camera!","reviewDate":"February 24, 2018","reviewText":"I've had this camera for almost a year now and I can honestly say I loved every minute with this camera! I'm a noob when it comes to photography and wanted to expand my knowledge and pick it up as a hobby. This was a great choice for an inexpensive choice without compromising quality. I would recommend this camera for any other new photographers out there"},{"reviewerName":"Carlos J.","rating":"1.0 out of 5 stars","reviewTitle":"No microphone","reviewDate":"November 20, 2017","reviewText":"This camera DOES NOT HAVE A MICROPHONE INPUT. Totally useless for serious broadcasting / video recording. If you want to take photos ONLY it might be ok, if you want to use it for video / YouTube / etc then AVOID IT."},{"reviewerName":"Jesse","rating":"4.0 out of 5 stars","reviewTitle":"Great camea for beginner's","reviewDate":"April 8, 2018","reviewText":"Great camera for beginner photographer's or people who have hobbies in the photography world. I dont have any issues with this camera and it takes good photos everywhere I go."},{"reviewerName":"cvsc15","rating":"5.0 out of 5 stars","reviewTitle":"Great!!","reviewDate":"March 20, 2017","reviewText":"I just received my camera an hour ago and I'm so glad I made this investment. The package arrived a day before planned, which is a plus. When it comes to the camera, the picture quality is wonderful! I'm a beginner in photography and I have a lot to learn on how to get the most out of it, but even on \"auto\" or \"pre-set\" settings it still comes out great. Totally recommend it."},{"reviewerName":"Andrew","rating":"5.0 out of 5 stars","reviewTitle":"Bang for your buck","reviewDate":"December 6, 2018","reviewText":"Very versatile without paying thousands of dollars. I have had my camera for just over a year and have taken about 4000 photos. With the right accessories you can take photos just like the person next to you with the $4000 camera."},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Great Camera for a good price !!","reviewDate":"July 26, 2017","reviewText":"I was lucky enough to get a great deal on this kit (T6 base camera plus 2 lens, EF and EFS) for $299 (discount from Canon for $499 plus $200 from Frys Electronics). I got this new camera right after my old Rebel T2 stopped working down in June 2017 after many years. The T6 camera is great for any amateur who just wants to take great pictures or HD videos in auto mode. It also has advanced features available which I will rarely use. I played with the new WiFi features but found them difficult to handle. Most people just use cell phones to take pics and send them off anyway."},{"reviewerName":"Stacey Witt","rating":"5.0 out of 5 stars","reviewTitle":"Great camera","reviewDate":"October 15, 2016","reviewText":"I bought this camera for my thirteen years old daughter, a budding photographer, to use for her yearbook staff. It is an excellent camera! She loves it and it takes great pictures and seems very easy to use."},{"reviewerName":"Lacy P.","rating":"5.0 out of 5 stars","reviewTitle":"Great camera for price","reviewDate":"December 2, 2018","reviewText":"I just got this camera yesterday and I already love it. It has a learning curve but the picture quality is a hundred times better than the cell phone I was using. Can't wait to take many more amazing pictures."},{"reviewerName":"Tarun","rating":"4.0 out of 5 stars","reviewTitle":"good","reviewDate":"October 18, 2016","reviewText":"Canon really are being a bit naughty selling this camera with the old version of the standard zoom lens and not the latest STM model. Presumably they have a large stock of the older ones and decided to unload them with the EOS 1300D. This would put me off buying this overpriced camera, as the newer lens does not have a rotating front assembly and is a bit quieter and faster in operation."},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Great investment.","reviewDate":"March 7, 2017","reviewText":"We need a camera for our family business so we decided to go with the Canon T6 and it was a great investment... We were taking pictures with our phones before we purchased the Canon T6.. It was okay but not the best...Since our business is considerably making custom cups & T-shirts.. Anything to do with sublimation ink..Since we bought the Canon T6 our business improve at least 40%....That my friend is call a great investment...."},{"reviewerName":"eduardozavala","rating":"4.0 out of 5 stars","reviewTitle":"Four Stars","reviewDate":"August 13, 2017","reviewText":""},{"reviewerName":"Jesshar Rajagukguk","rating":"5.0 out of 5 stars","reviewTitle":"Great DSLR for beginners!!!","reviewDate":"December 31, 2017","reviewText":"I just got into photography and I must say this camera is what a novice needs, and when you get better understanding the settings more then you can play aroumd im manuel mode and take full control!!! Don’t hesitate this camera is every beginners dream."},{"reviewerName":"K. J. K.","rating":"5.0 out of 5 stars","reviewTitle":"Very easy to use","reviewDate":"June 10, 2017","reviewText":"Very easy to use! The image stablizer makes almost every picture perfect! Very lightweight and easier to carry. Love it!"},{"reviewerName":"Johnathan Boyd","rating":"5.0 out of 5 stars","reviewTitle":"You most likely need a tripod for bigger lense","reviewDate":"December 23, 2018","reviewText":"The camera is awesome the pictures are great"},{"reviewerName":"Mr J","rating":"3.0 out of 5 stars","reviewTitle":"No USB power, 3.5mm jack does not fit","reviewDate":"October 7, 2019","reviewText":"This camera does not charge or power through usb. The battery has to be charged with the charger\nThe mic input does not fit a 1/8 inch plug"},{"reviewerName":"2P","rating":"2.0 out of 5 stars","reviewTitle":"Two Stars","reviewDate":"February 21, 2017","reviewText":"The lens were scratched when arrived."},{"reviewerName":"María Rita","rating":"5.0 out of 5 stars","reviewTitle":"Diseño excelente","reviewDate":"July 6, 2018","reviewText":"Me encanta su diseño, ojalá pudiera tenerla"},{"reviewerName":"Sidwardo","rating":"5.0 out of 5 stars","reviewTitle":"It's perfect; not basic yet not overwhelming","reviewDate":"December 29, 2016","reviewText":"My 16 year old is loving this camera. It's perfect; not basic yet not overwhelming. Easy to upload to social media sites."},{"reviewerName":"Sarah Elizabeth Bland","rating":"5.0 out of 5 stars","reviewTitle":"I love the canon rebel t6","reviewDate":"December 29, 2016","reviewText":"I love the canon rebel t6! It is fairly simple to use and the quality of the pictures are fantastic!\nThis is a wonderful camera!"},{"reviewerName":"José Orellana","rating":"4.0 out of 5 stars","reviewTitle":"Excelente","reviewDate":"November 2, 2018","reviewText":"Muy buena cámara buena resolución"},{"reviewerName":"micah w.","rating":"3.0 out of 5 stars","reviewTitle":"Received wrong model","reviewDate":"July 3, 2018","reviewText":"I received the T5 model inside the T6 packaging. The only reason I even noticed was because the T5 doesn’t have the built in WiFi which is why I purchased the camera. I would like to believe this was an honest mistake but who knows. Hoping when I get my replacement, all is well and I can leave a correct product review."},{"reviewerName":"clarissa","rating":"5.0 out of 5 stars","reviewTitle":"Great Camera!!","reviewDate":"October 3, 2017","reviewText":"This is a really great camera and it's affordable as well compared to all the cameras out there I would highly recommend it."},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"... shopping store for half of the price and I love this camera","reviewDate":"April 4, 2017","reviewText":"I bought one of this camera in other shopping store for half of the price and I love this camera , it took good pictures it makes you feel like a professional photographer. Amazing!"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"March 10, 2017","reviewText":"Great camera! Really awesome for a beginner with dslr"},{"reviewerName":"leosbel","rating":"5.0 out of 5 stars","reviewTitle":"Good quality for that price","reviewDate":"June 16, 2019","reviewText":"I love it.."},{"reviewerName":"Chris","rating":"5.0 out of 5 stars","reviewTitle":"This camera is perfect for a beginner","reviewDate":"December 31, 2017","reviewText":"This camera is perfect for a beginner. Attached are some photos that I took when I first opened the camera and got it setup."},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Best camera for me","reviewDate":"January 8, 2017","reviewText":"This camera was perfect for me. I am a beginner and this has been great for taking the pictures of my grandkids and giving me a professional look. I am really satisfied and glad I purchased this."},{"reviewerName":"anonymous","rating":"4.0 out of 5 stars","reviewTitle":"Beautiful quality!","reviewDate":"February 27, 2017","reviewText":"It finally came! I'm in love with my camera. I just need to learn how to work it better but with just simple settings, the image quality is amazing for beginner photographers!"},{"reviewerName":"Jaiden Middleton","rating":"5.0 out of 5 stars","reviewTitle":"Very pleased","reviewDate":"January 27, 2018","reviewText":"Excellent! Love this camera a lot my friend just love it!"},{"reviewerName":"Keveen Gilbert","rating":"5.0 out of 5 stars","reviewTitle":"Happy buyer!","reviewDate":"August 29, 2017","reviewText":"Camera was on perfect condition. Really good camera for a beginner, user friendly"},{"reviewerName":"Nick","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"July 10, 2017","reviewText":"Awesome camera!"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"January 13, 2017","reviewText":"great camera and work fine Would recommend it"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"February 7, 2017","reviewText":"Very nice quality pictures and very easy to deal with. Would recommend to anyone"},{"reviewerName":"Anthony o.","rating":"5.0 out of 5 stars","reviewTitle":"Good starter for youtube/professional pictures","reviewDate":"June 27, 2016","reviewText":"Wow let me start by saying the 550$ bundle is so worth it but to be very fair this is cheaper than getting a point and shoot for the price of you want to start YouTube or want to start taking professional pictures I would really recommend this camera best for the price."},{"reviewerName":"Tinamarie","rating":"1.0 out of 5 stars","reviewTitle":"I have a smaller Canon camera at home that I bought around 7 years ago or so that takes wonderful pictures and the colors are vi","reviewDate":"February 3, 2017","reviewText":"I would not buy this camera. I have a smaller Canon camera at home that I bought around 7 years ago or so that takes wonderful pictures and the colors are vibrant and have a nice rich quality. I bought this Rebel camera thinking I would get a better quality picture and that was NOT the case. The picture quality is very average or bland at best and it just did not meet my expectations at all. I did not like this camera. It was very disappointing. I do not settle for average but I do like saving money and getting a great deal. Also when I went to upload the \"chip\" in the camera into my Apple computer, it could NOT read the chip to get the pictures off of it."},{"reviewerName":"Caroleen","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"February 10, 2017","reviewText":"nice bundle"},{"reviewerName":"Wooley Pirate","rating":"4.0 out of 5 stars","reviewTitle":"It's better than a Nikon","reviewDate":"September 3, 2016","reviewText":"It's a cannon. So... It's better than a Nikon."},{"reviewerName":"Amazon Customer","rating":"2.0 out of 5 stars","reviewTitle":"The Camera was rejected from US government side as the ...","reviewDate":"May 16, 2017","reviewText":"The Camera was rejected from US government side as the Battery was inside it, I think it`s not the vendor fault but we didn't get it though."},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Perfect!","reviewDate":"November 11, 2016","reviewText":"Just the camera I wanted! Thanks Amazon!"},{"reviewerName":"john r degnan","rating":"3.0 out of 5 stars","reviewTitle":"Three Stars","reviewDate":"December 10, 2016","reviewText":"also bought for a gift. It's still in the box."},{"reviewerName":"June Mackie","rating":"1.0 out of 5 stars","reviewTitle":"... way too complicated and the operating manual is not easy to follow","reviewDate":"December 31, 2016","reviewText":"It is way too complicated and the operating manual is not easy to follow. I haven't used it yet.\nI may have to return it."},{"reviewerName":"Faun Henson","rating":"3.0 out of 5 stars","reviewTitle":"Three Stars","reviewDate":"November 15, 2016","reviewText":"Arrived in one piece now I have to learn how to use it"},{"reviewerName":"Lynn J Currell","rating":"3.0 out of 5 stars","reviewTitle":"Three Stars","reviewDate":"June 2, 2016","reviewText":"I like it so far. Have not used it too much yet."},{"reviewerName":"MILTON AGLIETTI P.","rating":"1.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"December 11, 2016","reviewText":"very good"},{"reviewerName":"Kenny N.","rating":"1.0 out of 5 stars","reviewTitle":"One Star","reviewDate":"September 19, 2016","reviewText":"Made in Taiwan........I don't like"},{"reviewerName":"FREDERICK","rating":"4.0 out of 5 stars","reviewTitle":"Excellent Camera","reviewDate":"January 2, 2018","reviewText":"I got this cam and it works very well once you get use to it.\nPhoto quality is EXCELLENT\nI will be using this mostly for Still photography in monochrome\nThe video auto-focus is garbage"},{"reviewerName":"Niroj","rating":"5.0 out of 5 stars","reviewTitle":"Cool","reviewDate":"September 6, 2019","reviewText":"Super cool camera on cheap price."},{"reviewerName":"sjm77","rating":"5.0 out of 5 stars","reviewTitle":"Great Camera","reviewDate":"March 1, 2017","reviewText":"Been using the camera for about a month and I love it. Great camera."},{"reviewerName":"CLBB","rating":"4.0 out of 5 stars","reviewTitle":"Good enough","reviewDate":"December 3, 2017","reviewText":"My last camera was broken and I need to right before I went on a trip. It is of course good for this price, but I would recommend people to buy better(expensive) cameras, and the second lens isn't that useful...as I thought...."},{"reviewerName":"Phyllis Owens","rating":"5.0 out of 5 stars","reviewTitle":"Excellent. Love it and would recommend to","reviewDate":"December 14, 2016","reviewText":"Excellent. Love it and would recommend to others"},{"reviewerName":"Jayden","rating":"5.0 out of 5 stars","reviewTitle":"I absolutely love it😍😍😍","reviewDate":"October 25, 2017","reviewText":"I absolutely love it😍😍😍"},{"reviewerName":"Amazon Customer","rating":"4.0 out of 5 stars","reviewTitle":"Great camera, but they lowered the price $50 the ...","reviewDate":"January 9, 2018","reviewText":"Great camera, but they lowered the price $50 the day after I bought it and then I saw it at Sams Club for even cheaper."}]}