{"title":"Canon EOS Rebel T6 DSLR Camera with 18-55mm, EF 75-300mm Lens, and Deluxe Bundle","manufacturer":"Canon","currentPrice":false,"rating":"4.7 out of 5 stars","totalRatings":"703 ratings","features":["\n         Make sure this fits\n                by entering your model number.\n        \n","Includes: Canon EOS Rebel T6 DSLR Camera w/ EF-S 18-55mm & 75-300mm Lens | Focus Flash w/ Wide/Tele Lenses & 58mm Filters | 58mm UV Lens Protection Filter | Two SanDisk Ultra 32GB SD Cards | ocus DSLR Camera Accessories Bundle | 59\" Photo & Video Tripod","Canon Authorized Dealer – Includes USA Manufacturer’s Warranty","Canon T6 18MP CMOS DIGIC 4+ Image Processor | Wi-Fi & NFC Wireless Connectivity","3.0 fps Continuous Shooting | 9-Point AF System","EOS Full HD Video | Enhanced Creative Filters"],"reviewsAspects":["easy to use","eos rebel","photo savings","wide angle","year old","highly recommend","still learning","memory cards","starter kit","great deal","great camera","recommend this to anyone","really good","great pictures","great value","get started","good deal","card reader","rebel t6 dslr","camera bag"],"productInformation":[{"Product Dimensions":"8 x 16 x 20 inches"},{"Item Weight":"10 pounds"},{"Shipping Weight":"10.1 pounds"},{"ASIN":"B01DJDSAVU"},{"Item model number":"1159C008"},{"Batteries":"1 Lithium ion batteries required."},{"Customer Reviews":"4.7 out of 5 stars\n    703 ratings\n4.7 out of 5 stars"},{"Best Sellers Rank":"#8,003 in Camera & Photo (See Top 100 in Camera & Photo)\n#301 in DSLR Cameras\n"},{"Date first listed on Amazon":"March 28, 2016"}],"productDescription":["\nXPIX Pro Series 2.2x High Definition Telephoto Lens: is great to get those far away shots when you can't get close up! Great for sports and portraiture photography too. Multi-coated, high quality glass. A protective case and front and rear caps are included. Works with 58mm front thread (filter size) lenses.\n\nXPIX High-Definition 0.43X Wide-Angle Lens: increases your wide-angle range dramatically. Works great for scenery & indoor shooting and fits much more into your picture. Multi-Coated Optics and High-Quality construction provides great quality photos to capture memorable family photos. This Lens is compatible with High-Speed and Infra-Red shooting modes and can be used for Day or Night photography. ","The Xpix Deluxe Camera Protector Bag is the perfect way to safely and neatly carry your DSLR or mirrorless camera with lenses, flash, tripod, and all other essentials. The bag has a zippered front pocket with internal compartments, an internal webbed pocket to keep your SD cards, batteries, and other small accessories safe and organized, plus three side pockets for extra storage and easy access. It is designed with a speed flap top to provide complete coverage and secures with dual quick-release buckles so you can rest assured that everything is safely protected. Additionally, there is a padded carrying handle and a removable shoulder strap making it an exceptionally comfortable and practical bag to carry with you wherever you go. Constructed with the on-the-go photographer in mind, the Xpix Deluxe Camera Protector Bag is handsome and attractive with a sleek and sturdy design.","Specifications:","Inside dimension : 12 1/2”(W) X 7”(D) X 7 1/2”(H) \nOutside dimension : 9 1/2”(W) X 5 1/2”(D) X 5 1/2”(H)","Xpix Manual Slave Flash \n\nXpix universal manual slave flash\nIdeal for Digital & SLR cameras \nGreat light source for indoor & outdoor photography \nLightweight & compact design \nUses 2 AA batteries (not included) \n\n ","XPIX Mini Tabletop/Handgrip Tripod\n\nThe XPIX Mini tripod is designed with photographers in mind, therefore, it is versatile, compact and extremely lightweight for easy portability. \n\n\nXpix Professional USB SD/SDHC Card Reader\n\nThe Xpix memory stick is the best way to do so. Simply plug the USB stick into your computer’s USB 2.0 port and you’re ready to transfer all your files. "],"reviews":[{"reviewerName":"Sancho Grubb","rating":"4.0 out of 5 stars","reviewTitle":"Still chasing the 40th frame","reviewDate":"March 19, 2017","reviewText":"It has been 20+ years since I used an SLR (Pentax K1000), so decided it was time. This is a great kit. The reviews I read on this model confirm that it should suit my needs for a long time. The price is great. Right now the camera kit and the extra lens at Best Buy would cost you about $80 more. Camera is great. Took it out to play this afternoon. I have a Powershot G15, so I am used to the menu layouts. But I have to say the accompanying Deluxe bundle leaves a lot to be desired. I'll list Pros, OKs and Cons\nPros\nYou would need to buy memory cards if you bought at Best Buy. The two included cards are upgrade to the ones illustrated and currently sell on Amazon for $17 each\nThe filters included 2 UV filters. While it seems to be a debate if you need a UV filter on a digital camera, it does provide a bit of protection. Filter set plus extra UV filter would have cost about $25\nThe bag is ok. It will due until I can find better. Not enough velcro panels to really provide a lot of separate places for things.\n\nOKs\nThe flash seems to be ok, but a manual flash on an automatic camera? Seriously?\nSD Card wallet is a plus. I hate it when I can't find them in a bag that doesn't have little pockets.\nThe wrist strap I might try, but it means losing the neck strap. Have to think about that one.\n\nCons\nThe tripod is junk. Just getting it out and extending the legs said 'don't put anything on here.' With hardly any pressure, putting it on the ground with all the legs extended resulted in legs flexing and bending. Crank to elevate the center rod is stiff, and I suspect you could strip the gear teeth quite easily. Also tried to chase down specs from 'manufacturer' for load limit - none.\nThe telephoto/wide angle lenses are throwbacks to the days of fixed mounted lens cameras. Weren't great then, not going to be great now. Tried the telephoto, and while there is some magnification, there was also aberration.\nThe deluxe started cleaning kit, the tabletop tripod and the SD card reader will all find their way into oblivion.\n\nWhat would have been useful instead of the detritus would have been a couple of lens pouches, for a little extra protection.\n\nSuggestion to everyone - The supplied battery from Canon is has a capacity of 860 maH. You should consider at least one extra battery, and personally, I have had good luck with Li-Ion batteries from Wasabi. You can get 2 with a capacity of 1600 maH for $15. Opt for 2 batteries and a charger for $21. The charger comes with a 12vdc adapter to charge batteries in the car."},{"reviewerName":"Megan Renee","rating":"5.0 out of 5 stars","reviewTitle":"Great camera","reviewDate":"April 28, 2017","reviewText":"I just received my camera today and so far so good. Despite that I don't know how to use a camera, I was playing with it and taking pictures of my friend within the first 10 mins of getting it and I'm impressed with how good it turned out for just a testing picture and no settings changed from what it came with. Very happy and I can't wait to figure it out more! Highly recommend."},{"reviewerName":"Rachel","rating":"5.0 out of 5 stars","reviewTitle":"Great quality! No one will know you're a beginner!","reviewDate":"September 23, 2017","reviewText":"Excellent camera for a beginner! If you want good quality photos you MUST get out of auto focus and go into manual mode. I took a few days reading some Pinterest suggestions for which lens to use with which setting, practiced with changing a few settings, and I was good to go. The lenses are good quality to get close-ups and reasonable shots of landscapes or family portraits. The handgrip tripod is great for steadying your hand and getting a less blurry shot. A lot of the other accessories don't seem to be amazing, but it's literally the same price to buy this kit as it is to buy just the camera and lenses at target, so why not? It's helpful to learn what I'm actually going to want to invest in. I didn't bother using the camera bag and just purchased a great quality camera backpack that also fits my laptop instead. Anyway it's a great value and as a beginner, I highly recommend it to anyone else looking to dip into DSLR photography. Here are some shots I took in my first week of owning it, no editing."},{"reviewerName":"Jonathan","rating":"5.0 out of 5 stars","reviewTitle":"The camera is phenomenal...","reviewDate":"April 28, 2017","reviewText":"So I received this nifty product and let me just say that it was a phenomenal feeling. Everything on the description came in except one thing...the mini tripod. I was kind of disappointed that it didnt come in with everything included, but besides that everything else came in. Some of the stuff were inside of the bag which was a surprise because I thought I had opened everything but apparently there was more inside the deluxe bag. The camera works perfectly, everything works perfectly, but one think to know is that the external flash needs AA batteries if I am correct, but overall it's a great buy. I would recommend it for first time photographers.\n\nOne thing about it is that it's kind if hard to take pictures at night so you'll either need to be in a lighted place or keep adjusting the focus. It's a great quality camera for the price and with the extra accessories it's just a bonus. Most cameras especially canon by itself cost nearly around $400/$500 only the body and the extra accessories would be around $200 so this is a great deal. Im highly satisfied with the sellers product"},{"reviewerName":"Amazonaholic","rating":"5.0 out of 5 stars","reviewTitle":"Buy this instead of the regular Canon 2 lens bundle","reviewDate":"October 6, 2017","reviewText":"This is the same price as the regular Canon bundles, but with WAY more stuff. You probably already know about the camera, so bundle pro/cons for me are...Pros: the body and 2 Canon lenses, SD cards, filters, card reader, table top tripod, and cleaning items. Cons: the regular size tripod is a little wobbly and the vivitar lenses (macro and wide angle) are...funky. BUT I plan to use them as props to shoot through as I hold them, so no loss there. The bag isn't a Canon, and the velcro inside is a little scratchy, and not that strong, and I thought I'd hate it, but I actually do. There are multiple pockets outside and on the top flap are very handy, and there's extra buckles that make the zippered flap even more secure. I haven't tried the flash yet, but all these extras are just bonuses. This is perfect for the beginner/student on a budget."},{"reviewerName":"Donna L. Anthony","rating":"5.0 out of 5 stars","reviewTitle":"Although I was very disappointed on the time of arrival got her about a ...","reviewDate":"June 7, 2017","reviewText":"Although I was very disappointed on the time of arrival got her about a week later than they said. The camera itself is absolutely amazing! I got everything it said it would come with. It takes professional looking photos! I love it an the price was well worth it, took these pictures with it. I went from my smartphone to this camera very easy to use!"},{"reviewerName":"Sandy C","rating":"5.0 out of 5 stars","reviewTitle":"Happy with purchase","reviewDate":"February 12, 2017","reviewText":"This replaced my EOS Rebel that only had 10 megapixels and was showing its age after years of service and lots of use. All the gear from my previous Canon naturally fits this one but this set had some filters I didn't have previously which is nice. The camera and lenses are more than easily fits in the provided carrying case, not really an issue if you're only taking one or two lenses with you. Good deal overall!"},{"reviewerName":"Paul3","rating":"4.0 out of 5 stars","reviewTitle":"Not a bad camera but this bundle isnt worth the cost","reviewDate":"September 7, 2017","reviewText":"This id a good beginner setup. For this package deal, id say skip it. The tripod is a flimsy piece of junk, and a bunch of the stuff that it comes with can be picked up cheap individually. I have yet to use the top mount flash, again, its not a well made product. To get started with digital slr photos, get a bag, the camera bkdy, a few good lenses, and a sturdy tripod. The rest of this was stuff i thought would be necessary, but it sure isnt. Id recommend the camera itself though. Its pretty easy to use and therea a bunch of videos on youtube that give detailed instructions on its use."},{"reviewerName":"B Louis","rating":"5.0 out of 5 stars","reviewTitle":"Best Camera I've Used","reviewDate":"March 6, 2019","reviewText":"I have used many 35mm cameras as well as digital ones from 3MP to 12MP. My better cameras were a Kodak fixed-lens unit with separate light meter, a Mamiya Secor 500 with changeable lenses and built-in light meter (no microprocessor) and the 12MP digital camera.\n\nThe Canon EOS Rebel T6 blows the others out of the galaxy. This is a camera that mimics professional-grade ones available 10 to 15 years ago for three to five times the price. The \"basic zone\" modes (creative auto, portrait, sports, landscape, food, etc.) are of much higher quality than the compact digital ones I have used. The \"creative zone\" modes that give preference to shutter speed, aperture, etc.) require more technical knowledge but offer some amazing options.\n\nI am very impressed with how fast the continuous mode works to take roughly three shots per second in portrait, sports or creative zone settings. The auto-focus takes a fraction of a second giving the ability to capture fleeting events well. I remember an acquaintance that spent thousands of dollars 15 years ago to get a camera that does not rival this one.\n\nI really like the included (bundled) items, particularly at the price. The telephoto lens and filters are worth the up-charge alone. However, when you add the two SD cards and other items this is an incredible deal.\n\nThis purchase ranks up there with the best purchase I ever made.\n\nI highly recommend the purchase of the Canon EOS Rebel T6/1300D for dummies book as a supplement to the camera bundle. The book has many illustrations and explains the camera operation and capabilities well."},{"reviewerName":"Matthew Villalobos","rating":"5.0 out of 5 stars","reviewTitle":"The package over delivers!","reviewDate":"January 17, 2019","reviewText":"I needed a new DSLR camera and was leaving on a trip in a week so I order this bundled after scouring the web for the best price and quality. I decided on this particular package and within the week it arrived. The 75-300MM lens is one of the best lenses I've shot with in a long time. I was immediately blown away by the quality and depth of the photos I was taken, not too surprised as Canon makes great cameras. The Bundle came with everything it said it did, more lens filters than I need to even use, but I will eventually as I slide into amateur photographer life. The macro and wide angle attachments are great when you need to get just a little bit more scenery in your shot using the 18-55mm. They easily screw onto the end of both telephoto and standard lens. The tripod is sturdy so long as you aren't dragging it over lava rock all day and the mini tripod that stands at a foot tall with legs extended is perfect for that table shot of the group or standing it up on your dresser or desk. The handheld is awesome, almost like your holding a camera gun. Great for video of moving objects and very sturdy, also folds out to be a tripod. Over all I give this bundle 5 stars across the board. I mean the price, all the accessories, you can't beat it."},{"reviewerName":"Doug Richards","rating":"5.0 out of 5 stars","reviewTitle":"Great bundle for someone new to DSLR","reviewDate":"July 25, 2016","reviewText":"This is my first DSLR camera and I never owned an SLR. Most of my experience has been with older 35mm film cameras and the newer point and shoot cameras. I know many professional photographers and they all tell me it isn't the camera, its the person behind it. I believe that, but there are things you can do with a DSLR that you can't do with a point and shoot. Otherwise, wouldn't all the pros be using cheap cameras to showcase their skills?\n\nI have been wanting to take some college classes in photography and felt this was a nice entry into DSLR's where I could manually adjust everything, learn about lenses and the purposes of them. The price was definitely better than buying everything separate. I was able to take nice pictures immediately. One portrait of my daughter in particular, I must have gotten lucky, came out really well with the blurred background and precise focusing. I am still learning to use this thing and am planning on doing some night photography with a 50 mm prime lens I also picked up. I think for the investment, especially if you plan on upgrading someday, this amount is minuscule compared to what the top cameras cost. One thing I learned after purchasing was about full and cropped frames. I wish I knew more about that beforehand since it changes the lenses and their field of view."},{"reviewerName":"memphisrain","rating":"5.0 out of 5 stars","reviewTitle":"Happy With It!","reviewDate":"March 14, 2018","reviewText":"I read a lot of the reviews and I am with the \"I love it\" crowd--no complaints here. Yes, I am sure the little things in the kit for the semi-pros...I just don't care about all that. I am not a pro or even a semi-pro...I love the beauty of the images I can create both in my shots and post artistry. All of the little filters and lenses are great for me and I will enjoy playing with them and eventually outgrow them, I am sure, but I thought it was pretty cool. I gave away the tripod (table) and have a nice backpack for my camera gear--but other than that, everything is usable and great! The Vivitar lenses (wide angle, etc) are actually really nice quality and way cheaper in this format than going out and buying an expensive, full lens. I think it is a good deal--I love it!"},{"reviewerName":"K.F.","rating":"2.0 out of 5 stars","reviewTitle":"Update: Was good while it worked, now won't turn on.","reviewDate":"February 19, 2018","reviewText":"Update : After less than six months of light use, it won't turn on. Internet research has shown that this is not an uncommon problem with this camera.\n\nGot this for a teenager who wants to get into photography. The camera is great, and all the accessories that come with it make it an even better deal. Some of the extras may not be the highest quality, but will be fine for someone just learning how to use everything. I am not the user of the camera, but I feel that it will be durable enough to last quite a while if properly taken care of."},{"reviewerName":"Terri H","rating":"4.0 out of 5 stars","reviewTitle":"Good kit for the money","reviewDate":"February 14, 2017","reviewText":"This is a good kit for the money, I am enjoying the camera, very user friendly, and I am able to create great shots. I have only used manual mode, so I am not sure how each mode works. The lenses are good quality. 70-300 is a little slow and heavy, but for the price it is worth it. Some of the kit extras are decent, but not high quality. I would not use the tripod, as it is not strong or sturdy. Off-camera Flash is also not the best, but it works."},{"reviewerName":"Christine D. Patterson","rating":"1.0 out of 5 stars","reviewTitle":"I brought this camera bundle as new but it was ...","reviewDate":"October 19, 2016","reviewText":"I brought this camera bundle as new but it was used. Had to send to canon to get repaired. The micro lens and wide angle are not by canon. card reader was corrupted. Flash does not work. There was no case for the memory cards as shown."},{"reviewerName":"Robert w. smith","rating":"5.0 out of 5 stars","reviewTitle":"Amazing product","reviewDate":"January 25, 2019","reviewText":"This was purchased as a Christmas present. The over all quality of the product is amazing. Everything in the picture is included. Nothing was missing. Picture quality is excellent. Overall extremely happy and would recommend this to anyone.\nThere was a manufacturing defect in one of the lenses. When I contacted seller they were extremely friendly and willing to help in any way possible. Contacting them was very easy. They replaced the part hassle free with out any problems. I received the part in a timely manner. Very very happy with everything from start to finish."},{"reviewerName":"-jc","rating":"5.0 out of 5 stars","reviewTitle":"Good package","reviewDate":"November 21, 2018","reviewText":"I haven’t used the camera that much and Rebel T6 is Rebel T6. There’s so much reviews about this camera here in Amazon and YouTube.\nThis review is for the package for this camera. The package has so much accessories. Most are enough to get you started. As beginner, as you learned, then you will slowly upgrade like for a better tripod and additional lenses, etc.\nWith intermediate and higher level, they might not need the accessories that come with it but I think the package is pretty good for the price."},{"reviewerName":"Amazon Customer","rating":"1.0 out of 5 stars","reviewTitle":"all the additional equipment is of poor quality","reviewDate":"October 29, 2018","reviewText":"I did not like the canon camera as well, I am used to Nikon and holding the Canon camera did not feel right - the location of the buttons did not make sense to me.\nI was really upset with the poor quality of all the additional equipment - it just made me feel that I bought a cheap product overall. why not to sell just the camera or add one additional product of reasonable quality?"},{"reviewerName":"Sparky","rating":"5.0 out of 5 stars","reviewTitle":"Great camera","reviewDate":"July 22, 2018","reviewText":"I have a small contractor business that I take pictures during a project and after. The camera has done a great job. It did take me a little bit to figure it out but does a great job! With the pictures taken I can save them for future use, records, and advertising for customers.\nI loved this camera package so much I bought another package for my father-in-law’s birthday."},{"reviewerName":"Shopaholic","rating":"5.0 out of 5 stars","reviewTitle":"Definitely recommend","reviewDate":"August 20, 2018","reviewText":"This camera is absolutely amazing when it comes to point and shoot. The picture quality is amazing especially for the price. Everything thing came as pictured and was packed beautifully. It came right on time and the seller was very pleasant. It all so takes great videos. However the focus function is to great if you are trying to refocus and video just something to be aware of. I think it great for starting out. Plus over time you can up grade your lens which is a great feature."},{"reviewerName":"June","rating":"3.0 out of 5 stars","reviewTitle":"Meh... Love/Hate","reviewDate":"November 15, 2017","reviewText":"The camera works great, takes beautiful pictures, but some of the items in the kit are not Cannon products and do not fit the camera. The wide angle lens does not fit at all, and the tripod is pretty cheesy. Would have rather have had an extra battery and double charger."},{"reviewerName":"MonieMill","rating":"5.0 out of 5 stars","reviewTitle":"LOVE THIS CAMERA & everything about it!","reviewDate":"July 2, 2018","reviewText":"Camera is great! We love Canon. I needed a second camera to film my daughter and son's games when my hubby would be at the other's game. We needed to be able to have both of us film their games so no one would miss seeing them play. I haven't had any issues as of yet, it works great. The only thing is I didn't pay close enough attention to the details of the camera before purchasing. I wanted the one w/the flip screen that opens and closes. This one doesn't do that. It has a stand-alone display screen at the back of it, but it does not move or cannot be modified in any way. Other than that, it does what it's supposed to do and takes beautiful pictures and film. We have no qualms about this camera, we LOVE it!"},{"reviewerName":"2 cents","rating":"5.0 out of 5 stars","reviewTitle":"Best entry level wifi camera!","reviewDate":"November 11, 2017","reviewText":"I did a lot of research and I am very happy with this purchase. If you are looking to enjoy photography but do not aspire to be a professional... this is the camera! Very nice quality, easy to use and wifi enabled so you can easily post to FB or other social media. I originally bought this camera for my wife and she is was so happy, I bought my daughter the exact same one."},{"reviewerName":"Andrew","rating":"4.0 out of 5 stars","reviewTitle":"Good introductory camera","reviewDate":"January 2, 2017","reviewText":"Good introductory camera. I thought it came w/ 2 batteries like most of the other ones shown but this one does not. A little disappointed by the description is accurate so it was my bad. The direction on the Wi-Fi and NFC are horrible. It jumps you from one section to another in the booklet. Not impressed with the booklet I would give that 1 star."},{"reviewerName":"Marcus J Kirby","rating":"5.0 out of 5 stars","reviewTitle":"Awesome bundle!!","reviewDate":"February 7, 2017","reviewText":"I was looking for a good starter camera and I am so satisfied with this bundle!! The camera works great and I’ve already used many of the accessories that came with the bundle. The produce was shipped to me quickly and the packaging was done with care. I’m completely satisfied with the product and the service I received. Thank you!!"},{"reviewerName":"ErickO","rating":"1.0 out of 5 stars","reviewTitle":"Terrible bait and switch","reviewDate":"November 16, 2016","reviewText":"Terrible bait and switch.\nDelivered products were not as described and pictured; replaced with cheaper items.\n\nReturned for a refund from a reputable vendor."},{"reviewerName":"Olive","rating":"5.0 out of 5 stars","reviewTitle":"Good camera","reviewDate":"January 16, 2017","reviewText":"I'm a beginner and I bought this package to get familiar with a camera. This is so nice and simple. My worry is that I would be overwhelmed, but it's been an opposite experience. I actually took our holiday photos with the camera and they turned out very nice."},{"reviewerName":"Patrick McLean","rating":"5.0 out of 5 stars","reviewTitle":"Great set, great price","reviewDate":"February 16, 2019","reviewText":"Got everything as described and everything is working as it should. I only really started to use it (took an intro to photography class today) so I can update later. Bit of a learning curvy if you never had used such a camera before but this package overall seems to be worth the price. I can see where other reviews deem some of the non-camera/lens items as lesser, but for a started set, to see if I want to get back into it, it really does get you everything you need to start off.\n\nI read a lot of reviews for lots of different options on Amazon and was thankful for the other reviews and their feedback. It's a stressful purchase for sure but it really does seem to be working on with me. No problems with the sellers either."},{"reviewerName":"Paxson","rating":"4.0 out of 5 stars","reviewTitle":"A bundle with a lot of stuff you won't use, but you may want to buy it anyways","reviewDate":"September 17, 2017","reviewText":"The camera itself and the two cannon lenses are great. The trip is is flimsy but this is a starter bundle of sorts. It includes two two UV protectors which is fine but you don't need them if you're careful because all they do is protect your lens from damage. I was pleased with the quality of the small hand tripod though. I had trouble with getting the hand strap to work and it also seems like a pointless add on to me. I wish they had put in a second battery rather than an extra UV protector and a hand strap though. The bag it comes with is adequate quality. This bundle includes a lot of stuff that you probably won't ever use, I haven't even opened the flash or the filters, but it is there if you like to experiment or just want to have things available."},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"amazing first big dslr purchase","reviewDate":"November 12, 2018","reviewText":"This comes with everything you need. If you are new to the dslr world, this is a wonderful bundle of equipment. The camera itself is a very good quality camera. I love the quality of the images. I haven't successfully tried using it for video yet. But I really love using this camera for my artwork."},{"reviewerName":"Gisela","rating":"5.0 out of 5 stars","reviewTitle":"Perfect, perfect and perfect","reviewDate":"May 20, 2017","reviewText":"Perfect, perfect and perfect! We are so happy we purchased this camera set. What you see in the picture and read you'll get, is exactly what you get when you buy this item! Everything was packed and transported with care, and came within the estimated time.\nThe camera makes beautiful pictures and there is a tutorial video posted on YouTube we saw to learn to operate the camera perfectly. The camera has a lot of features and it takes time to learn to use it all. I already feel like a professional photographer just by having this camera:)"},{"reviewerName":"TAS","rating":"5.0 out of 5 stars","reviewTitle":"Great Combo and price!","reviewDate":"May 28, 2017","reviewText":"AS DESCRIBE, big bang for the buck, very nice camera with lots of extras, the big zoom lens is perfect for Private Investigation work which is why I bought it, I dont know why people complain about the tri-pod, it is not a 300.00 unit but works, you get so much for your money, you may have to buy a better bag with more compartments but this is a great deal, easy to use camera."},{"reviewerName":"William Pyle","rating":"5.0 out of 5 stars","reviewTitle":"WOW perfect camera and set","reviewDate":"April 26, 2017","reviewText":"I am completely satisfied with this camera. It came in a package that included everything one could ever need in a digital camera, lens's tri-pod, extra flash, and so much more. A very complete and satisfying package.\nI will give the camera a full workout when I return to the Caribbean in July, until then I have been busy with tree and animal pictures, all of whech have been a great quality.\nThis set is far more than I ever expected.\nSuperb price, excellent seller."},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"... and important bits of this whole set was of good quality. Such a range of products and extra ...","reviewDate":"February 13, 2017","reviewText":"The main bulk and important bits of this whole set was of good quality. Such a range of products and extra add-ons made this purchase feel like a great bargain. However, I must say that the build quality on things like the tripod or the camera flash felt cheap when in use. This of course is just me nit-picking at the product. The camera as a whole is in perfect condition and was ready to use on arrival. Get this set if you are new to the DSLR game and want a deal which lets you try an array of various products that may or may not enhance your overall experience."},{"reviewerName":"nicole","rating":"5.0 out of 5 stars","reviewTitle":"Christmas gift for beginner photographer","reviewDate":"November 19, 2018","reviewText":"Sorry I can't write a review with how the camera works just yet I bought it as a gift for Christmas But I did open it and checked it out and I was really impressed with everything in the box so many items and lenses and filters nothing looked cheap I know my granddaughter is going to love it I can't wait till she opens it We will get back with you day after christmas"},{"reviewerName":"MB","rating":"5.0 out of 5 stars","reviewTitle":"Great Canon Rebel Bundle!","reviewDate":"February 13, 2017","reviewText":"Excellent camera! Does everything I need it to do! This is an absolutely great deal as you get extra lenses, an extra flash, great filters, a tripod, 2 memory cards, camera battery, a camera bag & more. No where else can you find a Canon Rebel Camera in such a huge bundle for such a low price!\n\nHowever, I did have to buy a bigger camera bag than what came with this bundle. No way can all of these great accessories fit into the camera bag included. Getting a larger camera bag was really not a big deal. I still use the camera bag that is included when I know I'll only need 2 lenses maximum & not much more.\n\nAll-in-all, this is a really good deal, & you do save money in the long run getting this excellent bundle!"},{"reviewerName":"Willa Ford","rating":"5.0 out of 5 stars","reviewTitle":"Great intro DSLR","reviewDate":"June 27, 2017","reviewText":"Great kit for the money! I wanted an intro DSLR that I could improve as I buy nicer lenses. The tripod actually works awesome even though it's a bit wobbly, and the polorizing lens I use all the time! I haven't used all the stuff in the kit yet but they're all nice to have! The flash they give you in the kit is trash though (imo). The attached photo is before any post processing and with the stock lens!"},{"reviewerName":"Kindle Customer","rating":"5.0 out of 5 stars","reviewTitle":"Great Starter Kit","reviewDate":"September 13, 2017","reviewText":"This camera comes with accessories by Xit photo. There is the wide angle lens and the telephoto lens, the 60\" tripod, the 6.5\" tabletop tripod/hand grip, a side hand strap, a USB drive with a memory card reader port, a set of filter lenses plus an extra UV lens, and a starter kit with a memory card case, lens cleaning fluid, 2 cleaning cloths, 2 universal screen protectors, and 5 cotton swabs. Two other non-canon accessories are 2 sandisk 32gb memory cards and a vivitar slave flash with batteries and a hot shoe bracket.\n\nThe canon package itself comes with the two lenses, a camera bag, a strap, one battery with charger, and a USB cable.\n\nUpon opening the only cons I have are that the extra UV filter comes in a plastic container that is the only protectant. The other three lenses come in a faux-leather camp closed case with cloth like separations on the inside for each lens. Also, the bag doesn't fit the camera body with the two lenses properly. All of it will fit if you place them in the right spot, but you risk damage and you will definitely no be able to fit all of the accessories from this bundle in it. However, if you're not a pro photographer traveling to shoots then this most likely won't be an issue.\n\nAll in all amazing camera kit for the price. If you're debating on the 5i or 6i for the flip out screen, the canon app allows you to view the camera screen live on your phone where you can touch to focus, take a photo, change settings, and many other things, which eliminates need for a flip out screen in my opinion. This alone makes it better than the 5i because it's much cheaper. Will update after a while of use!"},{"reviewerName":"D. Baker","rating":"5.0 out of 5 stars","reviewTitle":"Happy so far!","reviewDate":"July 16, 2018","reviewText":"Just received my camera two days ago but very impressed so far. New to photography and have a long way to go to figure out how to work all the different setting but have already taken some gorgeous pictures of sunsets over the lake I live on. Great starter kit for the money and found plenty of YouTube instruction videos to help me figure things out.."},{"reviewerName":"Pixel Pusher","rating":"5.0 out of 5 stars","reviewTitle":"REally great camera, and a really good deal","reviewDate":"October 3, 2017","reviewText":"I couldn't believe how much was in the package when I received it. Exactly as stated on right on time. I've only used one lens so far in my Photographing Artwork class, but it's been great. This is a different brand of camera than my old one, but I soon figured out how to set WB, Aperture, etc. Would recommend it to anyone just getting into SLR cameras for the first time."},{"reviewerName":"ericnsabrina gaskins","rating":"5.0 out of 5 stars","reviewTitle":"Would highly recommend!","reviewDate":"October 15, 2019","reviewText":"I love this camera although I do have to take lessons on how to use it since I stepped up to a much nicer camera. Looking forward to learning all that needs to be learned about it. Great for beginners"},{"reviewerName":"dennis sabourin","rating":"5.0 out of 5 stars","reviewTitle":"Perfect SLR for beginners","reviewDate":"July 16, 2019","reviewText":"The Rebel T6 is easy to use for beginners yet has feature to allow you to advance\nto a more professional level. I would highly recommend Julie Adair King's\nCanon EOS Rebel T6 for dummies"},{"reviewerName":"Brandon T Scott Sr","rating":"5.0 out of 5 stars","reviewTitle":"Great Bundle, Great Deal!","reviewDate":"April 8, 2019","reviewText":"I went to school for Photography after getting out of the Army but had to discontinue and sell my camera. I became very good at Photography and have missed it. Now I can continue my Photo journey! This was a great bargain and came with a lot of accessories and is definitely worth the money. Thanks!"},{"reviewerName":"Chanel","rating":"3.0 out of 5 stars","reviewTitle":"Camera is amazing. Accessories are generic.","reviewDate":"October 19, 2016","reviewText":"Needed to upgrade from my Rebel T3 so I went up a few steps and settle for the T6 for now.\n\nOnly thing that prevented me from giving it 5 stars was the accessories it came with. The larger tripod was decent and hasn't given me any problems. The two memory cards work VERY well and I didn't even realize it came with TWO 32gb ones. The mini tripod does not hold the camera. The flash didn't even want to slide into the camera. VERY disappointed at not getting the actual bag that was pictured. Instead got a canon bag that had one compartment with 2 dividers (shown in pictures) And the rest were just really generic and cheaply made.\nI plan to just sell the accessories I will not be using and get a small profit back to go towards better quality accessories.\n\nThe actually Canon products include : The camera, the battery, the 18mm lens, the 75 mm lens, the camera bag (which did NOT look anything like the picture), and the camera strap.\n\nThe camera itself is amazing for the price. I've included some photos I took using the camera and the different lenses. It also has many shooting scenes including one for food for all us foodies.\n\nAll in all, great bundle for the price. Amazing camera as always with Canon."},{"reviewerName":"Sam","rating":"5.0 out of 5 stars","reviewTitle":"I’ve always wanted a dslr and I’m so happy I chose this one","reviewDate":"January 28, 2018","reviewText":"Before this camera I had a cannon PowerShot which did me well but I wanted something more. I’ve always wanted a dslr and I’m so happy I chose this one. It’s a great all around camera and easy to learn for beginners. This camera takes stunning pictures with my 50 mm lens (which I bought separately). Everything offered came nicely packaged and I’m really happy with this seller."},{"reviewerName":"Eve","rating":"5.0 out of 5 stars","reviewTitle":"Loved this kit!","reviewDate":"August 4, 2019","reviewText":"Loveeed this kit! As a beginner photographer this kit had everything I needed. Unfortunately I had it stolen out of my car, but the kit has everything you need and more!"},{"reviewerName":"Sarah","rating":"2.0 out of 5 stars","reviewTitle":"Camera is good. Smaller lens doesn't seem to focus well at ...","reviewDate":"August 20, 2017","reviewText":"Camera is good. Smaller lens doesn't seem to focus well at all. Tripod is too short for an adult to use. Skip the bundle, and buy just the camera and lenses, and get another tripod elsewhere."},{"reviewerName":"Yolanda N. Swain","rating":"5.0 out of 5 stars","reviewTitle":"Love my camera","reviewDate":"April 24, 2019","reviewText":"Love my camera so much! I am A beginner so I’m still learning and Adding to it. Some of the things it came with are cheap like the tripod so you will have to buy a new one but over all worth the money!!!!"},{"reviewerName":"Amazon Customer","rating":"4.0 out of 5 stars","reviewTitle":"Good starter kit!","reviewDate":"January 31, 2019","reviewText":"This was a gift for my daughter. A starter kit as she learns the ins and outs of becoming a photographer. I can only say that she was thrilled to receive the gift, and has had nothing but good to say about the camera, and accessories."},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Thumbs up","reviewDate":"January 23, 2019","reviewText":"I bought this as a starter camera. I am use to the 35mm old school cameras but I have to say this bundle is amazing! It really gives you all you need to start anything. I absolutely love it. Looking forward to hiking this year in the PNW so worth the money I would recommend this to anyone getting into the digital age for sure"},{"reviewerName":"Nathasha Parris","rating":"4.0 out of 5 stars","reviewTitle":"Photography Near You... JahTashPics","reviewDate":"July 31, 2017","reviewText":"The kit changed my life. For starting a freelace photography life, it's a perfect fit. I will need to purchase a better tripod. Otherwise, I'm satisfied with my purchase and so are my fans."},{"reviewerName":"Andrew","rating":"3.0 out of 5 stars","reviewTitle":"Do yourself a favor.Buy body and lenses separately","reviewDate":"July 23, 2019","reviewText":"Great camera with general Kit lenses. Definitely quite a few items I won’t ever need. I would have bought the body separately and lenses separately next time around"},{"reviewerName":"AZREAgent","rating":"5.0 out of 5 stars","reviewTitle":"Love it!","reviewDate":"February 8, 2017","reviewText":"I bought this camera to help reduce some of the costs involved with all of my Real Estate listings. Quality photos are a must and a requirement for the type of service my clients deserve. I have been pleasantly surprised with not only the lenses and filters provided but with the resolution and quality of the photos! It shipped quickly & securely with NO missing or broken parts (which is a huge plus in my book!) I am still learning the ins-and-outs of everything this camera can do, I'm very happy with it so far!"},{"reviewerName":"Maria M.","rating":"5.0 out of 5 stars","reviewTitle":"love this cannon have a Nikon as well but this ...","reviewDate":"January 30, 2017","reviewText":"love this cannon have a Nikon as well but this rebel far easier, recommend you go to Best buy play with both and make your own decision. That is what I did, then bought it on amazon for a great deal"},{"reviewerName":"CIC Gal","rating":"5.0 out of 5 stars","reviewTitle":"Great Camera!","reviewDate":"February 8, 2017","reviewText":"We purchased this camera package as a gift. I had concerns over something as fragile as a camera being damaged during shipping. We were very pleased with the way it was packaged. I saw some of the photos that were taken with this camera. They were great quality. The accessories included were wonderful. I would definitely recommend this to anyone."},{"reviewerName":"jared","rating":"5.0 out of 5 stars","reviewTitle":"Amazing camera and great value for the money","reviewDate":"October 14, 2018","reviewText":"Amazing camera and lens. All the other stuff is nice but mostly cheaply made. But the whole package cost the same as just the camera and lens in store so its a nice addition. Bag is very nice and has many features and pockets"},{"reviewerName":"Kindle Customer","rating":"5.0 out of 5 stars","reviewTitle":"I absolutely love this camera","reviewDate":"March 28, 2017","reviewText":"I absolutely love this camera! I'm fairly new photography, but this camera has made it so easy!!! I would recommend this to anyone! The 75-300mm lens does not have image stabilization, but with the tripod and the purchase of an $8.99 remote shutter release, I've taken some amazing photos!!! Shots even given a thumbs up approval from a professional photographer I know! Would definitely buy again!"},{"reviewerName":"Michael Roman","rating":"5.0 out of 5 stars","reviewTitle":"Great starter camera","reviewDate":"September 1, 2018","reviewText":"Bought this camera with bundle package for my teenage daughter it's her first SLR, it's small and easy to use, and came with a lot of accessories, delivery was fast, received camera before delivery date, happy with purchase!"},{"reviewerName":"Bob Reynolds","rating":"5.0 out of 5 stars","reviewTitle":"Great camera","reviewDate":"January 3, 2019","reviewText":"Decided to splurge on a good camera and made a great decision on this on. There's a lot of stuff in the kit that I don't know how to use but I'm learning. Great quality and easy to use."},{"reviewerName":"D. Adams","rating":"5.0 out of 5 stars","reviewTitle":"Easy to get started","reviewDate":"September 6, 2018","reviewText":"I'm loving this camera and accessories. I bought it in preparation for a vacation and wanted more than just my camera phone. It's automatic settings make it easy to get great pictures without having to be a professional."},{"reviewerName":"Martin Yan","rating":"4.0 out of 5 stars","reviewTitle":"Very good with one exception!","reviewDate":"February 10, 2017","reviewText":"This was a xmas gift for my Doughter and she is very happy with the camera and most of the accessories with the exemption of the trypot. It is very flimsy . I ended up throwing it away. Don't want a good camera to get damaged due to a flimsy trypot."},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"I LOVE THIS CAMERA","reviewDate":"August 17, 2017","reviewText":"I LOVE THIS CAMERA. The bigger lens that it brings is AMAZING. good first starting camera. I'm super glad i got this, it is super fun and easy to use. Prize is worth for all you're getting. I have attached some photos i have taken, i just started this hobby so don't judge."},{"reviewerName":"happy","rating":"5.0 out of 5 stars","reviewTitle":"Great deal!","reviewDate":"January 1, 2019","reviewText":"Great bundle for the lonely. Camera is awesome. Easy to use and learn quick which settings to use to get the best pic. All the filters and extras are great too. Tripod is a little flimsy when extended but it worked. Bag could be just a tad bigger to fit all accessories but I got em in. Had to leave off a few of the bags that covered the wide angle lenses but they’re protected."},{"reviewerName":"Kyle","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"October 24, 2016","reviewText":"Love the way my pictures come out with both lens!"},{"reviewerName":"john","rating":"5.0 out of 5 stars","reviewTitle":"It took amazing pictures. The two zoom lenses nicely cover the ...","reviewDate":"November 10, 2016","reviewText":"I bought this camera to take on an African safari. It took amazing pictures. The two zoom lenses nicely cover the full range of conditions of interest. I recommend it to anyone who wants an entry level DSLR. This provider was responsive and I would buy from them again."},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Great!","reviewDate":"September 12, 2017","reviewText":"Everything is great. The only thing that was disappointing was the camera bag. It is much too small for the camera and all the camera equipment to fit. I wish the bag was larger, I don't like cramming everything into a small bag with the possibility of breaking something. I hope there is an opportunity to get a larger bag.."},{"reviewerName":"Love2Read","rating":"5.0 out of 5 stars","reviewTitle":"Camera works fine. The enclosed tripod is very light aluminum and ...","reviewDate":"January 9, 2017","reviewText":"Everything came just as pictured. A few weeks in and my camera bag has begun to fray around the edges and a zipper broke. Camera works fine. The enclosed tripod is very light aluminum and not suitable to be left unattended. I'm happy with the camera and the accessories."},{"reviewerName":"thoughts aloud","rating":"5.0 out of 5 stars","reviewTitle":"delivered as promised","reviewDate":"January 14, 2019","reviewText":"this is a newer version of the camera my husband bought me years ago. this was a present for our daughter. Shipped perfectly and the mailed on to her for the holidays. She has charged the battery and taken beautiful shots."},{"reviewerName":"ERIC POOLER","rating":"5.0 out of 5 stars","reviewTitle":"Love it! Everything works great","reviewDate":"July 27, 2018","reviewText":"I couldn't wait to use the camera. Love it! Everything works great. I have to admit, I was a little skeptical about buying a camera online. but everything worked out wonderfully."},{"reviewerName":"Christopher","rating":"5.0 out of 5 stars","reviewTitle":"Good Experience All Around","reviewDate":"November 14, 2018","reviewText":"Everything is great with this all inclusive bundle. Great quality, Easy to use (I suggest you find the Canon manual online to make it even easier to learn quickly and study while waiting once ordered). Was delivered on first day of 3 day window. These pics are from the first 20 photo's I took from my roof balcony... I am a planespotter and this will get a lot of use. Completely satisfied all around..."},{"reviewerName":"wonder","rating":"5.0 out of 5 stars","reviewTitle":"as advertised!","reviewDate":"January 3, 2019","reviewText":"Everything is fine, working great I am still trying to figure out things but that is on me, I need to use it more."},{"reviewerName":"Jess","rating":"5.0 out of 5 stars","reviewTitle":"It's perfect for someone whose diving into wanting some great looking ...","reviewDate":"February 9, 2017","reviewText":"This package was exactly what I was looking for. It's perfect for someone whose diving into wanting some great looking photos, yet not knowing a single thing about photography. All in all, it was a steal, price wise. You get a ton of different things for what the camera and 1 lenses is selling for in stores!"},{"reviewerName":"Stretch","rating":"5.0 out of 5 stars","reviewTitle":"Excellent product","reviewDate":"November 8, 2016","reviewText":"The entire kit is fabulous. The camera is a work of art and is extremely versatile for various types of photography. I bought a kit for myself and my son-in-law. He used it during a recent trip to Scotland. We are both.extremely plrased."},{"reviewerName":"water love","rating":"5.0 out of 5 stars","reviewTitle":"We love this camera","reviewDate":"February 6, 2017","reviewText":"We love this camera. It has replaced an older Rebel we had, and the upgrade was exactly what a family can use for high-quality photos of pretty much everything. Notably, the canon lenses packaged here are the entry-level lenses. They are not as heavy (and seemingly not as heavy duty) as other ones I have purchased in the past from Canon. The plus: the weight of these lenses makes them easier to throw in a bag in plural, and not feel as burdened carrying around for a day. The downside: I worry about whether they would last as long as some of the canon lenses I already have. So far, so good, though. Not to be missed: download the iPhone Canon app for taking selfies, and seeing what is on your camera screen from afar."},{"reviewerName":"Mae","rating":"4.0 out of 5 stars","reviewTitle":"Love it.","reviewDate":"May 30, 2017","reviewText":"Love love love this camera. I am new, I can take good photos on my phone. However I wanted to step my game up. So like an normal person I went and bought a $500 camera... haha. Anyway I'm happy I made the purchase. I am still learning the camera. However everyday since I got it, the weather has been rainy, and cloudy. Anyway I haven't used everything yet. The mini tri pod was trash can't really hold the weight of you want to extend the legs. Even without extending I still wouldn't want to put my camera on it. I plan to buy a better one. The bigger tri pod is not bad. Still learning how to use it better. I'm still use to my old tri pod. The 50ml and 300 (right I forgot at the moment) Lens are great. I've gotten some pretty decent photos. Once the moon is at it's full I hope to get a picture. Anyway I'm no expert but I will say that I'm beyond happy with my purchase. I'll admit I was super nervous because it is my biggest purchase that I've ever made. I'm glad o did."},{"reviewerName":"Cass00","rating":"5.0 out of 5 stars","reviewTitle":"Great Quality, Great Price","reviewDate":"January 10, 2019","reviewText":"Best price for the bundle. So much comes with the camera. very pleased with this purchase."},{"reviewerName":"Madhu Balajee","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"February 8, 2017","reviewText":"I love my camera, and I got a lot of better pics.\nThis camera is absolutely for beginner if you want to be a photographer start with this one, each and every money what you invest on this canon rebel t6 via Amazon is worth it, you can get lot of stuff and you can start practicing it"},{"reviewerName":"Cassandra Diane Wilson","rating":"5.0 out of 5 stars","reviewTitle":"Great price and product","reviewDate":"September 7, 2018","reviewText":"I can't wait to start using everything I got. I absolutely love everything, great price too. It even came a day early which made me really excited."},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"It is exactly as offered and works perfectly.","reviewDate":"May 1, 2019","reviewText":"Camera and lenses work perfectly. It was a graduation gift for my daughter and she is loving it. Everything pictured in the package came in in perfect condition. The delivery was super fast. Excellent experience with seller was great."},{"reviewerName":"Nancy J. Faria","rating":"5.0 out of 5 stars","reviewTitle":"Great camera deal. Awesome seller","reviewDate":"May 9, 2017","reviewText":"Great camera with so many extras. Buying everything separately would be far more expensive. Great for a photography student or someone who is looking to upgrade from just a point and shoot camera. Everything arrived in perfect condition and right on time."},{"reviewerName":"Chad Deisley","rating":"5.0 out of 5 stars","reviewTitle":"Great Camerea Kit for anyone!","reviewDate":"February 8, 2017","reviewText":"I received the camera kit and everything was packaged carefully and came undamaged. The camera kit as I opened everything up was exactly what I wanted for my daughter. She is just starting out and I wanted a kit she could grow with, and this kit was perfect for her. I made the right choice with this camera kit and would recommend it to anyone looking for a quality camera and accessories."},{"reviewerName":"JD","rating":"5.0 out of 5 stars","reviewTitle":"Camera takes great pictures. This was a great package for the ...","reviewDate":"February 24, 2017","reviewText":"My wife loves this. Gave it to her for Christmas. Camera takes great pictures. This was a great package for the price. She videos our Son's sporting events with this camera. Also, we are planning a trip to Yellowstone, so it will get a lot of use during that trip."},{"reviewerName":"Doreen Davis","rating":"5.0 out of 5 stars","reviewTitle":"comes with everything you need to start taking great pictures, I'm glad I finally bought one","reviewDate":"March 15, 2018","reviewText":"This is a camera I have always wanted and finally I bought it, comes with everything you need to start taking great pictures, I'm glad I finally bought one."},{"reviewerName":"destiny griffis","rating":"5.0 out of 5 stars","reviewTitle":"Camera","reviewDate":"June 30, 2019","reviewText":"I love my camera I love taking pictures and it was so easy to teach my self how to use it"},{"reviewerName":"Amazon Customer","rating":"4.0 out of 5 stars","reviewTitle":"It still works great. I gave it 4 stars because after a ...","reviewDate":"December 1, 2017","reviewText":"I'm a 19 year old college student who loves taking pictures, but doesn't have a lot of money to spare. I have had it for nearly a year now. It still works great. I gave it 4 stars because after a while it takes longer to buffer."},{"reviewerName":"D. Baker","rating":"5.0 out of 5 stars","reviewTitle":"Recommend!","reviewDate":"June 6, 2017","reviewText":"This is a very good package. Quality components are included. Would highly recommend. Fast shipping too"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Excellent pictures for low price","reviewDate":"September 2, 2016","reviewText":"Excellent! I am an amateur photographer and I found it very easy to use.\nIt takes amasing pictures."},{"reviewerName":"Ashley Ray","rating":"5.0 out of 5 stars","reviewTitle":"GREAT DEAL!","reviewDate":"September 14, 2017","reviewText":"GREAT DEAL!! If you want to invest in a camera this is the way to do it!! So much comes in this kit! It's like Christmas!! Saves tons of money to get this kit than getting everything in it separately"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Excellent camera - great customer service","reviewDate":"July 1, 2016","reviewText":"This is a fabulous camera and the kit has everything you could need when starting out. The camera bag in my kit came with a broken zipper and it was replaced immediately. This company has excellent customer service."},{"reviewerName":"Micaela","rating":"5.0 out of 5 stars","reviewTitle":"good","reviewDate":"June 23, 2019","reviewText":"love using this camera, great for beginners"},{"reviewerName":"Jessica Garcia","rating":"5.0 out of 5 stars","reviewTitle":"... my camera a month ago and I couldn't be happier, I think its a really good deal to ...","reviewDate":"February 9, 2017","reviewText":"I received my camera a month ago and I couldn't be happier, I think its a really good deal to get camera tripod lenses memory cards filters and all these things at once, because buying them each on their own is obviously more expensive, besides if you are a beginner its a great way to start! The package arrived safely and in the right time, it all fit in one box so the space is well used"},{"reviewerName":"Kat","rating":"5.0 out of 5 stars","reviewTitle":"This camera and package is a phenomenal deal","reviewDate":"April 30, 2019","reviewText":"This camera and package is a phenomenal deal"},{"reviewerName":"lindsey demott","rating":"3.0 out of 5 stars","reviewTitle":"For beginners if you are looking for a cheap deal","reviewDate":"June 14, 2019","reviewText":"Everything that comes with the camera is super nice but when you zoom up it gets blurry and doesn’t focus at all"},{"reviewerName":"Jazzie Holt","rating":"5.0 out of 5 stars","reviewTitle":"ABSOLUTELY LOVE IT!!!","reviewDate":"June 24, 2017","reviewText":"This is a great bundle deal and the Canon EOS Rebel cameras take amazing pictures. You get more stuff in this bundle than you will ever need unless you're that professional photographer that likes to filter out and do special stuff with your effects on your pics as you take them. We took our to Mardi Gras in New Orleans this year and my husband took over 4,400 pictures on one battery before it ran down and needed recharging. My favorite lens is the 75-300mm lens because it gives you the chance to take up close and great pictures of a beehive from far enough away to not disturb or be threatened by the bees, but still get every detail of their honeycomb and can count the individual bees on it. I could go on and on about this camera and it's wonders, but I'm going to post a couple of pics that were taken with it, and let you judge for yourself. I guarantee you won't be disappointed with this bundle. PS: I had to resize all of these pics. Their original size was 6000 x 4000 set out at 18MP and were incredibly large files."},{"reviewerName":"Amy Cruz","rating":"5.0 out of 5 stars","reviewTitle":"Amazing","reviewDate":"March 14, 2019","reviewText":"It is amazing and easy to use! I love it!"},{"reviewerName":"Natasha W.","rating":"5.0 out of 5 stars","reviewTitle":"Love it though","reviewDate":"October 13, 2017","reviewText":"I was shocked with so many pieces that fitted in the box. Haven't really used it yet. Still reading up on how to use the Bluetooth /internet part. I want to take it out, snap some pictures and update my social pages in real time. Love it though!"},{"reviewerName":"HB","rating":"1.0 out of 5 stars","reviewTitle":"Blurry pictures","reviewDate":"August 17, 2018","reviewText":"I have only used this camera 3 times and now the pictures are blurry, I have searched Google to find out what could possibly cause this and I have tried all trouble shooting options and still nothing. I purchased it in October and now the return window has closed and I don't know what to do."},{"reviewerName":"Mary Lou Gingras","rating":"4.0 out of 5 stars","reviewTitle":"GREAT CAMERA- A BIT COMPLICATED","reviewDate":"January 16, 2019","reviewText":"My husband loves the camera. He is still a little overwhelmed with the instruction manual. He did talk to someone about this problem, however. The advice that he received was to go to UTube- there are some good videos that will walk him through some of the the different settings on the camera."},{"reviewerName":"Darell J","rating":"5.0 out of 5 stars","reviewTitle":"Awesome","reviewDate":"December 26, 2018","reviewText":"Enjoy the price and value. Planning many trips and it will be with on each vacation"},{"reviewerName":"JK","rating":"5.0 out of 5 stars","reviewTitle":"Good quality and fast shipping.","reviewDate":"January 5, 2019","reviewText":"As advertised and arrived in good condition with fast shipping.\nSeller reached out to with in a week after delivery to make sure everything was OK.\n\nI was looking for a looking for a starter kit for taking photos while traveling and I am happy with the camera and the gear supplied in the bundle."},{"reviewerName":"Samantha S.","rating":"3.0 out of 5 stars","reviewTitle":"The camera is amazing but shipping was not on time as promised AND ...","reviewDate":"July 23, 2017","reviewText":"The camera is amazing but shipping was not on time as promised AND the only thing that is canon brand is the camera and battery. The bag, AS shown as canon, is not."},{"reviewerName":"Amazon Customer","rating":"1.0 out of 5 stars","reviewTitle":"False advertising! The picture shows a. Uncle package ...","reviewDate":"January 15, 2017","reviewText":"False advertising! The picture shows a. Uncle package with everything in the picture. Nope! We only got the camera, lens, and battery charger. Don't go with this!"},{"reviewerName":"Lori Meyers","rating":"5.0 out of 5 stars","reviewTitle":"Amazing camera, great bundle","reviewDate":"July 12, 2017","reviewText":"Great value - lots of extras - very helpful if you're just starting out. Camera itself is awesome. I researched out the best camera for what I would use it for, and I am very happy. Having a blast with it!"},{"reviewerName":"Krissia Fonseca","rating":"5.0 out of 5 stars","reviewTitle":"this is the perfect camera for a beginner like me","reviewDate":"May 21, 2018","reviewText":"My firt DSLR camera! Got to say I am very impressed with how user friendly it is, picture quality is outstanding, this is the perfect camera for a beginner like me."},{"reviewerName":"Savannah","rating":"5.0 out of 5 stars","reviewTitle":"Great so far!","reviewDate":"January 13, 2019","reviewText":"This camera is great! My mom and I bought this together to share and we both love it so far! We haven’t had time to really get out and play with it, but so far we are completely satisfied with it. Definitely a good buy. Everything listed was in the package and we look forward to using it all!"},{"reviewerName":"Interested Consumer","rating":"5.0 out of 5 stars","reviewTitle":"Great value with lots of options!","reviewDate":"March 19, 2017","reviewText":"The camera and kit is great for my entry level needs. I love that I have so many options and accessories! The tripod is light weight but I didn't purchase it for the tripod!"},{"reviewerName":"Kimberly Humphrey","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"October 24, 2018","reviewText":"Wonderful quality pictures for beginner-intermediate."},{"reviewerName":"magnummary","rating":"5.0 out of 5 stars","reviewTitle":"Fantastic camera!","reviewDate":"July 26, 2016","reviewText":"Very impressed with the whole package! My husband bought this same camera in a store 6 weeks prior to me buying on line for myself as liked his camera so much. Came on said day they said would arrive and packaged very well. Amazed at all that came with the camera! My husband was jealous! Such wonderful pictures it takes. Just love,"},{"reviewerName":"RG","rating":"5.0 out of 5 stars","reviewTitle":"Great Camera. Don't forget to order batteries","reviewDate":"June 15, 2017","reviewText":"Great Camera. Don't forget to order batteries. It came with so many fun accessories but I was disappointed that I didn't realize the batteries were not included."},{"reviewerName":"Twinjuli","rating":"5.0 out of 5 stars","reviewTitle":"Great product and great service!","reviewDate":"February 9, 2017","reviewText":"Awesome! I was stressing as the first place I purchased from sent me a notice they were out of the bundle I ordered...it was for my older daughter's Christmas! So then I ordered this one and it was an even better deal!! Came as promised and was brand new and great quality as expected! Thank you so much for saving me! Highly recommend to others looking!"},{"reviewerName":"T.Irby","rating":"5.0 out of 5 stars","reviewTitle":"A+","reviewDate":"August 21, 2019","reviewText":"Great Bundle"},{"reviewerName":"Rick Johnson","rating":"5.0 out of 5 stars","reviewTitle":"Good package but needs a bigger bag","reviewDate":"May 14, 2018","reviewText":"Everything was as advertised. Very happy with package. As others stated the bag is small and too tight for everything and the tripod is very light duty but I already had one so no big deal. Still a great package and good value for the money"},{"reviewerName":"Clarence J.","rating":"5.0 out of 5 stars","reviewTitle":"Excellent","reviewDate":"June 4, 2019","reviewText":"Excellent! Much better than expected."},{"reviewerName":"Gregs Custom Fence","rating":"4.0 out of 5 stars","reviewTitle":"Great camera.","reviewDate":"December 17, 2017","reviewText":"Great camera ... I wish I had a video with some tips as to how to use the camera and all its functions."},{"reviewerName":"jennifer meller","rating":"4.0 out of 5 stars","reviewTitle":"Would highly recommend.","reviewDate":"February 10, 2017","reviewText":"Everything was just as described. My daughter loves the many options avalible in one place. The only reason that I can't give 5 stars is that the camera bag had two broken zippers but we did not discover that until we went to pack it all up to travel and it was too late to deal with so we had to use something else we had in the house. Would highly recommend."},{"reviewerName":"Robert Box","rating":"5.0 out of 5 stars","reviewTitle":"Camera and Kit are really good","reviewDate":"January 23, 2019","reviewText":"I'm a beginner photographer and will be using this camera to take shot of the merchandise I sell. The Camera is great, and the kit that comes with it is all I needed to start taking professional looking pictures. This was a great deal!"},{"reviewerName":"marcellious","rating":"5.0 out of 5 stars","reviewTitle":"I am totally amazed of all the items in your package","reviewDate":"May 4, 2017","reviewText":"Hi Jennifer, I am totally amazed of all the items in your package. Trust me when I say I researched your Canon t6 to others. No could compare, And yes we are enjoying the camera to the fullest. Thanks"},{"reviewerName":"Kevin Sikkema","rating":"4.0 out of 5 stars","reviewTitle":"Great Camera Package","reviewDate":"March 11, 2017","reviewText":"I love this set it was a lot more than i expected. This is my first time with DSLRs so i haven't have much opportunity yet to use much. But what i have used I would still recommend."},{"reviewerName":"Danny Ryan","rating":"5.0 out of 5 stars","reviewTitle":"This is the perfect dslr to learn on!","reviewDate":"May 8, 2019","reviewText":"Everything in the bundle will have its use. I purchased primarily for an upcoming trip. While learning the camera, it has quickly become my favorite. I would absolutely purchase this bundle if you are an amateur or just an instagrammers like myself."},{"reviewerName":"Valerie","rating":"5.0 out of 5 stars","reviewTitle":"Good option for beginner photographers","reviewDate":"July 12, 2018","reviewText":"Came with everything it said it would and everything works for the most part. I say that only because the mini tabletop tripod seems too shaky to support the camera itself, but I won't be using it anyway so it's not a deal breaker."},{"reviewerName":"Mike C.","rating":"5.0 out of 5 stars","reviewTitle":"The bundle is great","reviewDate":"October 9, 2018","reviewText":"Canon cameras quality speaks for itself but the bundled accessories in this package give you an entire photography setup in one purchase. Very happy with everything I received."},{"reviewerName":"Ted","rating":"4.0 out of 5 stars","reviewTitle":"some good. The telephoto lens was a miss","reviewDate":"May 11, 2017","reviewText":"Wanted the camera, some of the kit is junky, some good. The telephoto lens was a miss, traded it off. Camera just what I wanted. Wear the price"},{"reviewerName":"Amazon Customer","rating":"4.0 out of 5 stars","reviewTitle":"Broken tripod mountain bracket/head","reviewDate":"January 22, 2019","reviewText":"Product arrived on time. The product performance was excellent and took beautiful pictures of trip. The only complaint is that the tripod I received mounting head was broken. Otherwise, the product is great."},{"reviewerName":"Fresh Face Dace","rating":"5.0 out of 5 stars","reviewTitle":"Excellent Product at a great value price!","reviewDate":"January 7, 2019","reviewText":"Got this for our son for Christmas. He has not put it down since! Love all the extra accessories that come with, including and extra lense, carrying case and tri-pod. Great value!"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"I really love this new camera","reviewDate":"May 21, 2017","reviewText":"I really love this new camera. I have never owned a DSLR camera before and wanted to start photography as a new hobby. I purchased this set-up for a trip to the Grand Canyon and wanted to get better pictures than my iphone could take. I was not disappointed. With no experience using a camera like this, I was very happy with how easy it was to take great photos. I'm still learning, but am really pleased the quality of the photos and the ease of use.\n\nThe bonus accessories included in this bundle are fantastic. I will have to learn how to use the filters and additional lenses, but what a great value. For the same price that I would have paid for just the camera with EF-S 18-55mm f/3.5-5.6 IS II Lens and EF 75-300mm f/4-5.6 III Lens at a major electronics retailer,I got a whole lot more.\n\nThe extra digital camera flash isn't high-end by any means, and found that mine was not working. I contacted the folks at Photo Savings to let them know the issue and they quickly sent a replacement. I found their customer service and responsiveness to be excellent.\n\nI would recommend this package deal and buying from Photo Savings."},{"reviewerName":"Eric","rating":"5.0 out of 5 stars","reviewTitle":"I love it!","reviewDate":"February 16, 2017","reviewText":"I'm fairly new to photography and this is my first DSLR. The package arrived very quickly and everything was included as advertised. The camera itself is very nice and right away I was taking some great photos. Now I take the camera everywhere I go and I am loving my new hobby. I would definitely recommend this product and seller to a friend."},{"reviewerName":"Roy D","rating":"5.0 out of 5 stars","reviewTitle":"Excellent buy","reviewDate":"February 8, 2017","reviewText":"This is an excellent camera, worth its value, works greater than I expected and easier to use & understand. Plus it works great with this app on my tablet. The only thing left is my creativity & getting those projects ."},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Great buy","reviewDate":"May 13, 2019","reviewText":"Taking pictures"},{"reviewerName":"Jamie","rating":"4.0 out of 5 stars","reviewTitle":"No battery?","reviewDate":"August 28, 2018","reviewText":"I like the photos I'm taking. Some functions were a little difficult to find initially but that could have operator error.\n\nMy only complaint is that it didn't come with a battery. Luckily I ordered extra with my initial purchase."},{"reviewerName":"Sujith Karnati","rating":"4.0 out of 5 stars","reviewTitle":"Awesome camera","reviewDate":"September 12, 2019","reviewText":"With this camera i got lot of good clicks if you're a wild life photographer this camera is awesome always"},{"reviewerName":"Linda Perkins","rating":"5.0 out of 5 stars","reviewTitle":"... this computer and am learning how to use it better everyday! Great price and great value","reviewDate":"April 6, 2018","reviewText":"I am enjoying this computer and am learning how to use it better everyday! Great price and great value!"},{"reviewerName":"K. Hollingsworth","rating":"5.0 out of 5 stars","reviewTitle":"Best quality for best price!!","reviewDate":"January 8, 2019","reviewText":"I loved that it shipped quickly. Everything was included in the box. A great value bundle for the price, the best price!!! I had searched many sites."},{"reviewerName":"preslee","rating":"4.0 out of 5 stars","reviewTitle":"Amazing product, amazing company.","reviewDate":"March 14, 2019","reviewText":"Shipping was quick, product is exactly what I was hoping for and company that sold it is amazing. Definitely a great buy. Camera doesnt auto focus great but I'm also new to this camera. Still love it and enjoying the beautiful pictures it takes!!"},{"reviewerName":"Michael Yearout","rating":"5.0 out of 5 stars","reviewTitle":"Great camera","reviewDate":"May 28, 2019","reviewText":"Love"},{"reviewerName":"SandraH","rating":"5.0 out of 5 stars","reviewTitle":"Great buy","reviewDate":"November 15, 2016","reviewText":"This purchase was one that my 13 year old granddaughter had researched and saved her money to purchase. I have a similar camera for which I paid much more, and did not receive nearly the extras that this one offered. She is still learning how to use it, but she is very pleased with this camera."},{"reviewerName":"Guido","rating":"5.0 out of 5 stars","reviewTitle":"Bargain Price","reviewDate":"January 8, 2019","reviewText":"Great price and quick delivery. Got everything we need in one bundle."},{"reviewerName":"randi","rating":"1.0 out of 5 stars","reviewTitle":"not used much and is malfunctioning","reviewDate":"January 8, 2019","reviewText":"I have only used the camera for a total of 2 hours and it is malfunctioning. I am not happy"},{"reviewerName":"William James Tilton","rating":"5.0 out of 5 stars","reviewTitle":"Great photos, good price for everything included","reviewDate":"January 10, 2019","reviewText":"This camera takes fantastic pictures. It was a Christmas gift, my girlfriend loves it. We both got some great pictures on a trip we recently took. The box set itself was a good price for everything included."},{"reviewerName":"Alexandria C.","rating":"5.0 out of 5 stars","reviewTitle":"Great for a novice","reviewDate":"February 6, 2019","reviewText":"This bundle was a great purchase for my small business, Indulge Pure Originals. I was looking to take some better quality product photography, and this does just the trick."},{"reviewerName":"Ashley H. Bowles","rating":"5.0 out of 5 stars","reviewTitle":"I love my camera","reviewDate":"September 17, 2017","reviewText":"I love my camera, still getting use to it though. My husband laughs at me cause I get so excited about taking pictures. I give it 5 stars!"},{"reviewerName":"andrea","rating":"5.0 out of 5 stars","reviewTitle":"Easy To Use Camera","reviewDate":"October 8, 2018","reviewText":"This was my first experience with a camera, other than just using my cellphone and I was able to take high quality photographs almost immediately. I am still learning more about how to use all of the features of the camera ; however, at this point I can definitely recommend."},{"reviewerName":"tommy lara","rating":"4.0 out of 5 stars","reviewTitle":"Four Stars","reviewDate":"May 3, 2018","reviewText":"this is a great package for the price."},{"reviewerName":"David","rating":"5.0 out of 5 stars","reviewTitle":"Great bundle at an unbeatable price","reviewDate":"December 30, 2016","reviewText":"Love it, love it, love it! Purchased as a gift for my wife and she absolutely loves it. High quality camera with incredible bundle at an unbeatable price! Highly reccomended"},{"reviewerName":"NV Dragon","rating":"5.0 out of 5 stars","reviewTitle":"Awesome package","reviewDate":"August 2, 2018","reviewText":"Used often, takes some great pictures and video"},{"reviewerName":"Chiliqua","rating":"5.0 out of 5 stars","reviewTitle":"Great camera","reviewDate":"May 23, 2018","reviewText":"Great camera. Takes excellent pictures. Awesome price for the bundle."},{"reviewerName":"Eileen C","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"April 10, 2018","reviewText":"Well worth the price takes great pictures and able to post on computer and ipad"},{"reviewerName":"Bernice Freeman","rating":"5.0 out of 5 stars","reviewTitle":"Great camera/great company!","reviewDate":"February 21, 2017","reviewText":"I stumbled on the Photo Savings group while researching the Canon EOS Rebel T6 DSLR. I have been using Canon Powershot SX30 and wanted to step-up a bit. Once I decided on the camera, I decided to buy it through Photo Savings. I'm enjoying getting to know this camera. The color definitions are spot on! And I've been nothing but impressed and satisfied with the Photo Savings group! The T6 \"bundle\" arrived within a few days of placing the order. Everything was brand new and securely packaged. It's a great package: the Canon camera body, 2 Canon lenses (18-55 and 75-300 zoom), and 2 Vivitar lenses (wide angle and closeup), camera bag, a variety of filters, lightweight extendable-legs tripod and a small table-top tripod, SD cards, lens cloths, battery & recharge unit....everything you need. (I already had a heavy duty tripod but it's nice to have this second one as a backup.) A small bottle of lens cleaner fluid was missing; I contacted Jennifer at Photo Savings and it was sent right out to me.\nBottom line: great camera and great company!"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"I couldn't be happier! This camera is by far the best I ...","reviewDate":"September 11, 2016","reviewText":"I couldn't be happier! This camera is by far the best I have Ever owned! If your looking for starter package and a good deal, This is the ONE!"},{"reviewerName":"JCR","rating":"5.0 out of 5 stars","reviewTitle":"Good camera bundle package","reviewDate":"September 28, 2017","reviewText":"I bought this for my 16 yrs daughter and she loves it. It has a lot of accessories. The only thing I would add is another set of batteries, cause it only comes with one."},{"reviewerName":"Rich O.","rating":"5.0 out of 5 stars","reviewTitle":"Camera","reviewDate":"January 9, 2019","reviewText":"The camera was for our 14 year old that is taking commercial photography.\n\nShe likes it and thinks it's great. Believe me, if there was a flaw with it, she would be conplaining."},{"reviewerName":"Justin","rating":"5.0 out of 5 stars","reviewTitle":"A+ quality and all contents are shipped. No jokes","reviewDate":"February 2, 2019","reviewText":"Hobby, got my wife started with what I would call intro to photography and she loves it. Camera has great quality and ease of use. Also NFC capabilities are phenomenal and unparalleled to other cameras. Would buy again if I had too"},{"reviewerName":"Margaret Contor","rating":"5.0 out of 5 stars","reviewTitle":"Delivered as Promised","reviewDate":"January 22, 2019","reviewText":"I purchased this product as a Christmas gift. I know the recipient was very excited about this gift. I was pleased with delivery of the product as promised. I can't rate ease of use or picture quality."},{"reviewerName":"WQuin","rating":"5.0 out of 5 stars","reviewTitle":"Great bundle","reviewDate":"January 18, 2019","reviewText":"This Camera bundle is great and very useful. Brings all you need to start! Great price / High/value"},{"reviewerName":"Brian C.","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"January 13, 2017","reviewText":"The perfect xmas gift for my son. He loves it for taking the next step into photos"},{"reviewerName":"Omar Gamboa","rating":"5.0 out of 5 stars","reviewTitle":"Great value, Great product.","reviewDate":"December 15, 2018","reviewText":"I love the quality when it comes to pictures and easy to use."},{"reviewerName":"Idatex","rating":"5.0 out of 5 stars","reviewTitle":"Professional quality","reviewDate":"January 7, 2018","reviewText":"Think I have a great new hobby with this fantastic product."},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Nice","reviewDate":"November 27, 2018","reviewText":"Nice"},{"reviewerName":"Jennifer P","rating":"5.0 out of 5 stars","reviewTitle":"Great package deal!","reviewDate":"December 22, 2018","reviewText":"The package was a great deal and came with everything to get started right away."},{"reviewerName":"Larry Allen","rating":"5.0 out of 5 stars","reviewTitle":"Great","reviewDate":"January 7, 2019","reviewText":"Great"},{"reviewerName":"jr2128","rating":"5.0 out of 5 stars","reviewTitle":"My best camera ever.","reviewDate":"January 8, 2019","reviewText":"Love...love .....love it."},{"reviewerName":"victor","rating":"5.0 out of 5 stars","reviewTitle":"100% recomendado.","reviewDate":"June 29, 2018","reviewText":"Mi primera camara. Excelente elección."},{"reviewerName":"Stephanie V.","rating":"5.0 out of 5 stars","reviewTitle":"Excellent package. I love it.","reviewDate":"September 7, 2018","reviewText":"Very good quality."},{"reviewerName":"Tina","rating":"5.0 out of 5 stars","reviewTitle":"Excellent camera ... worth the price!","reviewDate":"June 15, 2016","reviewText":"I love my new camera. I had a small issue with a lens, but PhotoSavings fixed it right away. The quality of my pictures are so great... now if i can just learn all the new features :)"},{"reviewerName":"Eduardo","rating":"5.0 out of 5 stars","reviewTitle":"Very good product","reviewDate":"March 27, 2019","reviewText":"Fantastic"},{"reviewerName":"Katie","rating":"5.0 out of 5 stars","reviewTitle":"Great camera","reviewDate":"January 3, 2017","reviewText":"Perfect camera, great accessories were included. The battery lasts extremely long. I have had it for over a month and have only needed to charge it once or twice."},{"reviewerName":"Randy Smith","rating":"5.0 out of 5 stars","reviewTitle":"This is by far the best value for everything you get here","reviewDate":"February 9, 2017","reviewText":"I bought this bundle as a gift for my wife. I cannot describe how much she LOVES it! This is by far the best value for everything you get here. For a starter kit for the beginner to intermediate photographer, you wont find a better deal."},{"reviewerName":"Pete","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"April 23, 2017","reviewText":"Excellent kit for beginners and semi pros, would be wonderful to have an instructional disc on fearures and operation."},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"I love the fact that it was a turn key kit","reviewDate":"November 11, 2016","reviewText":"I got this for my shutterbug wife and she absolutely loves it. I love the fact that it was a turn key kit. It had everything she needed to jump in with both feet and start taking professional quality pictures. The price was great too."},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"April 6, 2018","reviewText":"very good work"},{"reviewerName":"Tracy Gibson","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"December 8, 2017","reviewText":"I like but I ordered the wrong one."},{"reviewerName":"Selene Guerra","rating":"5.0 out of 5 stars","reviewTitle":"Great buy","reviewDate":"February 4, 2019","reviewText":"Bought this for my son! He loves it and it's was nice for his first camera because it had a lot of extras from this seller! The camera is easy to use and he takes pictures everywhere he goes!"},{"reviewerName":"Hunter hill","rating":"5.0 out of 5 stars","reviewTitle":"Great camera","reviewDate":"March 20, 2019","reviewText":"Great for beginners. I would say take a class to get to know more about photography or videography and just have fun with the camera. It takes really good pictures in great quality"},{"reviewerName":"D. Aguinaldo","rating":"3.0 out of 5 stars","reviewTitle":"Well priced but a bit of work to use.","reviewDate":"February 17, 2017","reviewText":"Did not realize how difficult it would be to use this camera. The quality of photos are good however. External charging of battery is unexpected and awkward"},{"reviewerName":"Ty","rating":"5.0 out of 5 stars","reviewTitle":"The perfect affordable bundle","reviewDate":"January 12, 2019","reviewText":"I've wanted this for 2 years lol do happy with this purchase!"},{"reviewerName":"Adele","rating":"5.0 out of 5 stars","reviewTitle":"Great Camera Package","reviewDate":"October 11, 2018","reviewText":"This was my first camera ever purchased and I'm happy to say that I am very pleased with the overall product and what this package includes. Great beginner camera with all the accessories to get started."},{"reviewerName":"April M.","rating":"5.0 out of 5 stars","reviewTitle":"Great purchase","reviewDate":"July 30, 2017","reviewText":"Bought this camera for my daughter-law. She takes many many photos. She is absolutely in love with this camera. The photos I've seen with camera are amazing! Its worth every penny I spent!!!"},{"reviewerName":"Raymond Chesley","rating":"5.0 out of 5 stars","reviewTitle":"I was very happy with my order","reviewDate":"May 9, 2018","reviewText":"Thanks. I was very happy with my order. Received it faster then thought. Good price."},{"reviewerName":"dan ridgley","rating":"5.0 out of 5 stars","reviewTitle":"It's worth every single penny!","reviewDate":"November 3, 2017","reviewText":"My girlfriend absolutely loves this and it takes professional pictures!"},{"reviewerName":"Bjc","rating":"5.0 out of 5 stars","reviewTitle":"Very Happy","reviewDate":"September 13, 2017","reviewText":"I received everything as described. It's really a nice starter set."},{"reviewerName":"Sue","rating":"5.0 out of 5 stars","reviewTitle":"Great Deal","reviewDate":"August 31, 2016","reviewText":"This came exactly as advertised. Great product for the price. The camera takes great pictures. Everything works as described. Very pleased with purchase"},{"reviewerName":"Montanafan","rating":"5.0 out of 5 stars","reviewTitle":"Fantastic package!","reviewDate":"May 31, 2018","reviewText":"Did a lot of research and this was the best package by far! Great accessories, you're ready to go for any trip, activity, don't need to buy another item. Pictures are amazing, highly recommend both package and seller!"},{"reviewerName":"James","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"February 1, 2018","reviewText":"Bought for my Bride for Christmas. She’s loving it!"},{"reviewerName":"krista Kulow","rating":"5.0 out of 5 stars","reviewTitle":"THE BEST","reviewDate":"February 12, 2017","reviewText":"I have wanted a camera like this for years and it has exceeded my expectations. I would recommend this to anyone and everyone."},{"reviewerName":"ZORAIDA Molina","rating":"5.0 out of 5 stars","reviewTitle":"👍🏼 A tiempo, precio Justo, buena calidad.","reviewDate":"January 6, 2019","reviewText":"👍🏼"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"This camera is awesome and the package comes with everything you need for your starter kit","reviewDate":"January 21, 2019","reviewText":"Amazing camera! I have way too many photos of my dogs now :)"},{"reviewerName":"Amazon Customer","rating":"4.0 out of 5 stars","reviewTitle":"the camera works fine, was in good shape when it arrived","reviewDate":"February 10, 2017","reviewText":"the camera works fine ,was in good shape when it arrived .I have found it other places a bit cheaper and the other one comes with a instruction DVD. Other than that it showed up when was supposed to and am generally happy with it and you!"},{"reviewerName":"Bree","rating":"5.0 out of 5 stars","reviewTitle":"Great deal on a bundle","reviewDate":"January 7, 2019","reviewText":"Great deal. Camera is fabulous. Just like if i bought it from bestbuy but better price."},{"reviewerName":"John Kozakar","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"October 23, 2017","reviewText":"great product, good price"},{"reviewerName":"Carl D.","rating":"5.0 out of 5 stars","reviewTitle":".","reviewDate":"May 12, 2019","reviewText":"Good price"},{"reviewerName":"HNIC","rating":"5.0 out of 5 stars","reviewTitle":"Great experience","reviewDate":"May 9, 2017","reviewText":"Great price e and quick shipping. What more can you ask for? I would buy from them again. 5 stars."},{"reviewerName":"Bill Taylor","rating":"5.0 out of 5 stars","reviewTitle":"Great camera","reviewDate":"March 11, 2019","reviewText":"Haven't used a lot yet so a little over my ability. I am extremely happy with the camera and excited to use it to it's full abilities."},{"reviewerName":"Carla D","rating":"5.0 out of 5 stars","reviewTitle":"Great deal! Some of the accessories I probably won't ...","reviewDate":"May 14, 2018","reviewText":"Great deal! Some of the accessories I probably won't use, but still, a great deal and the camera is awesome."},{"reviewerName":"Jamie","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"June 6, 2018","reviewText":"amazing!!!!! I use this all the time. Everything works well and is just plain awesome."},{"reviewerName":"Mary C. Dunn","rating":"5.0 out of 5 stars","reviewTitle":"This bundle is top notch!","reviewDate":"April 26, 2017","reviewText":"A really nice bundle. It is perfect for what I am doing plus fast delivery."},{"reviewerName":"AP","rating":"2.0 out of 5 stars","reviewTitle":"Received prompt before date delivery. Sorry to say, ...","reviewDate":"February 5, 2018","reviewText":"Received prompt before date delivery.\nSorry to say, package do not contain said item. Missing important component of digital photography - memory card (which was supposed to be in the package)."},{"reviewerName":"Michael Pitre","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"October 1, 2017","reviewText":"Really happy with my purchase. This was a great deal and quality camera."},{"reviewerName":"Burris","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"February 5, 2018","reviewText":"Most bang for your buck"},{"reviewerName":"Rice","rating":"3.0 out of 5 stars","reviewTitle":"Wi-Fi issue","reviewDate":"December 4, 2016","reviewText":"Great camera! Unsure on the wi if part of it the remote thing says not applicable w windows 10. Not at all sure I'm doing this correctly.\nIs there software or app that is current for Windows 10?"},{"reviewerName":"ItsAntDigga","rating":"5.0 out of 5 stars","reviewTitle":"A Happy Customer","reviewDate":"October 23, 2017","reviewText":"Mdse arrived as described. I am very happy with theCamera and very satisfied with the service."},{"reviewerName":"charles","rating":"5.0 out of 5 stars","reviewTitle":"I love the whole kit","reviewDate":"December 26, 2016","reviewText":"I love the whole kit , the camera itself is great , took so many nice pictures with it that it paid itself already!!!"},{"reviewerName":"Stephanie","rating":"5.0 out of 5 stars","reviewTitle":"awesome","reviewDate":"January 25, 2019","reviewText":"Was a gift!"},{"reviewerName":"Jessica","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"October 19, 2017","reviewText":"This camera takes GREAT pictures!! I love it!!"},{"reviewerName":"Romoalej","rating":"5.0 out of 5 stars","reviewTitle":"... is ir justo What I need and it is excellent.","reviewDate":"September 18, 2017","reviewText":"I received the camera and is ir justo What I need and it is excellent."},{"reviewerName":"Kindle Customer","rating":"4.0 out of 5 stars","reviewTitle":"So far everything is great!","reviewDate":"January 7, 2019","reviewText":"I haven't used everything in the bundle yet, but what I have used is great. Camera takes awesome action shots and zooms in quite well. The bundle came with everything listed on ad."},{"reviewerName":"scott martin","rating":"5.0 out of 5 stars","reviewTitle":"Great camera","reviewDate":"February 19, 2019","reviewText":"Took a while to get here but we’ll worth the wait great price great accessories nice beginners camera"},{"reviewerName":"Hendra","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"April 12, 2018","reviewText":"Loved it so far"},{"reviewerName":"dennis","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"November 16, 2017","reviewText":"excellent, as expected"},{"reviewerName":"Kindle Customer","rating":"5.0 out of 5 stars","reviewTitle":"No problems, all items came in as advertised.","reviewDate":"June 28, 2016","reviewText":"Everything came as ordered. No issues with any of the equipment EXCEPT that the gear bag was too small. However, I purchased a larger one which is just fine."},{"reviewerName":"SirenL","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"January 12, 2017","reviewText":"Great deal, lots to learn - thankyou!"},{"reviewerName":"CannaRay","rating":"5.0 out of 5 stars","reviewTitle":"Great deal","reviewDate":"January 2, 2017","reviewText":"MY wife loves this camera! Great deal and you get everything you need to start taking great pictures."},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"October 15, 2016","reviewText":"I love my camera so so much."},{"reviewerName":"Cristobal De Sasia","rating":"5.0 out of 5 stars","reviewTitle":"Great!!! but limited to its price","reviewDate":"January 22, 2019","reviewText":"Camera worked amazingly with no problems just didn’t have the video features we were hoping for, it’s a great camera for those who’d only need it for its picture functions"},{"reviewerName":"Debra A. Dreyer","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"September 17, 2017","reviewText":"Love the camera, a lot to learn about it."},{"reviewerName":"E.S.","rating":"5.0 out of 5 stars","reviewTitle":"Great stuff.","reviewDate":"May 24, 2017","reviewText":"Bundle included everything shown. Arrived quickly and on time. Would definitely make another purchase."},{"reviewerName":"Pugsrule","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"September 7, 2017","reviewText":"I love it. I've been using Canon camera for the last 40 years"},{"reviewerName":"Christine B Bouchie","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"July 18, 2017","reviewText":"Love it, lots of things I may never use because of my experience level but fun to experiment."},{"reviewerName":"Pat","rating":"5.0 out of 5 stars","reviewTitle":"Highly recommend","reviewDate":"May 8, 2017","reviewText":"This camera and the accompanied accessories are well made. This is a great camera for a first time buyer.\nIt was packed and protected very well. There were no unwelcome surprises or broken things."},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"My camera","reviewDate":"January 10, 2019","reviewText":"I love my camera and the accessories that came with it. This was the best gift my family could have gotten me."},{"reviewerName":"LaurieOnTheAir","rating":"1.0 out of 5 stars","reviewTitle":"... \"busy\" issues and (for a Canon) was quite a disappointment. We returned it immediately","reviewDate":"October 18, 2017","reviewText":"Camera continually had \"busy\" issues and (for a Canon) was quite a disappointment. We returned it immediately."},{"reviewerName":"Chad A.","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"July 12, 2017","reviewText":"Great starter kit. I purchased this for my wife and she loves it."},{"reviewerName":"Boxergirl","rating":"4.0 out of 5 stars","reviewTitle":"Great package","reviewDate":"May 12, 2017","reviewText":"Love this camera, not as heavy as my older Nikon DSL. Takes great pictures."},{"reviewerName":"Karin Berthiaume","rating":"5.0 out of 5 stars","reviewTitle":"Great gift!","reviewDate":"February 10, 2017","reviewText":"This was a gift for our son. He sends this review: \"Overall, it’s been a great product, especially for a beginner. There are some components that I’m not sure are necessary/are extra for a DSLR camera (like that baby tripod) but overall great for getting accustomed to the device.\""},{"reviewerName":"Cindy Lammers","rating":"5.0 out of 5 stars","reviewTitle":"Loving my new canon","reviewDate":"September 25, 2018","reviewText":"I love my new camera!! I finally had a chance to use it for a wedding.. I'm looking forward to trying out the different lenses when we go to Mount Rushmore in a couple of weeks!"},{"reviewerName":"Dean Leh","rating":"5.0 out of 5 stars","reviewTitle":"I am very pleased with this purchase","reviewDate":"March 23, 2017","reviewText":"I am very pleased with this purchase. The camera and the various parts of the package are awesome. The transaction was smooth and superlative. Dean Leh"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Great camera, accessories, And price!","reviewDate":"March 23, 2017","reviewText":"I've just barely started using this camera, but I'm very happy with it so far. The entire bundle came quickly and I'm really happy with the price of all that was included!! Really, a great purchase!"},{"reviewerName":"Inya Newsome","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"January 5, 2017","reviewText":"I love my camera haven't used all the functions yet but will learn"},{"reviewerName":"Judi Bright","rating":"5.0 out of 5 stars","reviewTitle":"as promised!!","reviewDate":"October 25, 2017","reviewText":"great product! sent in timely fashion!"},{"reviewerName":"Otie","rating":"5.0 out of 5 stars","reviewTitle":"Good source of Canon Camera","reviewDate":"December 30, 2016","reviewText":"Well packaged, no damage, Excellent camera and accessories"},{"reviewerName":"Debbie","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"February 9, 2017","reviewText":"We absolutely love this camera and great accessory package. Excellent care with shipping. Would purchase again from this seller"},{"reviewerName":"SGT Arce, Javier","rating":"5.0 out of 5 stars","reviewTitle":"Amazing camera bundle","reviewDate":"February 13, 2017","reviewText":"This Canon camera is great, it makes me look like a pro. For a starter camera it is great. Now this whole package is the best, basically everything you need to start is included, good quality and shipped in a very safe way. Fast shipping and great quality."},{"reviewerName":"SAM57","rating":"5.0 out of 5 stars","reviewTitle":"Love it!","reviewDate":"January 1, 2017","reviewText":"Camera is very easy to use with accessories. Take great pics!"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Great accessories.","reviewDate":"January 22, 2018","reviewText":"My daughter loves it. Great accessories."},{"reviewerName":"RAYMOND LAM","rating":"5.0 out of 5 stars","reviewTitle":"Fast delivery! Everything i needed.","reviewDate":"November 6, 2017","reviewText":"Fast delivery ! Everything i needed."},{"reviewerName":"Madmax","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"September 13, 2017","reviewText":"Very pleased with product(s) and vendor."},{"reviewerName":"dana elliott","rating":"5.0 out of 5 stars","reviewTitle":"Excellent value","reviewDate":"January 18, 2019","reviewText":"Ease of use. For the beginners excellent value wrapped in the bundle. The quality of photos is beyond expectations."},{"reviewerName":"ERICK CRUZ","rating":"5.0 out of 5 stars","reviewTitle":"TOTALLY BEAUTIFUL","reviewDate":"November 28, 2018","reviewText":"Excellent product, it’s awesome and complete!"},{"reviewerName":"Harold A. Stefan","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"July 20, 2017","reviewText":"I'm very happy with the package"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Arrived as Expected","reviewDate":"October 9, 2018","reviewText":"Arrived just as I expected. A good transaction:)"},{"reviewerName":"Michael Jay Smith","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"December 22, 2016","reviewText":"This is a great camera and more than worth the money. The seller was great to work with also."},{"reviewerName":"Stephen Gill","rating":"5.0 out of 5 stars","reviewTitle":"I am totally happy with the product that I got it is amazing ...","reviewDate":"December 13, 2016","reviewText":"I am totally happy with the product that I got it is amazing I would recommend it to everyone I know that is looking to get into photography.But ! :)\nYou did forget to put in the tabletop tripod other than that it is perfect!!!!!\nIt is so perfect I'm not going to send it just to get the table top tripod because I love it that much and my wife loves it that much I gave it to her early for Christmas because we went to Sea World in San Diego and swam with the dolphins. And she was just extremely excited grateful and Overjoyed with the performance and the quality and the service that we received and the product that we received. So the only thing I ask is that you send me tabletop tripod. We have never used a camera like this before and these are just a few of the pictures that were taken net worth absolutely every penny thank you!"},{"reviewerName":"jose bello","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"November 14, 2017","reviewText":"verygood"},{"reviewerName":"Katie Predmore","rating":"5.0 out of 5 stars","reviewTitle":"Camera works great, I am a novice and I enjoy trying ...","reviewDate":"March 3, 2017","reviewText":"I am very pleases wroth the camera bundle. Camera works great, I am a novice. I enjoy trying new setting and like the automatic setting too"},{"reviewerName":"Mary G","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"September 8, 2017","reviewText":"Perfect. Absolutely as described and lightening-fast delivery. Order with confidence."},{"reviewerName":"Mariene Toledo","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"February 12, 2017","reviewText":"I am very happy with the purchase... Easy to use... Great pictures and features. Thank you!"},{"reviewerName":"Vmccomack","rating":"5.0 out of 5 stars","reviewTitle":"Nice Camera, Wonderful deal!","reviewDate":"January 16, 2018","reviewText":"BEST Value for the money!"},{"reviewerName":"Roberto Borda","rating":"5.0 out of 5 stars","reviewTitle":"This package exceeded my expectation. I will highly recomkend ...","reviewDate":"September 27, 2017","reviewText":"This package exceeded my expectation. I will highly recomkend it for anyone considering starting to learn digital photography. The package has everything you might need."},{"reviewerName":"Javiera Paz Pernas","rating":"5.0 out of 5 stars","reviewTitle":"I'm very happy with my camera","reviewDate":"December 7, 2017","reviewText":"I'm very happy with my camera, still learning to use it.\nThe bag could be bigger, because I can't keep all the accesories in it"},{"reviewerName":"Ofuje Daniyan","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"April 7, 2018","reviewText":"Great, great, great"},{"reviewerName":"chantal","rating":"2.0 out of 5 stars","reviewTitle":"... few of the items shown in picture But still love the camrea","reviewDate":"January 21, 2017","reviewText":"Missing few of the items shown in picture\nBut still love the camrea"},{"reviewerName":"Rosa","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"March 7, 2018","reviewText":"Love it !!"},{"reviewerName":"Bling","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"July 31, 2017","reviewText":"Love this camera kit. Takes great pictures."},{"reviewerName":"Kassandra Hill","rating":"3.0 out of 5 stars","reviewTitle":"Three Stars","reviewDate":"March 7, 2018","reviewText":"LOVED the camera however, the case had a huge cut going down the middle in the front."},{"reviewerName":"LUIS A. RUIZ","rating":"5.0 out of 5 stars","reviewTitle":"Amazing","reviewDate":"December 31, 2016","reviewText":"Amazing package, more than I bargained for. I've been using it for a month and have encounter endless photographic possibilities."},{"reviewerName":"Scott Gregg","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"February 9, 2017","reviewText":"Great camera and an amazing price for what all you get. Takes wonderful pictures."},{"reviewerName":"Sci-Fi Reader","rating":"5.0 out of 5 stars","reviewTitle":"Nice package. I like the camera","reviewDate":"September 30, 2017","reviewText":"Nice package. I like the camera, the lenses cover all of my requirements, and the case is well made and handy. All in all a great way to get everything you require for the Canon Rebel T6 at a most excellent price. Thank you."},{"reviewerName":"Alma","rating":"5.0 out of 5 stars","reviewTitle":"Very nice camera!","reviewDate":"September 1, 2019","reviewText":"Love it!"},{"reviewerName":"W. Stohs","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"November 10, 2016","reviewText":"Great quality product. Everything that you see in the picture is included. Very happy with my purchase."},{"reviewerName":"Conny F.","rating":"5.0 out of 5 stars","reviewTitle":"Just awesome. Love it","reviewDate":"July 17, 2016","reviewText":"Awesome camera with more than I need for the start. Fast delivery"},{"reviewerName":"Hays County Young Life","rating":"5.0 out of 5 stars","reviewTitle":"Received everything on time and in great condition. Went on vacation and had a great ...","reviewDate":"August 1, 2018","reviewText":"Received everything on time and in great condition. Went on vacation and had a great time with camera while away. Can't wait to check out all the accessories. Thanks. 5 stars"},{"reviewerName":"Alexis","rating":"5.0 out of 5 stars","reviewTitle":"Amazing product","reviewDate":"March 25, 2019","reviewText":"Better than my previous camera I bought. I can't wait for the flowers to bloom so I can really take some awesome pictures."},{"reviewerName":"trevor lea","rating":"5.0 out of 5 stars","reviewTitle":"I love this camera","reviewDate":"May 27, 2019","reviewText":"Everything was packaged and present as listed. The camera overall is awesome. Shipping was fast and I got what I paid for."},{"reviewerName":"Ana Virginia Artavia Martinez","rating":"5.0 out of 5 stars","reviewTitle":"Cámara fotográfica","reviewDate":"August 30, 2018","reviewText":"Demasiado buena. Me fascino"},{"reviewerName":"Candace Tucker","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"February 12, 2017","reviewText":"Great price for a great starter set."},{"reviewerName":"Rosa Moreira","rating":"5.0 out of 5 stars","reviewTitle":"Excellent","reviewDate":"January 5, 2019","reviewText":"I love!!! It's all that i need"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"awesome camera","reviewDate":"October 25, 2018","reviewText":"Great camera and kit for someone getting into photography. price is outstanding for everything you get. 5 star all the way"},{"reviewerName":"Tj","rating":"5.0 out of 5 stars","reviewTitle":"Fantastic bundle for a great price","reviewDate":"February 22, 2017","reviewText":"Everything came in exactly as I'd expected it -- brand new and ready to go. I love the camera so far, and the accessories are great as well. Yes, some of the accessories (such as the flash fill) are off-brand, but they work every bit as well as their name brand counterparts for an unbeatable price."},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Great value in this kit","reviewDate":"September 20, 2018","reviewText":"We use this camera all the time. The kit contains everything we need."},{"reviewerName":"Snoopy","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"August 6, 2017","reviewText":"A great buy."},{"reviewerName":"TruthUncensored","rating":"5.0 out of 5 stars","reviewTitle":"Says it's a great package and has pretty much everything she wanted/needed","reviewDate":"December 8, 2016","reviewText":"Got as a birthday gift for my wife. She loves it. Says it's a great package and has pretty much everything she wanted/needed!"},{"reviewerName":"John M Nelson","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"February 28, 2017","reviewText":"Very nice package"},{"reviewerName":"Leon L. Mykietyn","rating":"4.0 out of 5 stars","reviewTitle":"Four Stars","reviewDate":"December 5, 2016","reviewText":"Camera's working great. I got everything that I was suppose to."},{"reviewerName":"Mike","rating":"5.0 out of 5 stars","reviewTitle":"Highly Recommended","reviewDate":"May 13, 2017","reviewText":"Great value, and an excellent camera."},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"September 4, 2016","reviewText":"THIS IS REALLY A BONUS GIFT.YOU WONT REGRET THIS"},{"reviewerName":"Amazon Customer","rating":"4.0 out of 5 stars","reviewTitle":"and this camera is just great! it takes really nice photos and is simple ...","reviewDate":"February 8, 2017","reviewText":"i'm not a professional photographer by any means, and this camera is just great! it takes really nice photos and is simple enough for me to play around with a figure out.\nwhen my package arrived, the tripod was broken, but the customer service was awesome and they sent me a new one right away!"},{"reviewerName":"Alberto","rating":"5.0 out of 5 stars","reviewTitle":"Loved It!","reviewDate":"September 12, 2017","reviewText":"One of the best deals I've seen and purchased! The bundle came faster than expected and opening the box gives any photographer a bliss feeling. You get a huge bang for you buck and I haven't looked back nor regretted this purchase *RECOMMEND IT*"},{"reviewerName":"sanjushekar","rating":"5.0 out of 5 stars","reviewTitle":"Amazing camera with WiFi & Mobile App to transfer pictures","reviewDate":"April 26, 2017","reviewText":"What shown, was what received!!\nI express my great happiness with this product, It was a gift for my wife, all the little things mentioned however with this product has been shipped. Can't stop taking pictures anymore. I would for sure recommend this product to my friends."},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Great camera","reviewDate":"November 25, 2018","reviewText":"This was a purchase my 14 year old daughter had made. Easy to use. She loves it."},{"reviewerName":"Kassie Brothers","rating":"5.0 out of 5 stars","reviewTitle":"Great Deal","reviewDate":"February 8, 2017","reviewText":"Great bundle deal. Everything came neatly packaged and works amazing. Don't miss out on this great deal!!"},{"reviewerName":"rosa strangio","rating":"5.0 out of 5 stars","reviewTitle":"This is the best camera you can get","reviewDate":"January 13, 2017","reviewText":"This is the best camera you can get!!! I bought it for my daughter and she loves it! Also, this bundle saves you a BUNDLE of money!!! You will not be disappointed!"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"This was a great deal to buy as a bundle and I am ...","reviewDate":"February 9, 2017","reviewText":"This was a great deal to buy as a bundle and I am enjoying my new camera. The service was great and all little gadgets included are handy for a novice photographer as myself. This bundle ihas everything you might need to play around with the camera while taking photographs."},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Very satisfied","reviewDate":"August 29, 2017","reviewText":"I bought this for my son and future daughter in law as an engagement gift. They absolutely loved it and and are having a great time experimenting with all the lenses Very satisfied!"},{"reviewerName":"Claire Lachance","rating":"5.0 out of 5 stars","reviewTitle":"Awesome camera, and so many possibilities with all the ...","reviewDate":"January 21, 2018","reviewText":"Awesome camera, and so many possibilities with all the extras! It will take a while to master all this but so happy we did!"},{"reviewerName":"Edward Ihne Jr","rating":"5.0 out of 5 stars","reviewTitle":"camera and bundle are greatbut the gadget bag one of ...","reviewDate":"May 24, 2018","reviewText":"camera and bundle are greatbut the gadget bag one of the compartments in the bag you cant use be cause there is no zipper flap . and i still cant get an answer back from amazon"},{"reviewerName":"Hannah Sokora","rating":"5.0 out of 5 stars","reviewTitle":"It came with so many extras that I was not expecting and so easy to use","reviewDate":"July 20, 2017","reviewText":"I'm obsessed with my new camera! It came with so many extras that I was not expecting and so easy to use!"},{"reviewerName":"Patrick","rating":"5.0 out of 5 stars","reviewTitle":"Great product bundle","reviewDate":"May 24, 2018","reviewText":"Great product bundle, everything you see in the picture is exactly what you get. Couldn't get a better quality bundle for the price anywhere else. I highly recomend this bundle"},{"reviewerName":"Red Hot Chiller Pep","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"October 3, 2016","reviewText":"Great deal! Love this camera. It's my first DSLR and easy to use."},{"reviewerName":"Melissa T.","rating":"5.0 out of 5 stars","reviewTitle":"Great value.","reviewDate":"September 7, 2017","reviewText":"Really really enjoying the camera. I'm new to photography, si all things are a learning curve.\nLots of information on line and your tube.\nI do wish the set came with a video, but it didn't.\nGreat value."},{"reviewerName":"joaquin","rating":"5.0 out of 5 stars","reviewTitle":"brand is very important","reviewDate":"January 28, 2019","reviewText":"great camera was a gift for my dougther"},{"reviewerName":"Ronald W.","rating":"5.0 out of 5 stars","reviewTitle":"Love it","reviewDate":"September 7, 2017","reviewText":"Love it"},{"reviewerName":"Nata","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"February 19, 2017","reviewText":"very good"},{"reviewerName":"Tim Horsley","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"January 4, 2017","reviewText":"Love it. More than I expected."},{"reviewerName":"Greta V.","rating":"5.0 out of 5 stars","reviewTitle":"AWESOME","reviewDate":"June 16, 2017","reviewText":"it arrived sooner than i expected, everything well packaged and in great condition, the camera works absolutely fantastic, im really happy with my purchase, thank you so much!"},{"reviewerName":"brie","rating":"3.0 out of 5 stars","reviewTitle":"Three Stars","reviewDate":"September 14, 2017","reviewText":"Wish I would have invested into the T6i instead."},{"reviewerName":"Brits","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"February 11, 2017","reviewText":"Great camera"},{"reviewerName":"HatLady","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"June 22, 2016","reviewText":"Great deal !"},{"reviewerName":"Kameron K.","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"June 5, 2016","reviewText":"Camera is amazing"},{"reviewerName":"Ruby","rating":"5.0 out of 5 stars","reviewTitle":"I love my camera and all that came with it","reviewDate":"February 15, 2017","reviewText":"I love my camera and all that came with it. I have all I need to start taking pictures... and have enjoyed setting the camera on the tripod and shooting bir birds at the feeders....."},{"reviewerName":"moner","rating":"5.0 out of 5 stars","reviewTitle":"Great camera","reviewDate":"April 10, 2019","reviewText":"Couldn’t be happier with this camera"},{"reviewerName":"Smokin' Guns","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"November 7, 2017","reviewText":"Wife LOVES it!!!"},{"reviewerName":"William Reynolds","rating":"5.0 out of 5 stars","reviewTitle":"excellent buy","reviewDate":"May 2, 2017","reviewText":"So far it is amazing, a bit technical but amazing"},{"reviewerName":"Ray Taylor","rating":"5.0 out of 5 stars","reviewTitle":"Buy this camera!","reviewDate":"February 13, 2017","reviewText":"This was a great buy! If you are looking for a beginner camera this is the one for you the camera and 75-300 mm lens are really good everything else is pretty cheep but as a beginner they are perfect! 10/10 would buy again!"},{"reviewerName":"Jamser","rating":"5.0 out of 5 stars","reviewTitle":"Good condition","reviewDate":"June 25, 2019","reviewText":"Hello friends! the product arrived in good condition and I am happy with this camera. regards!!!"},{"reviewerName":"NandoCal","rating":"5.0 out of 5 stars","reviewTitle":"Great Price & Product","reviewDate":"October 8, 2017","reviewText":"For the the price and all of the accessories this is an amazing deal. Shipped on time. I believe this is perfect for a beginner photographer."},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Highly recommend.","reviewDate":"August 1, 2017","reviewText":"Absolutely LOVE the camera and all the equipment. Posting pics on line and everyone is asking what kind of camera I have because the pics are so sharp. Highly recommend!"},{"reviewerName":"Rebecca","rating":"5.0 out of 5 stars","reviewTitle":"Product was a great buy with a great camera","reviewDate":"September 7, 2017","reviewText":"Product was a great buy with a great camera. My only fault with the kits is the tripod. very low quality. Other than than. this was an awesome buy"},{"reviewerName":"Rittick","rating":"5.0 out of 5 stars","reviewTitle":"The camera is performing to my expectations. The tripod ...","reviewDate":"February 12, 2017","reviewText":"The camera is performing to my expectations. The tripod which comes along with the set broke immediately. (It is plastic) Otherwise, i am enjoying photography with the camera."},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Great product","reviewDate":"January 23, 2019","reviewText":"Wish I had better simple instructions on how to use it but overall its an great beginner camara."},{"reviewerName":"Enrique","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"March 9, 2017","reviewText":"It's an excellent semi professional kit."},{"reviewerName":"LD","rating":"5.0 out of 5 stars","reviewTitle":"GREAT DEAL","reviewDate":"September 17, 2017","reviewText":"THIS PACKAGE IS PERFECT FOR A BEGINNER LIKE MYSELF"},{"reviewerName":"Lauren","rating":"3.0 out of 5 stars","reviewTitle":"Three Stars","reviewDate":"March 27, 2018","reviewText":"This is a wonderful starter's kit, but my camera began malfunctioning after about 6 months..."},{"reviewerName":"RGP","rating":"5.0 out of 5 stars","reviewTitle":"Camera review.","reviewDate":"February 19, 2017","reviewText":"I purchased this camera as a gift for my adult daughter and her husband. I have not used it but they LOVE it. Five stars"},{"reviewerName":"Diane Jordan","rating":"5.0 out of 5 stars","reviewTitle":"Price","reviewDate":"November 16, 2018","reviewText":"Everything is going well with the product. It is a present for my daughter. Good reasonable price. Thank you"},{"reviewerName":"vcraig","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"August 21, 2016","reviewText":"Great camera for the price. Easy to use."},{"reviewerName":"MYS","rating":"5.0 out of 5 stars","reviewTitle":"Great buy!","reviewDate":"November 8, 2016","reviewText":"Love love love my new camera!"},{"reviewerName":"AGG","rating":"5.0 out of 5 stars","reviewTitle":"Wife's gift","reviewDate":"March 18, 2017","reviewText":"Awesome price, specially for what you're getting, my wife loved it."},{"reviewerName":"Frank Monroe Moorer","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"February 10, 2017","reviewText":"Geeat deal and even better product. It was a gift do my daughter and she loves it."},{"reviewerName":"GDR","rating":"5.0 out of 5 stars","reviewTitle":"Customer service has been great - Photo Savings has reached out several times to ...","reviewDate":"March 13, 2017","reviewText":"The camera arrived and it is just as pictured (Ha! Yes, pun intended)! Customer service has been great - Photo Savings has reached out several times to make sure we are 100% happy with the purchase. Very happy so far with this purchase."},{"reviewerName":"Russ","rating":"5.0 out of 5 stars","reviewTitle":"This is an extremely good camera for beginners!","reviewDate":"August 14, 2019","reviewText":"Love this camera.💯🔥🔥🔥"},{"reviewerName":"Amazon Customer","rating":"4.0 out of 5 stars","reviewTitle":"No memory cards included","reviewDate":"September 21, 2017","reviewText":"Came with everything but the memory cards. Was a little disappointed that I have to wait until I purchase my own before I can start taking pictures. Other than that I don't have any complaints"},{"reviewerName":"Brandi Fuller","rating":"1.0 out of 5 stars","reviewTitle":"This was supposed to come with (2) 32 GB memory ...","reviewDate":"March 3, 2017","reviewText":"This was supposed to come with (2) 32 GB memory cards and as you can see it didn't. I would expect Amazon to fix this. When they do I will change the rating."},{"reviewerName":"Osk","rating":"5.0 out of 5 stars","reviewTitle":"Absolutely perfect. Just what I wanted","reviewDate":"July 16, 2016","reviewText":"Absolutely perfect . Just what I wanted ."},{"reviewerName":"Michael Morley","rating":"5.0 out of 5 stars","reviewTitle":"Rebel T6 Bundle, a Fantastic Package","reviewDate":"February 9, 2017","reviewText":"This camera/package is outstanding! We use it for photography at the school where I teach, specifically in Yearbook."},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Love the camera","reviewDate":"February 11, 2017","reviewText":"This camera bundle was purchased as a Christmas gift. Our daughter LOVES it, and that is not saying enough. It/she is taking beautiful photos. I'm jealous of all the features it has. Thank you for a terrific offer. MJS"},{"reviewerName":"julian antonio castro","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"July 31, 2017","reviewText":"Ok"},{"reviewerName":"Cassidie Bare","rating":"5.0 out of 5 stars","reviewTitle":"Good","reviewDate":"March 28, 2019","reviewText":"Exactly as expected"},{"reviewerName":"Glenn","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"December 7, 2017","reviewText":"My Wife loves it. The Tripod is weak."},{"reviewerName":"Dog Dr.","rating":"5.0 out of 5 stars","reviewTitle":"Great camera and bundle","reviewDate":"February 9, 2017","reviewText":"Great camera and bundle. Have bene very happy with the set. Only negative was that the threads of the screw on the tripod do not match the threads in the base of the camera, and so it did not securely attach to the tripod."},{"reviewerName":"Kindle Customer","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"January 11, 2018","reviewText":"Easy to use.good pics."},{"reviewerName":"azhunt","rating":"4.0 out of 5 stars","reviewTitle":"Delivery was on time and everything in great condition. The only downside was the tripods aren't ...","reviewDate":"December 25, 2016","reviewText":"I bought this bundle as a gift for my wife and she loves it. Delivery was on time and everything in great condition. The only downside was the tripods aren't stable enough to handle the weight of the camera."},{"reviewerName":"Becky","rating":"5.0 out of 5 stars","reviewTitle":"This was a Christmas present for my 16 year old ...","reviewDate":"December 28, 2016","reviewText":"This was a Christmas present for my 16 year old daughter. She loves the camera and all the accessories that came with it. Thanks!!"},{"reviewerName":"GB","rating":"5.0 out of 5 stars","reviewTitle":"Great Piece!!!","reviewDate":"August 25, 2017","reviewText":"New to this, but so far so very good..."},{"reviewerName":"Rami Binyamin","rating":"5.0 out of 5 stars","reviewTitle":"Perfect","reviewDate":"October 31, 2018","reviewText":"Perfect"},{"reviewerName":"soulytrina","rating":"4.0 out of 5 stars","reviewTitle":"Newbie (first canon)","reviewDate":"December 13, 2016","reviewText":"Love the camera, everything is great. I will agree the tripod seems a bit flimsy (flamingo legs) lol nevertheless, you get what you paid for. It's worth it. Thank you."},{"reviewerName":"Dinesh Reddy Cheedu","rating":"5.0 out of 5 stars","reviewTitle":"Camera is awesome","reviewDate":"April 11, 2019","reviewText":"I like number things we get with package"},{"reviewerName":"Amazon Customer","rating":"2.0 out of 5 stars","reviewTitle":"... EOS Rebel T6 DSLR Camera is ohky but not good because there is a problem with the Zooming I ...","reviewDate":"February 12, 2017","reviewText":"The Canon EOS Rebel T6 DSLR Camera is ohky but not good because there is a problem with the Zooming I need to capture 4 - 5 times to get a perfect shot. Since I presented it as a gift to my sister she won't accept it to return."},{"reviewerName":"Ryan LeFevre","rating":"5.0 out of 5 stars","reviewTitle":"Great for beginners.","reviewDate":"January 14, 2019","reviewText":"Good camera that takes solid pictures."},{"reviewerName":"MB jr","rating":"5.0 out of 5 stars","reviewTitle":"Excellent for a gift","reviewDate":"July 17, 2016","reviewText":"This is a gift for a nephew, next week I'll surprise him, as I'm with this kit."},{"reviewerName":"JTS","rating":"5.0 out of 5 stars","reviewTitle":"Great camera bundle","reviewDate":"November 6, 2016","reviewText":"This bundle was more than I expected. I am a beginner and out of the box it is fairly simple to use."},{"reviewerName":"Jeannie Moore","rating":"5.0 out of 5 stars","reviewTitle":"Was a Christmas gift for my husband he loves it ...","reviewDate":"January 4, 2018","reviewText":"Was a Christmas gift for my husband he loves it. Likes all of the gadgets that are included with the camera."},{"reviewerName":"Irene Gul","rating":"5.0 out of 5 stars","reviewTitle":"Overall Just Happy!","reviewDate":"January 31, 2017","reviewText":"I was a bit weary buying a camera off amazon... but decided to take a leap of faith... and, I was so happy when it came AND as described!!! I was so happy that the camera was authentic and worked. the accessories that came with it, other than the cannon lenses and the filters, were cheaply made. But, as a beginning photographer the accessories are fine for now. Im just happy that they all work and as described."},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"It really is a good deal to buy plus you get everything at once ...","reviewDate":"September 11, 2017","reviewText":"It really is a good deal to buy plus you get everything at once and you don't have to worry about all those extra stuff you will need in future."},{"reviewerName":"Eric Christensen","rating":"5.0 out of 5 stars","reviewTitle":"Loving it so far. Two weeks in I can ...","reviewDate":"February 13, 2017","reviewText":"Loving it so far. Two weeks in I can find no fault with the performance or features. The value of the bundle for a newbie is solid."},{"reviewerName":"duo la","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"March 8, 2018","reviewText":"I love it, the packing is very good and also complete fittings, good product."},{"reviewerName":"cozy sleeper","rating":"5.0 out of 5 stars","reviewTitle":"... my wife as a Christmas present and she has loved using it","reviewDate":"February 10, 2017","reviewText":"I bought this for my wife as a Christmas present and she has loved using it"},{"reviewerName":"CL","rating":"5.0 out of 5 stars","reviewTitle":"Great buy. Quality set","reviewDate":"February 11, 2017","reviewText":"Arrived on time. Great buy. Quality set. My daughter is thrilled!"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"June 5, 2017","reviewText":"What a full package!! Nothing is missing!!"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"The Auto setting does take great pictures, especially the landscape and close up settings","reviewDate":"February 10, 2017","reviewText":"I am a novice at photography. I am discovering the T6 to be user friendly as I learn about the settings. For the first couple of months I used the auto settings exclusively just to learn the camera. I am now venturing into settings other than Auto. The Auto setting does take great pictures, especially the landscape and close up settings. The kit was a great bargain with lots of included items. I am very pleased. BTW, You Tube has several great videos posted explaining how this camera works."},{"reviewerName":"patrick green","rating":"5.0 out of 5 stars","reviewTitle":"Very happy with this kit","reviewDate":"August 31, 2017","reviewText":"Very happy with this kit, every thing works, and I saved some money. Same camera was 600 at Best Buy."},{"reviewerName":"Alex","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"March 29, 2017","reviewText":"I like it thanks u"},{"reviewerName":"John C Wild","rating":"4.0 out of 5 stars","reviewTitle":"Four Stars","reviewDate":"January 6, 2017","reviewText":"everything is as advertised."},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"I believe she is extremely happy with it so far","reviewDate":"May 4, 2017","reviewText":"I purchased for my teenage daughter, I believe she is extremely happy with it so far. She is still in the learning phases."},{"reviewerName":"Alma","rating":"5.0 out of 5 stars","reviewTitle":"Absolutely love the product","reviewDate":"October 3, 2017","reviewText":"Absolutely love the product. Still trying to figure out how to use, mainly hobby photos of family and friends. Wonderful package."},{"reviewerName":"abdul karim","rating":"1.0 out of 5 stars","reviewTitle":"No good","reviewDate":"September 18, 2019","reviewText":"Dislike"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"I did good.","reviewDate":"September 28, 2016","reviewText":"I don't know much about cameras but this was a gift for my girlfriend who does. She loves it! I did good."},{"reviewerName":"Linda Snyder","rating":"5.0 out of 5 stars","reviewTitle":"... a couple of times but so far i really like it, it came with a ton of stuff ...","reviewDate":"January 8, 2017","reviewText":"I have only used it a couple of times but so far i really like it, it came with a ton of stuff and we are still trying to figure it all out. It takes really good pictures and it arrived quick."},{"reviewerName":"Hsa Moo","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"January 28, 2018","reviewText":"Great camera. Worth the money."},{"reviewerName":"Javier E","rating":"5.0 out of 5 stars","reviewTitle":"Every thing is ok, exactly as product description.","reviewDate":"January 21, 2017","reviewText":"Every thing is ok , exactly as product description.\nI wil post later more info"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"It was perfect. It included everything he's needed so far","reviewDate":"February 10, 2017","reviewText":"I bought this as a starter camera for my son. It was perfect. It included everything he's needed so far. We couldnt be happier with our purchase."},{"reviewerName":"Shanks","rating":"5.0 out of 5 stars","reviewTitle":"Great Camera for you.!!!!","reviewDate":"October 1, 2017","reviewText":"Everything is in it. I have nothing to say except that this is a great camera and if you want a great camera, this is for you."},{"reviewerName":"Jodi N. Rollins","rating":"5.0 out of 5 stars","reviewTitle":"It's perfect! Bought it for my daughter who has fallen ...","reviewDate":"February 9, 2017","reviewText":"It's perfect! Bought it for my daughter who has fallen in love with photography and she loves it! She has tried everything that it came with and it works great."},{"reviewerName":"Cassidy","rating":"2.0 out of 5 stars","reviewTitle":"The cleaning kit was not included, the battery was ...","reviewDate":"November 9, 2017","reviewText":"The cleaning kit was not included, the battery was not included, the tripie was broken, and the message sent to the seller has not been answered."},{"reviewerName":"Craig N.","rating":"3.0 out of 5 stars","reviewTitle":"Amazon not customer oriented","reviewDate":"February 14, 2017","reviewText":"Tripod was cheap and broken, Talked to amazon, what i needed to do to resolve was unacceptable. Camera was fine, most of the other items were cheap, overall an acceptable kit"},{"reviewerName":"Dennis","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"May 30, 2017","reviewText":"Love it! Still learning to use it. Quality of pictures are great!"},{"reviewerName":"Les Fussell","rating":"5.0 out of 5 stars","reviewTitle":"Awesome Camera Package","reviewDate":"February 12, 2017","reviewText":"We compared this Canon Rebel T6 DSLR bundle to a similar bundle offered at a national warehouse retailer that was advertised at the same price. This bundle included more extras such as the lenses, tripod and cleaning/care kit. The cameras (we bought 2) were Christmas presents for our grown daughters. Both daughters use the cameras on an almost weekly basis taking photos at home and sporting events that their kids are involved with. They simply love the cameras and use both lenses plus the included flash. The purchasing of the cameras was quick and easy. Despite it being around the holidays, the cameras arrived a day earlier than originally scheduled. The packaging was excellent so there were no loose pieces moving around so there was not even a blemish on the individual component boxes. Great experience and VERY, VERY pleased with our purchase!"},{"reviewerName":"Amazon Customer","rating":"3.0 out of 5 stars","reviewTitle":"but the few accessories are not of very high standards like flash. Few are good like bag","reviewDate":"October 5, 2016","reviewText":"Camera is Canon so no need to writer review about it , but the few accessories are not of very high standards like flash. Few are good like bag, tripod. i found the price comparative than other website."},{"reviewerName":"JTL","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"August 27, 2016","reviewText":"Great Camera Set at a great price"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"February 8, 2017","reviewText":"We love our camera! Definitely a great deal for such a nice camera! Highly recommended!"},{"reviewerName":"E. Owens","rating":"5.0 out of 5 stars","reviewTitle":"I love the whole package","reviewDate":"June 22, 2016","reviewText":"I love the whole package. The tripod is a bit flimsy and the external flash is cheap but they work and get the job done."},{"reviewerName":"Garry E. Layne","rating":"5.0 out of 5 stars","reviewTitle":"I am totally satisfied with this camera","reviewDate":"October 27, 2017","reviewText":"Outstanding performance! I am totally satisfied with this camera! Easy understandable operation, great photos!"},{"reviewerName":"Rohit","rating":"4.0 out of 5 stars","reviewTitle":"Good camera.","reviewDate":"May 2, 2017","reviewText":"Good camera. Little old model. Try to go for T6i or the latest model T7i."},{"reviewerName":"Abiodun Adeyemi","rating":"5.0 out of 5 stars","reviewTitle":"Canon EOS Rebel T6 DSLR Camera with 18-55mm, EF 75-300mm Lens, and Deluxe Bundle","reviewDate":"October 10, 2018","reviewText":"Great product. Worth the money"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"The protection of camera is important","reviewDate":"October 29, 2018","reviewText":"I really like the camera!"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"May 29, 2017","reviewText":"great camera, comes complete with everything you need. great deal. Highly recommend it."},{"reviewerName":"JT","rating":"5.0 out of 5 stars","reviewTitle":"Great Product. Fast Service.","reviewDate":"September 5, 2018","reviewText":"Bundle came exactly as described. Delivery was very fast. Great!"},{"reviewerName":"Glenn","rating":"5.0 out of 5 stars","reviewTitle":"Great deal with accesories","reviewDate":"October 9, 2018","reviewText":"Great deal with accesories"},{"reviewerName":"Valery Melus","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"February 8, 2017","reviewText":"Excellent product! I may need too buy the eos rebel t6i too"},{"reviewerName":"Lupita M","rating":"5.0 out of 5 stars","reviewTitle":"Great buy","reviewDate":"January 8, 2019","reviewText":"This was a great buy!! Love it!!"},{"reviewerName":"Abiezer Disla","rating":"5.0 out of 5 stars","reviewTitle":"Great price !","reviewDate":"January 12, 2019","reviewText":"Amazing camera !"},{"reviewerName":"Mary A Clevenger","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"January 16, 2018","reviewText":"Just need to learn how to use it"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Best purchase ever!","reviewDate":"January 5, 2017","reviewText":"Best thing I think I have ever purchased from amazon! Well worth the price and I LOVE my camera!!!!"},{"reviewerName":"shianne","rating":"5.0 out of 5 stars","reviewTitle":"Camera was delivered on time and in perfect shape.","reviewDate":"October 17, 2017","reviewText":"This camera is exactly what I was looking for. And the price was very reasonable. Camera was delivered on time and in perfect shape."},{"reviewerName":"HelToast","rating":"5.0 out of 5 stars","reviewTitle":"Great Kit!","reviewDate":"April 30, 2018","reviewText":"Exactly what I was looking for as a novice. Perfect kit and easy to learn!"},{"reviewerName":"Mehran","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"November 27, 2017","reviewText":"Best bundle i could asked for."},{"reviewerName":"Jessica Cardenas","rating":"4.0 out of 5 stars","reviewTitle":"Great starter kit","reviewDate":"November 5, 2016","reviewText":"Love how it comes with your \"starter kit\"\nThe Camera T6 -- is alright, love the wifi connection but not sure how I feel about the quality yet."},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Thank you for the wonderful kit, and service","reviewDate":"April 5, 2017","reviewText":"Everything in the package was delivered, and will be used by me as my skills progress. Camera works as expected. Thank you for the wonderful kit, and service."},{"reviewerName":"Jessica Williams","rating":"4.0 out of 5 stars","reviewTitle":"Great camera for the price","reviewDate":"February 19, 2018","reviewText":"Takes great photos! However the tripod is not sturdy at all."},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"I absolutely love my camera","reviewDate":"February 8, 2017","reviewText":"Quick delivery, everything was packaged brand new! I absolutely love my camera! This deal was amazing and totally worth it, now I can work towards my photography dream!!"},{"reviewerName":"Matthew J Connor","rating":"5.0 out of 5 stars","reviewTitle":"Nice product","reviewDate":"February 10, 2017","reviewText":"So far so good. Have used it several times and the pics are clear and crisp. Product came in a timely manner. Would recommend"},{"reviewerName":"Vivian Silvestre","rating":"5.0 out of 5 stars","reviewTitle":"I loved the product","reviewDate":"February 13, 2017","reviewText":"I loved the product! It was a GOOD deal!\nI was so happy when I saw all the things in the box. I am really satisfied with my purchase!"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"I bought this bundle for my 15 year old daughter ...","reviewDate":"February 11, 2017","reviewText":"I bought this bundle for my 15 year old daughter as a Christmas gift. She loves it!! I have used it myself as well and will soon be purchasing my own!!"},{"reviewerName":"Cecilia O.","rating":"5.0 out of 5 stars","reviewTitle":"Awesome beginners package","reviewDate":"February 13, 2017","reviewText":"Awesome beginners package.\nEverything works just need to learn how to use it hahah. But I love the wifi connection to my phone from the camera canon is amazing."},{"reviewerName":"alan ross","rating":"5.0 out of 5 stars","reviewTitle":"Good move great buy","reviewDate":"August 12, 2018","reviewText":"New to ohotoi but this is everything I need to get started"},{"reviewerName":"Erika Rodriguez","rating":"5.0 out of 5 stars","reviewTitle":"Great bundle!","reviewDate":"October 9, 2018","reviewText":"Love this so much. Great seller and product."},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"This was a great deal! Everything came as advertised and arrived quickly","reviewDate":"February 9, 2017","reviewText":"This was a great deal! Everything came as advertised and arrived quickly. I would definitely purchase from them again."},{"reviewerName":"Xayde Gonzalez","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"December 1, 2016","reviewText":"Great buy for the price! Everything came in nicely! Thank you Amazon!!"},{"reviewerName":"Marcela Orjuela","rating":"3.0 out of 5 stars","reviewTitle":"The product arrived in the indicated time, the HDMI ...","reviewDate":"September 14, 2017","reviewText":"The product arrived in the indicated time, the HDMI cables and the Usb do not work arrived damaged, ¿what can be done about it?"},{"reviewerName":"JD Kimbrough","rating":"3.0 out of 5 stars","reviewTitle":"Great camera but accessories not so much...","reviewDate":"October 12, 2016","reviewText":"First off packaging was great. As I went through everything I thought, wow this is a great deal for all these items. After getting everything together, I realized that all the canon items ( camera body, small lens and large lens ) were all great as expected since it is canon brand but all the other items not so much. The wide angle Len and telephoto look great in the middle of the frame but get blurry around all the edges. Flash is cheap along with the memory cards. Tripod is not bad and will work, for the price it was expected. All in all at this price it's still cheaper than the local box stores but plan on not using half the items in this kit."},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"November 13, 2016","reviewText":"Love this camera!!!"},{"reviewerName":"Heather Miller","rating":"5.0 out of 5 stars","reviewTitle":"really nice camera.","reviewDate":"February 9, 2017","reviewText":"Came on time, very well packaged, everything listed was there, really nice camera."},{"reviewerName":"kristin","rating":"5.0 out of 5 stars","reviewTitle":"Great product!","reviewDate":"October 8, 2018","reviewText":"Looking forward to using my new camera!"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"This is a very good camera to start with for a beginner","reviewDate":"September 19, 2017","reviewText":"This is a very good camera to start with for a beginner. The quality of the pictures are excellent! I would recommend it."},{"reviewerName":"Michelle Ollmann","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"February 11, 2017","reviewText":"Everything was packaged nicely and works well. Great products, I receieved everything I expected."},{"reviewerName":"The S","rating":"5.0 out of 5 stars","reviewTitle":"Great product","reviewDate":"February 7, 2017","reviewText":"Great bundle. Has everything you need to get started in amateur photography. All items as promised. Arrived early - well packaged - would recommend!"},{"reviewerName":"Juan Pablo Lopez","rating":"5.0 out of 5 stars","reviewTitle":"she loved!!","reviewDate":"June 25, 2017","reviewText":"Was 15 birthday's gifth for my daugther, she loved!!!!"},{"reviewerName":"THC","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"May 28, 2017","reviewText":"Really great camera"},{"reviewerName":"Morgan","rating":"5.0 out of 5 stars","reviewTitle":"I love this product","reviewDate":"February 15, 2017","reviewText":"I love this product! All of the pieces were included. The mini tripod did however break before I had the chance to use it, but overall it is a great camera bundle."},{"reviewerName":"Andres Colmenares","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"October 17, 2017","reviewText":"I’m very satisfied with this bundle. One of the best deals out there!"},{"reviewerName":"Teryl Bishop","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"April 21, 2017","reviewText":"Am taking great pictures with the Canon. So far So good!! Love it."},{"reviewerName":"Cache County School District","rating":"4.0 out of 5 stars","reviewTitle":"Great Camera and accessories","reviewDate":"September 18, 2017","reviewText":"Great Camera and accessories. Would have given it 5 stars, however the camera bag was damaged right out of the box."},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"The bundle came nicely packed with everything in the picture","reviewDate":"July 12, 2016","reviewText":"The bundle came nicely packed with everything in the picture. It also came extremely quick. I am very satisfied with my purchase. Thank you!"},{"reviewerName":"Nancy A Gould","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"December 22, 2016","reviewText":"Love my camera!! The case is great!!!"},{"reviewerName":"L. Ochsner","rating":"5.0 out of 5 stars","reviewTitle":"Don't look any further!","reviewDate":"February 11, 2017","reviewText":"Loved everything in Canon EOS Rebel bundle!!! Fantastic value for this amazing camera and accessories!!!"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"February 10, 2017","reviewText":"Great Camera!"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"February 6, 2017","reviewText":"Christmas present for my son, he loves it and now takes pictures all the time."},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"It's truly a great bundle for what you are paying","reviewDate":"July 20, 2016","reviewText":"I never do reviews but I definitely had to do one for this set! It's truly a great bundle for what you are paying! Not going to lie I was hesitant at first because it seemed to good to be true with everything you got but I'm so happy with my purchase. I read previous comments and really the only bad things I found was the camera bag wasn't canon or it broke after they tried to zip it. My bag is canon brand and it buckles so no trouble there! I highly recommend this set for beginner photography. The camera works amazing and is very easy to work. I recommend reading the manual or looking up a video manual on YouTube I did both and found very useful information!"},{"reviewerName":"wertheimer mai","rating":"4.0 out of 5 stars","reviewTitle":"Awesome camera.","reviewDate":"April 28, 2017","reviewText":"Shipped on time..package was intact and everything was in box. Great camera for sports and outdoor activities as well as indoors. Easy to use."},{"reviewerName":"ErnestT","rating":"5.0 out of 5 stars","reviewTitle":"I love my new Canon T6 bundle","reviewDate":"August 25, 2016","reviewText":"I love my new Canon T6 bundle, It was exactly as described, if you read & pay attention to the description there will not be any disappointments, in my opinion anyway. I have tested everything in the bundle with the exception of all the filters & it all works great, At this moment I would not hesitate to buy again. Did I say that I LOVE MY NEW CAMERA!"},{"reviewerName":"Tangula Love","rating":"5.0 out of 5 stars","reviewTitle":"This is a really good camera for upcoming photographers","reviewDate":"February 13, 2017","reviewText":"My camera was delivered on time and all the items listed was provided in prefect working condition. This is a really good camera for upcoming photographers."},{"reviewerName":"amcarlisle","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"June 9, 2016","reviewText":"love it! Works great and takes great pictures"},{"reviewerName":"Amazon Customer","rating":"4.0 out of 5 stars","reviewTitle":"Everything was great except for the external flash which unfortunately was not ...","reviewDate":"August 6, 2016","reviewText":"Everything was great except for the external flash which unfortunately was not fitting wish it did would had got 5 stars instead of 4"},{"reviewerName":"Amazon customer","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"February 6, 2017","reviewText":"Packaged nicely and secured. Camera takes awesome pictures. Great camera for a starter. Thanks Guys!"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"I bought for my 18 year old Daughter with an ...","reviewDate":"February 10, 2017","reviewText":"I bought for my 18 year old Daughter with an interest in photography. She loves it, discovering different way to use it everyday. 4 stars."},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"March 15, 2018","reviewText":"Had my camera since Feb 8 and love it !!"},{"reviewerName":"Kevin Green","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"January 18, 2017","reviewText":"Everything was as the picture and my wife was overwhelmed by all the extras in the bundle."},{"reviewerName":"Horacio Pinto","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"August 31, 2016","reviewText":"excellent"},{"reviewerName":"Sam","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"May 4, 2018","reviewText":"Great deal, just love it."},{"reviewerName":"Don Miller","rating":"5.0 out of 5 stars","reviewTitle":"Wife love it.","reviewDate":"September 7, 2017","reviewText":"Was bought as a gift . Wife love it."},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"December 15, 2016","reviewText":"Delivery was fast price was amazing my wife loves her new camera"},{"reviewerName":"Amazon Customer","rating":"1.0 out of 5 stars","reviewTitle":"Não veio a bateria do equipamento.","reviewDate":"May 19, 2017","reviewText":"Não veio a bateria do equipamento."},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"... T5 as stolen so i could not be more happy that i have my","reviewDate":"March 16, 2017","reviewText":"i broight this canon becuse my other T5 as stolen so i could not be more happy that i have my T6"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"February 12, 2017","reviewText":"Great savings, great products. Exactly what was advertised."},{"reviewerName":"Roger G. Henderberg","rating":"5.0 out of 5 stars","reviewTitle":"A great camera at a great price","reviewDate":"December 10, 2016","reviewText":"A great camera at a great price. As usual I am 100% satisfied with Amazon and the Canon T6 that I purchased.\n\nThanks,\nRoger Henderberg"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Great value","reviewDate":"September 7, 2016","reviewText":"Great value for the price! Took the camera on our vacation and it worked perfectly. The picture quality was better than we expected."},{"reviewerName":"Tyler Hime","rating":"5.0 out of 5 stars","reviewTitle":"Great deal","reviewDate":"April 13, 2018","reviewText":"Best bang for your buck!"},{"reviewerName":"Bernard theo","rating":"4.0 out of 5 stars","reviewTitle":"The quality component","reviewDate":"September 21, 2018","reviewText":"Personal shoots"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Need help","reviewDate":"August 14, 2017","reviewText":"I don't know how to use focus phometric lens which are bundled in this package. Please help me with link"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"May 3, 2017","reviewText":"Love It! Came fast and easy to use."},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Awesome Camera!","reviewDate":"September 7, 2017","reviewText":"I wish the tripod that came with it was better, it broke, but the camera is a no brainer. I would recommend this product."},{"reviewerName":"Nuno Rebelo","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"May 14, 2018","reviewText":"Love the camera"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Great value","reviewDate":"February 11, 2017","reviewText":"Solid. Great value. You get lots for the price. Have had for few months now. No regrets on this one"},{"reviewerName":"wildman","rating":"5.0 out of 5 stars","reviewTitle":"Amazing","reviewDate":"February 14, 2017","reviewText":"Great bundle for the price. Fun camera to play with. A lot to learn for a newer user, but the canon seems very user friendly."},{"reviewerName":"Jayb","rating":"5.0 out of 5 stars","reviewTitle":"Love it","reviewDate":"September 14, 2017","reviewText":"Great starter camera setup"},{"reviewerName":"Dan M.","rating":"4.0 out of 5 stars","reviewTitle":"All the accessories this kit comes with is also great. Especially the extra lens","reviewDate":"July 20, 2017","reviewText":"This is my first DSLR camera, and I am very impressed with it. All the accessories this kit comes with is also great. Especially the extra lens. I like the ability to take pictures from far away.\n\nThe menu on the camera is a little clunky and difficult to figure out for the wireless feature. I do like the ability to use my phone as a remote, it's great for group pictures, but it is difficult at times to get the phone to connect at times due to the wireless section in the menu being pretty confusing.\n\nAll in all though, this is a great starter camera, especially if you don't need the features of the higher end cameras."},{"reviewerName":"Samantha painter","rating":"4.0 out of 5 stars","reviewTitle":"Four Stars","reviewDate":"April 13, 2018","reviewText":"Love the camera package. It fits our needs."},{"reviewerName":"Brendon McGahan","rating":"5.0 out of 5 stars","reviewTitle":"everything was packages safely and in good order. Great experience","reviewDate":"September 17, 2017","reviewText":"Arrived as promised, everything was packages safely and in good order. Great experience."},{"reviewerName":"Matthew Jewell","rating":"5.0 out of 5 stars","reviewTitle":"Everything works great, and everything listed is included","reviewDate":"February 12, 2017","reviewText":"I bought this for starting my first semester as a photography student! Everything works great, and everything listed is included! Great buy!"},{"reviewerName":"mary","rating":"5.0 out of 5 stars","reviewTitle":"Cannon EOS Rebel T6 Camera","reviewDate":"June 11, 2016","reviewText":"What a camera!! For the price not only do you get the camera you also get a lot other equipment that in general would have cost a lot more. We are very satisfied with our purchase and the quality of the camera."},{"reviewerName":"AMTS","rating":"5.0 out of 5 stars","reviewTitle":"love the camera","reviewDate":"August 17, 2017","reviewText":"So far, love the camera. Have had it several months now. Tri-pod pretty cheesy."},{"reviewerName":"Jesika","rating":"5.0 out of 5 stars","reviewTitle":"Absolutely amazing. The only thing it didn't come with was ...","reviewDate":"January 8, 2017","reviewText":"Absolutely amazing. The only thing it didn't come with was the memory cards, but no big deal. I'm in love with my camera"},{"reviewerName":"Amazon Customer","rating":"1.0 out of 5 stars","reviewTitle":"NEVER AGAIN","reviewDate":"June 4, 2017","reviewText":"The camera is ok pretty easy to use, but hard to get WiFi working, the lenses came with no difusers to put on them and camera didn't come with cover for for external flash hookup on top of camera. The xtras package is a total piece of garbage worth about $10. I replaced a 15 year old Olympus with the Canon and now realize the Canon photos are inferior. Sorry just my opinion"},{"reviewerName":"Jeff U.","rating":"5.0 out of 5 stars","reviewTitle":"So far so good, got here quickly and my wife loves it","reviewDate":"February 9, 2017","reviewText":"Works well so far"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"February 7, 2017","reviewText":"Great camera! We really enjoy it. It fits our lack of knowledge and allows us to take beautiful shots!"},{"reviewerName":"Val","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"February 14, 2017","reviewText":"Great camera! I got everything that was listed in the bundle. It was exactly what I expected."},{"reviewerName":"AdaleighM","rating":"5.0 out of 5 stars","reviewTitle":"Great camera so far","reviewDate":"February 22, 2017","reviewText":"Great camera so far. Haven't had too much time to play through all the features but so far so good!"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"I love everything!","reviewDate":"May 11, 2017","reviewText":"Everything arrived soonet than expected and I received everything pictured above. I love everything!!! Thanks!!"},{"reviewerName":"Diego","rating":"3.0 out of 5 stars","reviewTitle":"Three Stars","reviewDate":"June 5, 2017","reviewText":"Excelent!!!!!"},{"reviewerName":"Amazon Customer","rating":"2.0 out of 5 stars","reviewTitle":"Two Stars","reviewDate":"December 24, 2016","reviewText":"Compared to Nikon 3, not up to that level."},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"I am extremely satisfied all around","reviewDate":"January 18, 2017","reviewText":"I purchased this bundle as a birthday gift for my 29 year old son. I am extremely satisfied all around, from ordering to receiving.\nThank You Amazon😆"},{"reviewerName":"Amanda D","rating":"5.0 out of 5 stars","reviewTitle":"Great","reviewDate":"February 18, 2017","reviewText":"Takes great pics! Easy to use and kit comes with evetything you need to get started."},{"reviewerName":"Amazon Customer","rating":"4.0 out of 5 stars","reviewTitle":"Four Stars","reviewDate":"July 2, 2017","reviewText":"I love this camera! Takes great pictures but a little slow sometimes. Still a great camera though."},{"reviewerName":"Michelle Mitcham","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"September 9, 2017","reviewText":"Happy do far!"},{"reviewerName":"Shannon Baird","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"September 13, 2017","reviewText":"Excellent camera. Took amazing pictures of the solar eclipse. Was well worth it."},{"reviewerName":"Susana Anabella Rodas Fernández","rating":"4.0 out of 5 stars","reviewTitle":"It would be great a bigger","reviewDate":"December 17, 2017","reviewText":"It has all I need to start. It would be great a bigger case"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"I absolutely love my camera","reviewDate":"February 9, 2017","reviewText":"I absolutely love my camera!! I was so excited to receive it! I have been using it as much as possible and enjoy it so much!"},{"reviewerName":"betypan","rating":"5.0 out of 5 stars","reviewTitle":"A+ camera and lenses.","reviewDate":"June 28, 2016","reviewText":"While the accessories pack is mediocre and the hand strap smells strongly of petroleum.... The camera and lenses are phenomenal and the expeditious arrival is a bonus. I think I'll get along quite well with Mr. Rebel T6, the wifi capability is neat and the quality of craft and design is real pretty."},{"reviewerName":"Jacinta","rating":"4.0 out of 5 stars","reviewTitle":"https: //www. amazon.","reviewDate":"November 8, 2017","reviewText":"https://www.amazon.com/dp/B01DJDSAVU/ref=cm_cr_ryp_prd_ttl_sol_0"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Awesome camera bundle!","reviewDate":"February 7, 2017","reviewText":"Great camera kit! Device is not complicated to use and the bundle is perfect for my needs."},{"reviewerName":"Glenda Bell","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"February 24, 2017","reviewText":"Contained a lot of extras I wasn't expecting."},{"reviewerName":"Rajesh Bhandari","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"February 25, 2018","reviewText":"Its too good, easy to us and the picture is amazing.,."},{"reviewerName":"Rick","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"February 10, 2017","reviewText":"Excellent Camera, accessories, price and service. I will buy from again."},{"reviewerName":"Gloria Griffin","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"January 18, 2017","reviewText":"Great"},{"reviewerName":"J.D.","rating":"5.0 out of 5 stars","reviewTitle":"Awesome","reviewDate":"January 13, 2017","reviewText":"Excellent product. As a college student studying photography I need a good camera and accessories for an affordable price and this is perfect. It's actually the second canon rebel I have had, the previous one was many years ago but I have always loved them. Easy to use and takes great pics."},{"reviewerName":"GF","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"February 13, 2017","reviewText":"Excellent bundle and delivered as expected. Great deal!"},{"reviewerName":"CaliforniaShadows","rating":"1.0 out of 5 stars","reviewTitle":"NOPE","reviewDate":"November 16, 2016","reviewText":"Not good at all. Bought this back in February and I've only used it twice since because of its crappy quality first time I took pics with it I thought it was just me but the second time I knew it was cameras fault. The pictures come out blurry and so not worth buying. I wish I never bought this. Smh"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Works great be camera we ever","reviewDate":"February 8, 2017","reviewText":"Product was just what we wanted! Works great be camera we ever bought"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Great Camera Purchase!","reviewDate":"December 4, 2016","reviewText":"Great buy and just a great camera package!"},{"reviewerName":"Federico Hernandez Meza","rating":"4.0 out of 5 stars","reviewTitle":"Four Stars","reviewDate":"February 13, 2017","reviewText":"Camera is great"},{"reviewerName":"Matthew L WIlson","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"December 13, 2016","reviewText":"Great value. Everything as described."},{"reviewerName":"Charline","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"November 11, 2017","reviewText":"This camera is great."},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Recommend it","reviewDate":"January 25, 2017","reviewText":"Very nice camera"},{"reviewerName":"Tara Mack","rating":"5.0 out of 5 stars","reviewTitle":"Great product and customer service","reviewDate":"February 8, 2017","reviewText":"I recieved everything that was described. Perfect condition. I have really enjoyed getting to use my new canon."},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Awesome Product","reviewDate":"March 15, 2017","reviewText":"It is an Awesome deal to crack.. I got 800$ worth products in 560$.. awesome deal"},{"reviewerName":"frank Mullins","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"November 23, 2016","reviewText":"Items as described and promptly delivered."},{"reviewerName":"Kim","rating":"5.0 out of 5 stars","reviewTitle":"Great product! No problems with delivery or use so ...","reviewDate":"April 26, 2017","reviewText":"Great product! No problems with delivery or use so far. Great quality."},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Very Happy!","reviewDate":"January 25, 2017","reviewText":"Very Happy with my Purchase! Everything came very well packaged and i'm in love with the quality and clearity of this camera!"},{"reviewerName":"Shiho Schoening","rating":"4.0 out of 5 stars","reviewTitle":"Happy with the product","reviewDate":"November 10, 2016","reviewText":"Happy with the product, but it I feel it doesn't need to have that many extra \"toys\" that most of us will never use."},{"reviewerName":"A. St Clair","rating":"5.0 out of 5 stars","reviewTitle":"Had a lot of fun taking photos with it","reviewDate":"February 8, 2017","reviewText":"My husband bought this camera for me for Christmas. We took it with us on a Caribbean cruise that had booked for Dec. 26. Had a lot of fun taking photos with it. I'm by no means a professional photographer, but I feel like this camera takes excellent photos. I love all the different modes this camera has and playing around with it has been fun. We're going on a trip to the mountains of Western Maryland this weekend. I can't wait to take the new camera and take some more photos."},{"reviewerName":"Ashley","rating":"5.0 out of 5 stars","reviewTitle":"Great purchase!","reviewDate":"October 17, 2017","reviewText":"Great camera! Everything is just as described!"},{"reviewerName":"Sudheer","rating":"4.0 out of 5 stars","reviewTitle":"Four Stars","reviewDate":"October 26, 2017","reviewText":"The product was fentastic I love this camera"},{"reviewerName":"Creator","rating":"5.0 out of 5 stars","reviewTitle":"I love it!","reviewDate":"February 13, 2017","reviewText":"Awesome camera! Easy to use and it comes with so many things. Thanks!"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"March 18, 2017","reviewText":"Hey only one thing was missing from the set is the pouch not the camera bag"},{"reviewerName":"Jessika Miller","rating":"5.0 out of 5 stars","reviewTitle":"One of the best!","reviewDate":"February 12, 2017","reviewText":"This is by far the best deal on an amazing camera. You can't go wrong with purchasing this bundle!"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Amazing value","reviewDate":"December 20, 2016","reviewText":"So happy with everything that came. Works great and as a beginner if was everything I hoped for!"},{"reviewerName":"SRM","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"January 19, 2017","reviewText":"Amazing comprehensive bundle"},{"reviewerName":"Prieta","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"March 9, 2017","reviewText":"I am extremely happy with my purchase, the item was delivered on time."},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"February 9, 2017","reviewText":"I am very happy with this product and service!!! Thank you!"},{"reviewerName":"Carnell Tyus","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"November 6, 2017","reviewText":"Grate job"},{"reviewerName":"Bill Hopson","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"June 20, 2016","reviewText":"great"},{"reviewerName":"Amazon loyal customer","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"February 9, 2017","reviewText":"Great product!!"},{"reviewerName":"Rsloan","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"August 14, 2016","reviewText":"Got everything as advertised promptly"},{"reviewerName":"Phillipvanr","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"June 17, 2017","reviewText":"Very good bundle"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"February 12, 2017","reviewText":"Works great and shipped fast. Wife loves it and has been taking pictures non-stop."},{"reviewerName":"Ixander","rating":"5.0 out of 5 stars","reviewTitle":"I am pleased.","reviewDate":"September 12, 2016","reviewText":"Everything came as said and nothing broken nor missing. I am pleased."},{"reviewerName":"Sara","rating":"5.0 out of 5 stars","reviewTitle":"I love this camera","reviewDate":"February 8, 2017","reviewText":"I love this camera. The bundle that it came with is truly amazing. I havent had the chance to use everything yet, but the mini tripod was great for family portraits. There's nothing bad that I can say. It takes amazing pictures."},{"reviewerName":"Saif","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"February 10, 2017","reviewText":"Excellent product and on time delivery."},{"reviewerName":"Don T.","rating":"5.0 out of 5 stars","reviewTitle":"I love it, very nice","reviewDate":"August 1, 2016","reviewText":"I have had this camera for about a month. I am new to the DSLR and I have had no problems operating this camera. Sure you can spend tons more to get a few extra features but if you're a novice like me then this is the way to go. This arrived quickly and was packaged very well. If I have any problems in the near future I will update this review."},{"reviewerName":"Amazon Customer","rating":"4.0 out of 5 stars","reviewTitle":"Four Stars","reviewDate":"August 15, 2017","reviewText":"Love my Canon!"},{"reviewerName":"Da","rating":"5.0 out of 5 stars","reviewTitle":"Every thing I wanted","reviewDate":"May 23, 2017","reviewText":"It came at a reasonable date and time it was what I wanted"},{"reviewerName":"stanley r. blankenship","rating":"5.0 out of 5 stars","reviewTitle":"Wife say like","reviewDate":"February 10, 2017","reviewText":"Got camera for Wife. Wife say like it"},{"reviewerName":"kevin b. cronin","rating":"5.0 out of 5 stars","reviewTitle":"Great value and Fast shipping too","reviewDate":"April 26, 2017","reviewText":"Item just as described. Great value and\nFast shipping too."},{"reviewerName":"Denise M. Cox","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"May 13, 2017","reviewText":"AWESOME!! love it"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"it's really great.. i will tell my friend about this ...","reviewDate":"October 11, 2016","reviewText":"it's really great .. i will tell my friend about this\n\nThanks\n\nHuy"},{"reviewerName":"bree","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"April 1, 2017","reviewText":"AMAZING"},{"reviewerName":"Lori Schultz","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"February 7, 2017","reviewText":"Excellent product... all the extras are amazing"},{"reviewerName":"DAVID THOMPSON","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"August 14, 2017","reviewText":"very good deal love it"},{"reviewerName":"Evan Palazzo","rating":"5.0 out of 5 stars","reviewTitle":"Amazing camera, I am very glad I bought this.","reviewDate":"December 5, 2016","reviewText":"The camera is magnificent, the quality is beautiful. Everything came in the package, undamaged and in great condition. The 18-55mm lens and the 75-300mm lens could fit in the camera bag perfectly. The battery life is good, and the camera is great for beginners. I am a beginner and the camera has been very easy for me to work with. I also read the manual and that helped a lot. I have had this camera for one week and I've not come across any problems or issues with the it, but the 57\" Tripod did not come with any instructions. Although it did not come with instructions, there are many videos on YouTube for setting it up. Also, the screen protectors that came in the Starter Kit for the Cameras LCD screen and lenses, were not that great of quality, that bubbled and made streaks across the screen. There were minor issues with this bundle but overall it is a great bundle and a wonderful deal. I would recommend this bundle to a friend."},{"reviewerName":"Roger Guillen","rating":"5.0 out of 5 stars","reviewTitle":"Awesome","reviewDate":"June 19, 2017","reviewText":"All was great. Thanks for this great product."},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"December 13, 2016","reviewText":"I was very happy with my new camera. What a great deal very happy:)."},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"February 11, 2017","reviewText":"Great kit good value, love it"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"December 8, 2016","reviewText":"Fast shipping and its just what my granddaughter wanted"},{"reviewerName":"Karee Deardorff","rating":"5.0 out of 5 stars","reviewTitle":"Awesome","reviewDate":"November 17, 2016","reviewText":"I love my new camera Great deal Great package"},{"reviewerName":"Christa","rating":"5.0 out of 5 stars","reviewTitle":"Perfect!","reviewDate":"April 17, 2017","reviewText":"Love love love!! Was exactly what I wanted and needed!"},{"reviewerName":"Zaynab Abdi","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"December 22, 2016","reviewText":"I love it"},{"reviewerName":"TAUNYA S DAVIS","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"February 9, 2017","reviewText":"Exactly as states. My husband loves it!"},{"reviewerName":"qqaiser142","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"April 24, 2017","reviewText":"I love this camera a lot"},{"reviewerName":"kenjo42","rating":"5.0 out of 5 stars","reviewTitle":"Very excited!","reviewDate":"December 7, 2016","reviewText":"I am new to photography and this kit came with everything I needed to get started at a great price!"},{"reviewerName":"mino","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"July 19, 2016","reviewText":"Finally got the corect camera at great price!!!!"},{"reviewerName":"Amy Wilkins","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"February 9, 2017","reviewText":"Amazing price, great product, fast shipping!"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"January 8, 2017","reviewText":"Very good deal!"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"March 3, 2017","reviewText":"Great product love it thanks!!!"},{"reviewerName":"Max R. Nelson","rating":"5.0 out of 5 stars","reviewTitle":"Best","reviewDate":"May 13, 2017","reviewText":"Very good camera"},{"reviewerName":"Amazon Customer","rating":"4.0 out of 5 stars","reviewTitle":"Most of the other stuff is good.","reviewDate":"April 21, 2017","reviewText":"Card reader doesnt work. Most of the other stuff is good."},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"June 30, 2016","reviewText":"Great camera and all the kit was arrived in good conditions."},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"December 7, 2016","reviewText":"Works really well."},{"reviewerName":"Valentina","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"September 17, 2017","reviewText":"Great products"},{"reviewerName":"Amazon Customer","rating":"4.0 out of 5 stars","reviewTitle":"Missing GPS","reviewDate":"February 20, 2017","reviewText":"Wish it had GPS like my little camera does."},{"reviewerName":"BRUCE McFie","rating":"5.0 out of 5 stars","reviewTitle":"... bit cheesey but the total package is such a great deal! Extremely happy","reviewDate":"December 22, 2016","reviewText":"Exterior flash a bit cheesey but the total package is such a great deal! Extremely happy."},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"October 11, 2017","reviewText":"Awesome!"},{"reviewerName":"Amazon Customer","rating":"4.0 out of 5 stars","reviewTitle":"Four Stars","reviewDate":"August 20, 2017","reviewText":"Good starter camera"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Love it!","reviewDate":"March 5, 2017","reviewText":"Great first DSLR. I love this camera!"},{"reviewerName":"sam skeens","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"December 22, 2016","reviewText":"Excellent camera!\nSuper fast shipping. Highly recommended"},{"reviewerName":"Michael D.","rating":"5.0 out of 5 stars","reviewTitle":"IT will be a great Christmas gift","reviewDate":"December 7, 2016","reviewText":"Fast service , IT will be a great Christmas gift."},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"June 7, 2017","reviewText":"This camera is awesome!!!"},{"reviewerName":"Teresa G.","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"September 15, 2017","reviewText":"love"},{"reviewerName":"Leonilda Lora","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"August 22, 2017","reviewText":"Love it"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"July 29, 2017","reviewText":"Excellence"},{"reviewerName":"Gatorgirl21","rating":"1.0 out of 5 stars","reviewTitle":"False advertising","reviewDate":"January 26, 2017","reviewText":"False advertising in the photo. I received a different package that did not include everything in this photo. It had one 32gb and one 16gb card no case for lenses. The camera case was not the one in the photo. There were no side compartments or straps as shown. It was discounted by $10.00 but I was not happy with their lying about what you get and substituting items so I sent it back. I HATE LIERS!!!!!"},{"reviewerName":"Maneesh Kumar Singhal","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"January 10, 2017","reviewText":"Good product."},{"reviewerName":"Robert A. Beard","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"November 18, 2016","reviewText":"Delivered on Sunday, as promised, had everything I wanted."},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"August 13, 2016","reviewText":"Fantastic camera! I love everything that came in the package."},{"reviewerName":"Amazon Customer","rating":"1.0 out of 5 stars","reviewTitle":"Awful and should not be sold!!","reviewDate":"March 26, 2017","reviewText":"I am very dissatisfied with this purchased. My main lens is non-functional and two other lens do not work as well. Along with that the lens of main lens the glass fell out!!"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"November 29, 2016","reviewText":"Such a good product"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"October 19, 2016","reviewText":"Awesome quality. Fast delivery"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"June 3, 2017","reviewText":"Its great!"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"February 13, 2017","reviewText":"It's great!!!"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"December 17, 2016","reviewText":"very pleased with the product as well as the Amazon shopping experience."},{"reviewerName":"Amazon Customer","rating":"3.0 out of 5 stars","reviewTitle":"New?","reviewDate":"December 15, 2016","reviewText":"Its a great camera. I was just expecting a new one. The camera that I got has over 3900 pics on it already. Not sure what I missed in the ad.\n\nAny one can have a good experience when everything goes perfect. A really good experience is when customer service steps in when things are not just perfect. The folks at Photo Savings sure stepped up and made things right. I cannot say enough about thier customer service. And the Canon is a great camera."},{"reviewerName":"kendra","rating":"5.0 out of 5 stars","reviewTitle":"Great value","reviewDate":"November 10, 2016","reviewText":"This is the perfect starter kit for someone transitioning into DSLR. Great value for all that's included. Photoso have been amazing, though I'm still learning about how and when to use all the settings."},{"reviewerName":"G Star","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"February 9, 2017","reviewText":"5 stars"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"January 3, 2017","reviewText":"Perfect!!!!"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Pleased with the product.","reviewDate":"January 7, 2017","reviewText":"The camera was a gift for my grandson. He loves it."},{"reviewerName":"Jessica L. Cheney","rating":"5.0 out of 5 stars","reviewTitle":"Happy customer","reviewDate":"January 10, 2017","reviewText":"Loving my new DSLR camera! So many gadgets included I haven't yet used them all. What a great bundle, would definitely recommend purchasing this product. I did a lot of research before biting the bullet on this purchase and Im glad I went with a bundle because its such a good value for everything you are getting. I have not yet used the longer lens but I am sure it will be up to my beginning photographer expectations."},{"reviewerName":"Michael Hueter","rating":"4.0 out of 5 stars","reviewTitle":"Awesome camera, and fairly easy to use for beginners","reviewDate":"December 15, 2016","reviewText":"Awesome camera, and fairly easy to use for beginners. Some of the accessories that come with it are pretty cheap, but still a great deal. The tripod is a bit wobbly, and one of the legs on the table tripod fell off as soon as I picked it up. I mainly bought this for the camera, lenses, and the SD cards, all of which I am very satisfied with."},{"reviewerName":"Opa","rating":"3.0 out of 5 stars","reviewTitle":"1st time not as expected","reviewDate":"December 17, 2017","reviewText":"I sent her to The Netherlands with this in tow and expected more out of everything, her & camera. Thought it would be an easy trans from working with my 5D mark II. Not the case. A number of the pictures were very nice. Maybe the lens was too slow. Got her a book for Xmas to make for better images. We'll see."},{"reviewerName":"Amazon Customer","rating":"4.0 out of 5 stars","reviewTitle":"Four Stars","reviewDate":"December 30, 2016","reviewText":"Great"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"December 11, 2016","reviewText":"excelent"},{"reviewerName":"kandglawn","rating":"5.0 out of 5 stars","reviewTitle":"Bundle is the way to go. Dont pay attention to megapixels they dont mean as much as people think. Great camera geeat bundle.b","reviewDate":"June 30, 2016","reviewText":"This bundle literally saved me a bundle of money. It comes with everything you would possibly need. I think the only accessory I've ordered was a neck strap other than that everything is included. The 18 megapixel if far more impressive then I imagined. The wifi feature makes this the prefect camera for me for the price. I feel like a professional now and if u saw some of my shots with this camera u would think so as well. Very nice package glad I bought the bundle."},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"August 17, 2016","reviewText":"I love my new camera!"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"August 11, 2016","reviewText":"Soo good!!"},{"reviewerName":"Grandma 7","rating":"5.0 out of 5 stars","reviewTitle":"... received the camera in record time and it was nicely packaged for maximum protection of all the fragile pieces","reviewDate":"February 8, 2017","reviewText":"We received the camera in record time and it was nicely packaged for maximum protection of all the fragile pieces. The price of this entire set was perfect for what we use our camera for; family pictures, children's sports,and everyday pictures.\n\nThe camera is lightening fast and a great step-up from our previous Canon camera. We love using the wifi perk and use it to review our pictures and quickly post them to social media.\n\nHands down a perfect price for an amazing package. Thanks so much for a quality package with a fantastic price!"},{"reviewerName":"Kylie Cicala","rating":"5.0 out of 5 stars","reviewTitle":"Love it! Can't seem to get the flash to ...","reviewDate":"January 4, 2017","reviewText":"Love it! Can't seem to get the flash accessory to go on but I'm new to this so it may just be me."},{"reviewerName":"kristin","rating":"5.0 out of 5 stars","reviewTitle":"I have played with it a little myself and it’s great, I’m really excited to give it to her","reviewDate":"October 30, 2017","reviewText":"So I bought this gift for my girlfriend for our two year anniversary. I have played with it a little myself and it’s great, I’m really excited to give it to her. She has been wanting a dslr camera for a long time. I will update this review once I give her the camera and let you know how she likes it! but for now it’s an awesome purchase!"},{"reviewerName":"Emily R.","rating":"5.0 out of 5 stars","reviewTitle":"Worth it","reviewDate":"June 24, 2016","reviewText":"Fantastic camera, wifi downloading is amazing. Great shots and lenses. Worth the package. I shopped several places to find the best value and this one was it"},{"reviewerName":"Vivian Cheeseman","rating":"5.0 out of 5 stars","reviewTitle":"This is a great bundle. We bought it for our son for ...","reviewDate":"February 11, 2017","reviewText":"This is a great bundle. We bought it for our son for Christmas so he could have everything he needed for a college photography class. Turns out his class is a black and white manual setting only film class, so he hasn't really dug into this kit yet. We know that this is a great camera, though, and perfect for him. It will really give him the ability to grow in this new interest without an initial outlay of huge amounts of money. I would say that the only drawback to this nice bundle, is that some of the equipment, like the tripod, is pretty flimsy. I wasn't upset by that, because it was to be expected, and I bought the bundle for the camera more than anything. Overall, this was a great 5-star purchase. It was well priced, came earlier than expected, was packaged well, and filled with lots of goodies. I would definitely purchase again."},{"reviewerName":"james","rating":"3.0 out of 5 stars","reviewTitle":"... quality of the accessories only rates 3 stars at best. Wish they would include better descriptions or name ...","reviewDate":"December 28, 2016","reviewText":"The quality of the accessories only rates 3 stars at best. Wish they would include better descriptions or name brands..."},{"reviewerName":"Vic S.","rating":"5.0 out of 5 stars","reviewTitle":"but this is an excellent buy. The best thing I have noticed so ...","reviewDate":"May 5, 2017","reviewText":"So many things yet to play with, but this is an excellent buy. The best thing I have noticed so far other then the absolute beautiful images is that you do not need a steady hand."},{"reviewerName":"Patricia Malchiodi","rating":"5.0 out of 5 stars","reviewTitle":"Fantastic. Still learning how to use it all","reviewDate":"January 17, 2017","reviewText":"Fantastic. Still learning how to use it all. But I love, love, love the challenge. It takes the most beautiful pictures. I am enjoying this camera more then I ever imagined I could."},{"reviewerName":"Amazon Customer","rating":"4.0 out of 5 stars","reviewTitle":"Canon camera deluxe offer","reviewDate":"May 25, 2016","reviewText":"I like the camera and was surprised with all the things that came with it. The only thing I wasn't expecting was the extra products were not the Canon brand, it was a different off name label that I've never heard of before. Otherwise, I really like my camera, everything came in the package as stated on line and it arrived safely."},{"reviewerName":"Cass","rating":"5.0 out of 5 stars","reviewTitle":"I bought this for my daughter as a gift - ...","reviewDate":"June 5, 2017","reviewText":"I bought this for my daughter as a gift - she has the gift to catch that magical look , moment , beauty in things . Hopefully she can start her own side business - she loves the camera"},{"reviewerName":"Geribash","rating":"4.0 out of 5 stars","reviewTitle":"But Amazon gave me credit for that which satisfied me. Cameras work great","reviewDate":"April 12, 2017","reviewText":"I received a scratched extra lenses and was missing some of the small items in the package. But Amazon gave me credit for that which satisfied me. Cameras work great."},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"I truly love this camera i replaced my Nikon d3200 with this ...","reviewDate":"November 28, 2016","reviewText":"I truly love this camera i replaced my Nikon d3200 with this camera and im so happy that i did and have no regrets.\nthe pictures that this camera produces are just totally amazing!\nwhat a really cool feature is the wifi where i can have it connect to my IPhone and upload the pictures onto my phone\nyou can also use your phone as a remote for the camera!\nthe lenses are great i was able to take some really nice shots of the moon with the 300mm lens"},{"reviewerName":"Jmarks","rating":"4.0 out of 5 stars","reviewTitle":"great product and some great accessories","reviewDate":"February 28, 2017","reviewText":"great product and some great accessories.\n\nthe tripod is junk. throw it away. broke before we even got to use it. but why put an expensive camera on a .10 tripod."},{"reviewerName":"Stephen","rating":"5.0 out of 5 stars","reviewTitle":"Shipped as ordered and takes great pictures. Easy to use","reviewDate":"September 14, 2016","reviewText":"Shipped as ordered and takes great pictures. Easy to use. I use the 75-300 zoom lens far more than the standard 18-55. Well worth it."},{"reviewerName":"Alice Lopez","rating":"5.0 out of 5 stars","reviewTitle":"It was a very good deal.","reviewDate":"December 4, 2016","reviewText":"Was really surprised at what was included in the deluxe package offered with this purchase. It was a very good deal."},{"reviewerName":"Paige L Williams","rating":"5.0 out of 5 stars","reviewTitle":"Great service, camera and all components exactly as advertised!","reviewDate":"February 10, 2017","reviewText":"I ordered two of these kits for my two teenage kids who are both interested in moving to a higher level in photography. They arrived promptly and with all components as advertised, and I'm very pleased with my service by Photo Savings. The cameras themselves are great and easy to use. I also bought a separate booklet called something like \"Canon EOS Rebel for dummies\" which has been helpful."},{"reviewerName":"AJ","rating":"5.0 out of 5 stars","reviewTitle":"Absolutely love my new camera","reviewDate":"September 22, 2016","reviewText":"Absolutely love my new camera. Everything was packaged correctly and my camera was very safe. The only thing is the bag has no instructions on the way the pads could go (minor thing). Can't wait to start shooting."},{"reviewerName":"Michael McDonald","rating":"5.0 out of 5 stars","reviewTitle":"Highly recommended for beginners to intermediate users.","reviewDate":"December 24, 2016","reviewText":"Very inclusive kit. The filters and tripods and all work well. The camera bag is sturdy and fits everything but the large tripod without a problem. The camera is easy for a beginner to use and offers more advanced features to grow in to. I highly recommend this package for someone looking to start getting into serious photography."},{"reviewerName":"cynthia mcalister","rating":"5.0 out of 5 stars","reviewTitle":"Loved the how to videos on line and all the ...","reviewDate":"August 5, 2016","reviewText":"Loved the how to videos on line and all the lessons on line on how to use the extra gadgets."},{"reviewerName":"Jennifer Marshall","rating":"4.0 out of 5 stars","reviewTitle":"Other than that amazing camera combo for the price","reviewDate":"November 16, 2016","reviewText":"This camera package is even more than I had hoped for. It's everything you need to capture your memories. The only complaint at this point is the camera bag is not big enough for all the accessories to be carried together and you can't leave the longer lense on it with out taking all the accessories out. Other than that amazing camera combo for the price."},{"reviewerName":"sharon cassidy","rating":"5.0 out of 5 stars","reviewTitle":"great camera","reviewDate":"July 8, 2016","reviewText":"love it. still learning options"},{"reviewerName":"Susan S. Muehleck","rating":"5.0 out of 5 stars","reviewTitle":"Excellent choice","reviewDate":"July 12, 2016","reviewText":"Upgraded from a Canon T3i. Love the new lighter weight camera. Takes great pictures. Excellent quality photos on auto. Very pleased with the whole package. Beginner/Advanced beginner camera to more complicated manual settings."},{"reviewerName":"Kellie McAlpin","rating":"5.0 out of 5 stars","reviewTitle":"Amazing!!","reviewDate":"March 2, 2017","reviewText":"I am so happy and completely satisfied with this bundle! the camera is beyond amazing, and I am having so much fun playing with all the different accessories. I'd definitely recommend this to anyone!"},{"reviewerName":"Princess of the Dawn","rating":"3.0 out of 5 stars","reviewTitle":"Nice camera bundle, BUT ......","reviewDate":"February 13, 2017","reviewText":"This is a great camera. The bundle package is better than buying the camera with just one len.\nThe pro: everything but 2 items, the bag and the big tripod.\n\nThe con: the bag is too small. You basically shoving everything that comes in the bundle in there. Not enough room. I have to buy the back pack which is better since you have everything well organized. And the tripod is tooooooooo cheap. You better buy a good one since the camera is NOT CHEAP."},{"reviewerName":"Jan","rating":"3.0 out of 5 stars","reviewTitle":"Don't bother with these accessories","reviewDate":"December 29, 2016","reviewText":"The accessories are junk, the zipper on the bag broke the first day I used it. The camera itself is fine but my husband's phone takes better/clearer pictures. The wifi feature is good though"},{"reviewerName":"Angela Holland","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"December 28, 2016","reviewText":"Bought for our daughter for Christmas. She is in seventh heaven."},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"perfect buy for starting a hobby in photography","reviewDate":"February 13, 2017","reviewText":"The kit has everything that it says it does! Camera, lenses and filters work perfectly. The only criticism I have is the tripod is a little flimsy and the card reader stopped working after a few days but other than that, perfect buy for starting a hobby in photography!"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"June 12, 2017","reviewText":"Grand son loves his camera"},{"reviewerName":"SJT","rating":"5.0 out of 5 stars","reviewTitle":"Very satisfied!","reviewDate":"May 26, 2016","reviewText":"I researched for a DSLR camera for awhile and I've decided on the Canon EOS Rebel T6 bundle. I purchased it from Photo Savings through Amazon...highly recommended! The package came in two days and it was packaged perfectly. I just started playing with it a little bit and find it fairly easy to use. Instruction manual online was easy to access and download. The bundle made it easy to get started with the camera without having to purchase individual items. Great price for the bundle."},{"reviewerName":"AHAGANS","rating":"5.0 out of 5 stars","reviewTitle":"Love the product and the sheller","reviewDate":"February 9, 2017","reviewText":"I ordered this for my daughter for Christmas. She absolutely loves it. Shipping was fast, and the product was everything promised in the advertisement. Love the product and the sheller."},{"reviewerName":"raashi","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"December 5, 2016","reviewText":"exillent camera i love it"},{"reviewerName":"Johanns Orchid Treasures","rating":"5.0 out of 5 stars","reviewTitle":"I love this Rebel T6 Bundle","reviewDate":"October 17, 2016","reviewText":"Purchased this to take the orchid jewelry product photos for Johanns Orchid Treasures my wife creates from the orchids from her backyard nursery.\nThis camera was recommended to me by a wedding photographer friend because\n• It would take quality photos\n• It has an easy learning curve for us. She was RIGHT.\nThe Canon EOS Rebel T6 DSLR Camera with EF-S 18-55mm f/3.5-5.6 IS II Lens, EF 75-300mm f/4-5.6 III Lens, and Deluxe Accessory Bundle has all of the lenses needed for close ups of the products.\nAfter the items in the box another big plus is that Canon Rebel T6 has an app that lets you use your smart phone as a view finder and shutter control.\nI use the BlueDot Trading-Photo Tabletop Studio Light 24-Inch/60cm Tent Box Kit with 2 Lamps and Camera Stand - Large Photobox (White) for all of the photos.\nFor the tasks I need to complete both of these products are definitely 5 stars.\n\nOrchid photo taken in the BlueDot light box using the Rebel T6 18-55mm lens with the HD wide angle macro converter lens in the kit."},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"I love my new camera and it is flawlessly satisfying","reviewDate":"July 14, 2016","reviewText":"I love my new camera and it is flawlessly satisfying. Everything in the description on what's included is really true. Best deal for Rebel t-6"},{"reviewerName":"Greg","rating":"4.0 out of 5 stars","reviewTitle":"Excellent Photographer Starter Package","reviewDate":"June 24, 2016","reviewText":"Wow - more than I expected. Lots to learn but a good starter package.\nBeginner? Buy this and you will not be disappointed."},{"reviewerName":"M. Martinez","rating":"4.0 out of 5 stars","reviewTitle":"Great value","reviewDate":"March 10, 2017","reviewText":"Decent package for the money. External flash did not fit camera...but other than that I'm totally satisfied."},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"I started off using the AF ( auto focus ) feature and was pleased with the detail it achieves","reviewDate":"April 6, 2017","reviewText":"This Kit comes with everything and then some you will need. I started off using the AF ( auto focus ) feature and was pleased with the detail it achieves. The operating manual is excellent so now I'm expanding my comfort zone. Great camera!!!"},{"reviewerName":"Karioka","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"July 8, 2016","reviewText":"Best deal ever!"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"and it doesn't take good photos at all","reviewDate":"April 18, 2017","reviewText":"I need someone to contact me from amazon regarding my canon camera, it's been only used twice, and it doesn't take good photos at all, my cell phone takes better pictures, I don't no if it has a defect or what, but please contact me, very unhappy 443-433-8299"},{"reviewerName":"Amazon Customer","rating":"2.0 out of 5 stars","reviewTitle":"Brands don't match accessories","reviewDate":"May 24, 2017","reviewText":"The brands listed don't match up with the products you receive. Also, the tabletop tripod was missing (Amazon mended this bridge for me)... still disappointed. I guess I should be glad the camera was what it's supposed to be."},{"reviewerName":"Mario Guerrero","rating":"4.0 out of 5 stars","reviewTitle":"Buy it now!","reviewDate":"July 1, 2016","reviewText":"I expected all the product come from Canon but it didn't, except for the camera (of course) and the EF 75-300. Anyway, the price is very convenient and I got everything the next day I ordered it, so I'm satisfied with my buying."},{"reviewerName":"Amazon Customer","rating":"2.0 out of 5 stars","reviewTitle":"Broken","reviewDate":"May 8, 2017","reviewText":"The camera was fine I did received everything, my only problem was that the stand for the camera is Broken."},{"reviewerName":"G.W","rating":"1.0 out of 5 stars","reviewTitle":"Screen went blank","reviewDate":"October 6, 2018","reviewText":"The screen went blank in 3 weeks"},{"reviewerName":"Danielle Berwick","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"July 7, 2016","reviewText":"Great camera, came with all I needed and more! Looking forward to taking pictures of my newborn son!"},{"reviewerName":"Brandy","rating":"5.0 out of 5 stars","reviewTitle":"Amazing Camera!!","reviewDate":"January 8, 2017","reviewText":"Got my camera only yesterday and I'm already in love. I love it and all the accessories. I'm speechless so I'll let my pictures from the past 24 hours do the talking =)"},{"reviewerName":"Raymond E. Hunniford, Jr.","rating":"4.0 out of 5 stars","reviewTitle":"The camera is everything I wanted and more. My ...","reviewDate":"September 12, 2016","reviewText":"The camera is everything I wanted and more. My grandson, who is a photograph \"nut\" is teaching me the ropes of my CANON EOS REBEL T"},{"reviewerName":"K. Jaquet","rating":"2.0 out of 5 stars","reviewTitle":"Not Happy","reviewDate":"March 29, 2017","reviewText":"First off, I bought this package for a higher price because it was purported to come with an additional battery, a car charger, and two 32GB cards. That is completely FALSE! I received ONE 32 GB card, one 16 GB card and ONE battery. No car charger. I'm also not sure if I just received a bad camera, but this unit is terrible in low light. It will not focus at all unless there is superb lighting. Additionally, the flash is constantly indicating that is it \"busy\" and I am unable to take a picture. This is an expensive package and it definitely did not deliver!"},{"reviewerName":"Friday","rating":"5.0 out of 5 stars","reviewTitle":"I'm in LOVE so many things came and I'm loving the quality","reviewDate":"July 11, 2016","reviewText":"I'm in LOVE so many things came and I'm loving the quality. I can't wait to play around with it"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"July 7, 2016","reviewText":"it's great for a starter camera couldn't ask for more"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"March 17, 2017","reviewText":"I love this bundle it has everything!!!! I would recommend this product tie everyone!!!!!"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Otherwise I LOVE THIS CAMERA and KIT","reviewDate":"January 20, 2017","reviewText":"The only thing that I am now finding out is this kit does not include a piece that allows you to adapt your telephoto lens to the lens within the kit. Otherwise I LOVE THIS CAMERA and KIT!!!!!!"},{"reviewerName":"Chelsea James","rating":"5.0 out of 5 stars","reviewTitle":"This product is amazing. It came with everything it was supposed to ...","reviewDate":"March 20, 2017","reviewText":"This product is amazing. It came with everything it was supposed to and everything works amazing. I'm more than happy with my purchase and I will definitely be recommending it to others!"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"I love this camera!","reviewDate":"August 3, 2016","reviewText":"We are not experts by any means, but our pictures are coming out sooooooo much better!"},{"reviewerName":"Erick C.","rating":"5.0 out of 5 stars","reviewTitle":"Wonderful Camera","reviewDate":"June 7, 2016","reviewText":"Great camera. Works wonders. Even has a built in camera, many filters, and I've made several videos in HD."},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"June 28, 2016","reviewText":"Amazing accessory kit- everything plus more was included with the camera."},{"reviewerName":"Amazon Customer","rating":"3.0 out of 5 stars","reviewTitle":"Three Stars","reviewDate":"December 9, 2017","reviewText":"There are better options!"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"great deal!","reviewDate":"November 13, 2016","reviewText":"My wife loved it!\nI purchased this kit for my wife who has been wanting to start doing photography again."},{"reviewerName":"Pete Riley","rating":"5.0 out of 5 stars","reviewTitle":"Great product. Bought for my son as a graduation ...","reviewDate":"July 14, 2017","reviewText":"Great product. Bought for my son as a graduation gift. He took it to Greece and had a great time photographing all the sights."},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Amazing Camera !","reviewDate":"November 7, 2016","reviewText":"I got a Canon EOS Rebel T6 DSLR Camera. Bundle included lenses EF-S 18-55mm, EF 75-300mm, a telephoto converter and a micro \"fisheye\" converter lenses, these last two were Vivitar brand. Two 32GB SDHC cards, Canon charger, Canon Batery and Canon strap. The rest of the items included in the bundle are of bad quality. tabletop tripod doesn't hold the camera, too much weight for it. The other \"sturdy\" tripod is not sturdy at all, it is trash, I would be embarrased if I sell it on craigslist, same thing with the power flash, and carrying case, believe me, bad, bad quality. the other miscellaneous stuff are trash as well.\n\nBut my 5 stars are for the Canon Camera and lenses, it is a good product with high reputation, and also to Seller Photo Savings, camera arrived a day before the promised date, and items were well packaged."},{"reviewerName":"Texas","rating":"5.0 out of 5 stars","reviewTitle":"I use Apple products (iPhone/pad) and the Canon instructions were a little lacking in hooking up the wifi feature(it would be go","reviewDate":"February 27, 2017","reviewText":"Arrived a day early! This is my 3rd Canon Rebel. I was excited about the wifi feature. This bundle contains all the extras you need and then some. I use Apple products (iPhone/pad) and the Canon instructions were a little lacking in hooking up the wifi feature(it would be good if the online led you to the correct app). Once I downloaded the Canon app it was a piece of cake! Lots of pics in my future!!"},{"reviewerName":"mandi","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"February 9, 2017","reviewText":"Love this camera set . It takes the best pictures."},{"reviewerName":"Mark","rating":"5.0 out of 5 stars","reviewTitle":"Good","reviewDate":"July 2, 2016","reviewText":"Quick service. Good value"},{"reviewerName":"Amazon Customer","rating":"4.0 out of 5 stars","reviewTitle":"I know it was nice present, she says","reviewDate":"June 20, 2017","reviewText":"Thanks,I buy it for a gifft ,I know it was nice present,she says......"},{"reviewerName":"erica","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"March 8, 2017","reviewText":"Fantastic bundle!"},{"reviewerName":"ana r.","rating":"5.0 out of 5 stars","reviewTitle":"Love!","reviewDate":"July 6, 2016","reviewText":"More than I expected. Love!"},{"reviewerName":"Adrbca","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"August 4, 2016","reviewText":"On time fantástic !"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"July 26, 2016","reviewText":"This package is amazing excellent"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"September 23, 2016","reviewText":"Awesome camera!"},{"reviewerName":"Amazon Customer","rating":"4.0 out of 5 stars","reviewTitle":"Four Stars","reviewDate":"January 30, 2017","reviewText":"zesty"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"I'm in love!","reviewDate":"June 3, 2016","reviewText":"This camera takes amazing pictures! It has tons of features and the built in wifi is definitely my favorite. I love this bundle as it comes with tons of extra accessories for a pretty good price and Everything came as listed"},{"reviewerName":"Justin D. McGrath","rating":"5.0 out of 5 stars","reviewTitle":"Epic bunclde!","reviewDate":"August 11, 2016","reviewText":"Returned as I really shouldn't have spent so much, but I loved it for the 1 minute I used it before returning it. Wish I could have kept it"},{"reviewerName":"RJS","rating":"5.0 out of 5 stars","reviewTitle":"Great Pictures. Light Weight. Reasonably Priced.","reviewDate":"May 13, 2016","reviewText":"We wanted a camera that took good pictures and was not that difficult to use. The camera is light weight, takes great pictures and reasonably priced. If you expect a professional camera, this is probably not what your looking for. If you want an everyday usable camera this camera fits the bill. It has several preset functions and has advanced functions that if wanted we could easily use to customize our photos. Regarding the \"bundle\" it contains 'Canon Lens' not generic brand lens. The bundle also contains other peripheral items that are all the accessories you could ever want. There is a learning curve, but you could take quality pictures right out of the box....after charging the battery. It is a good everyday camera made by reputable company 'Canon'. We received the package from the seller timely and it was well packed. The seller took the time to contact us to make sure we were satisfied with our purchase which was appreciated."},{"reviewerName":"Dave Steele","rating":"5.0 out of 5 stars","reviewTitle":"Camera works great","reviewDate":"May 15, 2016","reviewText":"All items shown arrived in package as advertised"},{"reviewerName":"Duare","rating":"5.0 out of 5 stars","reviewTitle":"Best DSLR entry package.","reviewDate":"June 25, 2016","reviewText":"Loved it. Bought another for my son's Godfather who loves it too. Great entry point DSLR, and the wifi function makes a huge difference, you can share the pics on the fly. Would also recommend purchasing the 1.8/50 lens for close ups."},{"reviewerName":"Carlos","rating":"1.0 out of 5 stars","reviewTitle":"Beware Do not Buy!!!","reviewDate":"July 14, 2016","reviewText":"I bought this expecting the camera with the whole kit and extra items! But to my surprise i only got the camera and the charger, none of the stuff advertise came with it! Not even the camera strap. Such a big dissapointment for the price!"},{"reviewerName":"Amazon Customer","rating":"2.0 out of 5 stars","reviewTitle":"Broken bag. But everything else is great!","reviewDate":"June 30, 2016","reviewText":"Camera and products were great. Up until I went to zip up the bag for the first time and the zipper broke because the tooth is missing on both sides in one spot. Is there anyway to get a different bag of this same one that fits all of the stuff?"},{"reviewerName":"Nancy","rating":"5.0 out of 5 stars","reviewTitle":"Good Deal, Great Pictures!","reviewDate":"June 24, 2016","reviewText":"I was very pleased with the photo bundle package. It contained everything to accessorize the Canon Rebel T6 DSLR camera. I have only owned this product for 5 days. The picture quality this camera produces is very good and I am really enjoying photographing with this new camera. I would definitely recommend this bundle package and camera. The camera comes with a complete manual on how to operate the Rebel T6 which is not a difficult camera to use. Here is a couple of shots I took with my new Rebel T6 DSLR."},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"August 18, 2016","reviewText":"It's a great camera!"},{"reviewerName":"james t. brown","rating":"4.0 out of 5 stars","reviewTitle":"Four Stars","reviewDate":"July 26, 2016","reviewText":"everything your need and more"},{"reviewerName":"luna","rating":"4.0 out of 5 stars","reviewTitle":"Four Stars","reviewDate":"June 20, 2016","reviewText":"Returned because I was looking for the tilts LCD screen."},{"reviewerName":"Michael Flynn","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"September 25, 2016","reviewText":"We love it!"},{"reviewerName":"Anonymous","rating":"1.0 out of 5 stars","reviewTitle":"Would have been a great bundle, but ...","reviewDate":"July 16, 2016","reviewText":"This seemed to be a good camera and bundle for more advanced amateur-level photo enthusiasts. However when I unpacked everything I found out that the lens and the tripod were damaged. Also, when placing the order, one is left with the impression that all parts of the bundle are from Canon. In fact only the camera, the 18-55mm EF lens and the 75-300mm EF lens are. The rest of the items are generic cheap off-shoot."},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Couldn't ask for more!","reviewDate":"July 1, 2016","reviewText":"The is the best kit you'll ever need if you are starting to learn about photography or even video. Everything came as described and the T6 really is a great value for the price, highly recommended product!"},{"reviewerName":"Heather","rating":"4.0 out of 5 stars","reviewTitle":"Four Stars","reviewDate":"October 12, 2016","reviewText":"Yes"},{"reviewerName":"Stephen McCloskey","rating":"4.0 out of 5 stars","reviewTitle":"Four Stars","reviewDate":"June 17, 2016","reviewText":"I did not dislike it, it works fine."},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Very nice package","reviewDate":"June 8, 2016","reviewText":"This camera has many features that I have only begun to figure out. Canon has many tutorials that I intend to take advantage of. This is definitely not a camera for someone that its wanting to just point and shoot."},{"reviewerName":"Fred Lulof","rating":"1.0 out of 5 stars","reviewTitle":"Too complicated","reviewDate":"December 13, 2016","reviewText":"Very complicated camera. It took me days beforeI\nI made a few poctures. Download these pictures to a desktop or IPhone takes forever. I would not buy this camera again."},{"reviewerName":"shave","rating":"5.0 out of 5 stars","reviewTitle":"A good place to start for DSLR kits","reviewDate":"June 18, 2016","reviewText":"I bought it for a particular purpose; to take pictures and make some videos. It's an entry level kit. That's what I needed. If it works well enough and I require more functionality and features, I'll buy another."},{"reviewerName":"2dropshop","rating":"5.0 out of 5 stars","reviewTitle":"My next level in photography!","reviewDate":"May 12, 2016","reviewText":"I was very pleased with how neat and organized everything was packaged. I shopped around for months before making this investment. The value of this package can not be found anywhere else.\nThanks for helping me get started on my intermediate journey in photography!"},{"reviewerName":"Amazon Customer","rating":"2.0 out of 5 stars","reviewTitle":"Two Stars","reviewDate":"December 30, 2016","reviewText":"Camera is great but the 11 days to get it was very distasteful I am very unhappy"},{"reviewerName":"Linda McIntosh","rating":"4.0 out of 5 stars","reviewTitle":"Great picture","reviewDate":"June 7, 2016","reviewText":"Well I haven't really used it much yet just around the house, and a beautiful sunset at the beach turned out really good, the only thing I'm not use to is the big zoom it's not like the zoom on my sx500 IS canon,its 30 x zoom, so it will zoom right up into the moon like crazy it's just to light if a camera,"},{"reviewerName":"Ricardo Cruz","rating":"1.0 out of 5 stars","reviewTitle":"Got a defective product, after shooting 5 pictures with ...","reviewDate":"July 31, 2016","reviewText":"Got a defective product, after shooting 5 pictures with flash the camera will turn off. Try with 3 different batteries and no luck. I returned it 2 weeks ago, but still waiting on my refund."},{"reviewerName":"Stephanie H","rating":"5.0 out of 5 stars","reviewTitle":"Great camera for great price.","reviewDate":"January 21, 2019","reviewText":"I got this camera as a gift for Christmas. I have to say I was really nervous about the features and being able to use the camera to its full potential. But with the instruction manual and all the information available online, its not as complex as I initially thought. I love this camera!! Just make sure to buy extra batteries."},{"reviewerName":"HGS","rating":"5.0 out of 5 stars","reviewTitle":"Love Our New Camera","reviewDate":"March 4, 2019","reviewText":"We are seniors...and have wanted a good digital camera for some time. The Rebel is easy to pick up and use....yet there is a lot to learn. I like the bundle, as it takes a lot of guesswork out of what we need to get started. There is still a lot to learn, but it can be as easy or as complex as you want to make it. We took it out of the box and took it to Death Valley. Cell phone cameras are great....but having a quality camera is a very good investment.\n\nOne drawback....I can't make phone calls with it."},{"reviewerName":"Wesley J Schiman","rating":"4.0 out of 5 stars","reviewTitle":"Mixed Review! Great Camera, the rest?? Eh, not so much","reviewDate":"August 10, 2018","reviewText":"Well the Camera is awesome. This is just an entry level camera, but its a great place to start. The overall deal I feel is fair, but buyer beware. My mini tripod broke on first attempt to open it, and the full size is so flimsy it is going straight in the trash without ever being used. I value the Camera, and lenses, so I will not use the main tripod at all, its guaranteed to fall over and break the camera.\n\nThe bag is sufficient, temporally. Some of the Velcro dividers are coming undone, after one attempt to organize the bag better.\n\nI still think with the low quality accessories, that this is a good deal. I am extremely picky about certain things, and I think others may find them adequate."},{"reviewerName":"Hope","rating":"5.0 out of 5 stars","reviewTitle":"If you want beautiful quality pictures this is the camera for you","reviewDate":"January 23, 2019","reviewText":"Very beautiful. It came with a lot more than I was expecting. My husband uses this all the time and says he loves it i would recommend this camera to everybody"},{"reviewerName":"Jennifer","rating":"5.0 out of 5 stars","reviewTitle":"I think she is going to be super excited when opens this Christmas morning since I convinced ...","reviewDate":"November 22, 2017","reviewText":"I received the camera but have not used it as it is a Christmas gift for my daughter. However, I opened the box, and I'm impressed with everything it comes with! I think she is going to be super excited when opens this Christmas morning since I convinced her she needed a computer for Christmas so she'll have a nice one when she goes off to college next fall. She isn't expecting to get this because I told her I couldn't do both at once. #sneakymom 😀"},{"reviewerName":"Nick Gill","rating":"5.0 out of 5 stars","reviewTitle":"Great camera for aspiring photographers!","reviewDate":"January 22, 2019","reviewText":"Settings are easy to work with and are great for photographers of every level. This package is great because it comes with multiple lenses, a tripod, carry case, memory cards....just an awesome deal!"},{"reviewerName":"Jan","rating":"5.0 out of 5 stars","reviewTitle":"That my son \"loved\" it...","reviewDate":"January 7, 2019","reviewText":"This was a gift for my son who is into Real Estate and was in need of a good camera. I did ask what his thoughts were in regards to it. He loves it...says there is a lot to it that he needs to learn about it. Been on U-Tube watching videos. He is very impressed!!!"},{"reviewerName":"Pete","rating":"5.0 out of 5 stars","reviewTitle":"It's an excellent starter kit for any ameture or semi ameture photographer","reviewDate":"March 25, 2017","reviewText":"It's an excellent starter kit for any ameture or semi ameture photographer. It has the basic essential components foe pictures and videos. It would be more simpler for a beginner to have an instructional DVD."},{"reviewerName":"Stanley","rating":"1.0 out of 5 stars","reviewTitle":"Almost not worth it.","reviewDate":"December 1, 2016","reviewText":"The camera itself is excellent; however, all the other features, excluding the camera and 2 lenses,are cheap off brand items that almost make this package not worth it. You'd be better off buying the camera and everything else separate in order to ensure the quality of items meets your expectations."},{"reviewerName":"bigfishonline","rating":"5.0 out of 5 stars","reviewTitle":"Great buy","reviewDate":"February 10, 2017","reviewText":"I purchased this for my wife for Christmas. She absolutely loves it. Great starter camera and affordable package. Photo Savings staff were more than helpful when I had questions. Great purchase!"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"It was exactly what i ordered so i'm pleased. I just received it today and have been ...","reviewDate":"August 30, 2017","reviewText":"It was exactly what i ordered so i'm pleased. I just received it today and have been playing around with it. I haven't tried out everything that it came with but i think this bundle is a really good deal."},{"reviewerName":"Nealle Beachler","rating":"5.0 out of 5 stars","reviewTitle":"Awesome Camera!","reviewDate":"June 24, 2018","reviewText":"I bought this for my 10 yr old daughter and she loves the camera. I have one for myself also and it takes great pictures. Easy to use, light weight. Excellent purchase."},{"reviewerName":"Ruben Calderon","rating":"5.0 out of 5 stars","reviewTitle":"she loved her gift and i got a whole lot for ...","reviewDate":"December 2, 2017","reviewText":"I purchased as a Christmas gift for my wife, she loved her gift and i got a whole lot for my money. Hopefully she can enjoy it for years to come. Its a beautiful camera and all the extras are of great quality, the tripod is a bit flimsy but it gets the job done"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Great Camera i sure am happy i picked up one now","reviewDate":"September 4, 2016","reviewText":"as someone that hasn't used a camera like this one,i was worried that it would be hard to understand .I am still learning an finding how easy it is. i found a web sight that helped a lot sometimes reading the instructions can confuse someone. here is the web sight that helped me a lot; [...]"},{"reviewerName":"Larry M. Miller","rating":"5.0 out of 5 stars","reviewTitle":"It was easy to use","reviewDate":"August 20, 2017","reviewText":"It was easy to use, recommend. I met one like this with my friend last week, maybe both of them are sold by the same seller."},{"reviewerName":"Benjamin foster","rating":"5.0 out of 5 stars","reviewTitle":"Awesome","reviewDate":"January 15, 2019","reviewText":"Great for beginners and great picture with my family"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"quality product","reviewDate":"January 10, 2019","reviewText":"I like the picture quality"},{"reviewerName":"Tatyana","rating":"4.0 out of 5 stars","reviewTitle":"Good quality for the price","reviewDate":"October 19, 2017","reviewText":"Good quality for the price. Lenses worked on the camera, but didn’t work on my better quality camera. For beginner who is on a budget this is a good choice"},{"reviewerName":"Maximus Armani","rating":"5.0 out of 5 stars","reviewTitle":"This is an awesome product. It was delivered exactly as it advertised","reviewDate":"February 10, 2017","reviewText":"This is an awesome product. It was delivered exactly as it advertised. I have never been so happy with a purchase like this before. Thank you !"},{"reviewerName":"cierra vaughn","rating":"5.0 out of 5 stars","reviewTitle":"Awesome especially when on the move","reviewDate":"February 15, 2017","reviewText":"Greatest camera EVER. I had an original before that used film. IT was so awesome in its time as well. THIS camera is unbelievable. Does everything like I want it to plus so much more. Thanks for ALL the extras too."},{"reviewerName":"Inha","rating":"5.0 out of 5 stars","reviewTitle":"Great camera for beginners 👍🏻","reviewDate":"February 20, 2019","reviewText":"Great camera for beginners!!!"},{"reviewerName":"Henry Asch","rating":"4.0 out of 5 stars","reviewTitle":"The tripod is garbage. You're almost better off holding the camera by ...","reviewDate":"November 10, 2016","reviewText":"The tripod is garbage. You're almost better off holding the camera by hand, but obviously it's a big bundle for cheap. The rest of the equipment is pretty solid. - a relatively new photographer"},{"reviewerName":"jennytzib","rating":"5.0 out of 5 stars","reviewTitle":"Yay","reviewDate":"August 18, 2017","reviewText":"Im very very happy about getting my first dslr it was great all the products that came with the camera was greats love love love it. Should definitely buy"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"May 22, 2017","reviewText":"Everything came as expected. My wife is very much enjoying using it."},{"reviewerName":"Jennifer M.","rating":"5.0 out of 5 stars","reviewTitle":"Great Camera!","reviewDate":"May 21, 2017","reviewText":"Took great pictures of our travels. Package met expectations. Supplier service was good."},{"reviewerName":"catfan1973","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"May 9, 2018","reviewText":"Great camera, easy to use."},{"reviewerName":"Amanda","rating":"5.0 out of 5 stars","reviewTitle":"packed compact and beautifully. This was purchased as a gift and it ...","reviewDate":"March 26, 2017","reviewText":"Very fast service, packed compact and beautifully. This was purchased as a gift and it will be very easy to wrap!"},{"reviewerName":"Johnny Miranda","rating":"2.0 out of 5 stars","reviewTitle":"La cámara tiene una mancha negra que no permite tomar bien las fotos","reviewDate":"October 6, 2018","reviewText":" El producto llegó bien, hice unas fotografías en un concierto y todo normal, hoy me desperté para tomarle fotos a mi gata y me encontré con que hay una mancha negra que me gustaría saber como quitar.\n\nQuedo atento para saber como resolver el inconveniente."},{"reviewerName":"Alejandro Sarli","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"December 18, 2017","reviewText":"Amazing!!"},{"reviewerName":"kdc","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"February 11, 2017","reviewText":"Excellent product package for a better than awesome price."},{"reviewerName":"Birdman","rating":"5.0 out of 5 stars","reviewTitle":"Great for beginners","reviewDate":"February 19, 2017","reviewText":"Great package for a beginning photographer. Includes lots of goodies."},{"reviewerName":"Jimmy Dyer","rating":"5.0 out of 5 stars","reviewTitle":"Perfect!","reviewDate":"February 8, 2017","reviewText":"Wife lives this set. Got a great deal on the camera and accessories."},{"reviewerName":"mike varholak","rating":"4.0 out of 5 stars","reviewTitle":"Not sure yet Christmas gift for","reviewDate":"December 13, 2016","reviewText":"Not sure yet Christmas gift for someone"},{"reviewerName":"Albert","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"February 11, 2017","reviewText":"great buy"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"January 4, 2017","reviewText":"Just love it, was what I always wanted for starting in the photography business! The perfect camera for beginners!\neverything came!"},{"reviewerName":"JMG","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"September 18, 2018","reviewText":"LOVE THIS CAMERA WOULD RECOMMEND"},{"reviewerName":"Roberto","rating":"5.0 out of 5 stars","reviewTitle":"Excelente bundle","reviewDate":"December 19, 2018","reviewText":"Excelente paquete a buen precio, la cámara funciona bien con todos sus accesorios. Recomiendo la tienda para futuras compras."},{"reviewerName":"Tina Lyons","rating":"5.0 out of 5 stars","reviewTitle":"Great quality and price, not to mention the bundle!!!","reviewDate":"December 29, 2018","reviewText":"I'm absolutely in love with my camera!!!"},{"reviewerName":"Kathy M.","rating":"5.0 out of 5 stars","reviewTitle":"Love, Love, Love this camera","reviewDate":"September 18, 2017","reviewText":"This camera is fantastic and so easy to use. I set it up and started taking picture's almost immediately. It came with everything advertised and in perfect condition. It will take me quite awhile for me to get to use all the attachments and find out everything I can do with this camera, but I have set my mind to do it. It takes beautiful picture's and you can download them right into you computer or printer from the card or use the card reader with the port connection. We had a small click and shot camera which served it's purpose but I always wanted a camera like our old Cannon that has film. This is it. I can't empress how happy I am with this camera and all the attachments and stands. Great product and would recommend it to everyone. Selling this camera through Amazon makes it so easy to reorder cards and anything else you might need. I will use this seller again as they sell great products and answered one question I had in about 15 minutes of my writing to them."},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Excellent product!","reviewDate":"February 12, 2017","reviewText":"Fast delivery!! Excellent product!! My daughter is in love with it! Thanks!!!"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Thanks! As advertised!","reviewDate":"April 21, 2017","reviewText":"Thanks! As advertised!"},{"reviewerName":"Moriah","rating":"5.0 out of 5 stars","reviewTitle":"Works like a dream","reviewDate":"September 5, 2017","reviewText":"Worth the price. I now use this at weddings and nature shots. Very high quality."},{"reviewerName":"Brett Johnson","rating":"4.0 out of 5 stars","reviewTitle":"Limited use as of yet...","reviewDate":"March 18, 2019","reviewText":"I haven't used it a lot yet, but I've found it very easy to use and I'm pleased with what Ive seen so far!"}],"qAndA":[{"question":"Is there a big difference between the T6 and the T5 ?","answer":"The T6 gives you Wi-Fi connectivity with NFC (allows users to tap a NFC enabled device to activate Wi-Fi). Other upgrades include:\nDIGICS 4+ Processor = faster (T5 has a DIGICS 4)\n920,000 pixel LCD screen = brighter and clearer live-view (up from 460,000 on the T5)… see more"},{"question":"can you buy other lenses to fit this camera separately","answer":"You can buy other Canon lenses for this camera, but it is recommended that you read lenses specifications first making sure the one you want to buy fits your camera model."},{"question":"Does it come with a charger","answer":"YES"},{"question":"Does this have good quality and a good picture","answer":"yes,just have to get used to not having film."},{"question":"This is probably a stupid question, but I can make videos with this right? Like good videos?","answer":"You are right!"},{"question":"What are the biggest proble with this kit?","answer":"I got my camera in November 2016, so far no problems at all. Other than the camera, lenses, and SD Cards, everything else in my bundle is worthless."},{"question":"Can I transfer videos through the canon app staight to my phone?","answer":"Yes! You do have to be connected to wifi though."},{"question":"Can you use an external mic with this?","answer":"No you cannot. There’s no audio input and the USB is output only. You’ll need to use an external recording device for better audio and then sync it with your video."},{"question":"Does it have a remote?","answer":"No"},{"question":"Is this camera New or Used?","answer":"New"},{"question":"Is this a gray market camera?","answer":"No, Photo Savings is a Canon Authorized dealer so all our Canon cameras and lenses comes with the USA warranty."},{"question":"What if the camera doesm't work?","answer":"I purchased the extra warranty"},{"question":"What is the weight?","answer":"according to manual, weight is 15.52 oz. (Body only)."},{"question":"Warranty for camera","answer":"I guess it is one year but I am not certain. I suggest you to send Canon an email."},{"question":"Does it have a flip out screen?","answer":"no it does not."},{"question":"After buying it, do we need to register this device at canon's site for 1 year guarantee?","answer":"If guarantees are important to you, then by all means. At my age they are not, is all I ask. is if it works fine an lasts along time, who cares!"},{"question":"What type of bag it has? It's the one in the picture or the smaller one with canon on it ?","answer":"the bag is not a canon bag but it holds everything except the tripod."},{"question":"I am looking for a good camera for real estate photos including nice wide angle shots. Is this a good choice?","answer":"Have been more than happy with subject matters with this camera set."},{"question":"Does it record videos?","answer":"Yes it does."},{"question":"Is white balance adjustable?","answer":"This camera has many adjustments as well as White adjustment. :)"},{"question":"is this camera good for shooting pic of sports such as paintball","answer":"Yes!"},{"question":"I am looking for a camera that will accommodate cable release and time lapse photos. Appreciate any suggestions","answer":"This is a perfect camera , it's accommodate cable releases. It is working working perfect for me and I will recommend it as it meet my expectations ."},{"question":"Is the tripod solid and sturdy?","answer":"Not really. Fortunately, I have my own which is a professional model"},{"question":"How is the customer service?","answer":"The product was good and only arrived a week late. I bought mine near Christmas so I didn't call the customer service for it."},{"question":"Does it have built in wifi? Because i read the difference between a t6 and t6s and the t6 doesnt have wifi..","answer":"Yes. Just looked at the menu. It has 2 options concerned with WiFi."},{"question":"Does this bundle really come with a neck strap? I saw in someone's review that they had to order one, yet the response does say it comes with one.","answer":"I am pretty sure it did. I have since purchaswd harn straps"},{"question":"Does it come with any software/utilities to make changes in laptop, or can it be downloaded for free?","answer":"Are you asking if it comes with editing software? If so no it does not."},{"question":"Shouldnt this come with a software cd?","answer":"Down load app for computer on line only. Camera Connect is the name of the app. The GPS on the T6 is not as user friend as my little camera."},{"question":"How long does it take to ship","answer":"Mine was one day with prime"},{"question":"Are the cameras sold in this package refurbished or brand new?","answer":"That depend in your choice at the time you choose with one you want, the price change in each option"},{"question":"Does the camera must have manual and program exposure modes? and does it have an eye level viewfinder, not just a rear lcd screen?","answer":"Yes, it has both manual and preprogrammed exposure modes. And does have both a viewfinder and lcd screen."},{"question":"How is video on this camera?","answer":"Video quality on this camera is much like the brilliant quality that one can expect from any canon DSLR. However I would say that having no flip out screen makes it more difficult to take certain shots."},{"question":"I'm starting my photography major this semester and just wanted to know if this was a good camera to start out with?","answer":"This is a great entry level camera system for someone that is interested in photography. The camera itself is fantastic and has most of the features you would look for in higher end systems and the lenses that ship with this system have a great range and will work with most any canon system if you upgrade the body late… see more"},{"question":"Does this package include an instruction manual?","answer":"Yes there was an instruction manual in the box."},{"question":"I'm confused. on canon's website it says that this model has 24.2 megapixels, yet i keep seeing it advertised here on amazon as having 18?","answer":"The T6 has 18 megapixals where the T6i has 24.1 megapixals. Hope this helps!!"},{"question":"Can you record video with thus camera? If so, can I connect it to the sound system board at my church richat my","answer":"You can record video and you can connect the camera to wifi and send the video via wifi to a laptop which you can then connect to the sound system and play the video if you like or I'm sure there is a video adapter made for this camera to connect to a sound system"},{"question":"What is the largest GB memory card you can use","answer":"There is no maximum size.\nIt has to be the supported memory type. You can find that on cnet.com or on the Canon spec page"},{"question":"Does this have a wifi?","answer":"Yes"},{"question":"Is the camera fully functioning and is the product actually manufactured by the company Canon?","answer":"Yes"},{"question":"Other then the warrenty we can buy does it have like a 1 year warrenty cause im 15 an buying this my self so i need to know for sure thanks","answer":"Dear camera lover,\nI have not given thought to warranty. I've had the camera for several months and had no issues. Most highly priced items come with a warranty. At 15, I think you will take care of it well. Enjoy the camera kit. It will not be your last camera. It is a great investment."},{"question":"Can i use separate samsung galaxy not 5 or samsung tab 3 as a separate screen for this camera","answer":"I don't know about the Tan 3, but I also own a note 5 and yes you can use it as a separate screen"},{"question":"So does the cameral only come with two different lenses? Because in the picture it shows the camera with the lense on it and then two other lenses.","answer":"You get the 2 pictured top left and also the telephoto lens and fish eye lens bottom left. Total of 4. Hope this helps."},{"question":"Is it original ?","answer":"Yes, it is the real thing, and it works fantastic!"},{"question":"Does the T6 have an articulated display? I need that for my astrophotography.","answer":"After looking on Google it appears the cannon t6 doesn't have an articulated display. Instead of asking the question here go to the Canon website and will be able to find a camera that comes with an articulated display"},{"question":"I'm going to be attending classes to become a nature photographer is this a good camera","answer":"Yes love it u going to be amazed good luck with your class"},{"question":"Does it come with only 1 lens that is 18-55mm ?","answer":"It come with 2 lens awsome camera love it alot"},{"question":"are the lenses Canon brand?","answer":"YES THEY ARE!"},{"question":"Does it come with everyting as shown in the picture","answer":"Yes as far as I can tell everything that is in the picture came in one box."},{"question":"Can it record videos? If so, how long?","answer":"Yes you can record video, I'm not sure how long."},{"question":"Can it record gaming videos ?","answer":"I have not tried it, but i believe it should be able to do it.\nIt's a powerful camera"},{"question":"Does it have an LCD screen","answer":"Yes, this camera is a very nice camera :)"},{"question":"Would this kit be good for astrophotography and for taking pictures of solar/lunar eclipses? If not what canon kit would be","answer":"I imagine this camera would do a great job. I actually bought an additional 500mm-1000mm telephoto lens so as I will take a full moon photo eventually. This package deal has many great options for the price."},{"question":"Is this original canon camera?","answer":"Yes"},{"question":"Is this camera water proof","answer":"No, is not water proof"},{"question":"does it come with only one battery?","answer":"Yes it only comes with one"},{"question":"¿Puede usar un control remoto?","answer":"La opción está pero el control lo venden por separado"},{"question":"Do it take pictures bright","answer":"Depends on how you set your exposure but overall it takes some great pictures"},{"question":"Does this camera take a picture every time you press the button or does it get hung up focusing, adjusting, etc. sometimes?","answer":"It gets hung up focusing, I still haven't figured out how for it to not do that. Sometimes if I switch the setting the picture will take."},{"question":"Does this come with any sort of tutorial?","answer":"You can go to YouTube for answers!"},{"question":"Incluye bateria?0","answer":"The camera comes with a battery and charger."},{"question":"Does this come with a warrenty","answer":"You can purchase an amazon warranty with it for I think 40 dollars or so."},{"question":"Does this camera have a stabilizer?","answer":"They both are right in a way. If you are looking for that feature on the camera itself, then the answer is no. Now as Margaret said, the stabilizer is on the len and is only one. The 18-55 mm is the one with the stabilizer. They should have it on both lens. Hope this help. Good luck."},{"question":"Does it have a waterproof case?","answer":"No. It doesn't."},{"question":"what's the maximum capacity SD card the Cannon T6 can handle ?","answer":"I have several 32gb cards that I use."},{"question":"How good is the recording quality","answer":"I'm not satisfied at all"},{"question":"Can the battery charge internally from usb. What voltage will battery charger accept ?","answer":"120 volt and yes you can charge it"},{"question":"Does this camera take good action photos?","answer":"It depends on if you are experienced with manual mode then you can choose the shutter speed. If you're in auto the camera will choose what It thinks you should be using most of the time it's ok."},{"question":"Does this have a charger and battery?","answer":"Yes it comes with both charger and battery .. I ordered a 2 pack of backup batteries also"},{"question":"Does it canon revel eos t6 support external microphone?","answer":"It does not have a microphone slot"},{"question":"Does it come with tripod？","answer":"Yes"},{"question":"can i pick this up at a canon store?","answer":"Possible but may not be bundled like this. Could end up paying more for each item."},{"question":"Does this camera include the battery and charger as pictured ?","answer":"Yes it did"},{"question":"what photo printer would I buy with this camera?","answer":"Have no recommendation"},{"question":"I do watercolors and I am looking for a camera that has a zoom lens to capture every nuance on flowers clearly...dewdrops, veins. Good choice?","answer":"This camera is absolutely fantastic!! I believe it will exceed your expectations -- with the only requirement on your part is to learn how to master the many amazing features of the camera to capture the level of detail you want to photograph. Enjoy and have fun!!!!"},{"question":"does it come with a battery","answer":"It comes ready to use...hence, yes it does have a battery"},{"question":"Do both lenses have the autofocus function?","answer":"Yes!"},{"question":"is the built in flash","answer":"Yes it has built in flash and in the kit, they also provide you with an \"on camera\" flash."},{"question":"Can you transfer photos and videos straight from the camera to your iPhone?","answer":"Yes, through NFC protocol. I transfered some photos to my Samsung Galaxy 4. I had to download to my phone the Canon Camera Connect App first."},{"question":"Does come with battery and charger","answer":"yes both"},{"question":"Hola hay toda via ?","answer":"Excelente, no tengo como expresar lo que me ha servido. Recomiendo este artículo en su totalidad"},{"question":"Is this a good camera for a beginner photographer? How good are the pictures because I have seen expensive cameras take awful pictures?","answer":"Very excellent for beginer and u can you read any canon camera lens from 30 dollars to 1200 dollars I recommend this camera just beautiful especially with all the accessory you get with it just amazing I love it"},{"question":"Does this come with the canon connect station cs100 1tb photo and video storage hub with nfc and wi-fi?","answer":"No"},{"question":"Does it come with a canon lens cap?","answer":"All lens have covers."},{"question":"Can the T6 be plugged into an iPad for photo storage?","answer":"I think so, if you have correct cable for your version of iPad"},{"question":"Does this come with a macro lens?","answer":"Mine did. All was fine. Awesome quality."},{"question":"Does it have auto focus","answer":"Yes"},{"question":"is the flashlight canon?","answer":"I dont know what you're asking me..."},{"question":"Does the camera have a self timer?","answer":"Yes of course as well as many other great features"},{"question":"Does this camera have a View finder","answer":"Yes, and it shows you which focus points triggered. DSLR cameras have a viewfinder, \"mirrorless\" digital cameras only have an LCD display."},{"question":"Can you record video with thus camera? If so, can I connect it to the sound system board at my church richat my","answer":"It does have video recording capability. As for connecting to a sound board, not sure, but I believe it has A/V output ports."},{"question":"Does this come with a battery and charger??","answer":"Yes,"},{"question":"Does this bundle include everything in the picture?","answer":"Yes it does."},{"question":"So I bought this and i dont know how to install the wireless flash. Can someone please help me","answer":"Go on line to ask for wireless connection for Canon Rebel. T6 . You will find a You Tube with easy, full instructions. Takes maybe 3 minutes . Have your camera ready /w lens and capable charged battery. Your smart phone will require you to set up the WiFi through an app. Not too hard."},{"question":"Is this camera a T6i","answer":"No, this camera (T6) is a great camera, but inferior to both T6s and T6i."},{"question":"Can this camera take a video, and if so, is it good quality video","answer":"Yes. Video quality is great"},{"question":"What is the sensor size in 1) either inches or mm, and 2) pixels? Thanks","answer":"According to manual, the Image Sensor Size is aprox 22.3 x 14.9 mm / 0.88 x 0.59 in."},{"question":"Does this camera have an input jack for a microphone?","answer":"No, but there is a microphone IN the camera."},{"question":"okay for making film?","answer":"YEA, i heard canon is better than nikon on film but nikon is better for pictures"},{"question":"Is it 720p","answer":"The actual Megapixel is 18.0"},{"question":"what size is the screen ?","answer":"3 inch LCD"},{"question":"Does this have wifi function?","answer":"I looked and yes it does"},{"question":"Is the battery rechargeable and if so does the charger and battery come with it?","answer":"Yes the battery is rechargeable and yes the charger comes with it."},{"question":"Will I be able to take full body pictures?","answer":"Yes, Camera is my Daughters and what I have seen, it takes a nice picture."},{"question":"Dose it have sound","answer":"It does record sound."},{"question":"How many gigs does the flash drive have?","answer":"A câmera veio com duas unidade de memória. O conjunto veio completo como o vendido, só não veio com a bateria da câmera."},{"question":"hi I was looking at the t6 bundle on one of the reviews it said the attachments are not cannon and they didnt receive a strap is this true??","answer":"Some of things are not Canon but both of the lens are Canon. Everything that is listed is in the bundle including the strap."},{"question":"Does it comes with all accesories showed in the photo?","answer":"Yes it does"},{"question":"Do we get International Warranty along with this product??","answer":"I would think so. I have called on two other purchases, a backpack and eyebuds and Amazon was zero helpful because I had sent them to India. Not covered there."},{"question":"can you use a 128gb sandisk on the camera","answer":"Yes"},{"question":"Does this come with the same camera bag as the one shown in the pictures?","answer":"Yes"},{"question":"Do I have to buy a converter for the vivitar lenses to fit the canon camera body?","answer":"Everything that came with the camera fits the camera without converter. The lens fits well! I have gotten some great pictures of sporting events with it."},{"question":"Can someone review the included lenses like the telephoto lens. If they are cheap, unnecessary and low quality? Im concerned in getting a bundle.","answer":"I am enjoying the camera and accessories and find no problems with the bundle (the tripod was broke upon receiving it, but Amazon refunded what would be the cost of it and I was able to obtain another one.) I had priced just the camera at another local business and just the camera and lenses were the same price as this… see more"},{"question":"Do we get two batterys along this bundel or one","answer":"I only received one."},{"question":"Does it contain all thing shown in the pocture","answer":"Yes it did! I have been very happy with this camera!"},{"question":"Do you have package of nikon D7100?","answer":"No I went with canon t6"},{"question":"how long does the battery last","answer":"Not 100% sure but nice played with mine for about 2 hour straight and it hasn't dies"},{"question":"Does it include a spot for a mic.","answer":"NO, it does not include a spot for a mic."},{"question":"is it 16 MP camera","answer":"It is an 18 MP"},{"question":"what is the model number for the camera?","answer":"T6"},{"question":"saludos los lentes son originales?","answer":"creo que si"},{"question":"Built in flash?","answer":"Yep!"},{"question":"If you can take a video, is the microphone on it good or do you need a separate microphone","answer":"I haven't use that feature yet. But purchased a mic for better sound anyway."},{"question":"What is the Canon App?","answer":"Its the app to use to connect the camera using your phone."},{"question":"is it good in low light?","answer":"I shoot in haze & low light alot & it does great! I use the extra flash all the time with it too."},{"question":"How is this camera with video recording, would I be better off purchasing a video bundle. Can I record good video with all these lenses?","answer":"Up to you..."},{"question":"How much to deliver to Nigeria","answer":"Contra know, sorry!!!"},{"question":"How is the quality of it?","answer":"I have this camera and the picture quality is excellent!!!"},{"question":"I purchased this package, but I cannot figure out how to use the vivitar lens that came with the kit. Everything I read they screw on, but mine won't.","answer":"It screws into the front of one of the cannon lens that comes with the camera. They are not stand alone lens. They will screw into the inside of the main lens."},{"question":"How many batteries does it include?","answer":"1"},{"question":"When using the 2x telephoto with the 300mm - is there any glare or reflection? Does the image come out clear?","answer":"No glare; comes out perfectly clear :)"},{"question":"is this camera good for recording videos?","answer":"The EOS Rebel T6 camera offers easy-to-use video capture with breathtaking Full HD quality. Capable of shooting in a number of recording sizes and frame rates, the EOS Rebel T6 offers outstanding video capturing performance, quality and simplicity - simply press the dedicated Live View/Movie Recording button to get sta… see more"},{"question":"can you import to mexico","answer":"Contra know, sorry!!"},{"question":"Does this camera allow me to email or text pictures from the camera if I’m hooked up on WiFi?","answer":"There is a sony camera app that you can download on your phone and use to transfer pictures between your camera and your phone."},{"question":"Does the camera box come in a vacuum sealed plastic.","answer":"No"},{"question":"Is there any reason the camera cannot be permanently connected to the computer?","answer":"In what way would you want it to be permanently connected to the computer? and why?"},{"question":"is this camera good for portrait or fashion shoot photography?","answer":"I would say yes. Actio shots are amazing!!"},{"question":"Should I get this one or the 449 or this one?","answer":"I use this one for a lot of softball, volleyball, and basketball..that pretty much covers indoors and outdoors..and I'll recommend it to anybody, with that said, I think they're all similar...but the 75-300 lens is what I pretty much got this bundle for..."},{"question":"Does the camera have date-time stamp on photos?","answer":"Yes I think it does..."},{"question":"what size is the screen ?","answer":"3 inch lcd screen."},{"question":"Is this the best bundle for the camera? Secondly, does everything work with the camera like the lens and flash?","answer":"Yes, bought for my daughter, she loved\n\nAll the items work properly with the camara"},{"question":"Does the 700 mm lens have optical stabilization?","answer":"There is a 18-55mm and a 75-300mm which both have stabilization."},{"question":"Does it have the flash included in camera or it's just the external one?","answer":"There is a built in flash. And also an external one you can use."},{"question":"someone in the reviews said that they only got the camera, and not the kit. Is that true?","answer":"I ordered this package and got everything included in the photo. It's a really great deal."},{"question":"Can this camera do black and white photo?","answer":"Yes, it can. First, take a picture, then go to display and edit it. There are also black and white lenses."},{"question":"Does it come with the camera bag thats shown?","answer":"Yes! Mine did!"},{"question":"Does this camera come with a neck strap?","answer":"Yes mine did come with a neck strap, as well as a hand strap."},{"question":"Does it come with vídeo creator kit","answer":"No"},{"question":"Does it come with wide an8len","answer":"an8len???"},{"question":"Does it make videos","answer":"It does but zooming options are very limited."},{"question":"Is it touch screen","answer":"No"},{"question":"What are the shutter speed ranges?","answer":"1/4000 to 30 sec., Bulb (Total shutter speed range)\nX-sync at 1/200 sec.\nSettable in 1/3- or 1/2-stop increments"},{"question":"is this camera only for pictures, or does it do videos aswell?","answer":"IF you google name, model there is a great manual on line. Will answer so many questions before you buy."},{"question":"Does the bag hold everything ?","answer":"Yes. It does. But you can find a better bag like a backpack for camera."},{"question":"Does the tripod come with a carrying case?","answer":"Hi Rhonda, yes, the tripod comes with a carrying case. Although the kit provides a tripod, I would recommend getting a separate tripod. The tripod in the kit is basically plastic and mine broken in a few days, luckily the camera was safe."},{"question":"Is this camera mirrorless?","answer":"no, its a standard DSLR"},{"question":"The lenses have stabilization system (IS)? Thanks ...","answer":"No, they do not."},{"question":"Does the camera have a date-time stamp on photos?","answer":"Yes it does perfectly"},{"question":"I keep seeing the term \"body only\"; what does that mean, exactly?","answer":"Body only refers to the camera without lenses. Some retailers sell the body only, some others include one or two lenses, such as the Canon EF-S 18-55mm f/3.5-5.6 IS II SLR lens."},{"question":"Are all the accessories in the bundle Canon brand?","answer":"Lenses and filters are Cannon. The other items like tripod, bag and SD cards are not. They do however all work together very well."},{"question":"Are the lenses auto-focus, manual-focus or both?","answer":"We bough the camera for our son, but I'm pretty sure they're both."},{"question":"Are you allowed to carry it on board an air plane??","answer":"You would have to check with the airline, I would think it would be considered to be another bag unless you can fit it into your carry on bag. I put my purse in mine to keep from having to pay for another bag. I would try to fit it into your carry on if you could, that way they won’t charge you for another bag. But I w… see more"},{"question":"Does it include battery?","answer":"Yes. I bought 2 extras though"},{"question":"How many fps is the 1080p Video?","answer":"The 1920x1080p video can be 24 or 30 fps."},{"question":"does this camera support class 6 and class 10 sd cards?","answer":"Yes, supports both"},{"question":"Does this model have flip out touch screen lcd screen?","answer":"No. The t6i has one"},{"question":"Does this come with a remote so i can join my family photos? If so, is it wireless?","answer":"No it does not"},{"question":"What canon camara is the best","answer":"It depends how experienced you are as a user of digital cameras, and what exactly you want to use the camera for. The Canon EOS Rebel series is a good \"beginners\" camera to get into DSLR use."},{"question":"Does this camera take profesional quality pictures?","answer":"It takes very high quality photos. More options than i currently can master"},{"question":"Does the lens have a wide enough angle for family group shot?","answer":"Yes, you can take great family pictures with it."},{"question":"Does everthing fit in the bag?","answer":"Yes, and with a little room to spare for any extra cards or batteries."},{"question":"Does it come with a mini tripod???","answer":"Yes"},{"question":"Is the video 1080 hd ?, can you use a remot mic","answer":"Yes the video is HD. Like YouTube videos HD, SmartTV HD. Yes mic works when recording."},{"question":"Are the Telephoto and Wide Angle Vivar lenses supposed to be attached to the front of the canon brand lenses? Or can they be used independently?","answer":"The Telephoto and Wide Angle Vivar lenses attach to the front of the Canon lenses. They cannot be used independently."},{"question":"Is there a built in flash?","answer":"Yes"},{"question":"Will it take pictures At night?","answer":"Yes"},{"question":"Signa 105mm macro work with canon Slp?","answer":"Yes, the Sigma 105mm f/2.8 work with the T6"},{"question":"i need a good camera for Real Estate Photos, but am very inexperienced. Is this a point and shoot and is it easy for beginners?","answer":"It's good for beginners and you can get great photos by doing everything on auto for sure. But there's a slight learning curve to do things on manual but it's worth it because you'll get amazing photos then. Nothing a short class or someone else couldn't show you in a couple of hours"},{"question":"Can transfer camera photos straight to my android S7edge","answer":"Yes. You have to install an app for it. The owners manual will walk you thru it"},{"question":"What is the size of the shipping box and the item is new?","answer":"The size of the box is big enough to hold all the items from this pachage and yes the items are new and come in their individual boxes."},{"question":"Can i shoot manuel with this?","answer":"Yes, you can easily"},{"question":"Is this remote capable","answer":"I don't think so ."},{"question":"Is this camera good for someone trying to get into photogtaphy?","answer":"oh yes definitely this is best camera for the beginners who are interested in photography...."},{"question":"Can you record video with this camera? If so, can I connect it to the sound board at my church in order to pick up the voices from the mics?","answer":"Yes, it has Wi-Fi and Bluetooth capability but how it's done I really don't know but it does say you can do that"},{"question":"How many times optical zoom?","answer":"No the camera itself does not have optical zoom. Your lenses you attach to the camera have the optics in the lens."},{"question":"what filters come wth kit? circular polarizing?","answer":"Yes for circular polarizing, it also has a UV filter and a fl-d fliter"},{"question":"does this come with caps for the lenses when they are not on the camera?","answer":"Yes, all lenses have caps"},{"question":"Does this come with everything thats in the pictures?","answer":"Yes..everything were there and all accessories are woth good quality.."},{"question":"Does this have a continuous auto focus?","answer":"Awesome greatly satisfied"},{"question":"Can you use an hdmi cable with this so you can view on your t.v.?","answer":"Yes"},{"question":"Does this come with the camera body too","answer":"Yes, it is a full camera. Great buy with tons of accessories."},{"question":"What kind of power outlet does the battery charger use? usb or the usa 3 prong power outlet?","answer":"USA 3-prong 120VAC. However, the battery charger itself comes with only 2 prongs. It has no GROUND prong."},{"question":"What's th difference between digital slr and dslr?","answer":"Same"},{"question":"Does the camera have date-time stamp on output video?","answer":"Yes"},{"question":"Can you take good pictures of the moon and stars?","answer":"I have not tried to do that yet, so I don't know."},{"question":"Is t a package?","answer":"Yes, it is an amazing deal. Has everything you need and then some more. i will recommend buying extra bateries."},{"question":"I seem to gather that the included tripods are junk. What would be low cost/quality alternatives?","answer":"They are not really sturdy, but can definitely be used until you have an alternative. Do not let that deter you from ordering the package. Great deal! Fortunately, I had a tripod from a video camera I previously owned."},{"question":"Buenas, viene la camara con todos los acessorios?","answer":"Si"},{"question":"How many lenses come with the bundle?","answer":"2"},{"question":"Is this camera compatible with 3rd party chargers like these? http://amzn.to/2mqIjMY","answer":"I would say yes, it lists the T6 in the description.\nI got the BM Premium Batteries and charger and they work great with the camera"},{"question":"Will the bag hold all the accessories or do I need a bigger bag?","answer":"Add. back-pack will be fine ."},{"question":"I do makeup looks would this be a good camers to show detail of my eyelooks?","answer":"Perfect. In modo macro."},{"question":"How many photos can this take?","answer":"Lots... The battery lasts a long time and the number of pictures it can store is dependent on MB you set in the camera. Additional SD cards are also very cheep if it becomes an issue"},{"question":"Are the lenses auto focus?","answer":"Yes. You can switch to manual focus as well."},{"question":"can you connect and external microphone to the camera","answer":"An external microphone cannot be used. Sound will be recorded by the built-in monaural microphone"},{"question":"best printer to work with this camera?","answer":"I use a HP inkjet printer . As long as it is set with best the photo comes out beautiful."},{"question":"What is the visor quality in this camera?","answer":"Don’t know. Haven’t used it yet. Sorry."},{"question":"the package picture show a flash attachment but the camera body picture shows a flip up flash which is it or?","answer":"The Canon T6 has both options"},{"question":"Does this support 64gb SD cards","answer":"Yes, but it has to say \"Full HD Video\" on the package."},{"question":"Can you record video with this camera? If so, can I connect it to the sound board at my church in order to pick up the voices from the mics?","answer":"Yes you can"},{"question":"You get the camera too?","answer":"Yes the camera was included. Great value for the money. Have been very pleased with this purchase"},{"question":"How is the tripod packaged?","answer":"It comes in a big box which holds all the items. I would recommend buying another tripod because this one isn't sturdy."},{"question":"What is the difference between t5 and t6?","answer":"The T6 gives you Wi-Fi connectivity with NFC (allows users to tap a NFC enabled device to activate Wi-Fi). Other upgrades include:\nDIGICS 4+ Processor = faster (T5 has a DIGICS 4)\n920,000 pixel LCD screen = brighter and clearer live-view (up from 460,000 on the T5)… see more"},{"question":"Does it comes with Lens cover?","answer":"yes"},{"question":"What is the difference between this and the t6i and t6s?","answer":"I believe it means that the t6i has the ability to be like a camcorder where as the t6s does not. I went on the Canon website and looked into all of those meanings and would encourage you to do the same."},{"question":"Does it come with everythin i see in the picture","answer":"Yes it did"},{"question":"the canon include all accesories like the image?","answer":"Yes"},{"question":"I'm confused. on canon's website it says that this model has 24.2 megapixels, yet i keep seeing it advertised here on amazon as having 18?","answer":"The one I bought is a Canon EOS Rebel T6 with 18 megapixels."},{"question":"So when I take some pictures, I can send from a wifi spot via email to my family?","answer":"When you take pictures with the camera, you can download them to a wifi-enabled device like a tablet or phone by connecting to your camera via wifi. It shows up under the wifi networks; you click the camera and open the Canon app to download the pictures. From there you can email the pictures from your device, not the … see more"},{"question":"Can it take AA batteries","answer":"No. Specific rechargeable battery packs only. There are external battery packs that can accept AA batteries."},{"question":"Does the telephoto lens, that comes in this package, have image stabilization?","answer":"Yes I took pics with it on my trip to Carbo (on a tour boat)."},{"question":"Will the wi-fi smartphone app work with a windows phone? windows 10? will the wi-fi work directly to the cloud? will the wi-fi app transfer videos?","answer":"The simple answer is, I haven't tried it. So sorry for being so unhelpful."}]}