{"title":"Canon EOS Rebel T6 Digital SLR Camera, 18-55mm EF-S Lens, EF 75-300mm Lens, SanDisk 64GB Card, Telephoto and Wide Angle Lens, Extra Battery, 58mm UV Filters, Gadget Bag with Bundle Accessories","manufacturer":"Canon","currentPrice":"$509.00","rating":"4.5 out of 5 stars","totalRatings":"106 ratings","features":["\n         Make sure this fits\n                by entering your model number.\n        \n","Kit includes Canon EOS Rebel DSLR Camera Body T6 Body - Canon 18-55mm EF-S f/3.5-5.6 IS II Autofocus Lens - Canon Zoom EF 75-300mm f/4-5.6 III Autofocus Lens","58mm 2x Professional Telephoto Lens - 58mm High Definition Wide Angle Lens - Vivitar Digital Camera SLR DC59 Large Gadget Bag - 3 Piece UV Filter Kit (UV-CPL-FLD) 58mm","Sandisk Ultra SDHC 32GB 80MB/S Class 10 Flash Memory Card - Sandisk Ultra SDHC 32GB 80MB/S Class 10 Flash Memory Card - Hi-Speed SD USB Card Reader - Extra Battery Replacement","Tri -Fold Memory Card Wallet - LCD Screen Protectors (Clear) - Camera & Lens 3 Piece Cleaning Kit - Cleaning Pen - Tabletop Tripod / Handgrip - Lens Band - Lens Cap Holder","18MP APS-C CMOS Sensor DIGIC 4+ Image Processor 3.0\" 920k-Dot LCD Monitor Full HD 1080p Video Recording at 30 fps 9-Point AF with Center Cross-Type Point Extended ISO 12800, 3 fps Shooting Built-In Wi-Fi with NFC Scene Intelligent Auto Mode Basic+ and Creative Auto Modes"],"reviewsAspects":["easy to use","extra battery","looking forward","great price","eos rebel","love this camera","get started","great package","camera is easy","great bundle","great camera","lenses and camera","camera lens","taking","dslr","photo","beginner","manual","auto","cameras"],"productInformation":[{"Package Dimensions":"16.5 x 12.6 x 8.6 inches"},{"Item Weight":"7.95 pounds"},{"Shipping Weight":"7.95 pounds (View shipping rates and policies)"},{"ASIN":"B01HH8H2WQ"},{"Item model number":"Canon T6 K14"},{"Customer Reviews":"4.5 out of 5 stars\n    106 ratings\n4.5 out of 5 stars"},{"Best Sellers Rank":"#15,025 in Camera & Photo (See Top 100 in Camera & Photo)\n#626 in DSLR Cameras\n"},{"Date first listed on Amazon":"June 23, 2016"}],"productDescription":[],"reviews":[{"reviewerName":"Megan M","rating":"5.0 out of 5 stars","reviewTitle":"Amazing price for what you get!","reviewDate":"March 2, 2017","reviewText":"Love this camera. I wanted to get a decent camera for traveling this year instead of using my smart phone. The number of lenses and accessories you get for this price is an amazing deal. Nothing was broken or scratched when it arrived. Camera is pretty simple to use. If you are a beginner like me, I would recommend this camera bundle. I absolutely love the bag it came with. It fits all the lenses, camera, and accessories in it perfectly."},{"reviewerName":"Robert D. Monson","rating":"5.0 out of 5 stars","reviewTitle":"Absolutely Brilliant!","reviewDate":"May 15, 2017","reviewText":"Simply amazing. I love this camera and the gear that it came with. I have been taking it everywhere I go and snapping off shots. With a little work in post you can easily make some nice looking stuff. It is my first DSLR and won't be going back to the days of point and shoot cameras or digital zoom.\n\nFor those taking the first steps into photography, I recommend watching youtube vids about setting up your settings and using manual mode. It easily has been the most useful setting on the camera."},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Great bundle!","reviewDate":"December 18, 2016","reviewText":"I love my camera, and this bundle had so many extra goodies/lenses in it. love the fact that I get another battery, too.\n\nAbout the camera, I wish the Rebel T6 had an option for an extension for a microphone :/ but hey for the price, it is amazing.\n\nI wish I had a satchel bag for the camera, but the camera comes with the big bag for all the stuff. LOVE my camera, wanted one forever."},{"reviewerName":"Jay Flats","rating":"5.0 out of 5 stars","reviewTitle":"6th Star?","reviewDate":"May 24, 2017","reviewText":"I wish there was a 6th star! This camera 🎥 is what I've been looking for! First off, it's easy to use with hundreds of functions to help create the perfect photo! 2nd, its extremely lightweight and versatile. Finally the up to date wi-fi capability, remote Canon App and photo sharing make it a fast and fun photography experience!"},{"reviewerName":"RenoRedhead","rating":"4.0 out of 5 stars","reviewTitle":"It's Easy To Use","reviewDate":"April 13, 2018","reviewText":"I got this for a once-in-a-lifetime trip to Italy. The camera is easy to use and pretty intuitive. I got extra sim cards to make sure I wouldn't run out of space. The extra battery is great, just remember to keep the plastic end cover to use when you're traveling. I'm not a professional photographer, so all I can say is that all of the pictures turned out great, and I'm looking forward to taking it on my next trip."},{"reviewerName":"thomas b.","rating":"5.0 out of 5 stars","reviewTitle":"Great Camera/Bag/Lenses bad extra battery","reviewDate":"April 14, 2017","reviewText":"I really like the camera lens and bag but i couldn't give a full five stars because the extra battery that came with the bundle would not hold a charge\nI originally gave this a 3 but after talking to customer service I was told I could return the whole package and they would send a new one. I told them that I was leaving on vacation soon and could not wait for a new one. At that they offered a credit which I could use to buy a new battery. I ordered a new battery and everything works wonderful"},{"reviewerName":"Rachel Jenkins","rating":"4.0 out of 5 stars","reviewTitle":"Wonderful set of lenses and camera for the price.","reviewDate":"July 26, 2019","reviewText":"I had to leave my expensive Canon EOS 7D Mark ll camera, 400mm lens, and myriads of smaller lenses in Thailand, when I had to leave suddenly due to severe illness (cancer). Once I became strong enough to carry a camera on my hikes in the desert near Albuquerque, I was glad to have this inexpensive, but WONDERFUL Canon camera."},{"reviewerName":"jwolf75638","rating":"5.0 out of 5 stars","reviewTitle":"Great camera for beginner to dslr.","reviewDate":"May 14, 2017","reviewText":"Nice features, still learning the menus and controls but so far loving this camera.\nComfortable and lightweight.\n\nPerfect for beginners to the DSLR world.\nHighly recommended this item."},{"reviewerName":"Mike","rating":"5.0 out of 5 stars","reviewTitle":"Great starter camera","reviewDate":"December 20, 2016","reviewText":"Wanting to get into photography and start taking pictures of my kids. Overall so far so good. Great price for all that comes in it. I shopped around at both best buy and target, Amazon of course offered the package which no other place did. Love the WiFi capabilities and the fact that it connects directly to my galaxy s7 so picture sharing to instagram is so quick and easy."},{"reviewerName":"Kenneth","rating":"2.0 out of 5 stars","reviewTitle":"Not all the accessories or lens fit the camera!","reviewDate":"May 19, 2018","reviewText":"The camera is awesome with some of the accessories but half of the accessories and lens aren't compatable with the canon t6. I was very bummed to see that the wide lens and the telephoto lens with the filters dont fit the camera. I bought it due to all the cool lens being added. Dont recommend this if you're looking forward to all the lens."},{"reviewerName":"Amaryla","rating":"5.0 out of 5 stars","reviewTitle":"Arrived on time and as advertised with great product support","reviewDate":"January 5, 2018","reviewText":"Arrived on time and as advertised. This is a nice outfit with all the extras we would usually require. We had a few issues which were handled promptly through Amazon. We are looking forward to a new experience in photography. We would most certainly deal with this company again."},{"reviewerName":"Natasha G","rating":"5.0 out of 5 stars","reviewTitle":"Outstanding Camera","reviewDate":"February 28, 2017","reviewText":"I absolutely adore this camera and it takes fantastic pictures. Even with many of the default settings and manual zoom and focus, the pictures are outstanding. When I sent in pictures to be printed, I had to sign a copyright disclosure as the store wanted to make sure I wasn't ripping off professional photographers (I like to think it is because of my awesome skills, but I'm pretty sure it was because of the high quality of the images).\n\nAll the pieces in the package were included and none are of a low quality that are often found in packages like this. Do be aware that with all the lenses, camera, and pieces that this set is huge and heavy. I tried travelling with just one of the lenses to make it a little lighter and instantly regretted not having the versatility of the different lenses, so just be prepared to want to bring the whole pack with you!"},{"reviewerName":"Min Jane","rating":"5.0 out of 5 stars","reviewTitle":"Buy it you’ll love it","reviewDate":"June 12, 2019","reviewText":"Love this camera been real good to me I forgot I bought it on amazon too! Wonderful product and great beautiful pictures and videos!"},{"reviewerName":"Don","rating":"5.0 out of 5 stars","reviewTitle":"Great starter DSLR for use as a research camera","reviewDate":"May 9, 2017","reviewText":"I've been using this camera since January for taking photos of specimens as a part of my research. I'm a paleontologist-in-training and usually take photos inside museum collections; my subjects tend to be fossils and bones. This camera is easy to use, and the quality of the photos is plenty good for my purposes. I would highly recommend this model for other graduate students and/or early-career researchers."},{"reviewerName":"wanda","rating":"5.0 out of 5 stars","reviewTitle":"Good Camera","reviewDate":"March 12, 2019","reviewText":"I like the auto focus and all the lenses. The only thing I would do differently is not put in the liquid cleanser. Despite all effects the second kit arrived and the liquid was everywhere. What is happening is it get frozen and then expands. Then it leaks.. I dont want a replacement.. it's just a suggestion."},{"reviewerName":"Donell B Eichler","rating":"5.0 out of 5 stars","reviewTitle":"Great package to get started","reviewDate":"June 17, 2018","reviewText":"Love my Canon EOS Rebel T6 digital camera. The pictures come out so clear and crisp. Really that it has several settings. I also bought a zoom lens and tripod."},{"reviewerName":"Kindle Customer L","rating":"5.0 out of 5 stars","reviewTitle":"excellent value","reviewDate":"January 13, 2019","reviewText":"I was very pleased upon the arrival of my Canon Rebel T6 package. Every thing I need to take quality photos! It even showed up earlier than expected!"},{"reviewerName":"Jennifer","rating":"1.0 out of 5 stars","reviewTitle":"Second battery doesn't work","reviewDate":"August 8, 2017","reviewText":"Bought this camera 4 months ago, mostly to have for the birth of our second daughter, so it hasn't been used much until now. Of course, when I go to use it the second battery was found to be flawed and doesn't work despite charging it for 10 hours the night before her birth. Because of this I missed pictures I'll never get back! Disappointed."},{"reviewerName":"Hannah","rating":"5.0 out of 5 stars","reviewTitle":"Best purchase!!","reviewDate":"June 6, 2019","reviewText":"AMAZING value!! I absolutely LOVE this kit, and I would have never been able to afford it at retail price. This is a perfect starter camera for anyone who wants a boost in their photo quality! Absolutely beautiful!!"},{"reviewerName":"heli flyer","rating":"5.0 out of 5 stars","reviewTitle":"Great package at a great price","reviewDate":"February 2, 2019","reviewText":"I am very pleased with the Canon T6 package. It contains a lot for the price. It arrived quickly and was well packaged. I highly recommend the seller"},{"reviewerName":"Little Boy (and Girl) Blue","rating":"5.0 out of 5 stars","reviewTitle":"My dad was extremely pleased with the bundle","reviewDate":"February 8, 2017","reviewText":"I gave this as a gift to my parents. My dad was extremely pleased with the bundle, thankful for the fact that they were bundled with things that for sure will work together, loves the functionality of everything, etc.!"},{"reviewerName":"karley","rating":"5.0 out of 5 stars","reviewTitle":"Great product","reviewDate":"August 31, 2018","reviewText":"I love it. It’s a great product great quality and for a great price. I definitely recommend it."},{"reviewerName":"Marv","rating":"4.0 out of 5 stars","reviewTitle":"Four Stars","reviewDate":"January 31, 2018","reviewText":"Gave it as a gift to a close friend. Being a joyful experience."},{"reviewerName":"Kim Roderick","rating":"5.0 out of 5 stars","reviewTitle":"Nice","reviewDate":"December 27, 2018","reviewText":"Was a gift for our son"},{"reviewerName":"M. Clark","rating":"5.0 out of 5 stars","reviewTitle":"Great pics! Great price","reviewDate":"April 21, 2017","reviewText":"Easy to use (total amateur here). And beautiful pictures! Still learning my way around all of the camera and lens capabilities, and have spent most of my time in the auto settings at this point, but loving all these of it!!!"},{"reviewerName":"JessRiley","rating":"5.0 out of 5 stars","reviewTitle":"LOVE, LOVE","reviewDate":"November 8, 2017","reviewText":"LOVE, LOVE, LOVE my camera! Has been very well loved! Use it almost daily, for fun as well as business!"},{"reviewerName":"Vann Griffith","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"May 2, 2018","reviewText":"Great price on a great camer."},{"reviewerName":"Raven","rating":"5.0 out of 5 stars","reviewTitle":"Great!","reviewDate":"January 2, 2019","reviewText":"Great camera...great price...great purchase. Arrived quickly and with everything shown. Daughter is thrilled with her gift!"},{"reviewerName":"Curvetheinfluence","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"January 23, 2018","reviewText":"Absolutely love this camera takes amazing photos and having so much fun already !!!"},{"reviewerName":"Moondoggie","rating":"5.0 out of 5 stars","reviewTitle":"Great camera!","reviewDate":"May 17, 2017","reviewText":"Very functional with interchangeable lenses. Haven'the had it long but it seems to be very versatile."},{"reviewerName":"HavnFun","rating":"5.0 out of 5 stars","reviewTitle":"This is a great camera for anyone","reviewDate":"May 26, 2017","reviewText":"I've been able to take so many different pictures. This is a great camera for anyone!!"},{"reviewerName":"Taylor Campbell","rating":"5.0 out of 5 stars","reviewTitle":"Love!","reviewDate":"March 23, 2017","reviewText":"Love this bundle!!! Came so fast and had more than I know what to do with at this point! Picture quality is great too!!!"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"April 7, 2017","reviewText":"love love"},{"reviewerName":"matt","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"March 19, 2017","reviewText":"comes with everything you should need. And works great"},{"reviewerName":"Danielle Bromfield","rating":"5.0 out of 5 stars","reviewTitle":"great buy!","reviewDate":"December 22, 2018","reviewText":"most excellent buy. came with everything it listed! saved soooo much money compared to if i was to buy each item individually. i'm happy"},{"reviewerName":"Ashley","rating":"5.0 out of 5 stars","reviewTitle":"I love this camera","reviewDate":"February 28, 2017","reviewText":"Beginner here! I love this camera! Easy to operate but yet a lot to learn."},{"reviewerName":"Gary","rating":"5.0 out of 5 stars","reviewTitle":"Say Click, Take a Pic","reviewDate":"July 20, 2019","reviewText":"Camera is easy to use. Selection menus are informational. Extra battery and memory cards are life savers. Excellent buy."},{"reviewerName":"Sarah Fuad","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"March 12, 2017","reviewText":"Im in love with it!! Very good price"},{"reviewerName":"Don Bush","rating":"5.0 out of 5 stars","reviewTitle":"Awesome deal, awesome product!!!","reviewDate":"February 15, 2017","reviewText":"This was an awesome deal and was just what my wife wanted!!! She loves the camera and really enjoys using it!!!"},{"reviewerName":"Wade D. Runnels","rating":"4.0 out of 5 stars","reviewTitle":"Four Stars","reviewDate":"July 12, 2017","reviewText":"Excellent camera and the accessories are nice. A lot to learn, but well worth it."},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"December 4, 2016","reviewText":"Excellent"},{"reviewerName":"Poosha","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"November 4, 2016","reviewText":"All good"},{"reviewerName":"Sam","rating":"5.0 out of 5 stars","reviewTitle":"I love this package","reviewDate":"May 20, 2017","reviewText":"I love this package! The bag fits all of the items, which is nice. I am a beginner photographer, but so far I've found the camera very easy to use. The variety of lenses is nice for experimenting! Overall I am very happy"},{"reviewerName":"Valerie Brewington","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"January 25, 2017","reviewText":"gift was loved."},{"reviewerName":"Eric","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"December 26, 2016","reviewText":"Fast and correct!"},{"reviewerName":"baby sister","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"November 6, 2016","reviewText":"Still working on the ins and outs. More later."},{"reviewerName":"Jody Green","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"January 12, 2017","reviewText":"So far so good - nice crisp pictures. Great value with all the lenses!"},{"reviewerName":"Sandra G.","rating":"5.0 out of 5 stars","reviewTitle":"Great beginner camera","reviewDate":"March 14, 2019","reviewText":"Love this camera already. Just a heads up that the lens cleaner bottle was bone dry!"},{"reviewerName":"Jason Channell","rating":"5.0 out of 5 stars","reviewTitle":"Love this camera","reviewDate":"March 9, 2017","reviewText":"Love this camera. Decided to buy one because my parents had one and wanted my own. Takes fantastic photos!"},{"reviewerName":"Duke","rating":"5.0 out of 5 stars","reviewTitle":"very nice package deal","reviewDate":"March 7, 2017","reviewText":"we are happy with it, still learning how to use and enjoy it"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Great Product","reviewDate":"December 28, 2018","reviewText":"Great product for the price"},{"reviewerName":"Tracy Crum","rating":"5.0 out of 5 stars","reviewTitle":"Amazing camera","reviewDate":"February 7, 2017","reviewText":"Great bundle for a beginner!"},{"reviewerName":"Laura","rating":"5.0 out of 5 stars","reviewTitle":"Been using camera for a few months now and am very satisfied with my purchase","reviewDate":"February 13, 2017","reviewText":"Received everything as described. Been using camera for a few months now and am very satisfied with my purchase."},{"reviewerName":"Amazon Customer","rating":"2.0 out of 5 stars","reviewTitle":"very disappointed with the long lens","reviewDate":"March 21, 2017","reviewText":"very disappointed with the long lens. My old Canon has a much slower shutter speed but zooms in far better with a smaller lens."},{"reviewerName":"Craig Becton","rating":"5.0 out of 5 stars","reviewTitle":"Great deal","reviewDate":"January 13, 2019","reviewText":"Filming I love the package"},{"reviewerName":"eeyore","rating":"4.0 out of 5 stars","reviewTitle":"Four Stars","reviewDate":"May 16, 2017","reviewText":"I have had the camera for 1 month and I haven't had a problem. Everything arrived on time."},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"November 8, 2016","reviewText":"So far the camera is great."},{"reviewerName":"Greg Martinez","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"January 20, 2018","reviewText":"Love the camera!! Highly recommend it"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"I love our new camera","reviewDate":"May 18, 2017","reviewText":"I love our new camera. The picture quality is great I am enjoying learning about what this camera can do."},{"reviewerName":"Ingrid FS","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"November 10, 2017","reviewText":"Great camera and accessories, very well packaged. I Love it."},{"reviewerName":"OregonPaul","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"October 22, 2016","reviewText":"This camera is great! Simple yet takes great photos..."},{"reviewerName":"Jill","rating":"5.0 out of 5 stars","reviewTitle":"Great bundle, this is the way to go!","reviewDate":"November 8, 2016","reviewText":"Recently made the T6 bundle purchase and so happy I did. I have some upcoming vacation time and I look forward to using everything that came in the bundle. I upgraded from the T1i purchased over 5 years ago and didn't have any additional lenses, so I am looking forward to taking some amazing pictures with this camera!"},{"reviewerName":"Gardening Grandma","rating":"4.0 out of 5 stars","reviewTitle":"Defective Lens","reviewDate":"September 21, 2016","reviewText":"I really needed to upgrade my DSLR camera and this looked like a good packaged deal but I'm holding back on high praises because of issues I had immediately with the 75-300 mm lens. First, the mount wherein the lens attaches to the T6 camera body is rough and stiff unlike any of my other Canon lenses. I tried my other Canon lenses as well as the included 18-55 mm lens and all mounted smoothly to T6 body. Secondly, the lens does not focus in Auto mode. It meters but does not focus so no picture. It works great in Manual mode but for times when I want to use the lens in Auto mode, no dice.\n\nI will be contacting the seller directly to see if I can get a replacement for just the defective lens without having to return the entire package.\n\nAs for performance, the camera is lightweight, easier to use than my previous xTi, and just about fool proof if one has prior experience with DSLR cameras. I have not tried the movie mode yet and don't foresee a lot of use in that area but for folks into that sort of thing, I understand the sound is not the best so looking at the T6i may be a better option. The photos I've taken thus far have been of very good quality and the camera has performed well."},{"reviewerName":"tracy c","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"April 29, 2017","reviewText":"Excellent and amazing quality. Not to mention a great value."},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"July 3, 2017","reviewText":"Everything arrived on time! All accessories that were included were actually USABLE"},{"reviewerName":"Christopher McDonald","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"March 3, 2017","reviewText":"Great starter kit. I reviewed several bundles before deciding on this one."},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"happy camper","reviewDate":"March 1, 2017","reviewText":"extra battery would not charge one phone call and a new battery arrived a few days later."},{"reviewerName":"James C.","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"July 13, 2017","reviewText":"Great Camera"},{"reviewerName":"tim","rating":"4.0 out of 5 stars","reviewTitle":"Canon T6","reviewDate":"December 3, 2016","reviewText":"Great camera, easy to use."},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"February 12, 2017","reviewText":"It's good stuff and arrived on time."},{"reviewerName":"Keith Kornmeyer","rating":"4.0 out of 5 stars","reviewTitle":"Four Stars","reviewDate":"April 10, 2017","reviewText":"love the camera the vivitar lenses not so much"},{"reviewerName":"Jeremiah S.","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"December 18, 2016","reviewText":"It's great starter kit everything you need to take awesome pictures."},{"reviewerName":"Angela Franco","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"March 3, 2017","reviewText":"All in good condition"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"December 25, 2016","reviewText":"Good deal for good price"},{"reviewerName":"Tammy S Easton","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"May 21, 2017","reviewText":"Looks good"},{"reviewerName":"Adam Szepkouski","rating":"5.0 out of 5 stars","reviewTitle":"No complaints!!","reviewDate":"November 4, 2016","reviewText":"All is great!! Thank you!!"},{"reviewerName":"Amazon Customer","rating":"4.0 out of 5 stars","reviewTitle":"Four Stars","reviewDate":"November 6, 2016","reviewText":"Muito satisfeito!"},{"reviewerName":"JESSICA M","rating":"5.0 out of 5 stars","reviewTitle":"This camera is a great package. It came with everything I needed and ...","reviewDate":"February 13, 2017","reviewText":"This camera is a great package. It came with everything I needed and for once it all fits in the provided bag. I am very happy with the ease of use and the quality of the product. I would recommend this to anyone. For the price it is totally worth the buy."},{"reviewerName":"Cristina","rating":"3.0 out of 5 stars","reviewTitle":"SD Card Broke first time","reviewDate":"March 23, 2017","reviewText":"Everything came as described. Although, the accesories aren't he best. The SD card reader came apart the first time I used it. Do not risk damaging your SD card, buy a better quality one. The screen protectors are not good- air bubbles galore. The bag is nice, and the lenses work fine."},{"reviewerName":"PATTI C.","rating":"1.0 out of 5 stars","reviewTitle":"One Star","reviewDate":"August 28, 2017","reviewText":"I received this and one of the batteries doesn't work. Notified them and heard nothing!"},{"reviewerName":"Vilma Barros","rating":"5.0 out of 5 stars","reviewTitle":"It is a great camera, the pictures are amazing and it very ...","reviewDate":"November 12, 2016","reviewText":"It is a great camera, the pictures are amazing and it very easy to use. It gives so many different possibilities and the features are really easy to access. The self explanatory caption on the bottom of the screen is very helpful."},{"reviewerName":"Pikedb","rating":"5.0 out of 5 stars","reviewTitle":"AMAZING VALUE - wonderful kit - will take some time ...","reviewDate":"January 4, 2017","reviewText":"AMAZING VALUE - wonderful kit - will take some time to pick through all the fun stuff here - my 14 year old was thrilled"},{"reviewerName":"Rob'z","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"March 5, 2017","reviewText":"Gift item and it was absolutely fantastic. Great price, even greater product. May purchase second one for myself."},{"reviewerName":"Deb","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"December 11, 2016","reviewText":"Excellent quality - great pictures and great price for what you receive"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"A shutterbug's dream","reviewDate":"December 14, 2016","reviewText":"Easy to understand how to use. I haven't touched a 35mm in decades and the first digital one. Was taking photo's in minutes. Those photo's were of excellent quality looking professional."},{"reviewerName":"Brittany","rating":"5.0 out of 5 stars","reviewTitle":"Great item","reviewDate":"January 22, 2018","reviewText":"I brought this as a late Christmas present for my wife! She hasn’t put it down yeti I know nothing about cameras, however she said I.T was better than the one that was stolen"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"January 6, 2017","reviewText":"great"},{"reviewerName":"Larissa Ortiz","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"November 24, 2016","reviewText":"good"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Got this as a Christmas gift. Came exactly as ...","reviewDate":"January 2, 2017","reviewText":"Got this as a Christmas gift. Came exactly as described. This is my first SLR...so my hubby got me the \"book for dummies\" too! As a first SLR user, I'm going to need it!"},{"reviewerName":"aero","rating":"4.0 out of 5 stars","reviewTitle":"Four Stars","reviewDate":"November 4, 2016","reviewText":"This product is exactly what I need except the carrying bag is not designed for this bundle."},{"reviewerName":"Alisha Bowling","rating":"5.0 out of 5 stars","reviewTitle":"So great!","reviewDate":"December 11, 2016","reviewText":"Let me start by saying that I am, by no means, a professional. This camera, however, makes me feel like one! All of the different modes on the camera make taking pictures in any type of lighting a breeze, and all of the extras it comes with a just wonderful. The handheld/tabletop tripod is so much better than I thought it would be, and the bag is great, as well. I'm still getting the hang of the extra lens and add on bits, but I'm having a blast with it so far. And, don't even get me started on how AMAZING the built-in wifi is! Seriously great bundle!"},{"reviewerName":"Vernon","rating":"5.0 out of 5 stars","reviewTitle":"... with all of its features will make taking photos easy and enjoyable","reviewDate":"January 7, 2017","reviewText":"The Canon Rebel T6 with all of its features will make taking photos easy and enjoyable!"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"March 27, 2017","reviewText":"SO Obsessed with this camera!"},{"reviewerName":"Amazon Customer","rating":"2.0 out of 5 stars","reviewTitle":"Two Stars","reviewDate":"January 7, 2017","reviewText":"Product came defective."},{"reviewerName":"Patrick James Walters","rating":"5.0 out of 5 stars","reviewTitle":"I have not owned a camera since Viet Nam and ...","reviewDate":"November 14, 2016","reviewText":"I have not owned a camera since Viet Nam and that one was a Cannon as well. This works well."},{"reviewerName":"Tobias Godek","rating":"1.0 out of 5 stars","reviewTitle":"Missing","reviewDate":"November 16, 2016","reviewText":"Missing a few things from the bundle. :("},{"reviewerName":"Edwardo M.","rating":"3.0 out of 5 stars","reviewTitle":"Three Stars","reviewDate":"December 27, 2016","reviewText":"Unable to figure out how to do Panoramas."},{"reviewerName":"AlextheGreat","rating":"5.0 out of 5 stars","reviewTitle":"Great action shots for U14 hockey","reviewDate":"December 20, 2018","reviewText":"We have been looking for a midprice camera that can handle the fast pace of youth hockey. This one is the best we have owned to date. It takes rapid up close shots in dimly lit Wisconsin youth hockey rinks. If you are used to a contained zoom lense, there is a learning curve to using detachable lenses, but once you get the hang of it, the camera is excellent. We have paid double for other cameras that did not have nearly the shutter speed on this camera and did not get anywhere near as close shots."},{"reviewerName":"JOSH","rating":"5.0 out of 5 stars","reviewTitle":"Best Bundle Value!!!","reviewDate":"September 13, 2016","reviewText":"I researched for a DSLR camera for awhile and I've decided on the Canon EOS Rebel T6 bundle. I FOUND IT BY Photo4Less through Amazon...highly recommended! The package came in two days and it was packaged perfectly. I just started playing with it a little bit and find it fairly easy to use. Instruction manual online was easy to access and download. The bundle made it easy to get started with the camera without having to purchase individual items. Great price for the bundle!!!"},{"reviewerName":"You can't take criticsm","rating":"4.0 out of 5 stars","reviewTitle":"Great pic. Makes a lot of noise","reviewDate":"January 22, 2017","reviewText":"Takes great pictures. It is very very load for a camera. Take a picture and it makes a clatter. Turn on the view screen makes a load clatter. You wont be doing any wild life shooting with this camera. Order extra battery's. You will need them. Really hard on battery's"},{"reviewerName":"Somajan","rating":"4.0 out of 5 stars","reviewTitle":"I love it.","reviewDate":"September 22, 2016","reviewText":"I love it! It was a little smaller than I expected, but that is actually 100% a god thing! I think the size is perfect and so far I love the apps and everything."},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"This set is awesome!!","reviewDate":"May 11, 2017","reviewText":"This set is awesome!!! Th camera, the lenses, the flash cards!! The only gripe I have is the camera bag wasn't my style but I purchased a canon camera backpack to fit more items. The small tripod is pretty flimsy but I already have a larger tripod that I use. Overall it's definitely worth the price!!"},{"reviewerName":"Y King","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"November 24, 2016","reviewText":"great variety of accessories at good price"},{"reviewerName":"Robin","rating":"5.0 out of 5 stars","reviewTitle":"ONE OF A KIND!","reviewDate":"September 13, 2016","reviewText":"I love this bundle!\nIts unique!\nGREAT GIFT ITEM!\nComponents are high end quality!"},{"reviewerName":"Hilda A.","rating":"1.0 out of 5 stars","reviewTitle":"I Guessed","reviewDate":"September 20, 2016","reviewText":"This is OK"},{"reviewerName":"SED","rating":"5.0 out of 5 stars","reviewTitle":"Canon EOS Rebel","reviewDate":"December 14, 2018","reviewText":"Awesome camera. It takes a while to get use to all the controls, but the pictures are fantastic. It's the best camera I have had so far. I am just a beginner, but we have so much wildlife I wanted to take some great pictures of them all. I feel confident that the pictures will turn out great. Just read the manual, and get to know your camera."}]}