{"title":"Canon EOS Rebel T6 DSLR Camera Bundle with Canon EF-S 18-55mm f/3.5-5.6 IS II Lens + Canon EF 75-300mm f/4-5.6 III Lens + 2pc SanDisk 32GB Memory Cards + Accessory Kit","manufacturer":"Canon","currentPrice":"$499.00","rating":"4.6 out of 5 stars","totalRatings":"856 ratings","features":["\n         Make sure this fits\n                by entering your model number.\n        \n","This Camera Bundle Kit comes complete with all manufacturer supplied accessories with a 1-year warranty and includes:","The EOS Rebel T6 DSLR Camera from Canon is an APS-C format digital SLR camera with an 18MP CMOS sensor and the DIGIC 4+ image processor. With 14-bit Analog/Digital conversion, an ISO range from 100-12800 (expandable to 25600), and Multi Shot Noise Reduction, it offers sharp details, accurate colors and low-noise imaging in both bright and low-light shooting situations. The Rebel T6 can continuously shoot up to 5 fps.","Canon 18-55mm II Lens - a standard zoom compatible with Canon APS-C format cameras. It features a focal length range of 18-55mm which is equivalent to 29-88mm in the 35mm format + Canon EF 75-300mm f/4-5.6 III Lens","2 x SanDisk 32GB SDHC Memory Cards + Deluxe Padded Camera Case + Flash Light + 3pc Filter Kit + Extra Battery Pack + AC/DC Car & Home Charger + High Speed USB Card Reader + 50\" Camera Tripod","Commander 0.43x Auxiliary Wideangle Lens - it conveniently mounts to the front of your fixed or zoom lens, and allows you to capture a wider field of view, Commander 2.2x Auxiliary Telephoto Lens - brings you twice as close to the action. Perfect for long-distance photo situations such as sporting events"],"reviewsAspects":["easy to use","extra battery","love this camera","great deal","great camera","entry level","wide angle","highly recommend","still learning","card reader","eos rebel","love love","great bundle","worth the money","definitely worth","great value","takes great","get started","camera bag","exceeded my expectations"],"productInformation":[{"Package Dimensions":"16.2 x 12.1 x 8.4 inches"},{"Item Weight":"9.4 pounds"},{"Shipping Weight":"9.4 pounds (View shipping rates and policies)"},{"ASIN":"B01MYM739C"},{"Item model number":"33-T6-KITD-111416"},{"Batteries":"1 Lithium ion batteries required."},{"Customer Reviews":"4.6 out of 5 stars\n    856 ratings\n4.6 out of 5 stars"},{"Best Sellers Rank":"#3,832 in Camera & Photo (See Top 100 in Camera & Photo)\n#110 in DSLR Cameras\n"},{"Date first listed on Amazon":"November 14, 2016"}],"productDescription":[],"reviews":[{"reviewerName":"Dan D","rating":"3.0 out of 5 stars","reviewTitle":"Great camera, but not all accessories are necessary","reviewDate":"February 24, 2017","reviewText":"Right up front, I am not a professional photog . . . nor can I be considered an amateur photog. I just enjoy taking pictures. I also believe customer reviews are critical. I love shopping on Amazon and I value customer reviews, tremendously. I purchased this bundle to take a step up from my Panasonic Limux digital camera. I love the Panasonic, and have been using it for a couple of years. I enjoy taking macro pictures, but recently started taking pics of birds. I wasn’t getting the quality of pictures I wanted, so a friend told me that I really needed to step up to a DSLR camera. She recommended a Nikon, but the ones she recommended were well over $1,000! Not wanting to spend a paycheck on camera (or get into trouble with my wife), I opted for the Canon Rebel T6. This is the base model, and it really is all that I need.\nThe reason I picked this bundle is b/c the price seemed good ($549) and it comes with a lot of accessories. After receiving the camera, I took everything out, and gave it a once-over to make sure all was good, and accounted for. The reason I give this bundle a 3-star rating is not b/c the camera is bad or cheap. I give it a 3-star rating b/c much of the bundled accessories are either not necessary for what I am doing, or the quality is not really that great.\nThe best parts of the bundle are: 1) camera body (obviously), 2) standard lens, 3) zoom lens (this is great for bird pics), 4) extra battery, 5) battery charger, 6) two 32GB memory cards, 7) macro lenses, and 8) the shutter remote.\nThe less than great parts of the bundle are: 1) the extra battery charger (I have to fiddle with it to get it in the right position so it will charge, if not it will show a green light, indicating it’s charged when it’s not), 2) the tripod (seems VERY flimsy, and almost fell over a few times when I had the camera mounted), 3) the two lens attachments (these did very little to extend the range of the lens or to magnify it for macro shots), 4) the external flash attachment (this is thin plastic and the attached guide sheet is peeling off), 5) lens filter attachments (don’t seem to make much of a positive difference in the pics I’ve taken).\nAll of that said, I really love this camera. I decided to spend a little extra money and get a good tripod and I upgraded the memory cards to two faster 64GB cards. If you are just getting into photography and want a great starter DSLR, I can recommend this camera. I have attached two pictures, both taken side-by-side, where I took a picture of a bird flying to the feeder. Both cameras were on tripods with the setting on action, and zoomed in to the maximum. You can immediately tell how much more clear the Canon picture is compared to the Panasonic."},{"reviewerName":"Anonymous","rating":"3.0 out of 5 stars","reviewTitle":"Inexpensive starting point with some useful extras","reviewDate":"October 31, 2017","reviewText":"The is an okay kit, but most of the components don't match the quality of the main item: The camera.\n\nThe EOS Rebel series is a great camera line to get started, especially if you're not sure yet if you want to do photography as a professional or if you're an amateur and want to do better than \"average.\" The APS-C (or \"crop-sensor\") cameras are not \"full-frame,\" professional 35mm cameras. They have most of the features of full-frame cameras, but they are usually physically smaller, have a smaller image sensor, and generally don't have quite the image quality of the larger cameras. That doesn't mean that they're bad. In fact, they are great cameras! It just means that there is a loss of quality that, all other things being equal, can be noticed in a number of instances. However, many professional photographers use crop-sensor cameras, either as their primary camera or as a backup. Canon's EOS Rebel line of crop-sensor cameras (like the T-7i, T6, T-5i, T-6i, etc.) are designed for EF-S mount lenses, which from Canon (and a few other manufacturers) is high-quality consumer grade glass, but they also accept most Canon EF mount lenses and even some EF extensions (mostly aftermarket), so professional-quality glass can be used.\n\nIf you're looking to use this for video, I recommend looking for a T-6i or T-7i kit, since this unit can only use the built-in microphone. I didn't realize this and would have spent the money for the T-6i had I known.\n\nThe included EF-S 18-55mm IS II lens is a reliable lens with good optics for portraiture, family photos, and most other \"everyday use\" situations. If you want to do telephoto shots, I recommend the EF-S 55-250mm f/4.0-5.6 IS STM lens (which is a huge improvement over the 55-250mm IS II), since there's no focal length overlap. The EF-S 18-135mm f/3.5-5.6 IS II STM (or the newer USM) is an excellent-quality lens with a wider aperture that's also available for the EOS Rebel line, but it completely overlaps the kit lens. The 18-135mm has roughly half the maximum focal distance of the 55-250mm and is roughly twice the cost, but its overall quality is much better than either the 18-55 or the 55-250. They're all 58mm diameter glass, so the add-ons for the kit lens (like the filters and hood) are all interchangeable. I have a 55-250 and have used it with this camera kit and the quality is good enough for most amateur photographers.\n\nAs for the rest of the equipment in this bundle, the best of what you're getting are the SD cards (which are reasonably good Class 10 cards suitable for photography and light video work) , the spare batteries, and the optical filters. The card reader is superfluous with most modern PCs but might come in handy on older or low-end computers (some Macs also don't have SD-card readers). The macro and telephoto lenses, while potentially useful in limited circumstances aren't high-quality items; you'll struggle to use them much of the time even with the kit lens, and they're totally impractical for lenses beyond 110mm focal length. The included flash is ultra-simplistic, but useful if you don't already have one. The tripod is cheap plastic and will probably break fairly quickly, but again it's useful if you don't already have (or if you need to save some weight and can't put the money into carbon fiber). The lens hood may come in handy if you've got a lot of glare in one of your shots; I rarely need it but it's been nice to have when I do.\n\nOverall, this an inexpensive way to start and it's a reasonably good value considering everything it comes with, but it's not great and much of it will leave a motivated amateur feeling wanting. Many components will end up being replaced and there will be many additions to it over time. Good for a just-starting-out middle/high school student or an amateur with limited time to practice the hobby."},{"reviewerName":"Katie Soderlund","rating":"5.0 out of 5 stars","reviewTitle":"Best bang for your buck!!","reviewDate":"February 10, 2017","reviewText":"Came with everything pictured, all of the add on attachments are not Canon brand but they all work and attach to the camera. So excited about this purchase! Such a great deal."},{"reviewerName":"Zoie","rating":"5.0 out of 5 stars","reviewTitle":"first DSLR camera, in love.","reviewDate":"August 23, 2017","reviewText":"this is an AMAZING starter camera. the bundle is great, comes with 2 batteries and 2 chargers so it'll potentially never be dead, tons of lenses, and tons of other cool stuff. battery lasts a while as well. i have already taken it on 3 vacations."},{"reviewerName":"Krys","rating":"5.0 out of 5 stars","reviewTitle":"Buy it! BUY IT NOW!","reviewDate":"November 17, 2017","reviewText":"I love, love, LOVE this kit! I ordered it wearily after some mixed reviews. I've always shot with nikon so this is all new for me.\nI opened the camera box and was panicked thinking it was a previously used camera because I couldn't find a battery in the box. It was there, I just wasn't looking hard enough. The box was sealed and looked like a factory packed box, but I was still afraid. Before I found the battery, I called Canon tech support and discovered this third part seller (PAGING ZONE) is an authorized seller, so if I ever have a problem with the camera, the warranty is fully intact! So GOOD NEWS for me!\nThe reviews about the tripod were on point... The tripod is ultra lightweight and not really good for much more than table top photography... Even then, BE CAREFUL.\nThe wide angle lenses, was worried they sent me the wrong size, but when I attach any of the lens filters, it fits like a glove... So use a filter. As far as a review involving it breaking the lens, if it doesn't fit smoothly, don't force it. Try removing and rethreading. The only other complaint I have is the sd card reader... It is just a hair too big to fit in the usb drive. I don't know how that happens...\nThe flash is a little weird, but I'm still learning how to use this one....\nSo!\nPros:\n-Camera is from an authorized seller\n-All the lenses and filters fit\n-SD cards and extra battery (and charger) work perfectly\n-this camera takes lovely shots!\n-The WI-FI transfer to phone or computer it AWESOME!\n\nCons:\n-Cruddy tripod\n-USB card reader is a hair too big to fit my USB port..."},{"reviewerName":"G. Sibaja","rating":"5.0 out of 5 stars","reviewTitle":"Great kit!","reviewDate":"May 25, 2017","reviewText":"Bought it as a gift for my wife and she is thrilled both by the camera itself which is a beauty, but also by the accessories that came with it; all of them are good quality and very complete in order to form a great starter kit for an amateur photographer; great buy, you pay a fraction of the camera's price and get a bunch of great gadgets practically for free! Very pleased, highly recommended for any aspiring photographer!"},{"reviewerName":"Kimberly yoder","rating":"5.0 out of 5 stars","reviewTitle":"The camera is awsome. Did find the picture a ...","reviewDate":"April 2, 2017","reviewText":"The camera is awsome. Did find the picture a bit misleading. I thought there was 2 batteries but only got one. So if you need more than one battery u may want to order an extra"},{"reviewerName":"Amanda Jackson","rating":"5.0 out of 5 stars","reviewTitle":"STOP YOUR SEARCH! This is the best camera (and bundle) you'll find under $500.","reviewDate":"July 10, 2018","reviewText":"I LOVE this camera! This is hands down the best camera you can buy for the price. (The Nikon 3400 is a comparable entry-level camera, and may have the edge in some aspects, but I lean toward this camera.) This is totally easy to use, especially if you've used a Canon DSLR before.\n\nThe add-ons from this seller are mostly good. Considering I paid $30 more for this whole bundle than the current retail price for JUST the body and lens, it's a fantastic value!\n\nPros:\n- I believe this is the best camera body and lens for the money\n- The Canon bag can hold everything in this bundle except for the tripod (obviously), but it is a tight fit and takes some practice to pack it efficiently.\n- Having an extra battery is awesome!\n- The UHS-I 32GB memory cards are actually SanDisk rather than some cheapo no name card, and each one has a capacity for thousands of full quality JPGs.\n- The lens attachments and filters are ok.\n- The remote shutter button is good, especially for tripod shooting to ensure the camera stays steady.\n\nCons:\n- The tripod is subpar. It's flimsy and I worry it will fall over with the slightest bump. If you plan on using a tripod a lot, buy a different one. But for the occasional (and very careful) tripod user, this will get the job done. Again, this was part of a huge bundle for essentially $30, so I can't complain."},{"reviewerName":"Amazon Customer","rating":"4.0 out of 5 stars","reviewTitle":"I'm a photographer and like to have a back up camera in the event ...","reviewDate":"May 28, 2018","reviewText":"I'm a photographer and like to have a back up camera in the event my primary stops working. I purchased this bundle. The tripod is extremely low quality, but I didn't expect it to be great and I didn't buy the bundle for the tripod anyway. The bag that it comes with it very small and wouldn't fit all this equipment even if you were a tetris master. I use one of my other bags for it and this one just sits in the closet. The kit lenses are meh, like any kit lens would be. The telephoto lens actually is pretty blurry and low quality, so I don't use it. The wide angle add on and the macro add on lenses however I was pretty impressed with. I also LOVE the clicker. The cord is pretty short, but it works awesome."},{"reviewerName":"Emily D.","rating":"4.0 out of 5 stars","reviewTitle":"Great Camera and Decent Bundle","reviewDate":"November 19, 2018","reviewText":"I am not a professional photographer, but I have loved so many of the photos that I have gotten out of this camera in the past year. I picked a Canon because I loved the macro quality I had always gotten from my little point-and-shoot elphs, and am generally more familiar with its interface. I haven't played around a ton with the extras (except perhaps for the macro lenses, which I love), but this is a wonderful grab-and-shoot camera for a beginner who wants an introduction to DSLR. The camera itself is very user-friendly, with the ability to take shots without much manual adjustment, or switch to settings where you can fine-tune to the particular situation. I've mostly used it to take nature photos, especially macro, and photos of my toddler (using the sports-action setting, it's easier to catch his antics without much blur). I'm not good at landscape at all, so I can't attest to its usefulness there, but I've never regretted buying this camera.\n\nAs far as the bundle goes, there are a couple cons: the tripod is extremely flimsy (handle broke immediately), all extras are generic (other than bag, strap, main lens, and lens cap, which actually doesn't bother me too much), and I can't seem to get the wide-angle or telephoto lenses ((Ultimaxx brand) to take a good photo without a black rim around the photo edge. It's probably the fact that I don't know exactly what I'm doing, but I don't take too many telephoto or wide-angle pictures anyway, so it's fine. There are also a few things I just don't use... The flash, the SD card reader (because my computer has an SD card slot, don't need it), remote (very, very short cord), and filters. I could see the filters being useful, though, if you know when to use them.\n\nBundle pros: camera bag, strap, TWO 32GB SD cards (I found quite a few kits with two 16GB cards or one 16GB with one 32GB), Canon battery and extra generic battery (again, I don't care if it's generic), Canon battery charger and generic charger (again, I don't care if it's generic, I just like having an extra!), stackable macro lenses, filters (if you know when to use them).\n\nSo, overall, I've used this camera for about a year, and absolutely love it. If you're a starter like me, I recommend getting the bundle and playing around everything to figure out what works best for the kinds of photos you want to take. You'll find out what you like, pack the handy case with stuff you'll actually use, and leave out the extras. If you know what you're doing, probably just stick with the basic camera body kit and customize the extras you need to get better quality accessories."},{"reviewerName":"Pam","rating":"5.0 out of 5 stars","reviewTitle":"Great price","reviewDate":"September 26, 2017","reviewText":"The camera kit alone would cost more in stores like Best Buy, Target, etc. Yet in this accessory bundle you get a bunch of extra stuff. I haven’t tried each accessory, but I reallly appreciated the two SD cards and the camera bag. As for the camera itself, I think it’s a good beginners camera for those trying to go beyond cell phone photography etc. I’ll attach some of the pictures I took during my first outings. All were taken in auto mode...I’m sure I can get better pics if I learned more about photography and used the manual settings & also purchased better lenses. However, the lens it comes with is great for general photography and to learn as a begginer. Overall im satisfied with this purchase"},{"reviewerName":"James","rating":"5.0 out of 5 stars","reviewTitle":"It's great camera! Our photography teacher says its the most ...","reviewDate":"February 18, 2017","reviewText":"It's great camera! Our photography teacher says its the most complete bundle he has seen. We love it and it is working very well for our class."},{"reviewerName":"Jennifer Mecca","rating":"5.0 out of 5 stars","reviewTitle":"Easy to use and it takes great pictures.","reviewDate":"January 29, 2018","reviewText":"I love this camera. There are a ton of features and I probably need to explore them, but the auto feature is just so easy to use that I haven’t bothered learning more. The only negative thing I have found is the tripod that came in the set. It’s rather flimsy and shorter than I expected. But even with the flimsy tripod, I highly recommend this camera and accessory pack. The two dog pictures that I uploaded are some of the first pictures I took without really knowing what I was doing...great quality for just taking it out of the box."},{"reviewerName":"Donovan Channer","rating":"5.0 out of 5 stars","reviewTitle":"I upgraded now to benefit for the many upgrades like continuous shutter","reviewDate":"September 8, 2017","reviewText":"I have the original Rebel for over 14 years and it took many pictures that I enlarged to 3'x4' and hung all over my house. I upgraded now to benefit for the many upgrades like continuous shutter, better indoor pictures due to better lighting technology. I collected a 300ft lens, remote shutter release and many other accessories due to my love of landscape photography.\n\nI was surprised to find this combo kit with all the accessories that I collected and spent over $2k over the years all in this kit. This is more than a starter set, it has 90% of everything that you will need to take breathe taking pictures that every will be amaze to see. My favorite pictures are sunrise or sunsets on vacations and hang a 5\"x7\" in the living room to remind me of the trips. I no longer keep an album, I use the walls to display my memories that all will see. I have a 3'x4' picture of the Grand Canyon that you can see every detail and the Colorado River in the middle. If you can see it, this Rebel will take it back home with you.\n\nThe only thing in the kit that is inferior is the tripod. Mine is much better and it is worth it to invest in different one. I would not spend this amount of money to see it tip over. Everything in the kit is 5 stars so upgrade the tripod to protect your valuables.\n\nNow I gave the original Rebel to my 21 year old daughter so she can fall in love with photography like I did at her age. It is still clicking away and have more years in it."},{"reviewerName":"derkinssg","rating":"5.0 out of 5 stars","reviewTitle":"Awesome first DSLR","reviewDate":"August 21, 2018","reviewText":"This is a great kit for those looking to upgrade from a crossover to a DSLR or those who used mid range film SLRs back in the day and, like me, have been waiting for years to be able to afford a DSLR.\n\nYou get everything you need to get started in both basic high quality photography and also doing those things that a crossover just *cannot* do, esp long exposures where the shutter is locked. As someone who loves night photography, light trails and painting with light, I'm in love with this camera.\n\nAll that said, this kit isn't perfect. The tripod is, simply put, total crap. I used it reluctantly, but kept a good hold on the camera the whole time. It might not be horrible as a tabletop or with the first legs extended, but plan on buying a real tripod. Likewise, the card reader is cheesy. Not really a problem, as the cable works great.\n\nAs for the case, while you can get the camera body, both lenses, both lens extensions, the flash, the filters, the shutter release and even a flexible leg mini tripod in if you are creative, you will absolutely have to move *everything* to get to *anything*. It's not too bad if you are wearing the camera and one lens around your neck, otherwise you will want a bigger bag.\n\nThese are my first pics with this camera, just messing around. None used a flash."},{"reviewerName":"JosieShopsTooMuch","rating":"3.0 out of 5 stars","reviewTitle":"Great camera but a lot of the accessories are not ...","reviewDate":"December 19, 2017","reviewText":"Great camera but a lot of the accessories are not canon. Extra battery wasn’t canon, neither was the extra lens."},{"reviewerName":"maria fernandez","rating":"4.0 out of 5 stars","reviewTitle":"AMAZING!","reviewDate":"December 6, 2017","reviewText":"This is an amazing deal. The camera itself cost more than this in other places so this is great because all the accesories. The flash is a great flash that will 100% brighten your picture but it is very cheap quality and that goes for the tripod aswell. Besides that the camera and the lens are amazing especially for a starter camera."},{"reviewerName":"Thomas McCann","rating":"5.0 out of 5 stars","reviewTitle":"... but I can tell you that this is a good one. If you have been taking photos with ...","reviewDate":"September 3, 2017","reviewText":"I have never owned a DSLR before this one but I can tell you that this is a good one. If you have been taking photos with your phone and you want an upgrade, but you dont want to spend 2000 dollars this is the camera for you. I got this on my 14th birthday I have had it for 6 months now and it still works great. Its an amazing camera but I can't tell you that this is the one for you, only you can tell yourself that.\n(P.S. all the photos are mine)"},{"reviewerName":"Amazon Customer","rating":"1.0 out of 5 stars","reviewTitle":"The camera is really awesome and takes great photos","reviewDate":"October 16, 2017","reviewText":"The camera is really awesome and takes great photos, however, the included products are unfortunately pretty awful. The tripod is flimsy, the button on the remote gets stuck, the flash isn’t very good and the extra battery barely holds a charge. Might be better off purchasing the extras serpately from the camera!"},{"reviewerName":"EJ McCune","rating":"4.0 out of 5 stars","reviewTitle":"Four Out of Five Stars","reviewDate":"September 22, 2017","reviewText":"All in all, this was a good buy and I am happy. The accessories are pretty low quality so don't pin your hopes on those. The camera and standard lens, however, are original Canon products and exactly as advertised. I priced this same exact camera at my local camera shop and it was the same price except the accessories did not come with it. The camera bag that comes with the package is way too small to fit all the other items and doesn't offer much protection to the camera. I am going to get a better one and use this one only in an emergency.\n\nDon't expect the two additional lens extenders to do much because they don't. One of mine (the zoom) was defective out of the package but considering I didn't buy this package for it, wasn't too disappointed. I have messaged the seller but yet to get a response.\n\nI most likely would buy this again and for the most part am happy with my decision."},{"reviewerName":"Roger","rating":"5.0 out of 5 stars","reviewTitle":"Do the research and pick the camera that fits you best.","reviewDate":"February 2, 2018","reviewText":"Tons of great videos to watch on youtube to expand your photographic knowledge and expertise. Take advantage so you can get the full benefit of having such a great camera. Tony and Chelsea Northrup do so many great video classes, so you can learn without having to do all of the reading. Take advantage of all of the resources that are available."},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"It comes with everything","reviewDate":"August 28, 2017","reviewText":"Its a great product it comes with everything in the picture and everything fits perfectly it comes with 2 SD cards the other one is in the camera the only bad thing is It doesn't have a flip out screen or you can't put a mic"},{"reviewerName":"jonathan couture","rating":"5.0 out of 5 stars","reviewTitle":"Fun and worth the cost.","reviewDate":"March 27, 2017","reviewText":"Lots of extras lots to learn. Been along time since my 35mm Minolta so adjusting to DSLR has a bit of a learning curve. My favorite function so far is being able to link to my phone and take remote pics as well as download pics directly to my phone. There's a ton of functions I haven't played with yet, but so far it's really been worth the money. Should have got the telephoto lens 75-300 though. My 35mm Minolta had one and I could really get up on stuff. This lens isn't bad but could be better."},{"reviewerName":"Bollycats","rating":"5.0 out of 5 stars","reviewTitle":"Great package deal!","reviewDate":"February 22, 2017","reviewText":"Very nice kit for a great price! One minor item was missing from the box, but a call to 33rd Street Camera had it sent out right away. Great customer service. The camera is pretty lightweight, which is good. I'm tired of holding a heavier camera and lens. Lots of great extras and accessories. Pretty much everything you need. It's a great deal when you can buy just the camera, one lens, and the bag for the same price elsewhere."},{"reviewerName":"Tryphaena","rating":"5.0 out of 5 stars","reviewTitle":"Great kit!!","reviewDate":"September 8, 2019","reviewText":"This is an excellent camera for starting out! I purchased it to start learning photography, and it takes beautiful photos. Per a friend’s recommendation (who is an award-winning photographer), I also purchased a Canon EF 50mm lens, so I switch between the kit lenses and the 50mm.\n\nThe added things in the kit are also really fun to play with, I especially love the macro lens! I thought I might get a lesser quality with so many added extras, but I was pleasantly surprised. I haven’t had any issues with anything so far and it’s been several months and I’ve had my camera glued to my hands since!\n\nIf you’re a beginner though, I HIGHLY suggest (nay, insist!) that you look up the meaning of aperture, ISO, and shutter speed before anything. It’ll help so much when learning your settings!"},{"reviewerName":"Heather D Pray","rating":"1.0 out of 5 stars","reviewTitle":"Product review.","reviewDate":"June 25, 2017","reviewText":"I am a little disappointed, with what I see in the photo I was under the impression that I was going to get the items that were in the photo. Now some of the items don't see durable with my camera. The tripod has already broken. Like I said I was hoping that all the products would have turned out a better quality."},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Wonderful","reviewDate":"March 18, 2017","reviewText":"I love this camera! Very easy to operate and has great pictures! READ THE MANUAL. If you don't read the manual you'll be suffering. It's a solid camera and will do what you want, be patient with yourself experimenting with settings, modes, lenses, filters. Don't be shy or embarrassed about bad photos every bad one is teaching you how to make a good one. It's digital not film so don't be afraid to screw up it doesn't cost you anything to take a picture and delete it remember don't get hung up on bad first shots you won't have time to remember them when you're taking good ones! Have fun! There's no wrong way in doing things. Just take care of your camera. It's about creativity not following instructions.\nWhen it comes to the hardware though;\nthe macro/wide angle lens and telephoto lens attach to you zoom lenses. You may want to upgrade your lenses eventually after you get enough practice/delve deeper into photography but it's all good for beginners.\nThis bundle saves a TON of money. Get it and have fun!"},{"reviewerName":"Parker D","rating":"5.0 out of 5 stars","reviewTitle":"Cool camera set!!!!","reviewDate":"August 10, 2017","reviewText":"I absolutely love this camera!!! Takes amazing photographs and comes with everything you need. All the accessories work great just not canon brand!"},{"reviewerName":"Carolyn S Boggs","rating":"5.0 out of 5 stars","reviewTitle":"Great intro level DSLR","reviewDate":"October 21, 2018","reviewText":"This camera is a full featured entry level DSLR - if you are a seasoned pro you'll want to go with one of the pricier models, but if you are new to DSLR cameras and are looking to step up from a point and shoot camera to something much more powerful, this is a fine first step. This camera gives you full control over most parameters of your photography, but includes a broad spectrum of presets and automation as well that lets you work your way up to using all the manual tools - if you are a beginner, this camera will carry you for a few years before you begin chafing for something a bit more substantial! The camera body is light and solidly built - all the controls are accessible via buttons on the exterior of the camera as well as through an easily navigable menu. The view screen is generous and bright, easily readable in most settings. The camera also offers a viewfinder which is very helpful when shooting in high glare settings (or when you forget to bring your glasses with you!) The included lenses cover a good range of distances, but you may want to invest in a wide angle lens - a good 12-20mm for getting more into your images (although most of the better ones out there will actually cost more than your camera did). The 75-300mm zoom lens will get you in close to many subjects, but don't expect it to compete with some of those 80x zooms you see on point and shoot cameras! Changing out lenses is easy and fast. There are ample settings for one shot, continuous shot, and timed delay shooting, so if you are shooting an active event you can get some great movement shots, and if you want to get into the picture yourself, its easy to do. When shooting in continuous mode, the camera will pause after five shots to let the data catch up - I've found that three shots is the gets keeps me from getting that delay. Both of these lenses shoot a little on the slow side. There is a slight hesitation after pressing the shutter release. I've also noticed that although the 18-55mm kit lens is equipped with an anti-shake feature, it really doesn't do much. So - consider using a tripod! The picture quality is excellent - I always shoot in RAW and this camera offers six RAW quality settings and the same for JPEG. Or you can choose to shoot both simultaneously if you don't know a lot about the formats and want to learn. Its great to have both formats to do side by side comparisons. This camera does not have an infrared sensor, so if you wish to use a remote, you'll have to use the Canon Camera Connect mobile app - it is available for both IOS and Android devices (sadly not for Windows 10 mobile devices though!). In addition to letting you control your camera remotely, the mobile apps also let you view the pictures on your camera on the bigger screens of your smartphone (I use my iPad - and its great to see a real time image for composition on that screen - believe me!) The app is pretty easy to use and so far I've found it to be stable and reliable, although more so on my iPad than on my Android phone. This camera is also capable of shooting HD movies and that is a terrific feature - but keep in mind, you'll have to master your lenses in order to stay in focus and do efficient zooms and pans. Overall this is a great camera. Canon lenses can be used on all their DSLR's, so when you are ready to upgrade to a more professional camera back, you'll be able to keep your lens kit and accessories."},{"reviewerName":"GrammaPam","rating":"4.0 out of 5 stars","reviewTitle":"Seems good for what you get.","reviewDate":"December 25, 2017","reviewText":"Camera seems ok and most of the accessories seem to be ok but the tripod and camera case are of poorer quality. The tripod is too short and not very supportive or sturdy and the camera case is barely large enough for everything. Once you FINALLY get everything to fit into the case in order to find anything or get something out you have to take just about everything out to find what you need. The case needs pukas (holes or storage pouches) on the outside so you can organize things.\n\nI haven't taken many pictures and haven't used the extra lenses yet so I will not give any rating on those yet. If I have anything constructive to say about them later on I will add to this."},{"reviewerName":"Emma E","rating":"5.0 out of 5 stars","reviewTitle":"I love this camera","reviewDate":"May 17, 2017","reviewText":"I love this camera! Takes really good quality pictures, has many different settings, and isn't too heavy! The messenger bag was a little small and definitely didn't hold all the lenses and stuff that came with this camera (I was able to borrow my dad's old bigger camera bag, which is why that wasn't a big deal for me), however the lenses themselves are amazing. The exterior flash is a little weird because it doesn't sit on top, it screws on the bottom, but it works. Also, the tripod is crap - it's very flimsy and unstable, so if that's a real must have for you, then I suggest just going ahead and ordering another tripod. Overall great product though; I'm very pleased with it!"},{"reviewerName":"amanda george","rating":"5.0 out of 5 stars","reviewTitle":"Good camera","reviewDate":"March 8, 2019","reviewText":"I am all about my reviews and opinions before spending this kind of money on something (especially online) But I can honestly say I am super please with my purchase, I have had it glued to my hip since I received it yesterday! I was also reassured by a fellow photographer that this is a good starter camera and I love it so far. I have yet to play with all the accessories I read a lot of people saying they were not useful or cheap I can not give my opinion on those at this point. I know I love the camera body its self and the lenses, one of my favorite parts is I received two camera cards which is awesome because I take A LOT of pictures and hate deleting them >_< and two chargers and two batteries!!! I am very excited to take this camera out where I love to shoot and see what she can do! In my opinion its a good price especially if your just testing the waters for your first DSLR camera! I went on canon's website and they have the body and 2 lenses for $449....So for $40 bucks more you really got a good deal when breaking down everything price wise (in my opinion). Good luck!"},{"reviewerName":"Susan","rating":"5.0 out of 5 stars","reviewTitle":"GREAT camera that makes awesome choices in fully auto settings","reviewDate":"December 7, 2017","reviewText":"GREAT camera with a great bundle. You save a lot of money with this bundle. The camera itself is LOADED with stupid proof settings. For those of you from the old school (like myself) you can use fully manual too. But the stupid shooter modes are quite excellent- not like when these fully automatics first came out. I am truly impressed with the fully automatic choices. This camera produces excellent photos on these modes. My daughter has shown me some photos from this camera and I am dumbstruck by them. So... we old timers just might be out of a job soon... lol"},{"reviewerName":"DJ Johnson","rating":"4.0 out of 5 stars","reviewTitle":"Nice kit & camera","reviewDate":"October 18, 2017","reviewText":"Nice kit & camera. The tripod is crap but i bought one from Amazon for under $30 and it works great. Now about the camera I had been using a Sony bridge camera for about eleven years and wanted something a little better. With faster fps this one has only (3) but fast enough for me. interchangeable lenses, video cable & WIFI was a surprise bonus. My only problem is reading all the crap the critics & experts say about this camera.They are too busy telling what all the camera does not have & won't do. Yes a articulating touch screen with 6 to 8 fps shooting and more focal points would be nice BUT i was not trying to spend $900 to over a thousand dollars on a camera. I saved that money and bought 2 very nice Lenses. A canon 55-250 4-5.6 & Canon EF-F Usm 18-135 3.5-5.6 Lens And I just love it. Also u soon learn get a decent camera body and buy good glass! ! !"},{"reviewerName":"Zachary Small","rating":"1.0 out of 5 stars","reviewTitle":"The accessories aren't with the additional cost of getting a package deal like this over just buying the body.","reviewDate":"May 21, 2018","reviewText":"When I got this I realized how badly I overpaid for the accessories. I wouldn't recommend this as a lot of the attachments are of very low quality. The camera tripod is worthless and that was one of my big reasons for going with this package over another. Most of the filters are unnecessary too and if you're buying nice lenses you don't really want to put a filter in front of them sometimes."},{"reviewerName":"Pennywise The Diva","rating":"3.0 out of 5 stars","reviewTitle":"I wish I hadn’t bought this, but I’m stuck so...","reviewDate":"September 20, 2018","reviewText":"Pros: A lot came with this camera and it shoots beautiful pictures.\n\nCons: I got this for an upcoming YouTube channel because it was recommended. It’s not really user friendly and it took time to figure out its idiosyncrasies. The worst is the 32GB cards that came with it. It will only record for 12 minutes, then shut off without saving your data. You have to get a 90+ GB card which will let you record for 30 minutes. Power eats up the battery and it doesn’t have a cord that you can plug into a socket. Calling Canon wasn’t helpful at all.\n\nIf I had to do it again, I wouldn’t have bought this camera...."},{"reviewerName":"Amazon Customer","rating":"4.0 out of 5 stars","reviewTitle":"The camera is pretty nice but it takes some getting used to","reviewDate":"May 17, 2017","reviewText":"The camera is pretty nice but it takes some getting used to. Most of the stuff that came with the camera is cheap and useless, particularly the stand (flimsy and lopsided) and the additional lenses. The cannon branded items are all nice. The sd cards and converter have worked wonderfully. It is worth buying this particular package compared to others because you get both of the cannon lenses, which are really nice."},{"reviewerName":"Amazon Customer","rating":"3.0 out of 5 stars","reviewTitle":"just okay, not great","reviewDate":"February 26, 2018","reviewText":"You could buy the camera body, the lens you need, and some better quality accessories for less than or about the same cost.\n\nGreat camera, bag, and canon lenses.\nSome of the accessories were cheap and not useful for serious use.\nTripod is cheap aluminum and can break easy\nMacro lens screw on extensions are not useful.\nCamera flash is brighter than additional flash attachment.\nLens hood is more complicated than it should be. Just get a canon branded lens hood."},{"reviewerName":"Eugene","rating":"5.0 out of 5 stars","reviewTitle":"Nice camera. I'm a beginner with DSLR","reviewDate":"September 20, 2017","reviewText":"Nice camera. I'm a beginner with DSLR. So I got this and am I impressed. I bought a EF 70-300 to go along with it. I'm learning quite a bit. There's a lot more to learn but it's exciting to see the results. I would recommend this camera to anyone looking for more than a good starter! Also Paging Zone is great dealer. Shipping was prompt even though it wasn't Prime. Package was great. Okay the tripod was cheap!!!! But the rest of it was all good quality. I bought 2 cameras from them and pleased with both deals. When I upgrade I'll definitely buy from them again."},{"reviewerName":"Lisa","rating":"4.0 out of 5 stars","reviewTitle":"Camera is great but some accessories could be better.","reviewDate":"December 2, 2018","reviewText":"Tripod is very flimsy (but compact if concerned about carrying in a small form factor with your gear), hot flash appears cheaper in design than I am use to using, the canon bag is small (will fit everything minus the camera body with small lens attached and the tripod so if you want to carry everything order a DSLR designed-use backpack), second battery was a viviparous brand and not Canon (but same design so not really important on what name is on the battery). Other than these few issues I am happy with the kit!"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Amazing camera I got it two days after I made ...","reviewDate":"November 3, 2017","reviewText":"Amazing camera\nI got it two days after I made the purchase.Came with everything shown on the pictures & everything was very well organized shows great pride of ownership from this company.Camera was easy to set up and there's also a bunch of YouTube videos that help you out in case u have any questions , I've lived in the NYC for 17 years and have taken The city from granted now that I have this great camera it motivates me to go sign seeing and start visiting museums parks and landmarks , Deft recommend buying this"},{"reviewerName":"cnote024","rating":"5.0 out of 5 stars","reviewTitle":"Great for beginners, great pictures","reviewDate":"June 3, 2019","reviewText":"First off- know NOTHING about photography. I just wanted to take better pictures when we travel. Right out the box I took some pics using some of the presets that came out great. It captures details that a smartphone just can’t capture. I used the 18-55 lens that was provided in the bundle. As I got more comfortable I started playing with the shutter speed, flash, ISO, etc. If you are a novice such as I am, do a little research as to what the functions do for your pics. I am very pleased with this camera and am glad I bought it. I look forward to the pics I will take with it as I get to know the camera better."},{"reviewerName":"Yuji","rating":"4.0 out of 5 stars","reviewTitle":"Great b-day present idea","reviewDate":"March 22, 2017","reviewText":"I bought this as a birthday present for someone who is trying to get back into photography. There's a lot of accessories that comes with this bundle, so I doubt the person I'm gifting this to will use all of it, but it's good that they have that option. Instead of a SanDisk memory card, I received a Sony memory card. No biggie since the speed of both brands are about the same (Song reads it a bit faster). I hope my giftee enjoys this present"},{"reviewerName":"MBLSTR","rating":"4.0 out of 5 stars","reviewTitle":"I really love the camera it takes high quality photos and all ...","reviewDate":"February 15, 2018","reviewText":"I really love the camera it takes high quality photos and all the other accessories where perfect except for the tripod. The tripod was all plastic and it felt like my camera was going to fall.. But overall the product is amazing"},{"reviewerName":"Initek","rating":"5.0 out of 5 stars","reviewTitle":"Wonderful starter kit!","reviewDate":"October 14, 2018","reviewText":"My niece has taken some very impressive pictures with this camera. I hope she gets into this as a hobby (or beyond). This is a great kit to start with and even build on. Lenses you buy today for this model can be used with other Canon DLSR's."},{"reviewerName":"Seenzjah","rating":"5.0 out of 5 stars","reviewTitle":"Great camera!","reviewDate":"March 9, 2019","reviewText":"I got soooo much photo credit off of this camera. I am so grateful that this camera has captured so many beautiful moments. I'm a beginner but this camera makes me feel advanced. It can take pictures fast too!"},{"reviewerName":"Kentarou Tamura","rating":"4.0 out of 5 stars","reviewTitle":"It's an amazing value for starters and has alot of things I ...","reviewDate":"January 25, 2018","reviewText":"It's an amazing value for starters and has alot of things I didn't think about. The wide lens and telescopic lens including filters we're things I would have never got. The tripod is crap though and really only good for light weight things like a smart phone mount or lighting. Otherwise the other components were great and we'll worth the value."},{"reviewerName":"Marcia in NorCal","rating":"5.0 out of 5 stars","reviewTitle":"Excellent value for the money","reviewDate":"December 15, 2017","reviewText":"Excellent value for the money. In the store, I'd have spent the same for just the camera body, and that much more on the lenses. The tripod is so lightweight as to be useless in normal use, but it's okay if you just need to set the camera up about 12\". What's lacking is a bit more documentation of what's what. Oh ... the bag ... as other reviews have suggested, it's 'way too small: I will end up getting a back-pack style bag ... this one hold the camera and one lense, and not much more. But to get me started, this is terrific."},{"reviewerName":"Julio","rating":"2.0 out of 5 stars","reviewTitle":"Is a nice camera, but the accessories doesn't work with the ...","reviewDate":"February 6, 2017","reviewText":"Is a nice camera, but the accessories doesn't work with the size of the lens, for example the lens hood is not from the right size What can i do?"},{"reviewerName":"Amazon Customer","rating":"2.0 out of 5 stars","reviewTitle":"Poor Customer service, products in bundle to not work with camera","reviewDate":"December 8, 2017","reviewText":"Camera bundle is a great deal. Customer service response is not as satisfactory. I used the tripod in the bundle on flat ground, and without even being fully extended it was not able to hold up the camera, which resulted in it tipping over and cracking one of the lens. When I contacted the seller to ask about the warranty I was ignored and never received any response. This purchase was a well researched and expensive one, and I would have hoped for more professional customer service."},{"reviewerName":"Amazon Customer","rating":"2.0 out of 5 stars","reviewTitle":"Eh.... maybe youll have better luck than me?","reviewDate":"November 13, 2017","reviewText":"The tripod came with a dented leg and a broken clip. The telephoto lenses cap is on so tight it won't come off for use. The camera box looked like it had been previously opened. The longer lense came in its own box, the seal was already cut. So I'm thinking they sent me a returned item. All the extras were cool, but not worth it for potentially getting a returned camera."},{"reviewerName":"Evan M Peters","rating":"5.0 out of 5 stars","reviewTitle":"Great quality camera that's easy to use","reviewDate":"May 14, 2017","reviewText":"We wanted to invest in a high quality camera and are very happy we chose this one. It takes great photos and is easy to use for beginners. It also has a lot of settings for those with more experience. The bundle was nice - it came with a lot of different lens and things we experimented with and the camera bag is actually pretty nice too. The tripod is awesome and can get really tall as well. I definitely recommend this camera if you are inexperienced like us but want a good quality camera to take photos with. This was great for our Europe trip!"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Very nice package","reviewDate":"February 6, 2019","reviewText":"It is going to take a long time to figure out all of the features on this camera. I really did like the complete array of accessories that came with this package. In particular I bought this package because it include a car charger. I do most of my photography out in the field so I can easily keep one battery charged up while the other is in the camera. I agree with other reviewers that the main tripod, especially at full extension, may be a bit shaky to put a $400+ camera on. However at its more compact settings it should be OK. The included carry bag will definitely not hold camera, both lenses, and all the other \"stuff\" included. Camera and lenses will fit, but will need another bag if you want to carry all the items at once. Cant wait until the weather clears up and I can give it a true workout...."},{"reviewerName":"Candace Klenk","rating":"5.0 out of 5 stars","reviewTitle":"Great Camera!","reviewDate":"September 29, 2018","reviewText":"It's easy to use, but I wouldn't recommend it to beginners. Only to beginners that plan on taking up photography as a major hobby, just because it is such an investment. I was happy with the camera and the different lenses and things the camera came with, and it came with plenty.\n\nIt's not a typical point and shoot and there are setting and ways to manipulate the camera. If you aren't planning on spending some time behind the camera, then save your money and get a simpler camera. It is easy to use and download pictures and things like that."},{"reviewerName":"Oakspirit","rating":"4.0 out of 5 stars","reviewTitle":"Great deal, but accessories useless","reviewDate":"January 14, 2018","reviewText":"The camera is great and works fine, but as expected the bundle is not so good. The one real lens is great, but the 'macro' and 2x lens does not work so well. The filters are filters and work as filters do. The tripod is shaky and the lens hood is cheap. Besides that, the case, camera, main lens, batteries, chargers, strap and the SD cards work just fine. I still find it a great deal due to the SD cards, lens and case for a fairly low price. The flash works, but it seems it doesn't perform much better than the built-in flash."},{"reviewerName":"Fairy Gothmother","rating":"5.0 out of 5 stars","reviewTitle":"Go for a package that has two lenses.","reviewDate":"May 17, 2018","reviewText":"For the price of the camera, the only true Canon items were the camera itself, the 18/55mm lens, the camera strap, one of the battery chargers, and the camera bag.\nThe only decent 3rd party items included are the extra battery, battery charger, and the ultra SD cards. Everything else is junk. It would be an insult to your photos to even bother using the “lenses” they supply. You’re better off getting a deal with the 18/55mm lens and possibly a telephoto lens (70/200mm). Look elsewhere if you want a better deal. Overall, shipping was fast and everything included that it lists was there. Canon DSLR cameras are very good- no matter if you are a beginner or a veteran photographer. Quality is great. I absolutely love the wifi/bluetooth capability to transfer images directly to my phone and even remotely snap photos using the canon camera app."},{"reviewerName":"ben","rating":"3.0 out of 5 stars","reviewTitle":"Great camera; bad accessories","reviewDate":"February 6, 2018","reviewText":"Awesome starter camera! Three stars is because most of the goodies are either near-worthless dollar-store quality or aren’t even compatible with the camera (only the longer zoom lens is Canon). The tripod broke after simply extending it, the spare battery doesn’t charge in the Canon charger (I’m afraid to put it in the camera), the uv filter, macro lenses, and 2.2x telephoto lens are all totally incompatible, and the flash is a piece of garbage.\nGet this camera, but get a different setup or buy what you need separately."},{"reviewerName":"Texas H.","rating":"5.0 out of 5 stars","reviewTitle":"this camera has been amazing. I love learning about all the settings to ...","reviewDate":"November 1, 2017","reviewText":"So far, this camera has been amazing. I love learning about all the settings to mess with and figure out which I like best. I am not a professional by any means but I do feel like this camera helps me feel more like one! I will be taking our family photos with it for sure. The photos I have taken so far turn out so crystal clear. I love it."},{"reviewerName":"Jerry-Candymachines.com","rating":"5.0 out of 5 stars","reviewTitle":"Besides the camera being Very Good - loved all those accessories that came with it.","reviewDate":"June 28, 2017","reviewText":"Really good camera and I used almost all of the extras that came with it. With all those accessories that came with the camera it really was the best deal around, and I looked !! Also, Except for the tripod that was at least usable, all the accessories were Brand name and Top Notch."},{"reviewerName":"H. Jones-Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"You cant beat the deal","reviewDate":"September 14, 2017","reviewText":"It comes with everything it says it will. I just wanted a camera to record my sons games. This does the trick. I also ordered the 55-200 IS lens for 140 later cuz the zoom camera the bundle comes with shakes during video without image stabilization.\n\nI havent used the tripod...yet. The smaller lens is that..very small. The zoom lens is great, sans it not having IS.\n\nThe extra batter IS in the box..its hidden under a flap. I thought i didnt get it.\n\nIta packed very welll. The extra wide angle lens is fantastic. Im still getting used to this camera. My 1st dslr."},{"reviewerName":"Elvish Eyes Photography","rating":"5.0 out of 5 stars","reviewTitle":"Excellent for entry level!","reviewDate":"April 16, 2018","reviewText":"I am an entry level photographer. The Rebel line of cameras was recommended to me by a good friend. I have gotten out to get a few shots with this camera and its kit lens and I am really pleased with what I am getting from this camera.\n\nI am still learning all the things I can do with this kit and I have ordered a Canon EF-S 55-250mm F4-5.6 IS STM Lens for Canon SLR Cameras (Certified Refurbished) and the Canon EF 50mm f/1.8 STM Standard Prime Lens.\n\nI am looking forward to seeing what I can do with them.\n\nAs far as the other parts of the kit go, the tripod is plastic and feels flimsy. Invest in a decent one.\nThe Wired Shutter Release Remote does not seem all that good either. Invest in a decent one.\nBut the fact that you get 2 batteries and 2 SD cards was one of the reasons I got this kit.\n\nI am already out of Auto and using manual with this kit and I am very happy with the picture quality.\n\nMy opinion is that if you are looking to get beyond a point and shoot or want to get someone a good entry level camera then you should get this for them or yourself."},{"reviewerName":"kasey","rating":"5.0 out of 5 stars","reviewTitle":"Great value. Great quality.","reviewDate":"December 13, 2017","reviewText":"I am very happy with this camera. It takes excellent photos, battery life is good, it is simple enough for a novice photographer to use well.\nMy only complaint about the camera is that it can sometimes have a processing delay in between photos while using a high resolution. It is only noticable when taking photos on wick succession.\nRegarding the accessories: some of the items are great (extra battery, car charger, some of the lens attachments), but some are very cheap. The tripod is very flimsy, though functional enough. This is a small issue and I still consider this package a great buy."},{"reviewerName":"Lavonia T.","rating":"3.0 out of 5 stars","reviewTitle":"There are so many cameras that you should invest in, but this isn't one.","reviewDate":"November 22, 2017","reviewText":"The camera itself has a lot of features that are DSLR essential, yet absent in this one. The lens works great. The teleconverters are visible in the corners of the photos. The flash is overwhelmingly too bright. The SDHC cards have a surprisingly low read speed, and are not the ones in the picture. The SD card reader is not the one pictured either, but it is the same brand and model and such. The tripod was the biggest disappointment. After less than 12 hours of extremely(!!!) light use, the handle to adjust the camera on the tripod has broken off like butter. The metal used for it is extremely weak, and it was already dented and scratched straight out of the packaging.\n\nI would recommend this camera to anyone who would be using it for family photos and trips, but not anyone looking for videography use. There is no mic input for Pete's sake! If you do buy this bundle, make sure you buy your own tripod, because this one is a piece of junk! Probably gonna end up in the trash by tomorrow."},{"reviewerName":"LadyCokonut","rating":"5.0 out of 5 stars","reviewTitle":"Love this camera!","reviewDate":"February 7, 2019","reviewText":"I Purchased this camera for myself as a Christmas gift and I absolutely love it! I have been searching since November and hoping for a good black Friday deal but found nothing that compared to this particular item on Amazon that includes all the accessories. It’s a fantastic camera and I am very happy with the purchase. I recommend anyone who is considering photography as a hobby to purchase this item. It has everything you will absolutely need and the price is great!"},{"reviewerName":"Amazon Customer","rating":"3.0 out of 5 stars","reviewTitle":"a great deal for this kit","reviewDate":"July 9, 2017","reviewText":"I was so excited when I opened my package and saw everything it came with. For sure, a great deal for this kit. Unfortunately the extra battery and car charger I received were not compatible with each other, nor the camera and original Cannon battery it came with. Now I have to send it back and pay for rush shipping in order to have it for a trip I'm taking. Not ideal. This is a huge inconvenience. Let's hope the next one I order has the right accessories!"},{"reviewerName":"Kat_C","rating":"1.0 out of 5 stars","reviewTitle":"Finally tried out this camera with the 1 lens that actually fit and all the photos are blurry and look really bad. I spent the extra money because I thought ...","reviewDate":"May 31, 2018","reviewText":"Only one of the camera lenses is made for the Canon camera, the other lenses do not fit at all and are basically paperweights. Finally tried out this camera with the 1 lens that actually fit and all the photos are blurry and look really bad. I spent the extra money because I thought this was an actual Canon camera with Canon accessories, but this is not the case. I would like to return all these items, it was a waste of money."},{"reviewerName":"George Eismont","rating":"4.0 out of 5 stars","reviewTitle":"Be sure you will use all of the accessories","reviewDate":"July 25, 2017","reviewText":"camera is great and wi fi feature made it great to share my vacation photos. The extra battery wouldn't charge in my canon charger and it's a little bigger than the factory battery so it was a little snug in the camera and had to be pried out. One of the filters distorted my shots on the zoom lens, but without it the shots were great. I still have to try all of the accessories, but am pleased with the camera. Looking back I probably could have done without some of them. I wish the camera had a feature where you can crop and save an image like my old Nikon, but there are enough ways to do that afterward"},{"reviewerName":"MRIchicky1","rating":"5.0 out of 5 stars","reviewTitle":"Excellent value","reviewDate":"December 28, 2017","reviewText":"My daughter is taking a digital media arts program at school. This is exactly what the teacher told her to get. He was blown away by the price! It came fast and she loves it!! She saved up her own money to buy this and is so proud to have gotten such a great deal!"},{"reviewerName":"Scott & Jesse Hussey","rating":"4.0 out of 5 stars","reviewTitle":"Love the camera! One of the accessories are a little cheap.","reviewDate":"November 29, 2017","reviewText":"This camera is easy with lots of room for grown as a semi-newbie. It's takes beautiful, sharp images and I'm very happy with it! The accessories are cheaply made... most specifically the strap and tripod. I bought a different strap and rarely use the tri pod though."},{"reviewerName":"Joseph","rating":"5.0 out of 5 stars","reviewTitle":"Great DSLR camera for beginners","reviewDate":"June 23, 2017","reviewText":"Great DSLR camera for beginners. This deal comes with an almost overwhelming amount attachments and accessories. The camera itself is easy to get the hang of and ease its operation. The price for value is more than worth it. All in all, worth the purchase and any wait period. My only complaint is the carrying case that comes with it isn't spacious enough to carry all the items pictured. So you'll either have to purchase a larger bag or not carry everything at once. Which, in some situations, won't be a hassle because you may not need everything."},{"reviewerName":"Rebekah","rating":"3.0 out of 5 stars","reviewTitle":"it's a great bundle for beginning photographers","reviewDate":"November 7, 2017","reviewText":"Keep in mind that there's a ton of stuff in here that you probably won't need. That being said, it's a great bundle for beginning photographers, especially if you're not quite sure what kind of photography you want to do yet. If you have a little more experience, or if you're willing to research what each piece of equipment does, I'd recommend just figuring out which pieces you would need. Chances are good that you can everything you would actually use separately for a better price."},{"reviewerName":"B. Smith","rating":"5.0 out of 5 stars","reviewTitle":"I love this camera","reviewDate":"May 19, 2018","reviewText":"I love this camera. It does everything but write your name, and I guess it would do that if I only knew how to program it. There is only one problem, my hard drive in my computer died and I cannot retrieve any of the pictures that I downloaded. Boo hoo, because we had to say goodbye to our beloved pet and we cannot look at her pictures anymore. We took the computer to Best Buy and they say that they can retrieve our pictures , maybe, for $80.00."},{"reviewerName":"Chris Bauer","rating":"3.0 out of 5 stars","reviewTitle":"The camera works very nicely. Easy to use","reviewDate":"January 25, 2018","reviewText":"The camera works very nicely. Easy to use, easy to manipulate. The accessories that come in this package are not \"Cannon\" brand. Cheaply built plastic junk. Some of the filters won't even stay on the lenses for outdoor use. Thought I was purchasing all Cannon parts with the kit."},{"reviewerName":"Guaran M.","rating":"5.0 out of 5 stars","reviewTitle":"Great bundle for price","reviewDate":"November 18, 2017","reviewText":"So much came with this bundle!!!! To much to put in bag if your not a fan of keeping boxes but you get everutjing pictured. And its heavy, not cheap plastic light feeling items."},{"reviewerName":"Shannon D.","rating":"5.0 out of 5 stars","reviewTitle":"Good entry level real camera.","reviewDate":"August 3, 2019","reviewText":"A good entry level Camera for those serious about getting into photography. There is a little of a learning curve if you have never used any camera other then the camera in your phone. It's pretty easy to use and takes excellent quality photos for the price range and a major perk is that any of the EF lenses you buy for this camera will be fully usable on any new Canon camera later."},{"reviewerName":"Amazon Customer","rating":"4.0 out of 5 stars","reviewTitle":"where's the battery","reviewDate":"January 12, 2018","reviewText":"great! Got the package and everything fits/ are included.\n\nI eventually found my extra battery in the camera box under the cardboard bottom!\n\nbought this kit because of a photography class and needed something quick and inexpensive (this) + prime!\n\n(in more a PC than a camera person)\n\nthe tripod is bad, don't expect much from it\n\nthe extra flash is cool on my opinion\n\nand at least they include memory cards\n\nTime to buy some tempered glass for the screen and I should be set"},{"reviewerName":"Sara","rating":"5.0 out of 5 stars","reviewTitle":"Great camera!","reviewDate":"July 2, 2019","reviewText":"I got this camera as a “something better than my iPhone, but nothing too complicated.” The bundle pack seems worth the value. As a beginner, I honestly don’t know how much of the accessories I will use at this point. I took this camera on a two week trip and the pictures turned out fantastic. They downloaded to my phone easily with the Canon app. It would have been helpful if there were instructions or anything to teach me how to use the features. I had to rely on google and YouTube to figure out what buttons did what, how to send images to my phone, and the basics of taking good pictures."},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"This bundle was the most abundant and generous collection we found--hands down the best deal ever","reviewDate":"November 28, 2017","reviewText":"Early Christmas gift for hubby. This bundle was the most abundant and generous collection we found--hands down the best deal ever! It arrived packaged well and on time. Hubby now has all the lenses, filters, zooms, and accessories any professional photographer would have in their cache! Very, very pleased with the Canon line of products."},{"reviewerName":"Grandma Christina","rating":"3.0 out of 5 stars","reviewTitle":"Very heavy and no touchscreen","reviewDate":"July 9, 2018","reviewText":"The camera is a lot heavier than I expected and when I did research I didn’t realize it wasn’t touchscreen or a flip out screen so I’m really bummed and the WiFi capability is not at all what I expected because when it says you can share instantly that’s not true you have to send it to the app and then from the app you have to save it to your phone so there are a lot of steps before your able to share the picture."},{"reviewerName":"DogMom","rating":"3.0 out of 5 stars","reviewTitle":"Good Camera for Distance Photos","reviewDate":"March 15, 2018","reviewText":"This camera is very good for landscape pictures. Portrait pictures are just okay, not wonderful. I was very disappointed\nin the close up use of this camera. It really is not good for close up pictures. I take pictures of items I put on Ebay. When\nI tried to take close ups with this camera the results were not acceptable. There is a decided clunk when you take pictures.\nThis noise could be a little softer. It sounds like you are dropping a wrench on a concrete floor. Ker-chunk."},{"reviewerName":"foto51dude","rating":"4.0 out of 5 stars","reviewTitle":"Good color saturation","reviewDate":"September 16, 2018","reviewText":"I upgraded from a T3 to this T6. Nice to not have to go through another learning curve. My old T3 battery still holds a better charge than the new one. Not very impressed with the lens adaptors. I do like having an extra battery and memory card. I have not used the external flash yet. Looks promising for bounce flash applications. Overall I am happy with this T6."},{"reviewerName":"PSE","rating":"5.0 out of 5 stars","reviewTitle":"Just get it, it’ll give you a reason to go explore the world.","reviewDate":"May 16, 2019","reviewText":"This is a great package deal. Everything you need to start. I bought this for my wife for a gift. She loves it! The picture quality is amazing. Even as a beginner she is capturing some beautiful images. It’s a nice setup for the aspiring photographer, or even the accomplished artist."},{"reviewerName":"Ayelet O. Kindler","rating":"5.0 out of 5 stars","reviewTitle":"Best bang for your buck DSLR Bundle!","reviewDate":"November 4, 2017","reviewText":"The Canon EOS Rebel T6 is a great start for new photographers.\nI chose this DSLR as my first ever DSLR and this bundle were worth every single Penny.\nEverything described on the page was given.\nThough some items were not good and felt very bad, many were good. The SD cards and the polarizers were very useful and good. I even like shooting with the Macro Lenses included from Vivitar.\nThe extra battery included is Vivitar and not Canon, but it still is very useful in case my other battery runs out.\n\nOverall this bundle was a great deal and I will enjoy using the t6 and the many other items in this bundle in the future!"},{"reviewerName":"Delano Richardson","rating":"3.0 out of 5 stars","reviewTitle":"Guess they got their $700 but would have like some sort of call","reviewDate":"January 13, 2018","reviewText":"Product had a defect on the digital screen internally where BUSY showed as BuSY and some numbers that were in the same places as the u were not showing as full number leading to believe something was wrong with the section where the U was. Contacted the seller, showed no concerns. Guess they got their $700 but would have like some sort of call. Takes nice pictures though but bad customer service."},{"reviewerName":"J.C.","rating":"1.0 out of 5 stars","reviewTitle":"Nothinhg works","reviewDate":"March 11, 2019","reviewText":"Update:The camera stopped working and the batteries will no longer charge.\n\nThe accessories that came with the camera are not very well made. The tripod was far too flimsy and couldn't even hold the weight of the camera, causing it to fall and luckily the lens cap was on or else it could have broken it."},{"reviewerName":"ernie","rating":"5.0 out of 5 stars","reviewTitle":"Great entry level dslr","reviewDate":"December 9, 2017","reviewText":"I love this kit. Got this for my wife and I as a starter camera. She’s been wanting a dslr for ages and I’ve been thinking of starting a YouTube channel so I fingered what the hell.\nI wish I did more research though while this is a great camera be careful if your wanting to use an external microphone as this model will not let you. For that you would have to get the T6i or better. Still for entry level I can’t complain and it’s been fun to learn with."},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"October 16, 2017","reviewText":"So exciting opening this box of goodies!!!"},{"reviewerName":"Steph","rating":"2.0 out of 5 stars","reviewTitle":"First of all the camera didn't come with a lense like shown in the pictures or told with the descrition","reviewDate":"October 1, 2017","reviewText":"It was missing some of the things that were supposed to come with it. First of all the camera didn't come with a lense like shown in the pictures or told with the descrition, yes it came with the two other lenses but the camera itself didn't. Also, it says it comes with a back up camera battery but the camera itself doesn't come with one and it shows in the pictures that it'll come with two. Last what really got me upset is that it said that you would get 2 SD cards of 32 GB and I didn't even get the SD cards so now I have to hold off taking pictures until I buy some SD cards separately. It was a good bundle until I didn't receive a lot of the things mentioned in the description!!"},{"reviewerName":"Happy Buyer555","rating":"5.0 out of 5 stars","reviewTitle":"A ton of accessories at a good price","reviewDate":"December 4, 2018","reviewText":"I did a lot of research for cameras and packages, this one seemed to be fairly priced and came with everything needed to get started. Still learning how to use it and all the extras it came with. Takes good pictures. The lens isn't great for distance, so might recommend something with a better zoom for those taking outdoor photos."},{"reviewerName":"Rick A'Mortis","rating":"5.0 out of 5 stars","reviewTitle":"Amazing value!","reviewDate":"November 28, 2018","reviewText":"I bought this camera bundle, not knowing what to expect. I was expecting there to be some issues, (i.e. generic parts, missing parts, non-working parts) but had no problems whatsoever. Order arrived on time, contained EXACTLY what is pictured, everything works nicely, overall an amazing photographer's bundle! Yes, there are some non-Canon brand parts included, but all are usable with this camera. I highly recommend this camera to ANYONE that is looking for a great starter bundle."},{"reviewerName":"Crystal J.","rating":"5.0 out of 5 stars","reviewTitle":"Great beginners camera!","reviewDate":"July 14, 2019","reviewText":"We bought this for our daughter’s 16th birthday. This camera was well worth the price! We took her to New York for her 16th birthday and this camera came in handy. She took tons of pictures and the quality is great! The camera bundle is the best way to go!"},{"reviewerName":"Anna Ramirez","rating":"4.0 out of 5 stars","reviewTitle":"Great camera for a good price","reviewDate":"July 5, 2019","reviewText":"The gadgets are cheap but everything fits and works fine aside from the tripod it’s very flimsy wouldn’t recommend using it with the camera itself it won’t hold however everything else came fine and the camera it’s great for beginners! Great purchase honestly for the price"},{"reviewerName":"Aiden","rating":"5.0 out of 5 stars","reviewTitle":"When I found this pack I thought it was too good to be true","reviewDate":"January 22, 2018","reviewText":"Always been a fan of Canon Rebel. When I found this pack I thought it was too good to be true. Honestly I have used almost everything in this pack. It's well worth the money.\n\nI would recommend getting a second or just a larger camera bag as the one that comes with it only holds the camera and lenses comfortably."},{"reviewerName":"JerichoEleven","rating":"4.0 out of 5 stars","reviewTitle":"Awesome! No mic jack.","reviewDate":"January 15, 2017","reviewText":"GREAT camera set! I really do wish I knew a little more. Didn't realize that the T6 records HD video, but doesn't have a mic jack. Other than that, awesome!"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"July 7, 2017","reviewText":"I love this Camera. Omg, it really worth.\nJust one of the chargers doesn't work."},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Very nice package!","reviewDate":"January 9, 2019","reviewText":"I bought this for my wife for Christmas and she loves it! I really like it as well. I use a Nikon at work occasionally and this camera is much lighter and I think it takes better pictures. We haven't even had a chance to use all the goodies it comes with! The picture shown was taken at Bass Pro with this camera."},{"reviewerName":"Amazon Customer","rating":"3.0 out of 5 stars","reviewTitle":"Check your package well when received!","reviewDate":"September 30, 2018","reviewText":"I purchased this package a year ago and have taken many awesome pictures on the many vacations this past year. Unfortunately I was having an isssue with my Cannon EF 75-300mm lens recently. The local camera shop told us that the lens was not communicating with the camera and it would cost more to repair than purchase new. So, looking to purchase another lens I found that our lens says EF-S 55-250 mm not what was advertised and not what the box states, EF 75-300mm. I thought I did a better inventory check, but I didn’t. The photos I took were great, so no complaints there, but it did break in less than a years use and they sent a lens that was wrong. Lesson learned, always check your package is what was advertised!"},{"reviewerName":"Camper","rating":"5.0 out of 5 stars","reviewTitle":"In love with my T6","reviewDate":"March 31, 2017","reviewText":"Love my new Canon EOS Rebel T6 😊 Now need to find more time to get out and play with it. I'm just an amateur photographer but what I have and with it pictures have turned out beautiful. A photographer friend recommended this camera because the ease-of-use and I'm not disappointed."},{"reviewerName":"Jenna","rating":"5.0 out of 5 stars","reviewTitle":"Awesome.","reviewDate":"June 17, 2019","reviewText":"Used all semester for my photography class, and now to take pictures. I just took my roommates engagement photos.\n\nEasy to learn, and it takes great pictures. I'm still learning new things about this camera that make my pictures even better, though!"},{"reviewerName":"Steve","rating":"4.0 out of 5 stars","reviewTitle":"Great starter bundle at a great price.","reviewDate":"April 3, 2018","reviewText":"This is a great bundle and a bargain for everything that is included with it. The only real flaws I see in this bundle are the very flimsy, aluminum tripod that I've already dented and the secondary flash does seem pretty cheap as well. These are things that I will be upgrading in the future. It's a great starter bundle for amateur photographers or hobbyists."},{"reviewerName":"Gregory Mathiesen","rating":"5.0 out of 5 stars","reviewTitle":"One of the Best Cameras at the Price.","reviewDate":"October 15, 2019","reviewText":"Great camera bundle at a great price. Camera is more competent than most photographers. Many features are used too seldom to be remembered by occasional users. Works very well in automatic modes which makes it a great camera for beginners as well."},{"reviewerName":"Deborah D Lindsay","rating":"5.0 out of 5 stars","reviewTitle":"Awesome Camera... Flash sent with bundle does not match camera.","reviewDate":"June 9, 2018","reviewText":"I love the bundle. The camera is awesome. However, as someone mention previously, the external flash sent with the bundle does not match the camera. So, be prepared to purchase your own. The camera has a flash on it but if you want more light; you have to purchase your own external flash."},{"reviewerName":"Henry Goss","rating":"5.0 out of 5 stars","reviewTitle":"Perfect for me!","reviewDate":"January 20, 2019","reviewText":"I love this camera! I am not a professional photographer by any means so this is perfect for me and my newfound hobby. It came quicker than I expected. It was missing a few things but the seller responded quickly and I received them just a few days after."},{"reviewerName":"T. L. Mitchell","rating":"5.0 out of 5 stars","reviewTitle":"absolutely STUNNING photo quality","reviewDate":"September 25, 2018","reviewText":"absolutely amazing camera. purchased this a few months ago for an upcoming vacation and it did not let me down. stunning photo and video quality, lots of cool and easy to use features and great for beginners. autofocus is beautiful in good lighting and can create gorgeous photos. honestly. definitely worth the money, would definitely recommend."},{"reviewerName":"Levi Zen","rating":"5.0 out of 5 stars","reviewTitle":"Great Bundle. Everything you need to get started.","reviewDate":"June 4, 2018","reviewText":"Great bundle. Everything came intact. The camera bag is kind of small but you can fit all of the essential stuff in it. If you buy another lens or somewhat sizeable accessory you will need a bigger bag. The Rebel T6 has done me well so far, I am not super experienced in photography but it makes it easier. I enjoy this product."},{"reviewerName":"P Alexander","rating":"5.0 out of 5 stars","reviewTitle":"amazing camera, a little loud but worked fairly easily ...","reviewDate":"March 5, 2018","reviewText":"amazing camera, a little loud but worked fairly easily out of the box. the first few shots were of my friends dog, on his dirty a** carpet and the pictures of the dog literally looked better than what you would get from a mall photo center, like one found in a Walmart or target. great pictures. tons of accessories, all worked."},{"reviewerName":"Manuel","rating":"4.0 out of 5 stars","reviewTitle":"Buy It","reviewDate":"November 8, 2019","reviewText":"This set came with everything Nd I'd recommend it for a 1st time. The products do seem a bit cheap and the tripod broke after a month and the backdrop covers are flimsy but starting out it's a good buy."},{"reviewerName":"Calk","rating":"4.0 out of 5 stars","reviewTitle":"Great Bundle","reviewDate":"June 1, 2019","reviewText":"There are so many lenses with this bundle. Some do not fit the canon camera. Not ideal for beginners."},{"reviewerName":"Ashley","rating":"5.0 out of 5 stars","reviewTitle":"Photo of my husband and son with canon rebel t6","reviewDate":"October 26, 2017","reviewText":"Amazing bundle pack!! Happy birthday to ME... Everything I could ask for!"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Great camera! Love all the accessories!","reviewDate":"July 8, 2019","reviewText":"I LOVE MY CAMERA! Was that considered shouting? 😊 I really am so pleased with this purchase. Seller shipped promptly and all arrived in perfect condition due to great packaging. Highly recommend!"},{"reviewerName":"Kelly","rating":"5.0 out of 5 stars","reviewTitle":"Couldn't Be Happier!","reviewDate":"July 9, 2017","reviewText":"Couldn't be happier! I'm totally a novice at photography and I'm lucky I found the power switch. Amazing camera. Easy to work. There are a ton of features I haven't even started to figure out yet but so far, what I've been able to do with a quick read through the instruction manual has been exactly what I was hoping to achieve. Definitely a great \"starter\" camera."},{"reviewerName":"Joshua Kneeling","rating":"5.0 out of 5 stars","reviewTitle":"Really great deal","reviewDate":"March 17, 2019","reviewText":"Really good starting DSLR camera! Does great in most situations and is pretty easy to use."},{"reviewerName":"Momaleia","rating":"5.0 out of 5 stars","reviewTitle":"Never been so happy","reviewDate":"April 2, 2018","reviewText":"I miss taking pictures. I feel so much freedom. The camera alone from Canon is $500, but to have a whole accessory for the price I paid was well worth it. All the utility software after registering the camera online at Cannon USA takes time and is stubborn, but the programs are nice to do simple edits."},{"reviewerName":"Active buyer","rating":"5.0 out of 5 stars","reviewTitle":"Wonderful camera","reviewDate":"April 9, 2019","reviewText":"Love this camera, been wanting a nice camera forever and i finally got it and love it. Takes time to learn all the different things i am still learning and such a great deal for all the stuff in package"},{"reviewerName":"Maura R.","rating":"5.0 out of 5 stars","reviewTitle":"Very nicely put together package","reviewDate":"October 10, 2017","reviewText":"Very nicely put together package. I have had the camera for about a week now and love it! I went from a tiny cyber shot and so far I am in love. I have a lot to learn, but I think I will go places with this camera! The tripod isn't made of much, but that I kind of expected."},{"reviewerName":"Rico S.","rating":"5.0 out of 5 stars","reviewTitle":"Awesome Kit","reviewDate":"August 25, 2017","reviewText":"Wow. There is alot of stuff in this kit, it barely fits in the provided bag. Ready to take some pics with this and try it out. The tripod is a bit cheapish. Canon EOS Rebel T6 DSLR Camera Bundle with Canon EF-S 18-55mm f/3.5-5.6 IS II Lens + Canon EF 75-300mm f/4-5.6 III Lens + 2pc SanDisk 32GB Memory Cards + Accessory Kit"},{"reviewerName":"charles andrade","rating":"5.0 out of 5 stars","reviewTitle":"cannon impresses yet again","reviewDate":"August 27, 2019","reviewText":"Great camera all around , with all the extras , it a great bang for your buck . it would be way more expensive if you bought everything separate. the lenses are great for beginners and the filters are awesome. just get a camera bag and your all set. comes with 2 batteries and tons of extra stuff i havent even used yet . takes video as well and great night pictures. i take it everywhere i go ."},{"reviewerName":"HW007","rating":"5.0 out of 5 stars","reviewTitle":"Great bundle!","reviewDate":"September 15, 2019","reviewText":"I just got it today, so I haven’t had much time to play with it, but so far I really like it. It takes great pictures and I love all of the extras that came in this bundle. I definitely recommend it!"},{"reviewerName":"Myriam Annie Desir","rating":"5.0 out of 5 stars","reviewTitle":"What a great camera!","reviewDate":"February 24, 2019","reviewText":"I like everything. This package deals is everything great price and more for your money , I suggest you buy this. Battery life is great just don't live it on all the time because it will drained ( common sense). Picture quality is great and I love this . This camera have all the tools to get me ready for the next big thing. Thanks Amazon, I'm going to keep shopping there for electronic but not best buy."},{"reviewerName":"Kailua","rating":"4.0 out of 5 stars","reviewTitle":"Camera and zoom lens are a worthwhile buy at this price but forget about the other items","reviewDate":"February 1, 2018","reviewText":"The Canon camera and zoom lens combo in this bundle is a good value at this price, but brace yourself for the poor quality of the other items in the bundle. Some are next to useless other than just introducing a beginner like myself to the various accessories available for photography. You can then go out and purchase more quality items to go with your camera. I give this buy 4 stars because this bundle is priced cheaper than other camera and lens only combos that I have seen advertised. The rest of the stuff is just a bonus that you may or may not find to be useful."},{"reviewerName":"Narisa M","rating":"5.0 out of 5 stars","reviewTitle":"Exactly as pictured/captioned/ listed here...","reviewDate":"April 20, 2018","reviewText":"EVERYTHING listed here came with the camera...\n\nThe camera is working well so far, took an island trip today and the quality is superb.... pictures look better when viewed with good quality screens..not an old laptop like mine...\n\nNo cons thus far... i really hope this doesn't change.."},{"reviewerName":"Marvin Hughes","rating":"4.0 out of 5 stars","reviewTitle":"Great Bundle for the Price","reviewDate":"May 6, 2017","reviewText":"Very nice bundle quick and easy delivery the only thing that made me give it a 4/5 stars is that I did not receive the tulip lens cover everything else was in the package except that which is one of the reasons I went with this package versus another but the rest of everything else was good some items felt as tho they've been opened before but for this price point and what all you're getting that's to be expected overall happy with the purchase!!!"},{"reviewerName":"Robert McGill","rating":"5.0 out of 5 stars","reviewTitle":"Awesome","reviewDate":"March 23, 2019","reviewText":"Bought for my wife as an anniversary present. She loves it and was able to take amazing pictures on our trip. Would highly recommend"},{"reviewerName":"Shiela","rating":"4.0 out of 5 stars","reviewTitle":"Rebel","reviewDate":"June 7, 2019","reviewText":"It's an expensive camera and the resale value isn't very good. I probably would look for a second-hand one next time, & not spend this obscene amount of money and the extra lenses are crazy priced."},{"reviewerName":"Rachel","rating":"5.0 out of 5 stars","reviewTitle":"Love, love love this camera","reviewDate":"January 7, 2018","reviewText":"Love, love love this camera! I have taken some beautiful shots and as well as practicing manual to curve my techniques. Post editing makes the photos turn out even better! I have attached some photos I have taken with this camera."},{"reviewerName":"Amy P","rating":"5.0 out of 5 stars","reviewTitle":"Great beginner's set of tools","reviewDate":"May 24, 2019","reviewText":"I'm super excited about this new toy of mine! Photography has interested me for awhile and I was looking for tools to get started. This package came with just the right amount of starter's accessories. Seller packaged everything very well and order was received in a very timely fashion. The weather hasn't cooperated very well for me to get out in nature but I can't wait to keep using this camera. I'm very impressed by the initial pictures I've taken around!"},{"reviewerName":"Holly Wells","rating":"4.0 out of 5 stars","reviewTitle":"Great bundle for price.","reviewDate":"February 13, 2018","reviewText":"Great for beginner or hobbiest. Great bundle for the price cause you won't find it cheaper i promise... I searched before I bought. Huge learning experience if you've never used a DSLR camera. Do a lot of practice with different settings before you do any serious photography."},{"reviewerName":"Nita Helping Hand","rating":"4.0 out of 5 stars","reviewTitle":"I like it","reviewDate":"January 4, 2019","reviewText":"I wish it was better about taking the photo when the button is pushed. If I keep it in auto focus, many times the button won't push because it won't focus - it just keeps trying to focus over and over."},{"reviewerName":"Derek","rating":"5.0 out of 5 stars","reviewTitle":"Great Value! Mine was received with the wrong size ...","reviewDate":"April 28, 2017","reviewText":"Great Value! Mine was received with the wrong size filters but amazon took care of that quickly. The tripod sucks but who cares this camera is awesome!"},{"reviewerName":"theresa ransom","rating":"5.0 out of 5 stars","reviewTitle":"Great for Beginners","reviewDate":"March 21, 2019","reviewText":"GREAT camera for a great price. Love it and recommend for starters like myself."},{"reviewerName":"Muthu","rating":"5.0 out of 5 stars","reviewTitle":"Awesome !!!","reviewDate":"December 8, 2016","reviewText":"Love this Camera and the accessories.\nThe Seller was not on Prime and hence the delivery to CA took a week from NY.\nThe kit came as described. The tripod is of OK quality and not very sturdy. The package includes an additional battery which is not a Canon battery.\nEverything is good so far and I would recommend it."},{"reviewerName":"Kelsey","rating":"5.0 out of 5 stars","reviewTitle":"I would 100% recommend this camera!","reviewDate":"October 4, 2018","reviewText":"I am new to photography and needed a camera for my photo one class at uni. This camera was exactly what I was looking for. Affordable and comes with a lot of cool extras! I’m very new to photography so I recognize that some of the quality of the extra lenses could be better (like it says in other reviews) but I think they’re great! The bag and tripod are super helpful and the camera works wonderfully. It comes with everything it says it does. I would 100% recommend this camera."},{"reviewerName":"DJR","rating":"4.0 out of 5 stars","reviewTitle":"great! But some of the products included in the ...","reviewDate":"June 11, 2018","reviewText":"Overall, great! But some of the products included in the bundle are cheap. I would not put the camera on the flimsy tripod, for instance. I also wish this bundle came with some of the items from other bundles, like a smaller tripod and cleaning tools."},{"reviewerName":"KJ","rating":"5.0 out of 5 stars","reviewTitle":"Best bundle hands down","reviewDate":"April 27, 2018","reviewText":"Love how the camera is brand new in the box. Hard to find a “new” one for for this price. Also the quality of the SD card and the extra battery (1 year warranty?!?) is another reason why I got this bundle. Amazing Canon. Highly Recommend"},{"reviewerName":"Greg D","rating":"5.0 out of 5 stars","reviewTitle":"Great value deal !","reviewDate":"September 24, 2017","reviewText":"I was researching buying this camera/kit at the Big box store and almost did until I researched the product on Amazon. For what I would have paid there , I received the same thing plus accessories only two days later due to shipping. Well worth the wait . Mind you some of the items are not the best of quality ... I'm not sure if I would trust the tripod and the flash is a smaller slave flash.... the other items filters, extra battery.. make this an outstanding deal ! With Amazon Prime it arrived two days after ordering. Special thanks to Paging Zone for putting together a great package"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Great Value","reviewDate":"June 17, 2017","reviewText":"This bundle has so much included! Some things are cheaply made, especially the tripod. I expected that, so I've been satisfied with the purchase overall. The camera is wonderful, and I love the app you can download; it allows you to remotely control the camera and download pictures straight to your phone."},{"reviewerName":"Batman","rating":"5.0 out of 5 stars","reviewTitle":"Take much time to learn how to use everything","reviewDate":"June 27, 2019","reviewText":"Honestly an overwhelming amount of product, but that means GREAT PRICE FOR LOTS OF EQUIPMENT..\nstill testing out equipment though so can’t say about that"},{"reviewerName":"Chastity Adams","rating":"5.0 out of 5 stars","reviewTitle":"Great camera set","reviewDate":"November 14, 2017","reviewText":"We bought the camera set for our trip in Dec. The amount of stuff that came in the set is amazing. I'm sure once we actually get to use it we want be missing anything."},{"reviewerName":"anastasia starcher","rating":"5.0 out of 5 stars","reviewTitle":"I love it","reviewDate":"October 23, 2017","reviewText":"I LOVE this camera, and the bundle is a steal! Granted, I'm new to photography and what not, and my actual photographer friend is the one who recommend this for me. And I'm in love! I never want to put it down."},{"reviewerName":"Sara","rating":"4.0 out of 5 stars","reviewTitle":"Handy starter pack","reviewDate":"July 17, 2018","reviewText":"Everything came as described. I love the camera, the system is user friendly. If you're starting a hobby in photography, this camera is a great for it. This bundle in particular has everything you need to start working on your skills without breaking the bank.\n\nThe only reason I don't give it a 5 star review, is that they sent it in a huge box unnecessarily. Amazon was great at solving the issue for me but having to go through that issue is still annoying."},{"reviewerName":"Buyer","rating":"5.0 out of 5 stars","reviewTitle":"Great camera!","reviewDate":"September 4, 2017","reviewText":"LOVE IT! Very easy to use. The only thing I would change is the fact that the bag isn't big enough to house all the pieces you want to carry with you while on vacation. I just traded it out with my old camera bag."},{"reviewerName":"Jesse R.","rating":"4.0 out of 5 stars","reviewTitle":"Everything you need to get started in photography","reviewDate":"October 16, 2017","reviewText":"This is a great bundle for a great price. I ordered the bundle with the 75-300 lens and it wasn't sent at first. I contacted Paging Zone and they sent it out immediately. Very happy with my purchase."},{"reviewerName":"Miesha","rating":"5.0 out of 5 stars","reviewTitle":"LOVE! LOVE! LOVE!","reviewDate":"August 7, 2018","reviewText":"I had been looking for a new camera for some time now. I did not need a top of the line model, not for what I do. This kits has everything you need in it, at a basic level. Nothing overly complicated. It's simple to use and set up. It arrived on time and in perfect condition.From what pictures I have taken the picture quality is excellent. Well worth it!"},{"reviewerName":"Tay","rating":"5.0 out of 5 stars","reviewTitle":"Great camera!","reviewDate":"September 30, 2018","reviewText":"I love this camera! Got it for a trip to Italy next month so I can take great pictures and I’ve been practicing with it since I got it. Pictures are great, it’s easy to use, definitely a good beginner camera! Only thing I didn’t like was that some of the things this bundle comes with aren’t canon products so unless I was using them wrong they didn’t actually fit with the camera. But the camera itself is great! Definitely recommend, especially for how much it comes with."},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"God? Is this? A gift??","reviewDate":"May 7, 2019","reviewText":"THIS PRODUCT IS SO GOOD I BRAG ABOUT IT SO MUCH. Everything is exactly as described in perfect condition and I am still in awe how much they gave for half the price of what Best Buy would sell for the body camera alone. I reccomend to everyone."},{"reviewerName":"Ian Peter Duke","rating":"5.0 out of 5 stars","reviewTitle":"Great bundle, great price","reviewDate":"January 25, 2018","reviewText":"Great bundle, great price. Tripod is a little feeble, but if careful with it would be nice enough (and it comes with a little carrying bag)."},{"reviewerName":"Jazmyn","rating":"5.0 out of 5 stars","reviewTitle":"IN LOVE","reviewDate":"February 11, 2018","reviewText":"Used it tonight for the first time to take pics to promote for my online store, IM IN LOVE!!! This thing has made me feel like I can be a photographer now lol."},{"reviewerName":"Jack","rating":"5.0 out of 5 stars","reviewTitle":"Very happy with my T6 DSLR","reviewDate":"August 28, 2017","reviewText":"Found the kit to be a great value - everything arrived on time and in good order. After seeking a lot of advise, most recommend the T6 as a good starter DSLR - and so far, very happy with it. There are a lot of how to use u-tubes that are helpful and i'm pleased in every way so far."},{"reviewerName":"B PRO","rating":"5.0 out of 5 stars","reviewTitle":"Canon T6 owner: Luv It","reviewDate":"June 26, 2018","reviewText":"I'm new to the DSLR and found this bundle to be perfect.\nI should have opted for the T6i for the external audio and video ports.\nOverall I'm not disappointed.\nIt will go to my wife once I get ready to upgrade to the 70d."},{"reviewerName":"Mr. Sanchez","rating":"5.0 out of 5 stars","reviewTitle":"More than satisfied for the price","reviewDate":"August 7, 2018","reviewText":"Great product.\n\nThe only thing that I would criticize is that the cheap lenses can have some defects.\nThis is what you pay for I believe.. and a good kit to start in the photography universe."},{"reviewerName":"Levi","rating":"5.0 out of 5 stars","reviewTitle":"Great idea","reviewDate":"April 4, 2019","reviewText":"This camera was fantastic. One of the best purchases of my life"},{"reviewerName":"L. Phillips","rating":"5.0 out of 5 stars","reviewTitle":"Amazing camera and great bundle for beginners","reviewDate":"October 20, 2017","reviewText":"Wonderful deal, great bundle! Had EVERYTHING I needed and MORE!!! Perfect camera so easy to use, love the genuine bag and can't beat getting two memory cards for it. Haven't even tried some of the accessories yet lol, but the camera has turned even me into a photographer lol."},{"reviewerName":"CJ","rating":"5.0 out of 5 stars","reviewTitle":"Bought several for photo class","reviewDate":"June 27, 2019","reviewText":"Bought several for a photo class. Great package for students to learn and grow with. Needs one more lens to be a really great (beginning) professional set."},{"reviewerName":"Larry Williamson","rating":"5.0 out of 5 stars","reviewTitle":"this camera bundle is a wonderful setup. If you really want to get into ...","reviewDate":"May 19, 2017","reviewText":"this camera bundle is a wonderful setup. If you really want to get into photograghy you may want to buy a telephoto lens to add to this bundle, however this bundle's price makes it easy to add a extra lens without crashing the budget. camera takes great pictures right out of the box, allowing you to learn how to do more slowly and take better photos."},{"reviewerName":"Jared","rating":"5.0 out of 5 stars","reviewTitle":"Great value bundle","reviewDate":"February 16, 2018","reviewText":"Awesome camera for a good price, plus comes with tons of accessories! Had a rebel in the past and wanted one again. Pictures are great quality and most of the accessories are good too, some seem cheap but for the price I cant complain."},{"reviewerName":"Mark Powell","rating":"4.0 out of 5 stars","reviewTitle":"Decent deal.","reviewDate":"September 15, 2017","reviewText":"I do not think I needed everything in the kit which was very complete, but I like the camera. I should use it more. The extra battery, external flash, and tripod are all nice to have."},{"reviewerName":"Amanda I.","rating":"5.0 out of 5 stars","reviewTitle":"Takes excellent pictures, I'm a newbie with a camera like ...","reviewDate":"June 4, 2018","reviewText":"Takes excellent pictures, I'm a newbie with a camera like this so i am still trying to learn all the settings. Good bundle deal tho, accessories all seem good quality And they all fit the camera."},{"reviewerName":"Mariah Lenard","rating":"5.0 out of 5 stars","reviewTitle":"Best Purchase Ever!","reviewDate":"May 5, 2019","reviewText":"This bundle is amazing!! It’s an easy to use camera and I love learning about custom settings. It’s a bonus that I can instantly save my pictures to my phone from the camera as well!"},{"reviewerName":"John P. Splingaerd","rating":"5.0 out of 5 stars","reviewTitle":"good value","reviewDate":"July 2, 2019","reviewText":"Bought it for my daughter so she would keep her hands off my full frame and APSC Sony Alphas. She loves it!"},{"reviewerName":"Lindsay N. Rome","rating":"5.0 out of 5 stars","reviewTitle":"It came as ordered, all there. With some ...","reviewDate":"December 4, 2017","reviewText":"It came as ordered, all there. With some U-Tube and some reading I will be taking the Pictures I have been wanting."},{"reviewerName":"Timothy Siebert","rating":"2.0 out of 5 stars","reviewTitle":"Why wait a week for something listed as prime!","reviewDate":"March 31, 2018","reviewText":"I haven’t got the camera I ordered yet and I know it will be a good camera but I bought this as a prime gift and it will be over a week before I get it. That isn’t ok. Most the time I don’t care as much but this time I did. So I’m not pleased with that at all."},{"reviewerName":"DFox","rating":"5.0 out of 5 stars","reviewTitle":"Great for a person who wants to get into photoghapy ...","reviewDate":"August 17, 2017","reviewText":"Just received my camera. Wow! It came with everything pictured. Great for a person who wants to get into photoghapy but doesn't want to send hugh dollars. Thanks!"},{"reviewerName":"Hannah De Young","rating":"5.0 out of 5 stars","reviewTitle":"... a first year photographer student and this is an awesome camera for the money","reviewDate":"February 22, 2018","reviewText":"I am a first year photographer student and this is an awesome camera for the money. I would highly recommend this camera."},{"reviewerName":"Amazon Customer","rating":"4.0 out of 5 stars","reviewTitle":"I like how easy is to learn all the basics about ...","reviewDate":"March 3, 2018","reviewText":"I am new in the world of photography. I bought this camera because it was cheap and because the reviews. I like how easy is to learn all the basics about photography with this camera. However, his video quality is not the best and not even good. I tried multiple times to make good videos on instagram, but never worked. It does not have autofocus which you will never be able to do good videos."},{"reviewerName":"amber","rating":"5.0 out of 5 stars","reviewTitle":"Great beginners camera","reviewDate":"April 25, 2019","reviewText":"I love my camera! Still learning how to use it, but so far it is easy to use. I love that I can instantly upload the pictures to my phone so that I can use the Lightroom app."},{"reviewerName":"Ramiz","rating":"3.0 out of 5 stars","reviewTitle":"Good budget camera but buy only camera body if interested.","reviewDate":"April 30, 2018","reviewText":"Good Camera for the money.\nI returned and got T7i because of below CONS,\n\nCONS:\nLess Focus Points!\nPoor Video\nNo slide display !\nAccessories are JUNK !"},{"reviewerName":"D.P. Brennan","rating":"5.0 out of 5 stars","reviewTitle":"One GREAT camera","reviewDate":"October 22, 2017","reviewText":"Simply put -- this is a great camera package for the person who is looking for great photos but desires an easy-to-use format. The photos are incredibly sharp and the camera body functional and user friendly. This is a great price, too."},{"reviewerName":"Randy Stenglein","rating":"3.0 out of 5 stars","reviewTitle":"Camera works fine with Cannon lenses","reviewDate":"February 28, 2018","reviewText":"Do not buy this package if you are buying it for the accessory wide angle and telephoto lenses. They do NOT focus. Camera works fine with Cannon lenses. The ones shown in the bundle are not the ones I received. The brand I received was Commander Pro HD series. I can not even find the manufacturer of them.\nI am debating sending the package back and purchasing something else."},{"reviewerName":"Elias Cuevas","rating":"1.0 out of 5 stars","reviewTitle":"Missing second lense","reviewDate":"October 27, 2017","reviewText":"Purchased this bundle before a two week European vacation and it was missing the second lenses."},{"reviewerName":"charlie Hart","rating":"5.0 out of 5 stars","reviewTitle":"great deal","reviewDate":"October 7, 2017","reviewText":"Love it- the order came exactly as described. The camera is absolutely awesome. I would highly recommend this for someone who is looking for a good starting point in photography, or simply wants a nicer camera to document their life. The whole package is cheaper than the body of the camera would be somewhere else, so it's a killer deal. Enjoy!"},{"reviewerName":"Chris Jangra","rating":"1.0 out of 5 stars","reviewTitle":"UV filter suck on lens","reviewDate":"May 3, 2018","reviewText":"Extremely upset after my UV filter got stuck on the lens and I’ve tried every trick and can’t remove it"},{"reviewerName":"Ralph Brown","rating":"3.0 out of 5 stars","reviewTitle":"Genuine Canon quality camera. Extras don't make it a great deal.!","reviewDate":"May 17, 2018","reviewText":"The Canon Rebel T6 is a good camera, however the accessories are marginal at best. The tripod is a throw-away. If you want to keep your camera safe don't mount it to this tripod. I received all the accessories listed. There are two batteries included. One is package with the accessory kit, the other is included with the camera. The carry bag included will never hold all the extra lenses or the extra flash unit."},{"reviewerName":"F. Todd","rating":"5.0 out of 5 stars","reviewTitle":"Couldn't ask for better as a beginner.","reviewDate":"August 19, 2018","reviewText":"Made this novice look like Pro at a great price! Bought to up my game as a social media manager. The wifi transfer makes my job easy. Also having fun as a hobby photographer."},{"reviewerName":"Sierra","rating":"5.0 out of 5 stars","reviewTitle":"Good camera but not good for videos.","reviewDate":"December 12, 2017","reviewText":"A great bundle at a great price! I enjoy this camera very much however it does not have auto focus so do NOT buy this for making YouTube videos."},{"reviewerName":"bob stephans","rating":"5.0 out of 5 stars","reviewTitle":"Wow","reviewDate":"January 11, 2019","reviewText":"Great camera, great bargain.\n\nDon';t use the included flash. The camera has a built in. The other flash can damage the camera"},{"reviewerName":"Christina","rating":"5.0 out of 5 stars","reviewTitle":"Like it! I am a beginner in photography","reviewDate":"February 16, 2018","reviewText":"Like it! I am a beginner in photography, these kits are very useful to me and my teacher really surprised to see so many kits when I talked to him about this deal! I really like the two lenses. The flash memory cards work well too."},{"reviewerName":"Richard Hoe","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"March 22, 2018","reviewText":"Made some really great vacation picks. Takes a little bit to get the hang of it though."},{"reviewerName":"shawneeray","rating":"4.0 out of 5 stars","reviewTitle":"Camera is great. Many of the accessories are","reviewDate":"September 4, 2017","reviewText":"Camera is great. Many of the accessories are, IMHO, useless. Flash is cheap, spare battery didn't hold a charge and the tripod makes me nervous to even consider using it. The camera bag is basically good for holding the camera, but not much else"},{"reviewerName":"Dave","rating":"5.0 out of 5 stars","reviewTitle":"Great camera","reviewDate":"March 4, 2019","reviewText":"Got as a gift for my wife. She loves it. Got it over a year ago and it’s still going strong"},{"reviewerName":"Tiane moore","rating":"5.0 out of 5 stars","reviewTitle":"Would recommend for a beginner","reviewDate":"September 16, 2019","reviewText":"I love this camera I still use it to this day and definitely worth every penny"},{"reviewerName":"Jamie","rating":"5.0 out of 5 stars","reviewTitle":"Love it","reviewDate":"April 8, 2019","reviewText":"I so love it. The camera was worth it.. I did not like the cheap tripod it came with but the rest was a great deal"},{"reviewerName":"Ellen Segale","rating":"5.0 out of 5 stars","reviewTitle":"I'd buy this again!.","reviewDate":"December 30, 2018","reviewText":"I'm happy I purchased this Canon!! This does everything, and the price was terrific, considering it included many accessories."},{"reviewerName":"Amazon Customer","rating":"4.0 out of 5 stars","reviewTitle":"Great for beginners","reviewDate":"June 29, 2017","reviewText":"Great camera for a begginer! I love how I can connect it to my phone and take pictures and also download them.\nThe rest of the things that come with the bundle are ok. Not the best quality, but if you're just beginning you won't need anything else"},{"reviewerName":"Asmaa Hussein","rating":"5.0 out of 5 stars","reviewTitle":"Perfect camera for beginners and professionals","reviewDate":"May 23, 2019","reviewText":"My favorite hope is a photography so I bought this to increase my photography skills.\nIt’s really easy to use and this kit includes everything that i need with the camera\nBag , lenses, holder and flash shooter.\nIt’s really a big deal to biy this awesome camera with all accessories with this price."},{"reviewerName":"James H. Mendoza","rating":"4.0 out of 5 stars","reviewTitle":"camera is very good but the lens are defective","reviewDate":"October 10, 2018","reviewText":"The EF-S 18-55mm f/3.5-5.6 IS II Lens works on and off, so it is not reliable. I am exchanging it for a good one. Thanks."},{"reviewerName":"Whitney skinner","rating":"5.0 out of 5 stars","reviewTitle":"Works for anyone! Even someone who doesn't know cameras!","reviewDate":"May 6, 2018","reviewText":"Best camera ever! I love ours. & you dont have to know photography to get a good picture. I only use manual mode & get amazing photos! I highly recommend to anyone wanting a camera!"},{"reviewerName":"NicoKell","rating":"5.0 out of 5 stars","reviewTitle":"Love this camera","reviewDate":"October 10, 2017","reviewText":"Totally worth the money. You get so much for what you spend! The camera takes amazing photos and videos. I do not really use all of the extra lenses but they are nice to have."},{"reviewerName":"Amanda","rating":"5.0 out of 5 stars","reviewTitle":"Great camera","reviewDate":"July 5, 2017","reviewText":"Great camera for a beginner. It took me about 20 minutes to start taking awesome photos. I'm by no means a photographer, I've used my phone for 10 years. This camera literally does everything!"},{"reviewerName":"Arielle","rating":"5.0 out of 5 stars","reviewTitle":"Definitely worth every penny.","reviewDate":"July 17, 2018","reviewText":"If you were very hesitant like me, don’t be. This package was seriously amazing & for the price with all these neat accessories. I am in heaven right now!"},{"reviewerName":"George E Fiske","rating":"5.0 out of 5 stars","reviewTitle":"Great Camera","reviewDate":"October 4, 2019","reviewText":"I bought this for my daughter. She was taking a digital photography class at college. No complaints."},{"reviewerName":"Jamie","rating":"5.0 out of 5 stars","reviewTitle":"Great camera","reviewDate":"December 29, 2018","reviewText":"We love this camera. It takes great picture and even better pictures when you use manual and play around with the settings"},{"reviewerName":"Dana cox","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"November 26, 2017","reviewText":"Good value. Some of the accessories are cheap, but the camera is high quality."},{"reviewerName":"Coley Canter","rating":"3.0 out of 5 stars","reviewTitle":"Most of the stuff is useless","reviewDate":"July 21, 2018","reviewText":"I LOVE THE CAMERA! All of the add on lenses leave a dark circle around the edge of the photos. The tripod falls over immediately once you put the camera on it. The only things I use are the camera bag, (which has a VERY STRONG buckle) the camera, the jump drive, the SD Cards, the camera strap, and the extra batteries are SUPER USEFUL I always carry them in my bag. I hope this helps because I was very worried before I bought my camera."},{"reviewerName":"josafat damaso","rating":"4.0 out of 5 stars","reviewTitle":"Get the same bundle but with out the 70-200 lense unless is the 70-200 IS","reviewDate":"September 9, 2018","reviewText":"Love it the only issue is the 70-200 lenses it’s an old lens no IS so it’s hard to used without a tripod because there’s no estabilización pictures come out blurry"},{"reviewerName":"Kathi","rating":"5.0 out of 5 stars","reviewTitle":"Nice bundle for a great camera","reviewDate":"September 23, 2018","reviewText":"This was a gift for a 16 year old who has an eye for photography and this was a great purchase. A nice variety of add ons and so far, so good."},{"reviewerName":"Olivia Sukaskas","rating":"5.0 out of 5 stars","reviewTitle":"Great if you’re just starting and it takes great pics.","reviewDate":"September 22, 2019","reviewText":"I bought this camera because I’m a beginner and was learning how to use it in my class. It came with so much stuff and extras that you don’t even need to buy anything else for it. It takes awesome pictures and has a lot of settings as well that are easy to learn about because it shows You about them on the display. Totally recommend."},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"A really tough camera.","reviewDate":"July 26, 2017","reviewText":"This bundle is great! This is the camera I always wanted, and I let a friend use it to photograph my son's wedding ant the results were fantastic. I am a home inspector and my main tool is a camera. I was on top of a two story roof and my new Cannon fell out of my pouch. I watched in horror as it rolled off the roof end over end. When I recovered it the only damage was dirt caked on the body from where it landed."},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Highly recommend","reviewDate":"May 3, 2017","reviewText":"This camera is a major upgrade from my previous XT. This is an excellent buy. So much good stuff in it. The order came packaged well so no damage and everything looks good. Highly recommended."},{"reviewerName":"Frances Ledesma","rating":"5.0 out of 5 stars","reviewTitle":"Great","reviewDate":"February 20, 2018","reviewText":"Great package, great camera. Have to return , it was a gift for someone who is no longer able to use. This product is great and the bundle is awesome."},{"reviewerName":"Kindle Customer","rating":"5.0 out of 5 stars","reviewTitle":"In Love","reviewDate":"August 13, 2018","reviewText":"We love our new camera. I can't wait to take more pictures of my three boys this coming football season. thanks for great product."},{"reviewerName":"Kait","rating":"5.0 out of 5 stars","reviewTitle":"Great package for a beginning photogeapher","reviewDate":"February 8, 2018","reviewText":"Camera was in fabulous condition. Comes with a lot of stuff you probably don’t want or need, but it’s not much more expensive than the camera itself, so I’d say this is a good deal. Some of the filter lenses and the tripod were accessories I found the most valuable. And the case!"},{"reviewerName":"Six","rating":"5.0 out of 5 stars","reviewTitle":"Fantastic quality for the price.","reviewDate":"August 31, 2018","reviewText":"Tons of extras which have all been great. I took this to the zoo and got some really great photos with it. Very pleased overall."},{"reviewerName":"k27","rating":"5.0 out of 5 stars","reviewTitle":"very satisfied.","reviewDate":"November 19, 2017","reviewText":"arrived on time. product exactly as described, very satisfied."},{"reviewerName":"Angel","rating":"4.0 out of 5 stars","reviewTitle":"honestly some phones have better image quality than this camera","reviewDate":"September 9, 2018","reviewText":"The quality is okay, honestly some phones have better image quality than this camera, it's kind of odd. Love all the accessories it comes with though."},{"reviewerName":"BOS MUC","rating":"5.0 out of 5 stars","reviewTitle":"I had started a review about the product not having ...","reviewDate":"February 6, 2017","reviewText":"I had started a review about the product not having everything in the package as described but actually it is.\nWe haven't used the camera yet but everything arrived as advertised."},{"reviewerName":"John Hinshaw","rating":"5.0 out of 5 stars","reviewTitle":"Superb Value! Definitely worth the coin!","reviewDate":"October 10, 2019","reviewText":"Superb value! Great for a novice, but also excellent for the professional!"},{"reviewerName":"VrooooM!","rating":"4.0 out of 5 stars","reviewTitle":"Nice package","reviewDate":"June 5, 2018","reviewText":"Nice package that come with everything needed (or don't need) haha\nThe camera works great at its price\nClear photo and many lens to work with"},{"reviewerName":"Stalin Vivanco","rating":"5.0 out of 5 stars","reviewTitle":"vale la pena","reviewDate":"September 11, 2019","reviewText":"es una buena camara para aprende es lo mejor"},{"reviewerName":"Michelle Kay","rating":"5.0 out of 5 stars","reviewTitle":"Great deal","reviewDate":"July 14, 2019","reviewText":"My daughter loves this camera!"},{"reviewerName":"Ed M","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"July 26, 2017","reviewText":"The Cannon Rebel T6 is an excellent camera, easy to learn, and the bundle provides everything we needed."},{"reviewerName":"Daniel jensen","rating":"5.0 out of 5 stars","reviewTitle":"Very nice!!!","reviewDate":"February 2, 2018","reviewText":"Shipped fast to me. Camera and all the lens are canon!! Checked all the stuff out and all the extras are great except the tri-pod. Like everyone else has said the tri-pod is bad. But can't really complain do to everything else that came with."},{"reviewerName":"Amazon Customer","rating":"1.0 out of 5 stars","reviewTitle":"Missing a lens and a memory card... you dont get what os advertised...","reviewDate":"April 22, 2018","reviewText":"Just received, i love the camera its beautiful. I am giving 1 star because I paid the extra $100 for the 300mm lens and I didnt get it. I am unfortunately going to have to return and buy elsewhere so i can get what I am looking for."},{"reviewerName":"SonicBroacasting","rating":"3.0 out of 5 stars","reviewTitle":"Glass filters though and the macro and wide angle are super nice.","reviewDate":"October 18, 2017","reviewText":"I give it a 3 because it comes with this ridiculously cheap tripod, cheap slave flash that I wouldn't trust for a paper weight. Glass filters though and the macro and wide angle are super nice."},{"reviewerName":"Barbara","rating":"5.0 out of 5 stars","reviewTitle":"Great value","reviewDate":"January 3, 2019","reviewText":"Bought this for my husband for Christmas. Beat out all the Black Friday sales and a fun bundle to open."},{"reviewerName":"Castiel","rating":"5.0 out of 5 stars","reviewTitle":"GREAT!","reviewDate":"July 27, 2017","reviewText":"Everything arrived on time and in great shape. All pieces were accounted for and worked great. The camera is perfect I'm very pleased with this purchase."},{"reviewerName":"Phil Jackson","rating":"4.0 out of 5 stars","reviewTitle":"Tripod is just ok, but everything else is perfectly acceptable...","reviewDate":"January 25, 2018","reviewText":"This was a gift for my wife and it has exceeded our expectations as a package. The only reason for a one star reduction is the tripod is mediocre. All other items are sufficient enough to be a wonderful starter kit."},{"reviewerName":"trish currie","rating":"5.0 out of 5 stars","reviewTitle":"Love this! Definitely worth the money","reviewDate":"August 30, 2017","reviewText":"Love this! Definitely worth the money! It is a great camera for beginners! The important lenses are Canon brand which was contradicting of some other reviews? Haven't found a complaint about it!"},{"reviewerName":"Mark Hock","rating":"5.0 out of 5 stars","reviewTitle":"Excellent Entry Level DSLR","reviewDate":"June 28, 2018","reviewText":"Have taken this camera all over. to family events hiking, MTB. Im taking better pictures already. The combo pack I ordered has everything I need to keep improving. I just need to spend more time learning about the different features. Love the thru the lens viewing because I dont have to wear glasses to see the screen when taking pics."},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Great product!","reviewDate":"June 7, 2019","reviewText":"Perfect camera set for beginner videographers."},{"reviewerName":"OldManBlish","rating":"4.0 out of 5 stars","reviewTitle":"Good starter kit","reviewDate":"April 4, 2019","reviewText":"Camera is great. Most of the rest of the kit is not, but let’s you get an idea of what you will use."},{"reviewerName":"Jessica M.","rating":"5.0 out of 5 stars","reviewTitle":"Great combo deal!","reviewDate":"May 8, 2019","reviewText":"Bought this as my first “professional” camera and I am in love! Filters and stand and camera!!! What a great deal!!"},{"reviewerName":"Michael","rating":"5.0 out of 5 stars","reviewTitle":"Great deal","reviewDate":"October 15, 2017","reviewText":"Came with everything pictured, all of the add on attachments are not Canon brand but they all work and attach to the camera. So excited about this purchase! Such a great deal."},{"reviewerName":"Leslie Scheidt","rating":"4.0 out of 5 stars","reviewTitle":"Not for an amateur","reviewDate":"October 8, 2018","reviewText":"This bundle is nice but it has way more than you would need if you are just an amateur."},{"reviewerName":"Monica S.","rating":"5.0 out of 5 stars","reviewTitle":"Wow!! So much stuff!!","reviewDate":"November 8, 2018","reviewText":"My only complaint is that the case you get isn't big enough to hold all the cool stuff this comes with."},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Good bundle deal.","reviewDate":"October 5, 2018","reviewText":"Looked and shopped around and for the money I think this is a good deal! Very happy with it and having a good time taking pictures."},{"reviewerName":"Dee Anahi","rating":"5.0 out of 5 stars","reviewTitle":"Love","reviewDate":"February 22, 2019","reviewText":"Amazing camera!\nNot everything is canon but everything works with the camera."},{"reviewerName":"RG","rating":"5.0 out of 5 stars","reviewTitle":"Good deal. Don't really use very much of the ...","reviewDate":"July 1, 2018","reviewText":"Good deal. Don't really use very much of the stuff but worth it for the two lenses and the camera bag."},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Everything in excellent condition as expected","reviewDate":"October 21, 2017","reviewText":"Everything in excellent condition as expected !\nSo excited to start my photography\nThe 2 bigger lenses have a red line instead of the gold in the picture and the storage USB came in blue\nOverall happy !"},{"reviewerName":"Betsy","rating":"5.0 out of 5 stars","reviewTitle":"A wonderful camera","reviewDate":"September 20, 2018","reviewText":"I am still learning each day what this camera can do! I love it and the pictures it takes. Another vote from Canon. I still have my father's Canon which came directly from Japan in the 1960's. I am so happy with this camera and have a lot to learn!"},{"reviewerName":"Enrique","rating":"5.0 out of 5 stars","reviewTitle":"Best starter camera for beginners","reviewDate":"December 13, 2018","reviewText":"I love it, I love it , I love it! Definitely worth the price. Don’t think twice just buy it!!!!!"},{"reviewerName":"sharon raven smith","rating":"5.0 out of 5 stars","reviewTitle":"Love this bundle","reviewDate":"January 27, 2017","reviewText":"Love this bundle. Still learning about all the things I can do with it. Would recommend this for anyone interested in photography."},{"reviewerName":"dshideman73","rating":"2.0 out of 5 stars","reviewTitle":"Nice but not worth it. Go bigger.","reviewDate":"April 23, 2018","reviewText":"Lots of accessories. But not very useful. Camera seems to take decent photos but thought would be a little better for the price. iPhone takes just as nice pictures."},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"So much quality for such a reasonable price","reviewDate":"January 31, 2019","reviewText":"I’m still getting to know this awesome gift the hubby got me"},{"reviewerName":"Alex","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"September 26, 2017","reviewText":"Love the way the pictures come out, great bundle for the value!"},{"reviewerName":"Tanya M","rating":"5.0 out of 5 stars","reviewTitle":"Takes great pictures at a great value","reviewDate":"April 16, 2018","reviewText":"I absolutely love this camera, it takes great pictures and is very easy to use and the package was a great deal. Best camera I have ever owned."},{"reviewerName":"susan vogel","rating":"5.0 out of 5 stars","reviewTitle":"Great quality and price","reviewDate":"February 17, 2019","reviewText":"Love my camera, graat to start out with, easy to learn. Good quality and price"},{"reviewerName":"JOSEPH","rating":"5.0 out of 5 stars","reviewTitle":"Canon Camera Package","reviewDate":"August 14, 2017","reviewText":"The camera package was perfect!! Even more than I expected. The tripod is a bit cheesy and will never work with this setup, but I expect it’s probably just a filler for the package. Otherwise all lenses and filters work fine. Oh one more thing, package should include the cable or whatever is needed to use that external flash that comes with that extension."},{"reviewerName":"Joanne","rating":"3.0 out of 5 stars","reviewTitle":"Need a bit of training","reviewDate":"July 19, 2018","reviewText":"I dislike the shutter button on preview mode...can’t get it to work well...can tell more after class this weekends."},{"reviewerName":"ItzJSasa","rating":"5.0 out of 5 stars","reviewTitle":"Awesome camera!!","reviewDate":"May 17, 2018","reviewText":"Beautiful camera everything came in perfect shape and on time. Just don’t use the tripod. If your planning on using a tripod plan on investing in a good quality one especially for a great camera like this one !!!"},{"reviewerName":"DL of the Roc","rating":"5.0 out of 5 stars","reviewTitle":"Great Bundle","reviewDate":"October 15, 2017","reviewText":"This bundle is an excellent value. Your able to start using camera for a wide varienty of photo assignment right out of the box.Only improvment would be to trade Flash & Tripod for an AC Power Adapter for continous power, a polorized filter for both lenses and camera rain coat. Tripod is rinky-dink and shaky. Over all very nice bundle for price, would always be nice to get one more memory card and spare and spare battery."},{"reviewerName":"Barbie Dahl","rating":"5.0 out of 5 stars","reviewTitle":"Good product at a good price","reviewDate":"September 16, 2018","reviewText":"Great camera at a great price. My daughter needed this for a photography class and now she uses it all the time. Takes good photos, downloads easily. It came with all the bells and whistles. Will order from again."},{"reviewerName":"Samantha","rating":"5.0 out of 5 stars","reviewTitle":"Best present ever","reviewDate":"March 3, 2019","reviewText":"Husband got this for me for Christmas and I love it!"},{"reviewerName":"Larry Patterson","rating":"5.0 out of 5 stars","reviewTitle":"Good product","reviewDate":"November 19, 2018","reviewText":"Granddaughter LOVES this camera for fun and her Photography class at school"},{"reviewerName":"Nana_mcrae","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"March 9, 2017","reviewText":"I am very pleased with this purchase. This is a great starter kit."},{"reviewerName":"Abraham","rating":"5.0 out of 5 stars","reviewTitle":"I really like the camera bundle","reviewDate":"February 17, 2017","reviewText":"I really like the camera bundle. I just wish that It came with the 75-300mm lens I would have paid extra for that. Overall I love this camera it's a great starter camera."},{"reviewerName":"Doug","rating":"5.0 out of 5 stars","reviewTitle":"I like it!","reviewDate":"October 7, 2018","reviewText":"I have had this camera for a while now. No issues with it. It takes really great pictures!"},{"reviewerName":"Jessica C.","rating":"5.0 out of 5 stars","reviewTitle":"I LOVE iT! Im a beginner and I’m still learning ...","reviewDate":"February 23, 2018","reviewText":"I LOVE iT! Im a beginner and I’m still learning how to use all the different filters and lenses. It’s great."},{"reviewerName":"Amazon Customer","rating":"4.0 out of 5 stars","reviewTitle":"Four Stars","reviewDate":"December 5, 2017","reviewText":"So far vary happy with the camera and lenses accessories aren't the best trypod is to flimsy."},{"reviewerName":"Samantha Zada","rating":"4.0 out of 5 stars","reviewTitle":"Good quality image for the price","reviewDate":"February 12, 2019","reviewText":"Very nice photos. Simple to figure out. It’s my first camera other than my iPhone. Hoping to turn this into something more than just a thought ❤️"},{"reviewerName":"Marie Toss","rating":"5.0 out of 5 stars","reviewTitle":"It is a very complete package for updating to digital","reviewDate":"April 26, 2019","reviewText":"I hope that this camera can update my focus and picture quality, while I'm filming UFO'S up in the mountains..."},{"reviewerName":"Aaron","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"May 18, 2018","reviewText":"Takes great photos for a starter camera. The instructions are very clear and easy to use."},{"reviewerName":"T.Irby","rating":"5.0 out of 5 stars","reviewTitle":"A+","reviewDate":"August 21, 2019","reviewText":"Great Bundle"},{"reviewerName":"K1234","rating":"5.0 out of 5 stars","reviewTitle":"Good Camera","reviewDate":"September 29, 2019","reviewText":"Good camera. Have been using it for product photography for 2 years and it is still going strong."},{"reviewerName":"McCollins","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"June 6, 2017","reviewText":"Great deal. Bought this for my daughter. She loves it and I get beautiful photos of her brothers. Win/Win"},{"reviewerName":"Newmommy","rating":"5.0 out of 5 stars","reviewTitle":"Great for the price","reviewDate":"July 5, 2019","reviewText":"Love love love this camera. I’m a beginner with DSLR cameras and this is so easy to use and such a great price. Highly recommend"},{"reviewerName":"E V.","rating":"4.0 out of 5 stars","reviewTitle":"This package is a great starter kit for my son","reviewDate":"February 5, 2018","reviewText":"This package is a great starter kit for my son. Gave it to him for Christmas. The only issue was the Flash did not function."},{"reviewerName":"Martín L.","rating":"4.0 out of 5 stars","reviewTitle":"Excellent starting kit","reviewDate":"November 16, 2017","reviewText":"Excellent starting kit. Some accessories are not very good quality but it helps when you are a beginner. I will replace them as soon as I can. Both canon lenses are very good, but there are newer models in the market. I would recommend it to a beginner keeping in mind that some accessories are not very good."},{"reviewerName":"Berk","rating":"4.0 out of 5 stars","reviewTitle":"I actually meant to get another Canon T6i but kept ...","reviewDate":"August 4, 2017","reviewText":"I actually meant to get another Canon T6i but kept this instead as a second camera. It works as well but does NOT record AUDIO."},{"reviewerName":"J.M.","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"December 20, 2017","reviewText":"Everything is very useful, and great quality."},{"reviewerName":"Amazon Customer","rating":"3.0 out of 5 stars","reviewTitle":"Ok camera.","reviewDate":"August 18, 2019","reviewText":"Ok camera."},{"reviewerName":"Maryanne","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"July 4, 2018","reviewText":"Great bundle, thank you! have used the camera for months, no issue so far."},{"reviewerName":"Namiah A.","rating":"5.0 out of 5 stars","reviewTitle":"A MUST GET!!!!","reviewDate":"September 8, 2017","reviewText":"I just got this today via Amazon Prime and did next day delivery and it arrived earlier then expected. It came with everything listed. Well worth the money. I do photography for a hobby and this was perfect for me. Still figuring how to use it being this is my 1st canon camera but sure a easy learn. A MUST GET!!!"},{"reviewerName":"masuma","rating":"5.0 out of 5 stars","reviewTitle":"Great","reviewDate":"March 22, 2019","reviewText":"Great product"},{"reviewerName":"Works","rating":"4.0 out of 5 stars","reviewTitle":"Good camera for entry level","reviewDate":"March 29, 2018","reviewText":"Good camera for entry level, no doubt about it. The bundles included, however, is somewhat flimsy, especially the tripod is not sturdy enough to hold weight of a DSLR. It doesn't have quick release screw assembly."},{"reviewerName":"Pamela R. Madron","rating":"5.0 out of 5 stars","reviewTitle":"Great Purchase","reviewDate":"September 11, 2017","reviewText":"Everything described was included, arrived on time and great protection. Haven't used/tried everything yet but the camera works perfectly. An overall great purchase."},{"reviewerName":"Shawn","rating":"5.0 out of 5 stars","reviewTitle":"It came with a very useful items! I’m excited to put my Canon to ...","reviewDate":"February 20, 2018","reviewText":"Very grateful for the quality of service. It came with a very useful items! I’m excited to put my Canon to use. Thank you!"},{"reviewerName":"Kindle Customer","rating":"5.0 out of 5 stars","reviewTitle":"Amazing! Everything works perfect","reviewDate":"January 7, 2018","reviewText":"Amazing! Everything works perfect, the camera is very very nice, the tripod is cheap, but most of the tripods in bundles are. Everything else is perfect. I love it all!"},{"reviewerName":"Eliza Alvarado","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"June 26, 2017","reviewText":"I love it .. Is very Complete . I love my new camera ."},{"reviewerName":"SuziQ","rating":"5.0 out of 5 stars","reviewTitle":"Nice camera","reviewDate":"August 19, 2019","reviewText":"Great package."},{"reviewerName":"sandor","rating":"5.0 out of 5 stars","reviewTitle":"Great deal on a camera bundle","reviewDate":"December 28, 2018","reviewText":"Nice camera bundle. Excellent amazon service.,"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Excelente producto","reviewDate":"May 7, 2019","reviewText":"excelente producto para quienes desean tomar fotos de calidad sin tener grandes conocimientos de fotografia.\nTodos los adicionales incluidos en la publicacion son funcionales y cumplen con lo publicitado"},{"reviewerName":"nichole","rating":"5.0 out of 5 stars","reviewTitle":"love it!","reviewDate":"March 7, 2018","reviewText":"I love my new camera. I had been wanting to invest in a quality camera for years but just couldn't justify spending the money on myself. I am so happy with my purchase, I don't yet know how to use everything (nor have I even opened everything at this point) but I am excited to learn and see where this hobby of mine could take me! :)"},{"reviewerName":"Jondeline Bellamy","rating":"5.0 out of 5 stars","reviewTitle":"Easy to use","reviewDate":"April 17, 2019","reviewText":"As Is, Great investment!"},{"reviewerName":"Kindle Customer","rating":"5.0 out of 5 stars","reviewTitle":"I am in love with my new Canon.","reviewDate":"April 2, 2017","reviewText":"I love it. It meets all my expectations and more. Very lightweight and easy to use. All the gadgets in the package made this camera more fun to use. The picture quality is marvelous."},{"reviewerName":"Maria Quiroz","rating":"5.0 out of 5 stars","reviewTitle":"... different which was the card reader but it is good either way over all I love it so much ...","reviewDate":"April 3, 2018","reviewText":"Got everything pictured just got one thing different which was the card reader but it is good either way over all I love it so much it was so affordable everything works and looks perfect"},{"reviewerName":"Jake","rating":"4.0 out of 5 stars","reviewTitle":"Decent value","reviewDate":"July 15, 2018","reviewText":"Great value bundle. The extra stuff is of low quality, but for the $, someone who doesn’t have any gear it’s good. The SD cards I received are are 48mb/s which is about half of the high end ones."},{"reviewerName":"K. Richards","rating":"5.0 out of 5 stars","reviewTitle":"Great camera","reviewDate":"March 3, 2019","reviewText":"Love this camera. Good quality photos"},{"reviewerName":"Lena Mohler","rating":"5.0 out of 5 stars","reviewTitle":"Such a great kit for a beginner","reviewDate":"March 14, 2018","reviewText":"Such a great kit for a beginner! It comes with everything you might need! It's a very good quality camera as well!"},{"reviewerName":"hannah","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"September 17, 2018","reviewText":"was a gift for my girl. just what she wanted"},{"reviewerName":"lovelylady","rating":"5.0 out of 5 stars","reviewTitle":"Exceeded my Expectations!","reviewDate":"November 3, 2017","reviewText":"This Camera exceeded my expectations!! It takes really good pictures no mater the lighting. Everything, except the tripod, fit inside of the camera bag. The second charger really came in handy for an event I had. I highly recommend this product."},{"reviewerName":"dave ringley","rating":"5.0 out of 5 stars","reviewTitle":"the best","reviewDate":"February 22, 2019","reviewText":"you will love it"},{"reviewerName":"CDees","rating":"5.0 out of 5 stars","reviewTitle":"Great Deal! Bought for my daughter since she liked ...","reviewDate":"July 31, 2018","reviewText":"Great Deal! Bought for my daughter since she liked ours... and she loves it. she lives in Japan currently and takes pictures all the time with it"},{"reviewerName":"K. Bullock","rating":"4.0 out of 5 stars","reviewTitle":"Good value","reviewDate":"September 11, 2017","reviewText":"No complaints about the camera. My only problem with the bundle is that the telephoto lens is almost useless. Otherwise, it's a great bundle, though."},{"reviewerName":"Laura María Lively","rating":"5.0 out of 5 stars","reviewTitle":"Good price","reviewDate":"March 5, 2019","reviewText":"Im impressed by this, was everything like I expect it and cámara is just incredible"},{"reviewerName":"Miguel","rating":"5.0 out of 5 stars","reviewTitle":"satisfied.. but a picture at the time though it’s arrival Would be the best idea","reviewDate":"July 8, 2018","reviewText":"I love it and I’m fully satisfied I am also looking forward to Buying more accessories for this camera love to meet you in the buying more accessories for this Camera"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Great for the family","reviewDate":"December 22, 2018","reviewText":"Easy to use just what I was looking for"},{"reviewerName":"lancdwl","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"March 7, 2017","reviewText":"Very good camera & great price for the amount of accessories that is bundle into it."},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Love it!","reviewDate":"April 18, 2019","reviewText":"Great quality! And the bundle is great for beginners who may not know what they need."},{"reviewerName":"Sanjay","rating":"5.0 out of 5 stars","reviewTitle":"Great camera, but go easy with some of the accessories.","reviewDate":"April 17, 2017","reviewText":"Great Camera and accessories. The pictures we've taken so far have been outstanding for a camera of this prices and type. The 18-55 mm lens has been sufficient for our needs so far, but I can see us using the 75-300 mm at some point too. The car charger has been unexpectedly useful as well.\n\nWord of caution on the Vivitar wide angle lens bundled with this camera. The Canon lens is mechanical. It's driven by plastic gears inside the lens and these are very delicate. They're small and built for a very specific function. When you add on the Wide angle or any other lens to the Canon lens, you're adding more weight to the lens and the gear is stressed beyond it's design. We added on the clear filter to the lens to protect it from dust, moisture and scratches.. but those are lightweight so we're ok with it.\n\nVery cool camera just by itself."},{"reviewerName":"my reviews","rating":"5.0 out of 5 stars","reviewTitle":"nice set for beginner","reviewDate":"November 25, 2017","reviewText":"great price for all you get. tripod is crap"},{"reviewerName":"Amazon Customer","rating":"4.0 out of 5 stars","reviewTitle":"The Camera is great but the accessories that come with are cheap products","reviewDate":"May 24, 2018","reviewText":"The Camera is great but the accessories that come with are cheap products. The tripod made from cheap aluminium and shakes a lot"},{"reviewerName":"Robin Miller","rating":"5.0 out of 5 stars","reviewTitle":"Awesome Camera","reviewDate":"December 28, 2018","reviewText":"Great bundle, very nice package. Awesome camera"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"May 24, 2017","reviewText":"This is a great camera bundle. Comes complete with everything you need. Takes great pictures. I highly recommend it."},{"reviewerName":"alishia santillo","rating":"5.0 out of 5 stars","reviewTitle":"AWESOME","reviewDate":"November 9, 2018","reviewText":"Worth the money it is amazing"},{"reviewerName":"Tatiana","rating":"5.0 out of 5 stars","reviewTitle":"Wonderful","reviewDate":"February 22, 2019","reviewText":"I’m so happy I bought this so many stuff for such a a good price"},{"reviewerName":"PJBT","rating":"5.0 out of 5 stars","reviewTitle":"We use it everyday!","reviewDate":"November 1, 2018","reviewText":"Great product!"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Great camera","reviewDate":"July 12, 2017","reviewText":"I absolutely love the camera and lenses. It is easy to use and I like the ability to send the photos to my phone or laptop. Some of the additional accessories that came with it are not of good quality and I probably won't use them. The tripod was extremely flimsy."},{"reviewerName":"Will Preston","rating":"5.0 out of 5 stars","reviewTitle":"Love it","reviewDate":"April 11, 2019","reviewText":"First day and I love it already! Still have a lot to learn but it's an awesome kit"},{"reviewerName":"K Hundley","rating":"5.0 out of 5 stars","reviewTitle":"Awesome","reviewDate":"October 16, 2018","reviewText":"Takes great pictures and easy to learn"},{"reviewerName":"Amazon Customer","rating":"4.0 out of 5 stars","reviewTitle":"For the price this camera bundle is great and the camera itself takes very crisp pictures and ...","reviewDate":"April 6, 2018","reviewText":"For the price this camera bundle is great and the camera itself takes very crisp pictures and video which is exactly why my wife and I purchased it. However we found it a little intimidating when we first began to use it. It is capable of many different functions and configurations so for two people who have zero experience using a camera of this type we struggled. It does come with a manual but it is similar in size to a pocket dictionary and isnt practical when you need the information but dont have a half hour to spend searching through it. The only other complaint we have is the size of the Cannon bag that comes with it. Dont get me wrong its great quality but considering how many accessories that come with the camera its difficult to get everything into it. Lots of trial and error to make everything fit and if you happen to need something and its in the bottom of the bag ultimately your gonna have to take almost everything out to get it which again isnt very practical and inconveniant if your on the go. That being said we still think its a good buy as it takes great pictures and does come with just about everything you need for one price rather than buying everything seperately."},{"reviewerName":"Roy","rating":"5.0 out of 5 stars","reviewTitle":"Very nice bundle package","reviewDate":"August 23, 2017","reviewText":"Well worth it-"},{"reviewerName":"Jules","rating":"4.0 out of 5 stars","reviewTitle":"Great for the price","reviewDate":"March 23, 2017","reviewText":"I enjoy this camera! Haven't had any problems so far!"},{"reviewerName":"B2theRy","rating":"5.0 out of 5 stars","reviewTitle":"Exceeded my expectations!","reviewDate":"March 12, 2018","reviewText":"Bought this camera as I will be doing some traveling this summer. Beautiful camera, came with more accessories than I will probably ever use. Exceeded my expectations! Just a fair warning that most of the accessories are not Canon brand, with the exception of the bag, 18-55mm lens, one of the batteries, camera strap and of course the camera itself."},{"reviewerName":"Barbara K","rating":"5.0 out of 5 stars","reviewTitle":"purchased this camera as a graduation gift for my granddaughter ...","reviewDate":"June 1, 2017","reviewText":"purchased this camera as a graduation gift for my granddaughter - she has used it frequently for all the pre-graduation activities , including the prom, and raves about how much she is enjoying it."},{"reviewerName":"Herman Rengifo","rating":"5.0 out of 5 stars","reviewTitle":"She's a photography student and could not be happier!","reviewDate":"May 5, 2018","reviewText":"Recipient was ecstatic. She's a photography student and could not be happier!"},{"reviewerName":"CONPROOFINC","rating":"5.0 out of 5 stars","reviewTitle":"Great deal. This camera is amazing and the pictures ...","reviewDate":"January 10, 2018","reviewText":"Great deal. This camera is amazing and the pictures are beautiful."},{"reviewerName":"Michelle Blanchard Vargas","rating":"5.0 out of 5 stars","reviewTitle":"Easy to use","reviewDate":"July 24, 2018","reviewText":"Exactly what I needed. Love all the accessories."},{"reviewerName":"LISE","rating":"5.0 out of 5 stars","reviewTitle":"Landscapes to Sports, thisw CANON workhorse is reliable & easy to use","reviewDate":"May 27, 2018","reviewText":"WONDERFUL package for a camera for the amateur or professional"},{"reviewerName":"hillary","rating":"5.0 out of 5 stars","reviewTitle":"Great deal","reviewDate":"July 6, 2018","reviewText":"I have been looking to buy this package for a really long time and have been very hesitant about purchasing. I finally gave in and purchased it and I couldn’t be any more happy. Everything was shipped very nicely. The camera is amazing. All the lenses are great."},{"reviewerName":"park2004","rating":"5.0 out of 5 stars","reviewTitle":"Nice camera","reviewDate":"September 19, 2018","reviewText":"Daughter using for photography class"},{"reviewerName":"Milbert Brown","rating":"5.0 out of 5 stars","reviewTitle":"Great camera","reviewDate":"November 16, 2017","reviewText":"This is one of the best cameras produced. It is very light and very simple to use. The camera's price allows advanced as well as beginning photographers a chance to improve their photography without having to spending a lot of money.\n\nmilt brown"},{"reviewerName":"Michelle","rating":"5.0 out of 5 stars","reviewTitle":"Great camera","reviewDate":"April 18, 2017","reviewText":"No problems! Great camera. Does what I need it to do on my photoshoots."},{"reviewerName":"Phillip Kalmbach Jr","rating":"5.0 out of 5 stars","reviewTitle":"Good deal","reviewDate":"September 27, 2018","reviewText":"Excellent camera and bundle, bought for family use and kids in photography classes."},{"reviewerName":"Bruce Burr","rating":"5.0 out of 5 stars","reviewTitle":"Great","reviewDate":"August 29, 2017","reviewText":"Everything that was advertised was delivered early and intact. I used the camera when I went to Alaska and shot some of the best pictures ever. I would buy this product again after a little training with all the different lenses."},{"reviewerName":"Cheryl","rating":"5.0 out of 5 stars","reviewTitle":"Very good camera and yet easy to use","reviewDate":"August 2, 2017","reviewText":"Very good camera and yet easy to use. Bundle came with everything I would ever use. Good camera for the price."},{"reviewerName":"Shepherd Lady","rating":"5.0 out of 5 stars","reviewTitle":"Everything for the novice","reviewDate":"March 18, 2018","reviewText":"Good camera, all the bells and whistles. Easy to learn and it’s a Canon!"},{"reviewerName":"Nadia","rating":"5.0 out of 5 stars","reviewTitle":"I love this bundle really great","reviewDate":"December 22, 2017","reviewText":"I love this bundle really great. I dont use everything but it is worth it! the camera is awesome."},{"reviewerName":"Keisha","rating":"5.0 out of 5 stars","reviewTitle":"You can’t beat the price","reviewDate":"July 22, 2018","reviewText":"Takes beautiful pictures for a beginner photographer."},{"reviewerName":"christian lott","rating":"5.0 out of 5 stars","reviewTitle":"Worth the investment","reviewDate":"March 15, 2019","reviewText":"First camera happy about my purchase. Everything came as listed."},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"September 8, 2017","reviewText":"fantastic setup, way worth the price."},{"reviewerName":"Bianey","rating":"5.0 out of 5 stars","reviewTitle":"Go for the bundle","reviewDate":"February 22, 2018","reviewText":"The bundle is perfect thought I wouldn’t use everything but I actually do."},{"reviewerName":"lynn livesay","rating":"5.0 out of 5 stars","reviewTitle":"Great deal","reviewDate":"June 30, 2017","reviewText":"Amazing camera with lots of amazing extras. Takes great pictures as well. Love the Wi-Fi to for uploading quickly."},{"reviewerName":"noemi cardenas","rating":"5.0 out of 5 stars","reviewTitle":"AMAZING QUALITY PRODUCTS","reviewDate":"June 26, 2019","reviewText":"This camera is great!! I love it !! The products are not canon but they fit perfectly ... havent had time to use all of them but made sure they did fit.. definitely worth the money"},{"reviewerName":"Robert Polster","rating":"5.0 out of 5 stars","reviewTitle":"Works great. Perfect for in between starter and","reviewDate":"April 19, 2018","reviewText":"Works great. Perfect for in between starter and professional"},{"reviewerName":"kyler","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"November 13, 2017","reviewText":"Good deal/Camera."},{"reviewerName":"Ceasar Simpson","rating":"5.0 out of 5 stars","reviewTitle":"Daughter uses it for her school class and loves all ...","reviewDate":"March 24, 2018","reviewText":"Daughter uses it for her school class and loves all the additional items that were included in the package deal"},{"reviewerName":"Leona H.","rating":"5.0 out of 5 stars","reviewTitle":"This is great! I'm so excited to take this package on ...","reviewDate":"July 26, 2017","reviewText":"This is great! I'm so excited to take this package on an African safari. I'm usually a technical idiot but I think I can do this! Booklet is easy to use and I even got a real person to answer the phone at 33 Street Camera. I'm psyched! Totally recommend Seller and product."},{"reviewerName":"Kathryn Scanlon","rating":"5.0 out of 5 stars","reviewTitle":"Love it! Just waiting for the warm weather to ...","reviewDate":"February 22, 2018","reviewText":"Love it ! Just waiting for the warm weather to get a lot of use ."},{"reviewerName":"Papa D","rating":"5.0 out of 5 stars","reviewTitle":"Canon Camera EOS Rebel Excellent Choice","reviewDate":"June 26, 2017","reviewText":"Very happy with the product and service!"},{"reviewerName":"Candie_gurl7","rating":"4.0 out of 5 stars","reviewTitle":"It’s a great camera","reviewDate":"December 15, 2018","reviewText":"Works great"},{"reviewerName":"Lydd","rating":"5.0 out of 5 stars","reviewTitle":"Professional Amateur","reviewDate":"February 9, 2018","reviewText":"Got my dream camera for a good deal, and it arrived sooner than expected!!! Looking at all that came with the camera has caused this amateur photographer to feel more professional!"},{"reviewerName":"Russell Pompey","rating":"5.0 out of 5 stars","reviewTitle":"Satisfied customers","reviewDate":"December 12, 2018","reviewText":"Great Camera with lots of extra stuff."},{"reviewerName":"Danielle Cushman","rating":"5.0 out of 5 stars","reviewTitle":"Perfect camera","reviewDate":"June 14, 2017","reviewText":"The best gift I've ever received. The photos are practically professional looking, even from the amateur photog."},{"reviewerName":"Francisco Rosalez","rating":"5.0 out of 5 stars","reviewTitle":"Nice","reviewDate":"January 2, 2019","reviewText":"Great"},{"reviewerName":"Joc","rating":"5.0 out of 5 stars","reviewTitle":"Great","reviewDate":"February 12, 2018","reviewText":"Great set. Has everything you need besides a good flash."},{"reviewerName":"VERA MOROZOV","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"May 9, 2018","reviewText":"my son very like it"},{"reviewerName":"LesleyJ","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"December 15, 2017","reviewText":"This is a great deal and a great kit for someone wanting to get into photography."},{"reviewerName":"Maurizio Loch","rating":"4.0 out of 5 stars","reviewTitle":"Good cost/quality relation","reviewDate":"August 3, 2017","reviewText":"Good cost/quality relation, this is an excellent camera for those who are starting at reflex photography Definitely Canon is the best option if you are looking for a very good camera and lenses. This one specialy have a nice imagen quality and a fast shoot response. Some of the accesories included are sincerly useless, anyway is a very goood bundle pack."},{"reviewerName":"Rachael Krueger","rating":"5.0 out of 5 stars","reviewTitle":"Love it!","reviewDate":"January 28, 2019","reviewText":"This was one of my best purchases, awesome deal. All the extras were as described and great quality. This camera is so much fun and easy to use."},{"reviewerName":"Tamia L. Walker","rating":"4.0 out of 5 stars","reviewTitle":"Tripid needs to either go or be upgraded","reviewDate":"August 29, 2017","reviewText":"It is great, with the exception of a pathetic tripod. Weird how everything, BUT that, was so awesome.\nStill a good price for everything."},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"however this is an amazing starter camera for someone looking to do some photography","reviewDate":"May 30, 2017","reviewText":"I loveeeee the camera and the entire package. Everything pictured was included and it was well worth the purchase. I am still learning the functionalities of the camera, however this is an amazing starter camera for someone looking to do some photography. Couldn't be happier with the purchase."},{"reviewerName":"NK","rating":"5.0 out of 5 stars","reviewTitle":"bien","reviewDate":"September 19, 2018","reviewText":"buena calidad"},{"reviewerName":"Pilsen extracts","rating":"5.0 out of 5 stars","reviewTitle":"Works great!","reviewDate":"September 15, 2019","reviewText":"She loves it!"},{"reviewerName":"John T Newman","rating":"5.0 out of 5 stars","reviewTitle":"Great package and great pictures","reviewDate":"February 17, 2018","reviewText":"As advertised. Great package and great pictures."},{"reviewerName":"Dan M.","rating":"5.0 out of 5 stars","reviewTitle":"Great value, works awesome for my budding photographer","reviewDate":"November 3, 2017","reviewText":"This was a gift for my son. Great value, works awesome for my budding photographer."},{"reviewerName":"banditandkoko","rating":"5.0 out of 5 stars","reviewTitle":"Good solid camera","reviewDate":"November 28, 2018","reviewText":"I travel much and this is perfect, especially for beach pictures."},{"reviewerName":"R. Link","rating":"5.0 out of 5 stars","reviewTitle":"Canon EOS Rebel T6 DSLR Camera Bundle with... Canon","reviewDate":"June 6, 2017","reviewText":"a wonderful bundle, the camera is superb, the lenses great the rest is to be tried, the tripod is a little flimsy"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Great quality","reviewDate":"October 1, 2019","reviewText":"Watched YouTube videos to learn, but very easy. Great quality"},{"reviewerName":"Kwame","rating":"5.0 out of 5 stars","reviewTitle":"Love the bundle and the price it comes at","reviewDate":"July 30, 2017","reviewText":"Love the bundle and the price it comes at. Camera is great & the lens kit you get it really amazing. Only thing that I didn't like in the bundle was the tripod, pretty flimsy but you can spend a few $$ to buy a better one to replace. Worth it!"},{"reviewerName":"Nick and Monique","rating":"4.0 out of 5 stars","reviewTitle":"Four Stars","reviewDate":"July 30, 2018","reviewText":"Love this camera, use this for my side business. Don't use the filter too much."},{"reviewerName":"Keri Adamczyk","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"March 24, 2018","reviewText":"This was a great deal for a great camera. I highly recommend this camera bundle."},{"reviewerName":"Theresa Raia","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"March 13, 2018","reviewText":"Great product need to get use to it . But a great buy"},{"reviewerName":"Libby Downing","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"July 19, 2017","reviewText":"Best camera ever!"},{"reviewerName":"dan","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"April 13, 2017","reviewText":"great setup for my daughter"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Happy girl!","reviewDate":"May 23, 2017","reviewText":"Got this for my daughter!! She loves it!!"},{"reviewerName":"laskjdf","rating":"4.0 out of 5 stars","reviewTitle":"Great buy","reviewDate":"May 26, 2018","reviewText":"Very nice camera and accessories. Would be a 5 out of 5 score but one of my lens filters was cracked."},{"reviewerName":"carla massiah","rating":"5.0 out of 5 stars","reviewTitle":"Wonderful buy","reviewDate":"February 14, 2018","reviewText":"Excellent camera. My son loves it"},{"reviewerName":"Robert Swain","rating":"4.0 out of 5 stars","reviewTitle":"Camera is great along with accessories but the bag should of been ...","reviewDate":"June 14, 2017","reviewText":"Camera is great along with accessories but the bag should of been more organized to hold all the accessories that came with camera"},{"reviewerName":"Becky Brummett","rating":"5.0 out of 5 stars","reviewTitle":"The best deal anywhere!","reviewDate":"November 6, 2018","reviewText":"I love, love, love this camera! Thank you so much!"},{"reviewerName":"James S.","rating":"5.0 out of 5 stars","reviewTitle":"Love this Camera","reviewDate":"March 23, 2018","reviewText":"Great Camera...Lots of extras....Good price..."},{"reviewerName":"Robert Baker","rating":"5.0 out of 5 stars","reviewTitle":"camera","reviewDate":"April 11, 2019","reviewText":"I have been waiting for years to get this camera. it is everything that it said that it was and more."},{"reviewerName":"Robert Megill","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"December 27, 2017","reviewText":"Huge value made for a great gift!"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Awesome product came with everything in pictures","reviewDate":"August 10, 2017","reviewText":"Awesome product. Come with everything that is pictured!! The camera stand is not very sturdy but I doubt I will use it anyway!! Great price! This product had the best deal with the accessories that it came with!! Highly recommend!!"},{"reviewerName":"dknox","rating":"5.0 out of 5 stars","reviewTitle":"Love my new camera","reviewDate":"September 29, 2017","reviewText":"Love my new camera, It was packaged well and i got everything that was listed in he description. I am very pleased with my purchase."},{"reviewerName":"jon b","rating":"5.0 out of 5 stars","reviewTitle":"made a great gift for my daughter","reviewDate":"September 20, 2019","reviewText":"she took a photo class and said camera worked better than she expected and got an a+ in her class"},{"reviewerName":"cycleman","rating":"4.0 out of 5 stars","reviewTitle":"Nice outfit. Camera and lenses work great","reviewDate":"April 22, 2018","reviewText":"Nice outfit. Camera and lenses work great. The bag that comes with this kit is to small to hold everything so plan on ordering a larger carrying bag to take all the peaces with you."},{"reviewerName":"Baaz","rating":"5.0 out of 5 stars","reviewTitle":"Great product.","reviewDate":"August 16, 2017","reviewText":"After attending class, I found that the camera that I had was not sufficient for doing my job correctly. This camera is more than sufficient. The price was very reasonable. Thanks."},{"reviewerName":"zach","rating":"5.0 out of 5 stars","reviewTitle":"Great product and as always thank you","reviewDate":"December 7, 2017","reviewText":"Everything Came in the way it was supposed to and came in the timeframe that was supposed arrive. No problems occurred from my order. Great product and as always thank you Amazon"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"August 7, 2018","reviewText":"The best kit for staring. The wifi functionally is really useful."},{"reviewerName":"drunaus1","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"March 24, 2018","reviewText":"Great camera."},{"reviewerName":"francis k. bainson","rating":"5.0 out of 5 stars","reviewTitle":"It’s a good money maker","reviewDate":"February 16, 2019","reviewText":"Most professional handling"},{"reviewerName":"Extrucker","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"June 12, 2017","reviewText":"Great package. Everything I needed to take pro type photos."},{"reviewerName":"Ashley Zachaire","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"February 10, 2018","reviewText":"I love my new camera, I received all my items that was shown in the picture."},{"reviewerName":"Jessica Rice","rating":"5.0 out of 5 stars","reviewTitle":"Love using my camera.","reviewDate":"July 17, 2019","reviewText":"I still use this camera and I ordered it 2 years ago. It was a very good deal!"},{"reviewerName":"Chuck","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"December 26, 2016","reviewText":"Christmas gift, she loves it!"},{"reviewerName":"Shon C","rating":"5.0 out of 5 stars","reviewTitle":"Its worth every dime.","reviewDate":"August 16, 2018","reviewText":"Love the camera every where I go people think I'm a professional photographer.."},{"reviewerName":"Meredith Harrison","rating":"5.0 out of 5 stars","reviewTitle":"Good beginner kit","reviewDate":"June 23, 2019","reviewText":"Great kit for beginners. Worth the price"},{"reviewerName":"genonchris","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"January 17, 2018","reviewText":"great package"},{"reviewerName":"Ernesto","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"May 4, 2018","reviewText":"Wife lives it"},{"reviewerName":"alex zambrano","rating":"5.0 out of 5 stars","reviewTitle":"Increíble","reviewDate":"December 2, 2018","reviewText":"Súper buena"},{"reviewerName":"Baron","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"February 20, 2018","reviewText":"Thank you"},{"reviewerName":"Rebecca","rating":"5.0 out of 5 stars","reviewTitle":"Love this camera","reviewDate":"April 20, 2019","reviewText":"This was my daughters first real camera. We purchased it for her college class. She was able to learn how to use it quickly."},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"I loves it takes great pictures easy to use","reviewDate":"May 27, 2018","reviewText":"Bought for a gift for my son. I loves it takes great pictures easy to use."},{"reviewerName":"Lisa S.","rating":"5.0 out of 5 stars","reviewTitle":"LOVE IT!","reviewDate":"December 6, 2017","reviewText":"Good bundle! Each item came out really handy. I totally recommend this offer. The camera is perfect for beginners. Pictures come so beautifully."},{"reviewerName":"Amazon Customer","rating":"2.0 out of 5 stars","reviewTitle":"The box's seal was broken and the lens body was dirty with a bit grease on the lens's glass","reviewDate":"November 2, 2017","reviewText":"I've received this camera, but the second lens which is packed in a different box was a used lens. The box's seal was broken and the lens body was dirty with a bit grease on the lens's glass. I've attached some pictures that show what it looks like. I expected a brand new lens not a used one. I hope it works properly otherwise I don't know what should I do."},{"reviewerName":"India Lynch","rating":"5.0 out of 5 stars","reviewTitle":"5 stars","reviewDate":"October 30, 2018","reviewText":"Great product"},{"reviewerName":"Ashley Mba","rating":"5.0 out of 5 stars","reviewTitle":"Love it","reviewDate":"May 4, 2017","reviewText":"I just my camera and I must say...IT'S AMAZING!!!!! I'm a beginner when it comes to photography but I hope with this camera, I can explore and take good photos and maybe become a professional photographer one day...but hey! This is a good way to start!"},{"reviewerName":"Amanda","rating":"4.0 out of 5 stars","reviewTitle":"Four Stars","reviewDate":"April 19, 2017","reviewText":"The kit was great but some of the things weren't necessary"},{"reviewerName":"Bauti","rating":"5.0 out of 5 stars","reviewTitle":"Todo Perfecto","reviewDate":"August 17, 2018","reviewText":"Soy de Argentina y al viajar a Estados Unidos decidí comprar esta cámara con su kit, muy recomendable, vino todo completo."},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Good Package","reviewDate":"May 10, 2017","reviewText":"Pretty good package. Bag is a little small and tripod is dinky, but for the price ....great deal. It beats Costco price and it has all the extra stuff thrown in."},{"reviewerName":"Jermain","rating":"5.0 out of 5 stars","reviewTitle":"Amazing DSLR","reviewDate":"June 19, 2017","reviewText":"Absolutely love me camera. I have taken this thing everywhere. Lots of great feature. Best to make the time to get to know it and get the most out of it. Canon never disappoints."},{"reviewerName":"steven","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"January 12, 2018","reviewText":"Great camera for a beginner like me"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"... combination package with all the pictured items was much better than purchasing the camera by itself","reviewDate":"July 5, 2018","reviewText":"The combination package with all the pictured items was much better than purchasing the camera by itself. Highly recommended by a family member who purchased the same package within the past year."},{"reviewerName":"chad","rating":"5.0 out of 5 stars","reviewTitle":"Cannon Quality!","reviewDate":"April 30, 2019","reviewText":"Good pics at bargain price. Quality product"},{"reviewerName":"Amazon Customer","rating":"4.0 out of 5 stars","reviewTitle":"Great beginner Camera","reviewDate":"September 27, 2018","reviewText":"The camera itself is great, easy to use and get used to, perfect for beginners. Came with everything pictured. I was surprised to find it came with a CPL filter.\nGreat deal with everything included."},{"reviewerName":"Diamond Williams","rating":"5.0 out of 5 stars","reviewTitle":"Very pleased!","reviewDate":"January 23, 2018","reviewText":"I got way more than I was expecting. It's so much stuff that I still haven't went through the entire box. Very pleased!"},{"reviewerName":"Sneha Raut","rating":"3.0 out of 5 stars","reviewTitle":"Second lense for camera seal was open and box looked ...","reviewDate":"February 7, 2018","reviewText":"Second lense for camera seal was open and box looked old. I hope the lenses is original and not a used one."},{"reviewerName":"ashley","rating":"5.0 out of 5 stars","reviewTitle":"Awesome!","reviewDate":"August 5, 2019","reviewText":"Great camera, awesome accessories. For the price, you can’t beat this."},{"reviewerName":"jose f.","rating":"5.0 out of 5 stars","reviewTitle":"Picture perfect","reviewDate":"December 2, 2018","reviewText":"What a great little camera. Professional yet simplistic enough for anyone to use. Love it"},{"reviewerName":"Alessia Barstow","rating":"5.0 out of 5 stars","reviewTitle":"Everything you need to get started","reviewDate":"August 24, 2017","reviewText":"The camera is very easy to use and excellent quality. The two lenses will get you going on most anything you would like to do. One of the best features to me is the wifi. This has allowed me to take photos, edit, and post them before I even get home."},{"reviewerName":"Hart Rose","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"April 11, 2018","reviewText":"Love it"},{"reviewerName":"ds","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"February 2, 2017","reviewText":"Nice bundle"},{"reviewerName":"Raiden","rating":"4.0 out of 5 stars","reviewTitle":"Love it!! But no flash","reviewDate":"September 16, 2017","reviewText":"This is my first real camra and its pretty awesome alone with the huge bundle thanks for that! The only this is the external flash doesn't work whatsoever. I put batteries and pressed the test button, tried switching it on and nonthing. If anyone can help that'll be great!"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"April 11, 2018","reviewText":"great product for a great price"},{"reviewerName":"kathy","rating":"5.0 out of 5 stars","reviewTitle":"Great camera","reviewDate":"May 27, 2017","reviewText":"Second one I have purchased for my business."},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Perfect gift","reviewDate":"January 16, 2018","reviewText":"Bought this for my boyfriend for Christmas who is new to photography. He loves it ! It came with plenty of accessories, the only thing I’d say is that the tripod is no good and flimsy."},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"May 23, 2018","reviewText":"I am in love with this camera!!! Great quality photos even from this amateur!"},{"reviewerName":"DAravenaR","rating":"5.0 out of 5 stars","reviewTitle":"Perfect!","reviewDate":"December 12, 2017","reviewText":"It came with all the products detailed, now i'm gonna try the camera."},{"reviewerName":"Zunibel","rating":"4.0 out of 5 stars","reviewTitle":"Muy bien","reviewDate":"July 8, 2019","reviewText":"El unico problema que encontré es que el tripode es pequeño, despues lo otro esta excelente"},{"reviewerName":"Jewell Rowlands","rating":"5.0 out of 5 stars","reviewTitle":"Awesome bundle, and great quality! Love it.","reviewDate":"September 19, 2017","reviewText":"This camera is AMAZING and all the accessories it came with totally exceeded my expectations. Everything works great, nothing has broken or had any problems, and I basically use this camera every day. Absolutely a great buy-- I couldn't have been happier with it!"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"July 28, 2017","reviewText":"wife loves it and works great"},{"reviewerName":"Brian","rating":"4.0 out of 5 stars","reviewTitle":"Maybe it will get better?","reviewDate":"March 1, 2018","reviewText":"It is hard to get used to. We had a fuji camera before, it doesn't seem to be as quick as our old camera. Maybe it will get better?"},{"reviewerName":"Trinishopper","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"April 22, 2017","reviewText":"love it"},{"reviewerName":"Sarah","rating":"5.0 out of 5 stars","reviewTitle":"Great purchase!","reviewDate":"September 10, 2018","reviewText":"For the price this package gives you everything you need!"},{"reviewerName":"William","rating":"5.0 out of 5 stars","reviewTitle":"but it is as described and everything seems to be good quality.","reviewDate":"May 16, 2017","reviewText":"Haven't had much time to mess with it yet, but it is as described and everything seems to be good quality."},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Great camera, great deal!","reviewDate":"May 13, 2017","reviewText":"I love the camera and all the accessories that come with it. Great for a beginning photographer!"},{"reviewerName":"Jackie","rating":"4.0 out of 5 stars","reviewTitle":"Upon initial delivery, I found the Vivitar Digital Slave ...","reviewDate":"August 22, 2017","reviewText":"Upon initial delivery, I found the Vivitar Digital Slave Flash unit to be severely scratched on the plastic window protecting the flashlight. It appeared to have been previously used."},{"reviewerName":"Stephanie","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"December 9, 2017","reviewText":"Awesome package! I'm a beginner but this looks very much like a professional kit."},{"reviewerName":"Laura Halpin","rating":"4.0 out of 5 stars","reviewTitle":"The package was awesome.. Everything a new camera person would need","reviewDate":"October 8, 2017","reviewText":"The package was awesome..Everything a new camera person would need!!!"},{"reviewerName":"jose salazar","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"September 25, 2017","reviewText":"Great camera"},{"reviewerName":"Ellen Orr","rating":"5.0 out of 5 stars","reviewTitle":"Great package deal.","reviewDate":"October 21, 2018","reviewText":"It is a great camera. It comes with a few lenses. I am still learning to use everything. Well worth the money."},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"April 27, 2018","reviewText":"Great bundle !!!"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Great Camera!","reviewDate":"December 11, 2018","reviewText":"My wife loved getting this last Christmas. Very nice camera."},{"reviewerName":"MrsSaddlersReview","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"August 31, 2017","reviewText":"In love. Just as promised!!!!"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"it's a great value.","reviewDate":"April 20, 2017","reviewText":"More stuff here than I need. But otherwise, it's a great value."},{"reviewerName":"John Mason","rating":"5.0 out of 5 stars","reviewTitle":"Awesome Camera!","reviewDate":"September 11, 2018","reviewText":"I love this Camera!"},{"reviewerName":"Steve M","rating":"4.0 out of 5 stars","reviewTitle":"The Canon EOS T6 takes very nice pictures at 18MP and there are a bunch of ...","reviewDate":"September 1, 2017","reviewText":"The camera: The Canon EOS T6 takes very nice pictures at 18MP and there are a bunch of settings to ensure that a novice can get the subject in focus and at right exposure under a variety of conditions. It also can be used in full manual mode (lenses have a switch for auto- or manual-focus). Having owned Canon cameras recently, I was little surprised at how long it took me to figure out the menus, but now that I've practiced with it I fell more comfortable changing settings quickly.\nThe package: The accessories are really for the first-time user, as I would imagine most experienced photographers would have a tripod and flash, both of which are pretty cheap in this package. The extra battery is a must and the home and car chargers are a nice addition. By far the best accessory here is the 0.43x wide-angle adapter, which screws onto the 18-55mm zoom lens to give a nice wide view which is great for small rooms and garden shots. Naturally, there's some vignetting at the widest setting. The bag holds the camera and both lenses, along with one of the lens attachments (there's also a 2x multiplier), but not much else. Plan on bringing the chargers and filters in a separate bag. The package also contains two 32GB flash cards. Battery life is excellent."},{"reviewerName":"Raghunath Bidari","rating":"4.0 out of 5 stars","reviewTitle":"Good DEAL","reviewDate":"November 30, 2018","reviewText":"It's a nice deal, but the combo accessories are not good, some of them are useless and doesn't work properly"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"November 8, 2017","reviewText":"Love the pics I took."},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Quality","reviewDate":"November 29, 2018","reviewText":"My granddaughter loved this camera she was so excited she couldn't believe everything in this bundle\n\nThank you"},{"reviewerName":"Georgie Harrington","rating":"5.0 out of 5 stars","reviewTitle":"Great first camera!","reviewDate":"March 25, 2018","reviewText":"I’m just starting out with photography and this camera is fitting all my needs! Took some amazing senior photos and is easy to use! I use an app that connects all my photos straight to my phone."},{"reviewerName":"Rebecca R.","rating":"4.0 out of 5 stars","reviewTitle":"Didn't come with everything as promised.","reviewDate":"March 17, 2017","reviewText":"Did not receive the memory card reader or the extra battery pack. However, this was a great deal as the camera alone retails for much more."},{"reviewerName":"Ted. A long time Amazon customer","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"September 23, 2017","reviewText":"A better bargain than the local big box electronics store. This package has everything you need."},{"reviewerName":"Amazon Customer","rating":"4.0 out of 5 stars","reviewTitle":"Falta una bateria","reviewDate":"July 16, 2018","reviewText":"Buen paquete de productos\nPero falta una bateria"},{"reviewerName":"Jessica W.","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"June 24, 2018","reviewText":"I ended up returning this but it looks like fun!"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Very good kit","reviewDate":"October 26, 2018","reviewText":"Very good kit"},{"reviewerName":"Jasmine","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"July 30, 2017","reviewText":"I love it!!"},{"reviewerName":"rick pagett","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"January 12, 2018","reviewText":"Our daughter was so excited to receive this bundle!!"},{"reviewerName":"Debra B","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"October 20, 2017","reviewText":"Was Short a battery."},{"reviewerName":"Deb A.","rating":"5.0 out of 5 stars","reviewTitle":"You won't regret buying this","reviewDate":"January 27, 2018","reviewText":"No matter what stage of professionalism you are at, amateur, beginner, intermediate, advanced, this camera will suit you well. It comes with everything you need and more! You will love this set and value every single items."},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"February 6, 2018","reviewText":"Excellent deal and product. Everything arrived and in excellent shape."},{"reviewerName":"Cindy","rating":"5.0 out of 5 stars","reviewTitle":"Worth it","reviewDate":"September 30, 2017","reviewText":"This product is no scam. It has amazing lenses, covers, and the tripod is much bigger than shown, but a little unstable"},{"reviewerName":"Jennifer Vaughn","rating":"1.0 out of 5 stars","reviewTitle":"Doesn’t last","reviewDate":"March 26, 2019","reviewText":"I have had this camera less than a year and it’s already slowing on shutter speed and pics are blurry. Won’t buy again"},{"reviewerName":"tylee","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"April 3, 2017","reviewText":"Love this package."},{"reviewerName":"Ronald Hill","rating":"5.0 out of 5 stars","reviewTitle":"Good deal.","reviewDate":"August 17, 2017","reviewText":"Well worth it."},{"reviewerName":"Kat","rating":"2.0 out of 5 stars","reviewTitle":"Terrible for the price!!","reviewDate":"August 20, 2019","reviewText":"Wasted so much money and its very difficult to use. Followed the manual and it wouldnt even connect to my laptop."},{"reviewerName":"Kevin","rating":"4.0 out of 5 stars","reviewTitle":"Four Stars","reviewDate":"June 1, 2018","reviewText":"Expensive but good"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Amazing Deal!","reviewDate":"June 22, 2018","reviewText":"Amazing deal for the price!! Very very happy!"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"... this camera it is part of her life now great asset to everything she's","reviewDate":"March 16, 2018","reviewText":"My daughter is still using them to make pictures movies videos and everything is she can make with this camera it is part of her life now great asset to everything she's doing"},{"reviewerName":"manoj","rating":"5.0 out of 5 stars","reviewTitle":"Best for beginners","reviewDate":"February 27, 2019","reviewText":"Good"},{"reviewerName":"Sepo Mwangelwa","rating":"3.0 out of 5 stars","reviewTitle":"The accessories are not Canon brands though but with good care, they can last quite a while","reviewDate":"June 18, 2018","reviewText":"Was quite impressed with the camera, if you are starting out as an amateur photographer. The accessories are not Canon brands though but with good care, they can last quite a while. Very good buy."},{"reviewerName":"Ele","rating":"5.0 out of 5 stars","reviewTitle":"Great camera for new photographer","reviewDate":"October 16, 2018","reviewText":"Takes great pics of my kids. I’m still learning to use al the features. WiFi is a must so it’s great this come with the WiFi capability."},{"reviewerName":"Sachin","rating":"1.0 out of 5 stars","reviewTitle":"One Star","reviewDate":"April 23, 2018","reviewText":"Received only accessories in 549$. Missing camera and DSLR. Unexpected"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Love it!","reviewDate":"May 7, 2017","reviewText":"I am so satisfied with my purchase and it was everything that it said it would be! I love it so much and just wanted a camera to take pictures of everything and I use it all the time! The best!!!"},{"reviewerName":"Cat","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"January 16, 2018","reviewText":"Love this camera...I feel it is a great deal with all the accessories you get with this package!"},{"reviewerName":"Regianena","rating":"5.0 out of 5 stars","reviewTitle":"Love it","reviewDate":"August 31, 2018","reviewText":"Love it"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"April 23, 2018","reviewText":"Great kit for the starter photographer. All Quality accessories."},{"reviewerName":"Skyy","rating":"5.0 out of 5 stars","reviewTitle":"Great camera , accessories.. hit or miss","reviewDate":"March 14, 2019","reviewText":"It is a good product , only problem was one of the SD Cards was corrupted and didn’t work, it said it came with two 32 gb cards"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Excellent camera","reviewDate":"June 26, 2017","reviewText":"Satisfied with purchase."},{"reviewerName":"Kendra","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"December 26, 2017","reviewText":"thanks"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"LOVE LOVE LOVE","reviewDate":"August 23, 2017","reviewText":"Such a great and affordable bundle! Definitely recommend for anyone starting photography, great entry level camera to start off with."},{"reviewerName":"Debora","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"February 23, 2018","reviewText":"GREAT value!"},{"reviewerName":"Roxy Rose","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"January 15, 2017","reviewText":"Love It! Great bargain"},{"reviewerName":"kirina davis","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"September 23, 2018","reviewText":"Perfect!!!!"},{"reviewerName":"Mikayla","rating":"5.0 out of 5 stars","reviewTitle":"I love this camera","reviewDate":"October 22, 2017","reviewText":"I love this camera! It's very easy to use but still extremely professional. My package arrived earlier than I expected it to which was wonderful. The display is wonderful and it takes amazing photos. Would recommend it for anyone."},{"reviewerName":"Steven D Sanders","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"February 8, 2018","reviewText":"I love my camera so much to learn!"},{"reviewerName":"Curt Jones","rating":"5.0 out of 5 stars","reviewTitle":"Great bundle, excellent price.","reviewDate":"February 22, 2018","reviewText":"I bought this as a gift after buying the same package for myself a year ago. Great deal, excellent product."},{"reviewerName":"Chrissy","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"October 26, 2017","reviewText":"Nice package and nice camera"},{"reviewerName":"Maureen Slavens","rating":"4.0 out of 5 stars","reviewTitle":"There was an issue with the one lens, but ...","reviewDate":"February 11, 2018","reviewText":"There was an issue with the one lens, but we sent it back after calling, and they quickly sent another one to us - which we have no complaints with. Thank you!"},{"reviewerName":"Deni","rating":"4.0 out of 5 stars","reviewTitle":"Easy to use","reviewDate":"April 26, 2019","reviewText":"The camera is easy to use, the accessories connect well."},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"I think this is a great camera & bundle","reviewDate":"April 26, 2017","reviewText":"As a novice, I think this is a great camera & bundle."},{"reviewerName":"Elizabeth A Hadley","rating":"5.0 out of 5 stars","reviewTitle":"Good starter bundle","reviewDate":"February 27, 2019","reviewText":"So far so good, everything works with the camera and the charger charges the battery quickly."},{"reviewerName":"sara","rating":"4.0 out of 5 stars","reviewTitle":"Four Stars","reviewDate":"January 2, 2018","reviewText":"camera is good for beginner would suggest check other canon camera options too"},{"reviewerName":"Marcelo Jiménez","rating":"5.0 out of 5 stars","reviewTitle":"Nice","reviewDate":"February 6, 2019","reviewText":"Nice camera"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"October 17, 2017","reviewText":"love this bundle"},{"reviewerName":"Srikanth T","rating":"5.0 out of 5 stars","reviewTitle":"Good quality","reviewDate":"December 18, 2018","reviewText":"Great picture quality with great features."},{"reviewerName":"Tracy T.","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"March 24, 2017","reviewText":"Awesome bundle!"},{"reviewerName":"Zhengzheng Fan","rating":"5.0 out of 5 stars","reviewTitle":".","reviewDate":"September 30, 2019","reviewText":"Really useful!"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Great value for money bundle","reviewDate":"September 14, 2017","reviewText":"Great value for money bundle. Brought this for my son's photograph class and it really does look like a fantastic bundle and very keenly priced!"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Received entire bundle as advertised and on time for a ...","reviewDate":"July 28, 2017","reviewText":"Received entire bundle as advertised and on time for a graduation gift for my daughter. I would order again from 33rd St. Camera"},{"reviewerName":"Nikki Miller","rating":"5.0 out of 5 stars","reviewTitle":"Lots of stuff","reviewDate":"May 29, 2019","reviewText":"Comes with a lot of helpful stuff. Very excited to get to truly put it to work!"},{"reviewerName":"Nav808","rating":"5.0 out of 5 stars","reviewTitle":"Good deal.","reviewDate":"May 1, 2019","reviewText":"Great beginner camera for my teenage daughter."},{"reviewerName":"Isaac","rating":"5.0 out of 5 stars","reviewTitle":"Nice set up for beginners","reviewDate":"November 25, 2018","reviewText":"Very nice product and nice price"},{"reviewerName":"Saúl cruz","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"June 2, 2018","reviewText":"love my camer so very good"},{"reviewerName":"Ronald Teel","rating":"5.0 out of 5 stars","reviewTitle":"Best Buy","reviewDate":"September 29, 2019","reviewText":"I brought for my son and he loves it"},{"reviewerName":"charlie","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"December 28, 2016","reviewText":"i love this camera!! I would recomend this deal to anyone"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Awesome bundle","reviewDate":"July 25, 2017","reviewText":"Great bundle. Have already made a few videos with the camera and the quality is perfect. Very happy and would definitely recccoment for others interested in purchasing a new camera. Can't beat the price for what you get."},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Best camera bundle your going to find.","reviewDate":"April 25, 2019","reviewText":"Amazingggg camera! Came with everything I needed & more. Would definenttly recommend!"},{"reviewerName":"Fanny Guerrero","rating":"4.0 out of 5 stars","reviewTitle":"Fun to use","reviewDate":"October 30, 2017","reviewText":"Easy to use, straight forward, if you're a beginner this is a good camera for you."},{"reviewerName":"Kim Sessum","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"June 28, 2017","reviewText":"Thanks for the great customer service. Overall everything is great. My camera takes perfect pictures."},{"reviewerName":"Anthony Johnson","rating":"5.0 out of 5 stars","reviewTitle":"Great camera, packaged with extras and a great price","reviewDate":"May 18, 2018","reviewText":"Great camera ,packaged with extras and a great price"},{"reviewerName":"john lam","rating":"5.0 out of 5 stars","reviewTitle":"Love it","reviewDate":"August 19, 2018","reviewText":"Love it"},{"reviewerName":"Sandra Silva","rating":"5.0 out of 5 stars","reviewTitle":"Easy to Function","reviewDate":"January 11, 2018","reviewText":"I bought this as a Christmas present for my 12 year old son. He loves his camera. It takes beautiful pics and it seems easy to function."},{"reviewerName":"A great story for kids with adventures in mind. The pictures are great too.","rating":"5.0 out of 5 stars","reviewTitle":"Good bargain for the price too.","reviewDate":"August 22, 2018","reviewText":"I love it! I lost my other one to the tornado. So finding one to replace it for the least amount of money was important. This did the trick!"},{"reviewerName":"Laura Herrera","rating":"5.0 out of 5 stars","reviewTitle":"I love this camera","reviewDate":"November 20, 2018","reviewText":"Is really nice, and all the extra stuff works fine\nIs nice for start"},{"reviewerName":"Lord_Slither","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"November 4, 2017","reviewText":"Great awesome camera for a great price"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Canon EOS Rebel T6.....what a package!!!!","reviewDate":"March 30, 2017","reviewText":"Ready to capture everything!!!!"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"April 4, 2017","reviewText":"It's an awesome camera for beginners and I'm thinking about buying another one but for myself"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"March 8, 2018","reviewText":"Great bundle!"},{"reviewerName":"Edwin Gilchrist","rating":"4.0 out of 5 stars","reviewTitle":"Four Stars","reviewDate":"February 24, 2018","reviewText":"Good Price for all that you get."},{"reviewerName":"Clinton Siedhof","rating":"4.0 out of 5 stars","reviewTitle":"This is a great camera. But the tripod that comes with this ...","reviewDate":"June 18, 2017","reviewText":"This is a great camera. But the tripod that comes with this bundle is flimsy. I would recommend getting a carbon fiber tripod from Neewer."},{"reviewerName":"Lorena G","rating":"5.0 out of 5 stars","reviewTitle":"Good for beginners","reviewDate":"April 14, 2019","reviewText":"I really like this camera and all the gadgets, great for beginners."},{"reviewerName":"Keith Groves","rating":"5.0 out of 5 stars","reviewTitle":"Gorgeous Camera. Makes everyone a Pro.","reviewDate":"March 6, 2018","reviewText":"Great Camera. Great Bundle. Everything that is provided are things that are needed. It took the hassle out of having to run to the camera store 5 times for different things. Well Done."},{"reviewerName":"Glen M.","rating":"5.0 out of 5 stars","reviewTitle":"Great bundle","reviewDate":"August 19, 2018","reviewText":"Good deal"},{"reviewerName":"Client d'Amazon","rating":"5.0 out of 5 stars","reviewTitle":"Thanks Exactly what I expected","reviewDate":"May 31, 2019","reviewText":"Exactly what I expected"},{"reviewerName":"Joe W. Hernandez Jr.","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"August 29, 2017","reviewText":"great bundle to get you started. I use it for my office."},{"reviewerName":"greg nelson","rating":"2.0 out of 5 stars","reviewTitle":"Really upset because it came missing a cannon lens. ...","reviewDate":"April 18, 2018","reviewText":"Really upset because it came missing a cannon lens. That was the only reason I bought this package. Will be returning and hopefully be getting what I paid for!"},{"reviewerName":"EllenW","rating":"5.0 out of 5 stars","reviewTitle":"Camera bundle","reviewDate":"June 15, 2019","reviewText":"Great camera bundle for the price!"},{"reviewerName":"myesha","rating":"2.0 out of 5 stars","reviewTitle":"Broken items","reviewDate":"July 14, 2017","reviewText":"Tripod arrived broken, battery and charger missing."},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Wonderful","reviewDate":"August 8, 2018","reviewText":"My friend loved it"},{"reviewerName":"Mansoor Shafi","rating":"5.0 out of 5 stars","reviewTitle":"Great Camera but problem with Trupod!","reviewDate":"October 9, 2017","reviewText":"We love the camera but slight problem with the Tripod which is a part of the bundle. Upon opening the package we found everything in good order except the Tripod. One of the screws on the Tripod does not tighten and as such makes the Tripod unusable. The two photos attached show the location of the problem.\n\nWe are hoping that the seller will resolve this problem soon, otherwise we will have to return the whole package for a refund!"},{"reviewerName":"Linda Adkins","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"March 16, 2017","reviewText":"great value."},{"reviewerName":"Colleen Edwards","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"October 3, 2017","reviewText":"Great bundle"},{"reviewerName":"Daniel Lambert","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"March 3, 2018","reviewText":"Very good, all perfect"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"August 12, 2017","reviewText":"Love this camera. Takes great pictures. The different lens make is possible to take amazing pictures."},{"reviewerName":"Jo","rating":"5.0 out of 5 stars","reviewTitle":"WOW... Great value.","reviewDate":"September 12, 2018","reviewText":"I love taking photos with my new camera."},{"reviewerName":"wandajohn","rating":"5.0 out of 5 stars","reviewTitle":"Completely satisfied","reviewDate":"July 22, 2017","reviewText":"Got this camera for my husband and he loves it. Takes really nice pictures."},{"reviewerName":"Tiara Hughes","rating":"5.0 out of 5 stars","reviewTitle":"This is a great starter camera for people like myself","reviewDate":"August 7, 2017","reviewText":"The entire set was included and everything works perfectly. This is a great starter camera for people like myself!"},{"reviewerName":"Lisa L. Lamb","rating":"5.0 out of 5 stars","reviewTitle":"Great camera!","reviewDate":"September 10, 2017","reviewText":"The camera was just what we wanted with all of the accessories and camera bag. The box was a bit beat up when received it, but no damage the the items inside."},{"reviewerName":"Andrew C.","rating":"2.0 out of 5 stars","reviewTitle":"froze up","reviewDate":"March 12, 2018","reviewText":"i received everything it was supposed to come with... but after having tried it 2 times it froze up on me and wouldnt work... even if i shut it off, the screen would stay on."},{"reviewerName":"Alicia Ruiz","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"August 15, 2017","reviewText":"Exellent"},{"reviewerName":"Topaz","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"March 17, 2018","reviewText":"I’m beyond happy with the bundle, amazing camera, came really fast in the mail!"},{"reviewerName":"Julieta Oviedo","rating":"5.0 out of 5 stars","reviewTitle":"Buen equipo","reviewDate":"April 30, 2019","reviewText":"Es un buen kit para comenzar con la fotografía"},{"reviewerName":"Dar H.","rating":"5.0 out of 5 stars","reviewTitle":"Love it! Awesome value for the price","reviewDate":"September 12, 2017","reviewText":"Love it ! Awesome value for the price !"},{"reviewerName":"Georgina","rating":"5.0 out of 5 stars","reviewTitle":"I loved it! Everything that was advertised came with it ...","reviewDate":"February 9, 2017","reviewText":"I loved it! Everything that was advertised came with it and they boxed it up well. Everything is brand new and great quality!"},{"reviewerName":"Sarah Boettner","rating":"5.0 out of 5 stars","reviewTitle":"Canon Rebel","reviewDate":"May 17, 2019","reviewText":"I was delighted to receive my order quickly and safely."},{"reviewerName":"Reina rivera","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"February 7, 2018","reviewText":"great item and fast shipping"},{"reviewerName":"Clarence Jones","rating":"5.0 out of 5 stars","reviewTitle":"Great deal, great camera","reviewDate":"August 21, 2017","reviewText":"simply a great deal and great camera.."},{"reviewerName":"Michael Fisk","rating":"5.0 out of 5 stars","reviewTitle":"Definitely would recommend this product for anyone","reviewDate":"October 17, 2017","reviewText":"Definitely would recommend this product for anyone, even a starting out photographer or someone looking into making YouTube or whatever you want."},{"reviewerName":"ASpring","rating":"4.0 out of 5 stars","reviewTitle":"Exactly what I expected","reviewDate":"January 19, 2017","reviewText":"The camera came with everything pictured. The bag is too small so I purchased a separate bag to use. My only complaint is that my tripod is missing the thumbscrew to attach the camera."},{"reviewerName":"LayLay","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"January 5, 2018","reviewText":"Great kit!"},{"reviewerName":"Kerwyn Joseph","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"June 12, 2018","reviewText":"AMAZING PACKAGE!!!"},{"reviewerName":"ks","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"January 17, 2018","reviewText":"Great camera for a first timer!"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"February 2, 2017","reviewText":"Easy to use."},{"reviewerName":"James V. Parker","rating":"5.0 out of 5 stars","reviewTitle":"Great Package","reviewDate":"March 23, 2017","reviewText":"Just as advertised. Great quality for the price."},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"But I love the camera I have two young babies so I ...","reviewDate":"April 1, 2017","reviewText":"I am no pro. But I love the camera I have two young babies so I can capture all their moments!!"},{"reviewerName":"Nikhil","rating":"4.0 out of 5 stars","reviewTitle":"Canon T6 purchase","reviewDate":"November 4, 2017","reviewText":"It's good camera for beginners.. the accessories provided is exhaustive.. quite impressive"},{"reviewerName":"Nate","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"November 20, 2017","reviewText":"The best T6 bundle out there hands down"},{"reviewerName":"Aaron Lee","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"January 28, 2018","reviewText":"Fast shipping and great bundle! Thank you for such a good deal!"},{"reviewerName":"Amazon Customer","rating":"2.0 out of 5 stars","reviewTitle":"Dont buy this","reviewDate":"October 22, 2018","reviewText":"Blurry picutres and I would not trust amazon either."},{"reviewerName":"Ivan Arana","rating":"5.0 out of 5 stars","reviewTitle":"... these im smiling everytime i use my camera i love it!","reviewDate":"February 7, 2018","reviewText":"I always wanted to get one of these im smiling everytime i use my camera i love it!"},{"reviewerName":"Travis Fuger","rating":"5.0 out of 5 stars","reviewTitle":"High quality starter!!!","reviewDate":"August 16, 2018","reviewText":"Great camera!!!"},{"reviewerName":"Tony Ramsey","rating":"5.0 out of 5 stars","reviewTitle":"takes some great photos and it's easy to use","reviewDate":"November 30, 2017","reviewText":"Came with everything in the thumbnail, takes some great photos and it's easy to use."},{"reviewerName":"Christina Smith","rating":"5.0 out of 5 stars","reviewTitle":"Great value","reviewDate":"September 18, 2018","reviewText":"This camera was exactly as advertised. It Is a great camera and it comes with so many accessories."},{"reviewerName":"Bebes","rating":"5.0 out of 5 stars","reviewTitle":"Amazing!","reviewDate":"January 25, 2018","reviewText":"Omg! I was so scared to buy it online but that was the best that happened to me. I love my camera!!!! I have use everything that comes in the package."},{"reviewerName":"Dale Petrie","rating":"5.0 out of 5 stars","reviewTitle":"very happy with it the only thing is I would like ...","reviewDate":"January 2, 2018","reviewText":"very happy with it the only thing is I would like to buy warranty where do I go when I made the purchase the xtra warranty did not come up to buy with it"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"This bundle was awesome! This was my first camera and it had ...","reviewDate":"September 7, 2017","reviewText":"This bundle was awesome! This was my first camera and it had way more than I needed but it had everything I do need. Great canon products, you can trust this bundle."},{"reviewerName":"Katie","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"November 12, 2017","reviewText":"love it !! Came with so many things and the camera is great!"},{"reviewerName":"Jon Smith","rating":"5.0 out of 5 stars","reviewTitle":"Great buy","reviewDate":"August 22, 2018","reviewText":"Came with a litany of extras that will allow you to take almost any type of photo for any occasion."},{"reviewerName":"Eronau","rating":"5.0 out of 5 stars","reviewTitle":"Great camera","reviewDate":"December 14, 2018","reviewText":"Absolutely love this camera!"},{"reviewerName":"Nola Y.","rating":"5.0 out of 5 stars","reviewTitle":"Great DSL bundle","reviewDate":"December 7, 2017","reviewText":"The camera itself is a great starter camera for someone that wants a DSL without spending upwards of a thousand dollars. The bundle comes with everything you need to get started. The Canon lenses are typicallly well made. The generic brand filters are \"ok\". The only one I will use consistently is the clear filter to protect the actual lens. The rest will most likely sit in the case. The rest of the bundle is good enough except for the tripod. Toss that thing away. It's junk. Get a real tripod and you are all set."},{"reviewerName":"Royner Umaña Garcia","rating":"5.0 out of 5 stars","reviewTitle":"Genail","reviewDate":"October 26, 2018","reviewText":"100% satisfecho"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"June 3, 2017","reviewText":"awesome awesome deal"},{"reviewerName":"Marvin","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"March 12, 2018","reviewText":"This is amazing camera,I like it a lot,thanks Amazon"},{"reviewerName":"Something For Every 1 Store","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"April 19, 2018","reviewText":"Very nice package! Great value!"},{"reviewerName":"Kindle Customer","rating":"5.0 out of 5 stars","reviewTitle":"Great camera to start with.","reviewDate":"October 17, 2018","reviewText":"A little hard to figure out but after googling stuff I was able to use my camera"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Awesome!","reviewDate":"January 20, 2019","reviewText":"Wow what a steal! This was a great package!"},{"reviewerName":"Gerardo Varela","rating":"5.0 out of 5 stars","reviewTitle":"gvc","reviewDate":"October 8, 2018","reviewText":"good..!!!!!!!!"},{"reviewerName":"Keleigh Kight","rating":"5.0 out of 5 stars","reviewTitle":"My kit is awesome even though I haven't got around to using all ...","reviewDate":"December 10, 2017","reviewText":"I bought my camera a few weeks ago and don't have one complaint. My kit is awesome even though I haven't got around to using all the items in it yet."},{"reviewerName":"laura","rating":"5.0 out of 5 stars","reviewTitle":"Best Product out there","reviewDate":"November 24, 2018","reviewText":"Really good product 😊 And of course the seller was a really nice person. Thank you"},{"reviewerName":"Linda Stephens","rating":"5.0 out of 5 stars","reviewTitle":"... it's box what you see is what you get great deal for a entry level","reviewDate":"February 17, 2017","reviewText":"everything is brand new in it's box what you see is what you get great deal for a entry level camera"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Low price for high quality","reviewDate":"January 30, 2019","reviewText":"Amazing bundle. Thank you"},{"reviewerName":"johanny","rating":"5.0 out of 5 stars","reviewTitle":"Me encanta","reviewDate":"April 23, 2019","reviewText":"Estoy encantada de esta inversión"},{"reviewerName":"ramoos","rating":"5.0 out of 5 stars","reviewTitle":"The pictures come out amazing.","reviewDate":"April 13, 2018","reviewText":"Exactly what was advertised!! I am enjoying it each time I take a new pic. The pictures come out amazing."},{"reviewerName":"Daysi R.","rating":"5.0 out of 5 stars","reviewTitle":"Good","reviewDate":"June 29, 2019","reviewText":"I like everything 😍😍"},{"reviewerName":"Sasha Rochelle","rating":"5.0 out of 5 stars","reviewTitle":"Good","reviewDate":"December 4, 2018","reviewText":"Awesome"},{"reviewerName":"Leah","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"February 24, 2018","reviewText":"I love all the extra's, the camera is fantastic!"},{"reviewerName":"Carlos Cruz","rating":"5.0 out of 5 stars","reviewTitle":"Starting to do photography as a hobby","reviewDate":"September 24, 2017","reviewText":"Shipped overnight, got it and it came with everything in the box plus an extra memory card. Camera quality is good. Stepping up from a camera phone.very pleased."},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"April 17, 2017","reviewText":"Just Great!! Easy to use"},{"reviewerName":"Paulina Marín Cruz","rating":"5.0 out of 5 stars","reviewTitle":"excellent","reviewDate":"January 18, 2019","reviewText":"everything as described"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"I like the camera it works well good price for what ...","reviewDate":"June 17, 2018","reviewText":"I like the camera it works well good price for what you get"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Excellent","reviewDate":"August 9, 2018","reviewText":"Excellent"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"May 22, 2017","reviewText":"Great Bundle. You have everything to start"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"January 25, 2018","reviewText":"Great camera package everything you need , I love Canon cameras"},{"reviewerName":"Karla","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"February 15, 2018","reviewText":"love it!! ... having so much fun using this camera thanks!"},{"reviewerName":"cyndi benoit","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"August 5, 2017","reviewText":"first canon camera I have owned and I love it."},{"reviewerName":"Erick Tag","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"June 26, 2018","reviewText":"AMAZING bundle!"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"October 8, 2017","reviewText":"Very good cámara with a lot accessories\nVery good price"},{"reviewerName":"TitanFan30","rating":"5.0 out of 5 stars","reviewTitle":"This camera is great!","reviewDate":"October 9, 2018","reviewText":"It is a very great camera!"},{"reviewerName":"Karmen","rating":"5.0 out of 5 stars","reviewTitle":"Must get it","reviewDate":"May 3, 2018","reviewText":"Fantastic and a bargain"},{"reviewerName":"Joseph","rating":"5.0 out of 5 stars","reviewTitle":"WOULD RECOMMEND","reviewDate":"September 29, 2018","reviewText":"Very pleased with everything that came in this bundle for the price!"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"December 11, 2017","reviewText":"great deal"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Loving it 100 %","reviewDate":"August 18, 2017","reviewText":"My husband loves his camera, takes it every where we go, he shot over 3000 pictures with this camera on our international trip had a great time."},{"reviewerName":"Amazon Customer","rating":"3.0 out of 5 stars","reviewTitle":"Prices","reviewDate":"February 10, 2019","reviewText":"Great"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"April 27, 2017","reviewText":"Excellente product!!!"},{"reviewerName":"Amaz0n Cust0mer","rating":"2.0 out of 5 stars","reviewTitle":"Broken tripod","reviewDate":"January 30, 2018","reviewText":"It’s the second time I buy from here. Camera is good. But tripod is broken."},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Great bundle!","reviewDate":"October 19, 2018","reviewText":"Lots of things ! So exciting, Tripp’s by far the best"},{"reviewerName":"Pablo david corado urbina","rating":"4.0 out of 5 stars","reviewTitle":"Great product though","reviewDate":"July 18, 2018","reviewText":"The 2 memory cards that are shown on the pictures weren’t there"},{"reviewerName":"fishdocrls","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"November 6, 2017","reviewText":"It's a great camera. Very easy to use and lots of accessories to figure out."},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"September 2, 2017","reviewText":"I am in love with this camera!"},{"reviewerName":"Maillebet Elie","rating":"5.0 out of 5 stars","reviewTitle":"Best camera","reviewDate":"December 11, 2018","reviewText":"Good quality"},{"reviewerName":"Elizabeth Smith","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"March 1, 2018","reviewText":"Excellent. Packaging was meticulous, products were top notch and bundle price was a steal."},{"reviewerName":"A.J.","rating":"5.0 out of 5 stars","reviewTitle":"Awesome","reviewDate":"May 5, 2019","reviewText":"Great"},{"reviewerName":"Christopher Triplett","rating":"5.0 out of 5 stars","reviewTitle":"Great","reviewDate":"January 13, 2019","reviewText":"Great and easy to use product!"},{"reviewerName":"anthony j gardner","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"January 31, 2018","reviewText":"Great package! Everything needed to get started and room to grow!"},{"reviewerName":"Keisha marshall","rating":"5.0 out of 5 stars","reviewTitle":"love","reviewDate":"January 30, 2018","reviewText":"Grate camera...love it"},{"reviewerName":"Frances","rating":"5.0 out of 5 stars","reviewTitle":"So pleased.","reviewDate":"March 28, 2017","reviewText":"Just received it. So pleased."},{"reviewerName":"Shannon Degenstein","rating":"4.0 out of 5 stars","reviewTitle":"Filters dont fit","reviewDate":"January 17, 2018","reviewText":"I love my camera. The only problem I had was the fact that the filters that were sent with it do not fit the lens."},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"June 19, 2017","reviewText":"I absolutely love this camera!! Great bundle! Thank you!"},{"reviewerName":"Patrick EDOUARD","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"June 20, 2018","reviewText":"It is a very good camera. I like this. I take a lot of good pictures with that."},{"reviewerName":"Kloe","rating":"5.0 out of 5 stars","reviewTitle":"Great Buy","reviewDate":"February 10, 2019","reviewText":"Great buy"},{"reviewerName":"Joel Zavala","rating":"5.0 out of 5 stars","reviewTitle":"Great","reviewDate":"February 26, 2019","reviewText":"Great"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"July 27, 2017","reviewText":"The detail of the item was exact and was shipped on time."},{"reviewerName":"Frank","rating":"5.0 out of 5 stars","reviewTitle":"Excelente para principiantes","reviewDate":"June 30, 2018","reviewText":"Muy buena cámara."},{"reviewerName":"Oscar","rating":"4.0 out of 5 stars","reviewTitle":"The external flash doesn't work","reviewDate":"September 5, 2018","reviewText":"The flash doesn't work. Everything else it's just right."},{"reviewerName":"Silverbelle97","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"January 9, 2018","reviewText":"I love this camera and with all the items that came with it the price is well worth it!"},{"reviewerName":"James H. Earnest Jr.","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"April 27, 2018","reviewText":"Nice camera and accessories. Came with OEM battery and 1 after market and 2 chargers."},{"reviewerName":"Christopher","rating":"5.0 out of 5 stars","reviewTitle":"Easy to use, great for beginners","reviewDate":"January 27, 2019","reviewText":"Good picture quality"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"March 7, 2018","reviewText":"For the money it was great came with a lot of extras"},{"reviewerName":"Vanessa jardon","rating":"5.0 out of 5 stars","reviewTitle":"I got a great deal best purchase I've made","reviewDate":"January 26, 2018","reviewText":"I honeslty thought this was a scam at first but nope haha. I got a great deal best purchase I've made!"},{"reviewerName":"Des","rating":"4.0 out of 5 stars","reviewTitle":"Four Stars","reviewDate":"November 30, 2017","reviewText":"It came with everything. The camera is lovely!"},{"reviewerName":"Shirley Cranford","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"March 17, 2018","reviewText":"So far so good. I just learning the difference future on the Camera. Still learning them."},{"reviewerName":"Jenewc","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"January 29, 2018","reviewText":"Great Camera and great bundle"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Packaged Beautifully.. Love It","reviewDate":"February 15, 2018","reviewText":"Everything Came As Said, Packaged Beautifully.. Love It, Good DSLR For Just Starting Out ."},{"reviewerName":"Amazon Customer","rating":"4.0 out of 5 stars","reviewTitle":"Great Product! Lots of value for the new-be and ...","reviewDate":"May 27, 2017","reviewText":"Great Product! Lots of value for the new-be and semi-pro!"},{"reviewerName":"Klare Damiani","rating":"5.0 out of 5 stars","reviewTitle":"Love it!!!","reviewDate":"March 20, 2017","reviewText":"Amazing!!! I read someone say the camera doesn't fit in the carry bag... it does, plus most of the accessories, including all the manuals. I haven't been out to take pics yet, but am anxious to!! I also read a review about the camera stand falling over with the camera on it. While it's not the greatest, it held the camera perfectly fine. The package was more then I hoped for, it even came a day early. I am very satisfied."},{"reviewerName":"Bernadette Lyden-Wilken","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"October 10, 2017","reviewText":"No problems"},{"reviewerName":"J Smith","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"December 3, 2017","reviewText":"Great price for everything that it comes with!!!"},{"reviewerName":"Daniel W. McCrackin","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"March 13, 2017","reviewText":"This is a great deal."},{"reviewerName":"Biak Lian","rating":"4.0 out of 5 stars","reviewTitle":"It is better if included used guid book or disc.","reviewDate":"August 24, 2018","reviewText":"I love it. And I used for my Chin community."},{"reviewerName":"Adam J","rating":"3.0 out of 5 stars","reviewTitle":"I personally love the camera and have not tried out all the ...","reviewDate":"July 13, 2017","reviewText":"I personally love the camera and have not tried out all the accessories. The issue I have, and why this product has a 3 star instead of a 5 star, is that the batteries will not hold a charge. I do not know if this is a fault of the two batteries I received or a faulty charger, but none the less, after a couple months of mild use, my batteries are completely dead."},{"reviewerName":"Jaden","rating":"5.0 out of 5 stars","reviewTitle":"Wow!","reviewDate":"May 16, 2017","reviewText":"An amazing deal!"},{"reviewerName":"Daniel Camargo Arruda","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"March 5, 2018","reviewText":"Great camera!"},{"reviewerName":"Julie Algaard","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"January 17, 2018","reviewText":"All the extras plus the camera was a great value!"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Impressed -- First Camera","reviewDate":"August 26, 2017","reviewText":"I cannot describe how satisfied I am with this product. I have never truly owned a camera (aside from the old school Kodak film cameras) and I am pleased with everything this bundle got tot offered. I purchased one because I want to somewhat take photos of memorable moments and my road trips to capture quality. This bundle offers such diverse gadgets for beginners like myself, with some cool filters for the lenses, extra battery, official canon bag, and 2 SD cards. I would totally recommend this product to anyone out there in the market for a new camera or as a gift. The additional lens it comes with is astonishing for long distance shots. I have attached a picture using the long distance lens, which is breathtaking. No filter necessary. Cannot wait to go out more and take some quality pictures with this camera. 10/10 recommend."},{"reviewerName":"Rochelle Peterson","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"March 7, 2018","reviewText":"Love it, it’s easy to use and takes wonderful pics"},{"reviewerName":"virginia browning","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"July 28, 2017","reviewText":"It's a great camera. I love it!"},{"reviewerName":"Janell","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"January 25, 2018","reviewText":"Love the camera! Exactly what was described!"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"July 3, 2017","reviewText":"Love this bundle package!! Lots to learn and explore with this and the price was great,"},{"reviewerName":"Vanessa Zavala","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"March 19, 2018","reviewText":"Absolutely awesome! I love it!"},{"reviewerName":"ANNA SOTO","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"March 28, 2018","reviewText":"I love it! The camara came with everything that shows in the picture."},{"reviewerName":"Tyler P","rating":"4.0 out of 5 stars","reviewTitle":"Four Stars","reviewDate":"April 1, 2018","reviewText":""},{"reviewerName":"Daiana Camila Gonzalez Patuto","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"September 27, 2017","reviewText":"Good product"},{"reviewerName":"Paul K. McTee","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"February 10, 2018","reviewText":"Love it, still learning new things every day about things I can do with it."},{"reviewerName":"Anonymous","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"December 13, 2017","reviewText":"Love the camera and accessories."},{"reviewerName":"R.Wafa","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"November 12, 2017","reviewText":"buy this product love it"},{"reviewerName":"Patricia Grzybowski","rating":"5.0 out of 5 stars","reviewTitle":"Overall a good","reviewDate":"January 26, 2018","reviewText":"I received everything in the order well packaged. Overall a good experience"},{"reviewerName":"Eddy Gutierrez","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"December 27, 2017","reviewText":"Great Camara"},{"reviewerName":"Loren Crumb","rating":"4.0 out of 5 stars","reviewTitle":"Easy to use and good pictures","reviewDate":"October 24, 2017","reviewText":"Camera has been used now and seems to be just what we wanted. Easy to use and good pictures."},{"reviewerName":"Adrian Acuña","rating":"5.0 out of 5 stars","reviewTitle":"Excelent!","reviewDate":"June 28, 2018","reviewText":"Excelent!"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"July 21, 2017","reviewText":"Great camera and great price."},{"reviewerName":"Charlotte","rating":"5.0 out of 5 stars","reviewTitle":"Great!","reviewDate":"July 23, 2017","reviewText":"Everything I wanted"},{"reviewerName":"Manny Ramirez","rating":"5.0 out of 5 stars","reviewTitle":"Well for me is a good cámara. Is a fun I like and love ...","reviewDate":"November 4, 2017","reviewText":"Well for me is a good cámara. Is a fun I like and love it.Is good for the fun I have."},{"reviewerName":"Lori T","rating":"5.0 out of 5 stars","reviewTitle":"Fantastic bundle!","reviewDate":"April 16, 2017","reviewText":"This whole package is amazing! My husband and I splurged with our tax return, and we can't believe what we got for the price. I bought a Nikon DSLR in 2009, and it was more expensive than this for only the camera and the lens. I'm still figuring everything out, but so far, I'm absolutely thrilled!"},{"reviewerName":"mamalife","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"March 24, 2018","reviewText":"Awesome, love the camera"},{"reviewerName":"Christina","rating":"5.0 out of 5 stars","reviewTitle":"Everything works with camera","reviewDate":"December 19, 2017","reviewText":"It came with everything shown! Beautiful camera! Can’t beat the price"},{"reviewerName":"Genus Munoz","rating":"5.0 out of 5 stars","reviewTitle":"Excellent camera and fast delivery","reviewDate":"October 8, 2017","reviewText":"Fast delivery... excellent camera... came with everything it said it would come with"},{"reviewerName":"Chweychex","rating":"5.0 out of 5 stars","reviewTitle":"AMAZING! Camera, price, accessories!","reviewDate":"January 20, 2017","reviewText":"I was beyond HAPPY with this bundle! It even arrived early (the day before Christmas eve) and it wasn't supposed to arrive until after Christmas! There was so much stuff in the box and it was all in the box / package. I was actually surprised by some of what was in there! You absolutely CANNOT beat the price for the camera/ accessories!"},{"reviewerName":"eva parson","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"March 17, 2018","reviewText":"For what I need this is fantastic."},{"reviewerName":"JULIAN GS","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"November 17, 2017","reviewText":"Absolutely awesome"},{"reviewerName":"Enrique Moncada","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"October 23, 2017","reviewText":"Excellent Camera for people who want to advance as professional photographers."},{"reviewerName":"Janelle","rating":"5.0 out of 5 stars","reviewTitle":"Love the pictures it takes.","reviewDate":"March 4, 2017","reviewText":"This is a great set! My daughter uses the same camera at picture people and it takes beautiful photos. Well worth the money."},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"September 1, 2017","reviewText":"Very good bundle. Delivery on time. The package came with all the accessories announced."},{"reviewerName":"Yuki","rating":"1.0 out of 5 stars","reviewTitle":"NOT RECOMMENDED","reviewDate":"July 20, 2017","reviewText":"I bought this pack, 3 months ago for my girlfriend. The original Canon battery and charger worked just fine but now the charger doesn’t charge anymore, it keeps on blinking when it has to show a continuous light. I have tried with both, the original and generic battery that came in the pack.\nI don't recommend this product, it works like a chinesse low performance product, I thought Canon was a good brand, now I know it's not. I need you to solve this problem of mine because it was a gift. I hope the other items from the package won't damage in a future."},{"reviewerName":"Tatiana Solera","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"September 3, 2017","reviewText":"Loved it! Original 18-55mm and 70-300mm Canon lenses, and a great bundle"},{"reviewerName":"wendy fearn","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"July 31, 2017","reviewText":"This is an amazing deal! I love the different lens and the camera is wonderful!"},{"reviewerName":"Julien Lebamoff","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"August 19, 2017","reviewText":"I've been using this camera for a while now and it is AMAZING"},{"reviewerName":"Hugo Campos","rating":"5.0 out of 5 stars","reviewTitle":"Worth it!","reviewDate":"August 16, 2017","reviewText":"High quality and awesome product, the acessories and gadgets that comes with it is very helpful."},{"reviewerName":"Brian","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"January 22, 2017","reviewText":"Great value tons of accessories"},{"reviewerName":"Trevor McGreevy","rating":"5.0 out of 5 stars","reviewTitle":"Everything is works good and is just as expected","reviewDate":"October 31, 2017","reviewText":"Came just as shown. Everything is works good and is just as expected."},{"reviewerName":"Dandy Don","rating":"5.0 out of 5 stars","reviewTitle":"I Think this camera is great although I am still learning how to use its ...","reviewDate":"June 22, 2017","reviewText":"I Think this camera is great although I am still learning how to use its many functions. Came with 2 SD Cards, 2 batteries and chargers. The Vivatar flash works great once I learned how to use it with the on camera flash. I don't really have any use for the close-up filters at this time. I used a film based SLR many years ago, but switched to small point and shoot cameras for vacation trips since I was tired of lugging the thing around. The pocket cameras allowed me to get many photos I would have never taken since I would have left the larger camera behind. Now I use both, but the Canon quality is so much better, versatile and consistent than the pockets cams."},{"reviewerName":"Martin Rene Partida Melchor","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"August 14, 2017","reviewText":"Excellent product"},{"reviewerName":"Travis C. Hudson","rating":"5.0 out of 5 stars","reviewTitle":"but with this camera I'm taking good pictures. Been trying out night shots in manual ...","reviewDate":"August 2, 2017","reviewText":"I'm no photographer by any means, but with this camera I'm taking good pictures. Been trying out night shots in manual settings and am starting to take good bright pictures. The accessories leave a bit to be desired, but I will be using one of the filters to glue solar film to, so I can photograph the upcoming eclipse. The macro lens adapter seems to be working good, but the wide angle one isn't that impressive. The extra charger, battery, and remote are real handy."},{"reviewerName":"michele","rating":"5.0 out of 5 stars","reviewTitle":"Great Deal","reviewDate":"October 27, 2017","reviewText":"Excellent package and awesome camera for beginners."},{"reviewerName":"Shahalis Phillips","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"March 22, 2018","reviewText":"I love this camera!"},{"reviewerName":"Sara","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"August 23, 2017","reviewText":"All of the accessories are of good quality, definitely worth it!"},{"reviewerName":"Nicole Cino","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"March 14, 2018","reviewText":"Love this camera !! Great pics !"},{"reviewerName":"Kindle Customer","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"October 19, 2017","reviewText":"Excellent bundle with all items included!"},{"reviewerName":"Steven A.","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"August 20, 2017","reviewText":"This Rebel T6 is a great bundle to buy you can't go wrong, love it."},{"reviewerName":"Reena","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"February 20, 2018","reviewText":"Very happy!!!"},{"reviewerName":"Jeremy C nichols","rating":"3.0 out of 5 stars","reviewTitle":"Misleading Product photo","reviewDate":"January 5, 2017","reviewText":"I know nothing about cameras I was going off mostly the photo for the accessories that were included. Product picture and description are a little misleading. Picture looks like it has an extra lens but you only get the one lens the comes with the comaera. It shows 2 batteries thinking I am getting 2 Cannon batteries. The cannon one that comes with the camera is on top but the one underneath with the name covered up is a third party. All accessories are just cheap third party stuff. I would rather have just bought the camera for $449 and spent the $20 on better quality products. Just FYI"},{"reviewerName":"Linneth barraza","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"October 30, 2017","reviewText":"Great camera with a lot of awesome accessories!!"},{"reviewerName":"Deantre","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"February 14, 2018","reviewText":"Great item"},{"reviewerName":"Victor J. Richard","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"September 19, 2017","reviewText":"Well worth it!"},{"reviewerName":"Aida","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"November 8, 2017","reviewText":"Great camera"},{"reviewerName":"Letica","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"December 20, 2017","reviewText":"love it comes with every thing"},{"reviewerName":"NPC","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"September 5, 2017","reviewText":"Recommend others to get this bundle"},{"reviewerName":"Lobo","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"February 2, 2018","reviewText":"A+"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Future in a Box","reviewDate":"March 30, 2017","reviewText":"Excited for the new heights I'm going to go from this great deal!"},{"reviewerName":"Danny Van Huss","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"September 12, 2017","reviewText":"Met all my expectations thanks"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Great","reviewDate":"January 10, 2017","reviewText":"Everything came nice and neat, was cautious at first but glad I went with this deal."},{"reviewerName":"Edward Corbitt","rating":"4.0 out of 5 stars","reviewTitle":"Happy so far","reviewDate":"March 28, 2017","reviewText":"Happy so far. Aside from the two lenses, the quality of accessories is on the low end of the scale. That was to be expected. However, the camera is the only reason to buy the bundle, and it is just what I want. I've also been impressed with the batteries. During recent trips to the Monterey peninsula and Maui, I shot and reviewed over one thousand photos. The batteries never let me down. I'm not a master of photography, but I do possess enough knowledge to set up a shot while shooting RAW. This camera offers more than enough flexibility for what I do. I plan to add a Canon EF 50mm f/1.8 lens to the set. With that addition, I will have everything I desire and it should serve me well for many years."},{"reviewerName":"Luis Avalos","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"September 14, 2017","reviewText":"Fully satisfied. Thanks!"},{"reviewerName":"laura bordagaray","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"November 4, 2017","reviewText":"Everything was as described"},{"reviewerName":"Jacquelynn Carcone","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"November 17, 2017","reviewText":"Love it!!"},{"reviewerName":"Ryan Brown","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"October 23, 2017","reviewText":"Quality camera"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"October 31, 2017","reviewText":"Good quality"},{"reviewerName":"Matheus","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"August 24, 2017","reviewText":"The quality of the camera is excellent!"},{"reviewerName":"laurie louk","rating":"4.0 out of 5 stars","reviewTitle":"Four Stars","reviewDate":"March 15, 2017","reviewText":"Its was a great deal... and a great camera"},{"reviewerName":"Taylore","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"May 31, 2017","reviewText":"love canon!"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"January 30, 2017","reviewText":"Great package! Love it"},{"reviewerName":"mau1992","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"January 16, 2018","reviewText":"Ee"},{"reviewerName":"HAYRTON C","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"July 27, 2017","reviewText":"Excellent! It met all my expectations!"},{"reviewerName":"Jeanette Wimberley","rating":"5.0 out of 5 stars","reviewTitle":"Great buy!","reviewDate":"April 15, 2017","reviewText":"Everything arrived right on time. Great buy!"},{"reviewerName":"Luis","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"August 6, 2017","reviewText":"Excellent purchase !"},{"reviewerName":"Brittany C.","rating":"4.0 out of 5 stars","reviewTitle":"Great camera for beginners with an AMAZING price","reviewDate":"February 1, 2017","reviewText":"I LOVE this camera! I had been using my friend's for the longest time before purchasing it for myself, and it is a great beginner professional DSLR camera. Takes quality photos, is easy to use, and doesn't break the bank. I'm not sure if all the extra goodies is worth it, as I have only used the stock lens, the tripod, the neck strap, bag, and SD cards so far, but I will hopefully try them out soon! All in all, this is definitely a worth it purchase if you are just starting out learning about photography and want to be able to take quality photographs.Canon EOS Rebel T6 DSLR Camera Bundle with Canon EF-S 18-55mm f/3.5-5.6 IS II Lens + Canon EF 75-300mm f/4-5.6 III Lens + 2pc SanDisk 32GB Memory Cards + Accessory Kit"},{"reviewerName":"angelstar","rating":"5.0 out of 5 stars","reviewTitle":"Fantastic camera! Love it!","reviewDate":"February 7, 2017","reviewText":"Very pleased with the Canon Rebel T6!!! Fantastic, clear pictures and still learning all of the great features this camera offers!! Love it!! Fantastic price for the bundle! Thanks Amazon!!"},{"reviewerName":"Kara Mizell","rating":"4.0 out of 5 stars","reviewTitle":"Four Stars","reviewDate":"May 13, 2017","reviewText":"Very easy to use!"},{"reviewerName":"Haroon Montas","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"May 23, 2017","reviewText":"I love it"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"December 31, 2016","reviewText":"Good camera"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"May 25, 2017","reviewText":"Love this camera."},{"reviewerName":"William A. Wallace","rating":"5.0 out of 5 stars","reviewTitle":"Cannon T6","reviewDate":"March 28, 2017","reviewText":"WNo problems with my camera."},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"August 24, 2017","reviewText":"Great camera"},{"reviewerName":"Fredi","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"August 16, 2017","reviewText":"Muy buenaa."},{"reviewerName":"Jacky","rating":"5.0 out of 5 stars","reviewTitle":"I absolutely loved this camera","reviewDate":"November 21, 2017","reviewText":"I absolutely loved this camera, it takes really amazing shots. And it’s nice that it comes with 2 batteries so you’ll never run out of battery life."},{"reviewerName":"Artie","rating":"5.0 out of 5 stars","reviewTitle":"Great Entry Level Bundle","reviewDate":"August 13, 2017","reviewText":"Good deal"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"March 27, 2017","reviewText":"The camera is great"},{"reviewerName":"Nick G","rating":"4.0 out of 5 stars","reviewTitle":"Great Bundle, but a few things to note.","reviewDate":"June 10, 2017","reviewText":"Of all of the things that come in the bundle, a few things should be addressed. When using the tripod, your camera will just barely sit unevenly, due to the lack of support on the one side. The only use for the SD card reader would be if you didn't have an SD card slot to insert it in, which is almost always comes factory with anything that also has a ISB port. Finally, the slave flash isn't compatible with this camera. Ive tried different methods of using it, but after some research, I found that this external flash will never work with the T6 Rebel. Other than that, it was a great deal!"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"June 12, 2017","reviewText":"Love it!"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"May 21, 2017","reviewText":"Love it!!'"},{"reviewerName":"Erin F.","rating":"5.0 out of 5 stars","reviewTitle":"I would strongly recommend this Amizon partner","reviewDate":"March 29, 2017","reviewText":"Items came fast/on time. Unfortunately I had to return the camera bundle do to the Canon T6 does not have a forward facing flip screen.\nI would strongly recommend this Amizon partner. Everything came as advertised. I'm just sorry I couldn't have kept it. Great camera choice!"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"March 28, 2017","reviewText":"Nice bundle"},{"reviewerName":"Debra Azevedo","rating":"5.0 out of 5 stars","reviewTitle":"she is loving all the accessories and the beautiful pictures it takes","reviewDate":"January 5, 2017","reviewText":"Gave to daughter as a Christmas gift, she is loving all the accessories and the beautiful pictures it takes."},{"reviewerName":"David Smith","rating":"5.0 out of 5 stars","reviewTitle":"Love it so far!","reviewDate":"February 3, 2017","reviewText":"So far very pleased with this bundle. Does not include the longer lens, but I knew that and wanted to save the $100 for now and add that lens later.\nOnly issue so far is battery life. My battery seems to be dead when i go to use the camera if i leave it in, even if the camera is off. I have not fully read the user manual, so could be something that i am doing. However they do provide 2 batteries, so i always have a charged one in there anyway. Still learning all the modes and features, but have some great pics so far!"},{"reviewerName":"Taylor","rating":"3.0 out of 5 stars","reviewTitle":"The camera itself was nice and for all you get it's a great deal","reviewDate":"September 28, 2017","reviewText":"The camera itself was nice and for all you get it's a great deal, however not all the accessories are compatible with these lenses. If you're getting this for the accessories choose a different bundle"},{"reviewerName":"Regular Dan","rating":"2.0 out of 5 stars","reviewTitle":"What they don't tell you","reviewDate":"March 15, 2018","reviewText":"Yes, this camera works fine for taking pictures. What they don't tell you:\n* You cant attach an external Mic- and audio quality is poor\n* The wifi doesn't' stay connected. Everytime we use it we have to go through the process of reconnecting"},{"reviewerName":"Wendy","rating":"3.0 out of 5 stars","reviewTitle":"Great camera but accessories not worth it.","reviewDate":"August 8, 2017","reviewText":"Camera is excellent however the accessories are cheap knock offs. Not worth the extra money to get the accessories included with the camera."},{"reviewerName":"Diane","rating":"5.0 out of 5 stars","reviewTitle":"I have already taken some beautiful shots that are worthy of framing and for the ...","reviewDate":"March 27, 2017","reviewText":"I am having a blast with this camera. I have already taken some beautiful shots that are worthy of framing and for the price you can't beat this set."},{"reviewerName":"Celeste Lausier","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"August 15, 2017","reviewText":""},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Awesome value","reviewDate":"June 24, 2017","reviewText":"Awesome bundle, in the store you can buy the same camera....just the camera with none of the extras.. so definitely do the bundle"},{"reviewerName":"Kelly","rating":"5.0 out of 5 stars","reviewTitle":"Awesome bundle. Everything you could need and MORE","reviewDate":"February 25, 2017","reviewText":"Awesome bundle. Everything you could need and MORE. You will not regret this purchase."},{"reviewerName":"Rac18320","rating":"2.0 out of 5 stars","reviewTitle":"Bad battery","reviewDate":"June 7, 2017","reviewText":"I just got this yesterday. The extra battery is not a Canon branded battery and will not charge. None of the extras set Canon branded, so I'm hoping everything else works."},{"reviewerName":"Susan","rating":"5.0 out of 5 stars","reviewTitle":"Great camera bundle","reviewDate":"January 17, 2018","reviewText":"This was such a great camera bundle! The camera is good quality and easy to use for beginners like me."},{"reviewerName":"Carla Richardson","rating":"5.0 out of 5 stars","reviewTitle":"and I absolutely love it. With not a lot of know-how","reviewDate":"November 2, 2017","reviewText":"I replaced my Nikon with this Canon, and I absolutely love it. With not a lot of know-how, I can operate this camera and it takes incredibly clear, crisp pictures. My only gripe is the quality of the tripod, but that's an easy fix."},{"reviewerName":"TrialByFire","rating":"3.0 out of 5 stars","reviewTitle":"Baaaaaaaad Flash","reviewDate":"January 17, 2017","reviewText":"Great camera, plenty of accessories. The bad thing about it is that the flash died the first time I used it. Still recommend it, just bring your own flash."},{"reviewerName":"Margo C.","rating":"4.0 out of 5 stars","reviewTitle":"Overall decent bundle","reviewDate":"March 29, 2017","reviewText":"Overall a decent bundle. As expected some of the items I plan to replace with more quality products because they are obviously cheap. Tripod is not horrible by any means just not as sturdy as you would want it to be when trusting it to hold a $600 camera setup, it would be perfect for a point and shoot camera. Flash is ok but I plan to upgrade it to something else. I don't trust the battery but that's because it's not a canon branded battery and I don't plan to use it also the second non canon charger is flimsy and doesn't hold the battery very well. I received all the items advertised and they were what was advertised if anyone was worried about the larger lenses not actually being canon they are."},{"reviewerName":"Sonya","rating":"5.0 out of 5 stars","reviewTitle":"This is a great package and a great user friendly camera for beginners","reviewDate":"January 4, 2017","reviewText":"This is a great package and a great user friendly camera for beginners, which is what I am. I got a fast delivery and everything pictured was received."},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Great value","reviewDate":"December 20, 2016","reviewText":"Everything I could ask for in a beginners camera."},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"January 18, 2017","reviewText":"Great value and excellent camera"},{"reviewerName":"chica brava","rating":"5.0 out of 5 stars","reviewTitle":"Wonderful product,","reviewDate":"March 5, 2017","reviewText":"Great camera, super deal--now if only I had the time sit down and figure it out!\nThat will come...eager to get some good portraits...sunsets...surf videos!"},{"reviewerName":"Karen Lewis","rating":"1.0 out of 5 stars","reviewTitle":"Some accessories not included","reviewDate":"May 24, 2017","reviewText":"Good camera. Just didn't come with all the accessories shown in the picture. Missing flash, which is what I really wanted with the camera. I just used the camera for the first time and was highly disappointed when I opens the box and no flash was found and it was too late to return. If you buy this camera, I would check immediately to see if all accessories are included."},{"reviewerName":"Kimmy","rating":"5.0 out of 5 stars","reviewTitle":"Just came in today and I am in love 😍 First DSLR camera and I bought this to ...","reviewDate":"March 2, 2017","reviewText":"Just came in today and I am in love 😍 First DSLR camera and I bought this to take pictures of my kids and my business products. So many accessories for the price. Highly recommend"},{"reviewerName":"Bradley W.","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"January 13, 2017","reviewText":"Excellent value"},{"reviewerName":"Karen Perasso","rating":"5.0 out of 5 stars","reviewTitle":"Great package for any need","reviewDate":"February 2, 2017","reviewText":"Great package for any need. Arrived quickly, easy to use. I hope to learn how to use all the features during our travels this year."},{"reviewerName":"Amazon Customer","rating":"3.0 out of 5 stars","reviewTitle":"Three Stars","reviewDate":"March 18, 2017","reviewText":"I just thought this bundle would've been better quality."},{"reviewerName":"Sol McNally","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"March 21, 2017","reviewText":"Takes great photos. Great deal!"},{"reviewerName":"Lakyia","rating":"4.0 out of 5 stars","reviewTitle":"Focus Issues","reviewDate":"June 20, 2017","reviewText":"sometimes the camera won't focus and you have to swap original lens for wide or 2.2x lens just to get it to focus again. Then you put your original lens back on."},{"reviewerName":"B. Johnson","rating":"4.0 out of 5 stars","reviewTitle":"No mic port","reviewDate":"October 4, 2017","reviewText":"Its a great camera, the only reason its not a 5 star is because it doesnt have a Mic port 😑"},{"reviewerName":"Kiwi","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"April 27, 2017","reviewText":"pretty great"},{"reviewerName":"Bobbibibb","rating":"5.0 out of 5 stars","reviewTitle":"Great buy.","reviewDate":"March 18, 2017","reviewText":"Beyond expectations!"},{"reviewerName":"Philip D Keighley","rating":"2.0 out of 5 stars","reviewTitle":"Don’t bother","reviewDate":"February 10, 2018","reviewText":"Canon camera and tele lense and bag. Everything else not Canon brand (which was never implied, just an FYI) Absolute trash tripod. No response from seller about this."},{"reviewerName":"Nita","rating":"3.0 out of 5 stars","reviewTitle":"Three Stars","reviewDate":"January 29, 2018","reviewText":"extra battery is not canon one. flash don't work but as average."},{"reviewerName":"Emilija Poposki","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"October 13, 2017","reviewText":"the camera is great and the value of this package is amazing"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Great deal","reviewDate":"November 17, 2017","reviewText":"Super combo set. Perfect for my son in photography class."},{"reviewerName":"Scoobydoo","rating":"5.0 out of 5 stars","reviewTitle":"Great camera!","reviewDate":"September 19, 2017","reviewText":"This camera bundle was priced right for what I was looking for, it came with everything shown and had brand names on the things it said it would. The camera has endless features, this amateur will be busy learning them all for quite some time."},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"It's the first camera I've owned and I love how much stuff was included in the bundle","reviewDate":"April 12, 2017","reviewText":"It's the first camera I've owned and I love how much stuff was included in the bundle. I am excited to use it and see all the different tools! Everything was packaged extremely well. Great Product!"},{"reviewerName":"Brian Bear","rating":"4.0 out of 5 stars","reviewTitle":"Great Purchase","reviewDate":"January 8, 2017","reviewText":"Great camera and great accessory kit too!\nGreat way to start off the photography journey:-)"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Great Choice","reviewDate":"February 13, 2017","reviewText":"I purchased this camera bundle for my daughter Mackenzie Skye for her Digital Photography Class. She is in love with it, she's only had a beginning SLR Class. Great choice"},{"reviewerName":"Amazon Customer","rating":"3.0 out of 5 stars","reviewTitle":"The problem I have with the package is that the ...","reviewDate":"January 23, 2018","reviewText":"The problem I have with the package is that the tripod is so cheap and flimsy that I would never mount a camera and leave unattended. In my opinion it adds nothing to the bundle and should be noted in the description if it remains part of the product. It was an Amazon selection. I think you could have done better"},{"reviewerName":"Duane L.","rating":"4.0 out of 5 stars","reviewTitle":"Four Stars","reviewDate":"August 19, 2017","reviewText":"came with a lot of little nice extras."},{"reviewerName":"Kindle Customer","rating":"4.0 out of 5 stars","reviewTitle":"Four Stars","reviewDate":"January 16, 2018","reviewText":"Still learning how it all works"},{"reviewerName":"Richard O","rating":"4.0 out of 5 stars","reviewTitle":"Great Package","reviewDate":"January 8, 2018","reviewText":"Gave this to my wife for Christmas. Works very well and pretty easy to learn how to use. Lots of YouTube instructions on the model.."},{"reviewerName":"Ivo Da Silva","rating":"3.0 out of 5 stars","reviewTitle":"Three Stars","reviewDate":"February 15, 2017","reviewText":"Good camera, some additional items were not good quality"},{"reviewerName":"E. Dixon","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"February 5, 2017","reviewText":"love it. price was exceptionally good for what you get."},{"reviewerName":"Amazon Customer","rating":"4.0 out of 5 stars","reviewTitle":"Gift","reviewDate":"May 26, 2017","reviewText":"It's a gift so it can't be properly rated but I am sure it will make tat person as happy as my friends are with theirs'."},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Perfect starter kit","reviewDate":"January 11, 2017","reviewText":"Christmas gift for my 18 year old daughter. She loves it, great starter kit! Lots of attachments to give her a variety of photography practice. Would recommend for anyone looking for an all-in-one kit."},{"reviewerName":"J P","rating":"4.0 out of 5 stars","reviewTitle":"Four Stars","reviewDate":"July 2, 2017","reviewText":"I like it."},{"reviewerName":"Michael J. Dolan","rating":"5.0 out of 5 stars","reviewTitle":"The best camera I have ever used.","reviewDate":"April 2, 2017","reviewText":"The best camera I have ever used. takes great pictures with little hassle."},{"reviewerName":"Jaccob Hirt","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"March 18, 2017","reviewText":"I personally couldn't be happier. It's a great camera and comes with all of the essentials and more."},{"reviewerName":"rebecca williams","rating":"5.0 out of 5 stars","reviewTitle":"Love it","reviewDate":"April 26, 2017","reviewText":"It was everything I expected and I am enjoying it"},{"reviewerName":"Ray R.","rating":"5.0 out of 5 stars","reviewTitle":"Loves it!","reviewDate":"March 22, 2017","reviewText":"Bought it for a friend and she absolutely loves it!"},{"reviewerName":"Lee Griffin","rating":"4.0 out of 5 stars","reviewTitle":"but some of the accessories are pretty useful. The stand is a joke","reviewDate":"March 5, 2017","reviewText":"Mainly bought for the camera, but some of the accessories are pretty useful. The stand is a joke, broke the first time I used it. Same with some of the extra macro lenses. All in all you aren't paying more than you would to get just the camera. If you are a beginner, this kit will teach you how to use the accessories before you know exactly what kind of accessories you want to use."},{"reviewerName":"Chris M Pearson","rating":"5.0 out of 5 stars","reviewTitle":"Awesome package and product!","reviewDate":"January 4, 2017","reviewText":"Perfect! Exactly what I was looking for!"},{"reviewerName":"Miranda Nason","rating":"5.0 out of 5 stars","reviewTitle":"I love my canon rebel t6 it takes amazing photos and ...","reviewDate":"January 17, 2017","reviewText":"I love my canon rebel t6 it takes amazing photos and came with a lot of stuff for the price"},{"reviewerName":"Facebook","rating":"5.0 out of 5 stars","reviewTitle":"Just as described and works great!","reviewDate":"March 16, 2017","reviewText":"Fast shipping. Just as described and works great!"},{"reviewerName":"etelka","rating":"5.0 out of 5 stars","reviewTitle":"Buy it","reviewDate":"December 10, 2017","reviewText":"Very funny and complete"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"I Couldn't be more happier with my Rebel","reviewDate":"May 2, 2017","reviewText":"Wow what a steal ! I Couldn't be more happier with my Rebel. I've been shooting with it for over a month now and still no complaints !"},{"reviewerName":"Daniel Hunter","rating":"5.0 out of 5 stars","reviewTitle":"great pictures","reviewDate":"September 8, 2017","reviewText":"Great, multi-purpose camera."},{"reviewerName":"sarah noble","rating":"5.0 out of 5 stars","reviewTitle":"This camera is fantastic. And the bundle is a great startup kit ...","reviewDate":"February 25, 2017","reviewText":"This camera is fantastic. And the bundle is a great startup kit making the step into photography. It's got a ton of fancy settings and it's easy to use!"},{"reviewerName":"Dani Lunsford","rating":"3.0 out of 5 stars","reviewTitle":"Three Stars","reviewDate":"November 3, 2017","reviewText":"Turns out those are lense adapters not lenses. I was confused."},{"reviewerName":"rebecca kendrick","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"December 2, 2016","reviewText":"Very happy thanks for the quick shipping as well A+++"},{"reviewerName":"Mark Johnson","rating":"5.0 out of 5 stars","reviewTitle":"You won't find a better deal elsewhere","reviewDate":"January 24, 2017","reviewText":"Great deal. Unfortunately i purchased for $600 and the next week the price drops to $549. I could now have purchased a more higher end model but it was a price drop for all sellers.\n\nBut this is a great camera bundle lots of accessories, you won't find a better deal elsewhere. No I will say you will need a better tripod."},{"reviewerName":"SunniDread","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"February 13, 2017","reviewText":"Love my camera !"},{"reviewerName":"Kiana Young","rating":"1.0 out of 5 stars","reviewTitle":"One Star","reviewDate":"February 17, 2017","reviewText":"Did not have memory cards in the package. I want my memory cards."},{"reviewerName":"wendy nicole ruiz","rating":"5.0 out of 5 stars","reviewTitle":"Shipping was great!! Would highly recommend this product","reviewDate":"December 25, 2016","reviewText":"Shipping was great!! Would highly recommend this product! It came with lots of accessories and was perfect for my daughter!"},{"reviewerName":"Enoch Hamilton","rating":"4.0 out of 5 stars","reviewTitle":"I am very happy with everything in the package","reviewDate":"August 31, 2017","reviewText":"I am very happy with everything in the package..this package has everything you will need to get started taking photos"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Great Deal!","reviewDate":"May 11, 2017","reviewText":"The package deal contained all necessary equipment for the camera and saved hundreds of dollars if items were purchased separately."},{"reviewerName":"Lisa Kirschke","rating":"4.0 out of 5 stars","reviewTitle":"Four Stars","reviewDate":"August 16, 2017","reviewText":"Some of the products are off brands and not the highest quality but otherwise everything works well"},{"reviewerName":"madeline","rating":"4.0 out of 5 stars","reviewTitle":"It works really great! I love it and definitely think it was ...","reviewDate":"January 13, 2018","reviewText":"It works really great! I love it and definitely think it was a great price for everything that comes with it."},{"reviewerName":"btk711","rating":"3.0 out of 5 stars","reviewTitle":"Camera is great accessories are poor quality","reviewDate":"February 28, 2017","reviewText":"Camera works great but the cheap Vivitar parts do not work very well. Debating on returning due to the poor quality of the accessories.... Will try to give it a couple days to see if any more of the accessories are not working properly."},{"reviewerName":"TP in SFL","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"November 3, 2017","reviewText":"nephew is getting into photography, thought this is would get him started ."},{"reviewerName":"elver r.","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"May 14, 2017","reviewText":"It's been very helpful to my needs"},{"reviewerName":"Armando Feliciano","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"May 23, 2017","reviewText":"Great Package"},{"reviewerName":"7262728","rating":"5.0 out of 5 stars","reviewTitle":"Camera works great!","reviewDate":"October 6, 2017","reviewText":"It came on time and included all of the little extras. Camera works great!"},{"reviewerName":"Mariano Urman","rating":"5.0 out of 5 stars","reviewTitle":"Great entry level camera","reviewDate":"April 1, 2017","reviewText":"Great entry level camera, good value for the price"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Great set up","reviewDate":"February 16, 2017","reviewText":"It was a present for my daughter and she loves it"},{"reviewerName":"Jia","rating":"4.0 out of 5 stars","reviewTitle":"Four Stars","reviewDate":"February 10, 2017","reviewText":"I like it ~!!!"},{"reviewerName":"AmazonTom","rating":"4.0 out of 5 stars","reviewTitle":"A great bundle.","reviewDate":"December 31, 2016","reviewText":"As advertised. A great bundle."},{"reviewerName":"Amazon Customer","rating":"1.0 out of 5 stars","reviewTitle":"No Tripod/Missing Accessories","reviewDate":"October 10, 2017","reviewText":"I didn't get the tripod I was supposed to receive."},{"reviewerName":"CRue612","rating":"4.0 out of 5 stars","reviewTitle":"and two SD card are great.","reviewDate":"April 23, 2017","reviewText":"The camera does everything advertised and more. The tripod is chinsey, it would work in a pinch. The extra battery, battery charger, and two SD card are great."},{"reviewerName":"Amazon Customer","rating":"4.0 out of 5 stars","reviewTitle":"Slightly disappointed. Ordered a different package originally and canceled/will be ...","reviewDate":"March 15, 2017","reviewText":"Slightly disappointed. Ordered a different package originally and canceled/will be returning because I found this package. The image makes it seem like all components are Canon brand... they are not. My tripod came all beat up with several scratches. It is a great starter package, since I am new to photography. I just feel like this was false advertisement. The description should indicate what brand the accessories you're receiving are."},{"reviewerName":"Amazon Customer","rating":"4.0 out of 5 stars","reviewTitle":"Four Stars","reviewDate":"January 16, 2017","reviewText":"It's great, but it should be noted that this device actually continuously shoots at 3 fps, not 5."},{"reviewerName":"Webster McClellen","rating":"2.0 out of 5 stars","reviewTitle":"No external microphone plug","reviewDate":"December 29, 2017","reviewText":"I sent this one back. Be aware, this camera does NOT have an external microphone capacity. No one says anything about its limits in the ad, but you must buy a T6i to get that capacity. So I had to return it and upgrade ($150 about more) to the T6i."},{"reviewerName":"jill","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"January 10, 2017","reviewText":"Very happy with my purchase!"},{"reviewerName":"David A. Velasquez","rating":"4.0 out of 5 stars","reviewTitle":"Four Stars","reviewDate":"January 23, 2017","reviewText":"Very nice camera and accessories\nGreat price"},{"reviewerName":"Denzel Taylor","rating":"5.0 out of 5 stars","reviewTitle":"Awesome deal","reviewDate":"January 5, 2017","reviewText":"Fantastic deal. Best deal for a starter camera and accessories. Only issue is that the tripod is small and the bundle doesn't come with an SD card reader."},{"reviewerName":"stephanie robinson","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"January 2, 2017","reviewText":"Fantastic camera, especially for a beginner. Was a Christmas gift for my daughter, and she loves it."},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Everything about this bundle is amazing. I love the camera","reviewDate":"January 13, 2017","reviewText":"Everything about this bundle is amazing. I love the camera, it takes amazing photos. On top of that all of the accessories are great and fun to try out! Highly recommend as you won't find a deal like this in stores."},{"reviewerName":"mel","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"January 13, 2017","reviewText":"This product was received as shown. Given as a gift."},{"reviewerName":"mlc","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"January 22, 2017","reviewText":"Looks like some great stuff. This was gift, I'm sure will get much use"},{"reviewerName":"FRANCIS","rating":"2.0 out of 5 stars","reviewTitle":"Two Stars","reviewDate":"March 23, 2017","reviewText":"One of the lenses cannot operate in AF mode"},{"reviewerName":"Carter","rating":"3.0 out of 5 stars","reviewTitle":"Three Stars","reviewDate":"January 29, 2018","reviewText":"cant wait this one will take tie to learn"},{"reviewerName":"Herman Deyette","rating":"5.0 out of 5 stars","reviewTitle":"but for the times when detail isn't as important like working with scapes and clouds","reviewDate":"December 9, 2016","reviewText":"Own the 710IS Powershot. Been a fan of the Powershot and the Rebel is so much easier to use, but for the times when detail isn't as important like working with scapes and clouds, would still use the Powershot as a space saver and point and shoot."},{"reviewerName":"Daisy","rating":"5.0 out of 5 stars","reviewTitle":"Canon EOS Rebel T6 DSLR Camera","reviewDate":"December 25, 2016","reviewText":"Five Star Rating! Meets expectations & package\nwas nicely put together for shipping from the\nseller. Highly recommended!!"},{"reviewerName":"Rachel","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"February 3, 2017","reviewText":"Excellent"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"December 8, 2016","reviewText":"excellent! Fast shipping, all accessories came in! The camera is great"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Awesome","reviewDate":"December 27, 2016","reviewText":"I bought as a gift for my gf and she loves it. Great value and great package"},{"reviewerName":"Nihx Knows","rating":"5.0 out of 5 stars","reviewTitle":"Does The Job Well","reviewDate":"January 5, 2017","reviewText":"Came quickly, a day early even with standard shipping. Everything was as expected. Great value. Some of the accessories are a bit on the cheaper side but doesn't affect quality much or the performance. I.e. the tripod. What matters is better quality like the lenses n filters. Which come with cases for them. I'm already taking good pictures without knowing much of the how tos. Oh and LOVE the wireless feature. Uts so easy to share a quick photo using canon connect!"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"January 21, 2017","reviewText":"Arrived as expected"},{"reviewerName":"Victoria L.","rating":"3.0 out of 5 stars","reviewTitle":"It's a Start","reviewDate":"March 16, 2017","reviewText":"I'm a hobbyist and am overall pleased with the camera; however, I cannot say the same for the rest of the bundle. The first time I removed a lens from the camera it came apart. After slicing my hand a bit trying to remove the bottom most piece and a few youtube videos, I was able to separate the bottom piece from the camera. The tripod is cheap looking. I thought there was no way it could support the weight of the camera. Sure enough, when I set it all up I had to catch the tripod/camera due to it being unable to handle the weight. I have the camera I have saved up years for, which I guess is what matters, but it would be nice if the accessories it came with held it together longer after spending so much money."},{"reviewerName":"Amazon Customer","rating":"1.0 out of 5 stars","reviewTitle":"One Star","reviewDate":"November 13, 2017","reviewText":"Dice que fue entregado y no es así"},{"reviewerName":"Alex","rating":"1.0 out of 5 stars","reviewTitle":"in the trash it goes then","reviewDate":"February 23, 2018","reviewText":"HEY this isnt a PET ROCK this is just a STUPID CAMREA"},{"reviewerName":"Amazon Customer","rating":"3.0 out of 5 stars","reviewTitle":"Three Stars","reviewDate":"July 28, 2017","reviewText":"Not so good."},{"reviewerName":"Anthony","rating":"4.0 out of 5 stars","reviewTitle":"Just like the add says","reviewDate":"January 11, 2017","reviewText":"Just like the add says, very nice camera. However I live in Utah, Amazon now collects sales tax for Utah. I will not be buying anything from Amazon again."},{"reviewerName":"Nicholas","rating":"5.0 out of 5 stars","reviewTitle":"Amazing product","reviewDate":"December 21, 2016","reviewText":"I am a starter photographer and I love it it has everything you need to start in photography!"},{"reviewerName":"R. Duncan","rating":"1.0 out of 5 stars","reviewTitle":"Product doesn't work","reviewDate":"April 15, 2017","reviewText":"I would have given it no stars if I could have.\nBought it in January, just getting around to using it and it doesn't work"},{"reviewerName":"Amazon Customer","rating":"4.0 out of 5 stars","reviewTitle":"Four Stars","reviewDate":"January 10, 2017","reviewText":"Very happy with the camera"},{"reviewerName":"Jeck","rating":"2.0 out of 5 stars","reviewTitle":"The Macro Lense ruined my 75-300mm","reviewDate":"May 6, 2017","reviewText":"Well, someones upset and its me.\n\nRunning a photography business means you need more than one camera. I bought this bundle for one of my employees giving him a good start into the company. The Vikitar 2.2x Telephoto macro lens this bundle comes with, looked really nice.... Before I go to far, lemme give ya a pro/con\n\nPros:\n- Rebel T6 - really nice starter camera\n- 32gb cards, good for about 4000 jpegs or 1000 raws\n- 2 batteries\n- comes with both standard lens\n\nCons:\n- tripod is absolute crap\n- UV filters are useless\n- THE MACRO LENSES\n\nTHE VIVITAR 2.2X TELEPHOTO MACRO LENS IT CAME WITH TOOK MY ENTIRE FRONT LENS OFF MY 75-300MM LENS. OR WHATVER YOU CALL IT. I WAS SHOWING HIM HOW TO SCREW IT ON AND OFF AND HAVE USED PLENTY OF MACROS BEFORE AND THIS ONE UNSCREWED THE FRONT THREADS AND THE LENS FELL OUT AND SHATTERED.\n\nDO NOT USE THE MACRO LENSES IN THIS BUNDLE. PLEASE DO NOT LET IT HAPPEN TO YOU."},{"reviewerName":"Amazon Customer","rating":"1.0 out of 5 stars","reviewTitle":"One Star","reviewDate":"November 10, 2017","reviewText":"bad quality"},{"reviewerName":"JASON","rating":"5.0 out of 5 stars","reviewTitle":"Good beginner camera.","reviewDate":"December 11, 2018","reviewText":"The camera and lenses are nice quality pieces. The extra battery and charges are helpful. You also get some cheep filters, lens adapters, and something they attempted to call a tripod. The lens adapters and filters are as nice as the actual Canon products are but for the price of the bundle they are basically free so they are a nice added bonus. As the other reviews state the tripod is useless. It will barely stand by its self let alone putting a camera on it. The camera bag is nice but not near big enough to put everything in."},{"reviewerName":"Kindle Customer","rating":"4.0 out of 5 stars","reviewTitle":"BUY THIS CAMERA, but expect to purchase a bigger bag, and a much better tripod.","reviewDate":"March 30, 2017","reviewText":"I bought this camera for work, and upon initial inspection, everything was basically as expected. Two caveats right away:\n\n1) The camera bag is tiny. It's going to fit your camera with standard lens on, your long distance lens, and a few accessories in the front pocket. There are no side pockets, and there isn't a pocket in the roof of the bag. This might be an ideal bag for a tiny day shoot, but if you want flexibility, you're going to want a bigger bag - I was fully expecting to get the larger cannon bag that had all the pockets and double the width.\n\n2) The tripod is super flimsy. In fact, I removed the shoe for the tripod and wasn't able to get it to screw back on. It's like there was a part there that flew off when I separated the shoe from the tripod, and I didn't see it fly. If there was such a piece, No idea where it went. If there wasn't such a piece, then this tripod is broken before I ever put a camera on it (which is why we try these things out!). In addition, it only makes it to about 4' high fully extended. If you're going to spend a bunch of time sitting while taking pictures, it might be ideal, but it's too ergonomically incorrect to slave over for hours for that perfect shot. In addition, your shoe really should be something that you can screw onto your camera, and then snap into the base. Anything else is just playing with matches."},{"reviewerName":"Jim Ferry","rating":"5.0 out of 5 stars","reviewTitle":"Great Value","reviewDate":"June 22, 2019","reviewText":"I was looking to get into photography and this camera from Canon looked like a good starter camera to get into DLSR photography. I have never owned a camera other than my smartphone camera and was up and running taking pictures in a few minutes. Very easy to use in auto mode and just started to explore the manual modes. Lots of good videos on the tube to guide you through. I did purchase the 50mm lens after watching a few videos and it’s great for portrait shots. If you new to photography then give this unit a try."},{"reviewerName":"J. Grant Bierman","rating":"4.0 out of 5 stars","reviewTitle":"A Quick Review","reviewDate":"September 10, 2017","reviewText":"I have not had this long, but here is a general 'first' impression... First who every put this bundle together should have be required to pack (safely) everything in the included bag.\n\nThe camera bag does hold the camera and two lens just fine, with a little room in the camera section. and has a pocket on the side that the flap covers when it's closed. I just used another camera bag I had for storing some of the other items.\n\nThe Flash include is a cheap one, no way to adjust where the flash it pointing w/o moving the entire flash. But it does work, and includes a bracket to side mount the flash to the camera.\n\nThe tripod is light, probably too light, I'll keep it in a vehicle as a spare in case I forget to take one of my better tripods.\n\nAs far as to the lens, really have not had time to give them a proper run though. I am coming from a Panasonic DMC-FZ18, so I feel I need more time to learn how to properly work and use a dSLR.\n\nAnyway that is some of my thoughts about this bundle, good for the price but could have been somewhat better."},{"reviewerName":"B. Lynn Stubblefield","rating":"5.0 out of 5 stars","reviewTitle":"Great beginners kit...","reviewDate":"January 9, 2017","reviewText":"Bought this fot my thirteen year old boy video monster. He already has many hundreds of photos and is asking about accessories, lenses and etc.\nI was disappointed that Amazon dropped the price almost immediately after my purchase...."},{"reviewerName":"Lincoln300","rating":"3.0 out of 5 stars","reviewTitle":"Dont go by the picture.. no extra battery","reviewDate":"October 12, 2017","reviewText":"Everything was packages well.. the flash package was dirty filth stuck to it's cover which was very odd. Also, THERE IS NO EXTRA BATTERY. the picture is misleading. But it for the camera, two mem cards as well as the tripod.. rest all it not the best quality..!"},{"reviewerName":"Deborah Flanagan","rating":"1.0 out of 5 stars","reviewTitle":"Buyer.beware! Lenses don’t fit on camera","reviewDate":"May 15, 2018","reviewText":"The seller has substituted cheap lenses in this package that don’t even fit onto the camera body. The basic Rebel camera and lens are great but the rest is junk. Don’t plan on using the included macro or telephoto lens - they won’t work with the camera body and are cheap products."},{"reviewerName":"John Dubin","rating":"1.0 out of 5 stars","reviewTitle":"VERY VERY DISAPPOINTED!!","reviewDate":"December 10, 2016","reviewText":"Didn't come with extra battery pack as advertised took way took\nlong to ship and now Im leaving on my trip soon without the extra battery which is one of the reasons i CHOSE THIS.....VERY VERY DISAPPOINTED !!!!"},{"reviewerName":"Moises Mena Jr","rating":"5.0 out of 5 stars","reviewTitle":"That takes pictures so clear and it focus on the person.","reviewDate":"December 26, 2018","reviewText":"I love so so much this Item and I know because my cousin have one and I want one so so bad and I ask my parent if they can buy it for me because I don’t have money but they said that it was to expensive and I really want it so bad."},{"reviewerName":"Leah Gerry","rating":"5.0 out of 5 stars","reviewTitle":"but I don’t have a really good camera my camera can only shot 720P HD it’s ...","reviewDate":"January 13, 2018","reviewText":"HI I’m Micah i have not bought this Camera yet because i don’t have the money, i have a YouTube channel and it’s name is SimulatorAdventures and i only have 18 Subscribers but just o most 1000 Views in total, but I don’t have a really good camera my camera can only shot 720P HD it’s a Sony no a fence but I like you canon way better, anyway here’s the point i need a better camera but i could review this camera and these acc that come with it or i could review a cheaper camera of yours but i don’t have the money, so I’m just wondering if you could send me this camera or a cheaper one to review and after i review it i can use it for my video’s"},{"reviewerName":"Mercy","rating":"1.0 out of 5 stars","reviewTitle":"No camara","reviewDate":"December 22, 2018","reviewText":"in the box there is no camera"},{"reviewerName":"Sissy Eugenia Macias","rating":"5.0 out of 5 stars","reviewTitle":"First purchase","reviewDate":"May 31, 2019","reviewText":"Bro the camera is amazing, for all the things it came with, it's a pretty good price. I'm in love with it."},{"reviewerName":"george wilson","rating":"5.0 out of 5 stars","reviewTitle":"Good product","reviewDate":"March 1, 2019","reviewText":"Great value for beginners. My only complaint is it says it comes with an extra battery when it doesnt."},{"reviewerName":"Cole","rating":"5.0 out of 5 stars","reviewTitle":"great price","reviewDate":"May 19, 2019","reviewText":"very useful for weddings and prom photos"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Great pictures","reviewDate":"June 16, 2018","reviewText":"I love this camera! Easy to learn how to use and the pictures are incredible. Would definitely reccomend!!"},{"reviewerName":"Joshua young","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"February 13, 2018","reviewText":"Really easy camera to learn on wife loves it all the little things are really worth the extra money!"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"It looks great, arrived quick","reviewDate":"March 29, 2017","reviewText":"Everything that was supposed to come with it did! It looks great, arrived quick, and all fit in the bag except the tripod (obviously). Im very pleased."},{"reviewerName":"Carrie","rating":"5.0 out of 5 stars","reviewTitle":"Is this a good camera for shooting the night sky","reviewDate":"February 24, 2018","reviewText":"Is this a good camera for shooting the night sky? I’m looking for something I can do good shoots with?"},{"reviewerName":"Jessica","rating":"5.0 out of 5 stars","reviewTitle":"Amazing bundle. So many brand new great items","reviewDate":"December 2, 2017","reviewText":"Amazing bundle. So many brand new great items. Chose gift wrap option it was wonderful my bf loved it. Thank you!!!"},{"reviewerName":"Johnny Flores","rating":"5.0 out of 5 stars","reviewTitle":"Great price. I recommend","reviewDate":"February 20, 2018","reviewText":"Delivered on time. Order was complete. Great price. I recommend.."},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"February 13, 2017","reviewText":"Excelente!"},{"reviewerName":"Amazon Customer","rating":"4.0 out of 5 stars","reviewTitle":"It's good entry level","reviewDate":"January 16, 2017","reviewText":"It's good entry level, but one thing that should be noted is that it actually continuously shoots at about 3 fps, not 5."},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"wife loved","reviewDate":"December 30, 2016","reviewText":"Fast shipping! everything as described!\nwife loved it"},{"reviewerName":"Brum","rating":"1.0 out of 5 stars","reviewTitle":"This camera is horrible. I don't recommend it","reviewDate":"June 2, 2017","reviewText":"This camera is horrible. I don't recommend it. I received the camera, tried to turn it on but it wouldn't turn on. My pictures were just a black screen. Every picture I took was a black screen. It would be a much better camera if I had a battery and charger."},{"reviewerName":"Kaelyn Palms","rating":"5.0 out of 5 stars","reviewTitle":"Review this Product","reviewDate":"July 11, 2017","reviewText":"My name is Kaelyn. I have am an Social Media network and in the growing process. I would love to review this product to my fans on my channel."},{"reviewerName":"John","rating":"5.0 out of 5 stars","reviewTitle":"LOVE IT, JUST WISHED THE SALE WAS A WEEK EARLIER","reviewDate":"December 12, 2016","reviewText":"I am really upset right now that this deal is going on man lol I just brought my camera at Best Buy for the same amount of this whole package. I can't complain though because the camera is really great. Overall the camera is a very good FIRST camera for myself, it very easy to use, different dials are very easy to read and comprehend and lastly the autofocus and stabilizer makes it easier for you to take quick snaps rather than going into manual mode and fixing it."},{"reviewerName":"charles phillips","rating":"5.0 out of 5 stars","reviewTitle":"Eos rebel t6","reviewDate":"November 27, 2016","reviewText":"Great camera at that price"},{"reviewerName":"TONY","rating":"5.0 out of 5 stars","reviewTitle":"Awesome bundle, and great pictures!","reviewDate":"October 21, 2019","reviewText":"Great camera bundle! Comes with everything needed to get started taking great photos! Excellent quality came"},{"reviewerName":"Jerrieann Buczek","rating":"5.0 out of 5 stars","reviewTitle":"Absolute bargain and prefect for beginners","reviewDate":"August 13, 2019","reviewText":"I love all the items it came with. This being my first real camera my husband and I have been looking and wasn't sure but so far I'm very impressed with all the setting's and filters. Once I get more practice I'll be more comfortable."},{"reviewerName":"Charles Brown","rating":"5.0 out of 5 stars","reviewTitle":"Good quality pics!","reviewDate":"October 31, 2018","reviewText":"Bought this camera for my brother and he says it’s easy to use and take great pictures."},{"reviewerName":"Monica L.","rating":"4.0 out of 5 stars","reviewTitle":"Excellent Camera! Love the WiFi","reviewDate":"January 5, 2018","reviewText":"I would give this a 5/5 if it was just the camera. The camera and lens it's self is great. However, some of the extra things that come with it are a little cheap. In the pictures it makes it look like the accessories are canon products but they are not they just fit canon equipment. The only thing I received that was canon was the lens, camera, strap for camera and a battery charger that ended up not working.\n\nDon't get me wrong, I didn't really care because I am a beginner and was just excited about all the stuff you get \"free\" in the bundle. The accessories work well and fit just not brand name.\n\nIf you are trying a beginner this is an excellent product, of course since I purchased this last year I paid a little more, so at this price it is totally worth it.\n\nAlso what sold me was the ability to connect the camera to my smart phone via wifi and instantly upload photos. So EASY! Also you can print them straight from camera."},{"reviewerName":"Jonathan","rating":"5.0 out of 5 stars","reviewTitle":"... going to start a YouTube page and I would love to sample your producer","reviewDate":"August 16, 2017","reviewText":"hey I am going to start a YouTube page and I would love to sample your producer"}]}