{"title":"Canon EOS Rebel T6 Digital SLR Camera with Canon EF-S 18-55mm Image Stabilization II Lens, Sandisk 32GB SDHC Memory Cards, Accessory Bundle","manufacturer":"Canon","currentPrice":"$419.00","rating":"4.5 out of 5 stars","totalRatings":"121 ratings","features":["\n         Make sure this fits\n                by entering your model number.\n        \n","Canon EOS Rebel T6 Digital SLR Camera Bundle Includes 1-Year Canon USA Camera Warranty","Canon EOS Rebel T6 DSLR Camera with 18MP APS-C CMOS Sensor - DIGIC 4+ Image Processor - 3.0\" 920k-Dot LCD Monitor - Full HD 1080p Video Recording at 30 fps - 9-Point AF with Center Cross-Type Point - Extended ISO 12800, 3 fps Shooting - Built-In Wi-Fi with NFC","Canon EF-S 18-55mm IS II Lens with EF-S Mount lens - 29-88mm (35mm Equivalent) - Aperture Range: f/3.5-38 - One Aspherical Element - Optical Image Stabilization - Stepping Motor, Internal Focusing System - Supports Movie Servo AF Feature","In the Box: LP-E10 Lithium-Ion Battery Pack - LC-E10 Battery Charger for EOS Rebel T3, T5, T6 - Eyecup Ef for Digital Rebel Cameras - RF-3 Body Cap for Canon EOS Cameras - EW-400D Neck Strap - Battery Cover - IFC-130U Interface Cable","In the Bundle: Sandisk 32GB SDHC Class 10 Memory Card - Digital Flash Light - USB Card Reader - Remote Control - Professional Tripod - 2.2x Telephoto Lens - 0.43x Wideangle Lens - 3pc Filter Kit - AC/DC Travel Charger - Lens Hood - Extra Battery - Xit Deluxe Camera Bag"],"reviewsAspects":["love this camera","absolutely love","easy to use","starter kit","extra battery","camera takes","definitely recommend","takes great","great package","great starter","came with everything","camera is amazing","great beginner","new camera","price great","camera takes great","great camera","camera and bag","camera came with everything","good camera"],"productInformation":[{"Product Dimensions":"3.4 x 5.1 x 4 inches"},{"Item Weight":"1.07 pounds"},{"Shipping Weight":"9.05 pounds (View shipping rates and policies)"},{"ASIN":"B071RH4Y9W"},{"Item model number":"PZ-T6-18-55-042117"},{"Batteries":"1 Lithium ion batteries required."},{"Customer Reviews":"4.5 out of 5 stars\n    121 ratings\n4.5 out of 5 stars"},{"Best Sellers Rank":"#5,315 in Camera & Photo (See Top 100 in Camera & Photo)\n#178 in DSLR Cameras\n"},{"Date first listed on Amazon":"April 21, 2017"}],"productDescription":[],"reviews":[{"reviewerName":"Xiao Kai","rating":"5.0 out of 5 stars","reviewTitle":"the photos are satisfied.","reviewDate":"July 14, 2018","reviewText":"It's really not expensive. I got a large box with both camera and all kinds of fittings inside.\nThe camera is not as heavy as I imagined.\nI took some pictures yesterday, the photos are satisfied."},{"reviewerName":"Kimberly","rating":"4.0 out of 5 stars","reviewTitle":"Great deal for the price","reviewDate":"August 11, 2017","reviewText":"Great deal for the price! I am new to the DSLR world so this is a great beginner camera for me. It takes great pictures my only complaint is that even holding as still as you can it can miss good shots trying to focus and almost always has quite a hesitation so that is a little disappointing :( but overall for the price it is a good camera especially for a beginner in DSLR. The tripod is junk and I wouldnt trust my camera on it at all. also the add on flash is useless but everything else is great!"},{"reviewerName":"Dennis S.","rating":"4.0 out of 5 stars","reviewTitle":"Good package, gift for my wife and was a home run.","reviewDate":"June 4, 2017","reviewText":"Everything was included just as in the picture. The camera came in a sealed Canon box, and all appeared to be right from the factory. The telephoto and wide angle lenses are Vivitar lenses, but are good quality. The only criticisms (and only thing that kept it from being 5 stars) is that the tripod is a bit flimsy, and the bag, while good quality, is smaller than expected. After fitting the camera, 1 lens, and the flash, it's full."},{"reviewerName":"J. Krawiec","rating":"5.0 out of 5 stars","reviewTitle":"Great package deal for the price","reviewDate":"May 1, 2018","reviewText":"Great package deal for the price. Haven't used all the accessories yet, but the camera takes great pictures. Tripod isn't the best, but does the job if you ensure all leg locks are secure. Overall, great beginner photographer starter kit."},{"reviewerName":"Elise Winchester","rating":"4.0 out of 5 stars","reviewTitle":"I love my new Canon Rebel T6","reviewDate":"September 26, 2017","reviewText":"I love my new Canon Rebel T6! As far as the accessories, you get what you pay for. I bought an inexpensive Amazon Basics tri-pod separately, and the difference in quality was astounding. The one I purchased separately was far superior.I haven't tried out the lenses, the remote, or the filters. Having two batteries is nice and I really like the bag. It holds everything (including the lens I purchased separately) and feels secure. If I'd only purchased the camera and bag - it would definitely be 5 stars."},{"reviewerName":"Suzy Sunshine","rating":"5.0 out of 5 stars","reviewTitle":"Loving this!","reviewDate":"October 1, 2018","reviewText":"Not a camera for a beginner, unless you are willing to sit down with it and learn real photography. This kit has everything you need to produce beautiful photos. The tripod is kind of cheap, so you may want to upgrade. The backpack style is nice for the parts, but it also is easy to leave open, and I have frequently dumped everything out when I forgot to zip the bag. Wish everything wasn't black inside - It makes finding small parts loose in the bag (such as caps) a challenge when you are in a hurry."},{"reviewerName":"Louise","rating":"5.0 out of 5 stars","reviewTitle":"Great package.","reviewDate":"August 29, 2017","reviewText":"This is an awesome package. I selected this package over similar priced options because it comes with a backpack camera bag instead of a cross bag. The camera takes great pics and package includes all necessary lenses and filters etc. Shipping was fast and item was as described. Thank u"},{"reviewerName":"Foodiewife","rating":"5.0 out of 5 stars","reviewTitle":"Canon quality delivers","reviewDate":"February 24, 2019","reviewText":"I did a lot of research when I decided to upgrade my camera. The price of the camera is pretty much set by Canon. The packages are additions from each camera store. For $30 more, it made sense to go with a package. Yeah, the tripod is cheap but I already have a quality Targus tripod. I appreciated the extra battery, filters and I'll play with the two extra off-brand lenses, lens hood, charger and the backpack would come in handy. Honestly, I really wanted the camera and that's what the reviews should really focus on.\n\nI bought a Canon T1i camera around nine years ago, and have used it ever since. It has traveled the world with me, and has made beautiful food photos for my blog. After years of shooting in automatic and semi-automatic mode, I'm entering the world of manual photos-- and that is why I decided to upgrade to this model. I love the \"Q\" button that helps me to navigate around the camera features. I'm excited that I can now transfer photos from my camera, directly to my iPhone. Easy! I plan to venture more into taking food videos for my blog, and I think this is a good start. I know food bloggers (and professional photographers) who spend THOUSANDS of dollars on the higher end Canon Cameras, and that's all good and well. One day, I'll upgrade that way. For now, I am very happy with the Rebel series. It's within my budget and I think the quality of photos are fabulous-- so much better than my old point-and-shoot!\nUPDATE: I was having trouble syncing my iPhone to the camera. I called Canon Tech Support and didn't even have to wait. My rep was super patient, polite and got me up and running. I love the iPhone app, so I can view my photos on my phone and a few other features. Very happy!"},{"reviewerName":"Kindle Customergw","rating":"5.0 out of 5 stars","reviewTitle":"It's taken awhile for us to learn some of the ...","reviewDate":"September 30, 2017","reviewText":"It's taken awhile for us to learn some of the features, but we're getting there. Took pictures of some flowers in my back yard, and the colors were gorgeous. I hope I can learn everything I need to know about the camera before I get too discouraged. Thank you"},{"reviewerName":"Davis H","rating":"5.0 out of 5 stars","reviewTitle":"Overall good but over hyped","reviewDate":"December 20, 2018","reviewText":"Honestly my brother got me into photography. He recomended this camera I have taken some good photos with it, but to get most of the shots that I need I eather have to buy some expensive lenses or upgrade my accual unit. I was new to photography at the time I got it so I was very pleased but the way they advertise the products definitely over hyped it"},{"reviewerName":"Sk","rating":"5.0 out of 5 stars","reviewTitle":"Happy wife!!","reviewDate":"November 4, 2017","reviewText":"Bought this for My wife! It took about 2 hours and she's already got everything figured out and is taking amazing pictures already! Very good quality for an excellent price! Perfect for beginners!!"},{"reviewerName":"Micherlande","rating":"1.0 out of 5 stars","reviewTitle":"I don't recieve that 3 things","reviewDate":"June 18, 2018","reviewText":"I don't recieve 3 things"},{"reviewerName":"Chris Snook","rating":"5.0 out of 5 stars","reviewTitle":"Good deal","reviewDate":"February 16, 2019","reviewText":"This camera itself, with nothing added, was about $499 at Walmart. The camera came with everything pictured. I have yet to check for the little tripod attachment that is pictured, but the tripod is definitely there, and the attachment is probably in the bag with it. I have turned on the camera already and it is functional, however it is fully complicated and I have yet to figure it out. This does not mean it is a low quality camera. I have yet to test the quality of the camera itself, but it has a full HD movie mode which might be acceptable for what I am using it for. As for the package itself, it is everything that is promised and I have yet to detect an issue."},{"reviewerName":"Holly Drake","rating":"5.0 out of 5 stars","reviewTitle":"This package is AMAZING. I used Canons all throughout high school and ...","reviewDate":"September 26, 2017","reviewText":"This package is AMAZING. I used Canons all throughout high school and wanted one of my own and this did NOT disappoint! It comes with literally everything you might need to start up a photography hobby. The tripod is a little flimsy when it's all the way extended, but everything else is great. And if you know how to properly pack, you can fit EVERYTHING from this kit inside the bag minus the tripod (for obvious reasons lol) I am so beyond impressed with this kit and I definitely recommend this to any and everyone who wants a high-quality camera without the painful price tag!"},{"reviewerName":"Kellie","rating":"5.0 out of 5 stars","reviewTitle":"Wi-Fi capable and bundle with everything!","reviewDate":"January 1, 2019","reviewText":"This bundle came with EVERYTHING! The battery already had half a charge. We bought this for my MIL and she was thrilled. She knows nothing about cameras, but we were able to pull it out of the box, put the battery and SD card in and start taking flawless pics! Also a bonus is this camera is equipped with WiFi so you can download an app on your phone and send all of your pics directly to your phone!"},{"reviewerName":"Norcal Rob","rating":"4.0 out of 5 stars","reviewTitle":"Excellent move up from \"point and Shoot\"","reviewDate":"August 30, 2019","reviewText":"If you're on a budget, and want to move up from simple \"point and shoot\" cameras, this is a good choice. The photos and video are beautiful. My biggest disappointment with this model is that when shooting video, there is no provision for connecting an external microphone or mixer. Had I known that, I would have purchased a Nikon instead. If not for that shortcoming, I would have given it 5 stars."},{"reviewerName":"Andrew Lisowski","rating":"5.0 out of 5 stars","reviewTitle":"I absolutely love this camera","reviewDate":"June 2, 2018","reviewText":"I absolutely love this camera. It takes should clear and detailed pictures, and I haven’t even learned how to use all the attachments. Would definitely recommend this camera to people."},{"reviewerName":"rebecca chavez","rating":"5.0 out of 5 stars","reviewTitle":"Best purchase ever","reviewDate":"August 5, 2019","reviewText":"I absolutely love this camera! I’ve had it for a few months now and the more I adjust and learn new things the more I love it! Perfect for beginners who want to get into photography, it’s simple to use and the manual helps me f you have questions. All the accessories are great as well and I love being able to use a create beautiful memories."},{"reviewerName":"Kindle Customer","rating":"5.0 out of 5 stars","reviewTitle":"Great for beginners","reviewDate":"February 18, 2019","reviewText":"I've had the camera for a month now and feel that I can make a good review. I bought this for my photography class and I absolutely love this camera. It's a great beginner camera to start off with. The price did go up since I purchased, but I still think that bundles like these are worth it. You might not use everything all the time, but it's good to have it. The tripod is OK, but if you plan to take photography more serious, it'd be best to buy a better one. It does function the way it should so you don't have to buy another right away. I attached a few pictures that I've taken with my camera so far and love the results. I plan to invest in more lenses for my camera in the future."},{"reviewerName":"Chelebell15","rating":"5.0 out of 5 stars","reviewTitle":"... - all the extras in the box area a great plus.","reviewDate":"March 14, 2018","reviewText":"Bought for Boyfriend who is just getting started - he loves it - all the extras in the box area a great plus."},{"reviewerName":"ArmyGurl773","rating":"4.0 out of 5 stars","reviewTitle":"Love this camera","reviewDate":"January 16, 2018","reviewText":"Love this camera, only thing I didn't like was the portable charger that came with it didn't fit the batteries that came with the camera. But all other products are fine."},{"reviewerName":"David Poor","rating":"2.0 out of 5 stars","reviewTitle":"Several things missing.","reviewDate":"June 8, 2018","reviewText":"Camera arrived today. Missing second battery,Canon EF-S 18-55mm IS II Lens with EF-S Mount lens - 29-88mm (35mm Equivalent. I will be returning this."},{"reviewerName":"Azucena Leiva","rating":"5.0 out of 5 stars","reviewTitle":"PERFECT!","reviewDate":"October 3, 2019","reviewText":"I’ve had this camera for about 3 months. I was really skeptical about buying it because it sounded too good to be true. I did my research and in the end, I ended up buying it!\nI’m super stoked I bought this! The camera is amazing! It comes packaged in the Canon box and with the rest of the accessories mentioned which are not Canon but still work with the camera! The camera also comes with instructions (if you’re a beginner) and gives you tips. You can also register it on the Canon site.\nVery great investment overall!!"},{"reviewerName":"Matthew Uebbing","rating":"3.0 out of 5 stars","reviewTitle":"All good except tripod","reviewDate":"August 6, 2018","reviewText":"Unboxed the kit today, everything seems good and a worthwhile inclusion to the package except for the tripod, which is super cheap and flimsy. It weights maybe 3/4 of a pound and can barely stand on it's own, let alone with 2 -3 pounds of camera + lens fixed on top.\n\nKind of a shame as that's why I bought this particular package. Now I have to buy another tripod separately."},{"reviewerName":"Lisa Montiel","rating":"1.0 out of 5 stars","reviewTitle":"No quality control","reviewDate":"August 29, 2018","reviewText":"I recently purchased this product and was kind of hesitant to buy it. I should of trusted the reviews when they said a) that the accessories were cheap and b) they didn’t receive a few of the accessories. You would think that with time they would fix this problem but apparently they don’t listen to their customers."},{"reviewerName":"pamela j ripley","rating":"4.0 out of 5 stars","reviewTitle":"My daughter loves the camera however the tripod never held ...","reviewDate":"October 16, 2017","reviewText":"My daughter loves the camera however the tripod never held the camera. It is so cheaply made the attachment does not line up and even if we got it to attach to the camera Im sure it would not stand up for long. I did sent my concern to the company and never heard back."},{"reviewerName":"2012DS","rating":"1.0 out of 5 stars","reviewTitle":"felt like a play camera","reviewDate":"August 17, 2018","reviewText":"Returned, felt like a play camera. Cheap quality. Bought a Nikon.."},{"reviewerName":"James Rodgers","rating":"4.0 out of 5 stars","reviewTitle":"Great canon camera","reviewDate":"November 14, 2018","reviewText":"Turns out I didn’t need most of the accessories- they’re hardly used but he tripod is a win. Cheap but does the job. If I could buy again I’d buy just the camera and a nice tripod."},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"I love this camera","reviewDate":"September 21, 2017","reviewText":"My last review was about my pictures were blurry no matter what I did...well it was operator error! lol. I love this camera. Everything was in the box as promised and the camera is AWESOME...I just have to learn it and I will be a PRO. I will buy again from this seller when I upgrade...."},{"reviewerName":"J. Roberts","rating":"5.0 out of 5 stars","reviewTitle":"Super nice camera","reviewDate":"September 24, 2019","reviewText":"The Canon EOS Rebel is a super nice camera. Fairly simple to use and the package it came with was fantastic. I'm not a professional photographer, but with this camera I might be able to fool some people :)"},{"reviewerName":"Riley","rating":"5.0 out of 5 stars","reviewTitle":"Great Camera Setup!","reviewDate":"July 1, 2019","reviewText":"I was new into photography, and got this package to get started. I co own a company and needed to get great social media and product photography. I've been able to get exactly what I need for my company using this - without spending a ton on a higher dollar camera. The gear that comes with it works just fine."},{"reviewerName":"Catherine Villeneuve","rating":"5.0 out of 5 stars","reviewTitle":"Great package for the price","reviewDate":"August 30, 2017","reviewText":"Great package for the price. There are good instructional videos on YouTube for this exact camera. They have helped me get to know my new camera."},{"reviewerName":"Jen","rating":"5.0 out of 5 stars","reviewTitle":"I love this camera!","reviewDate":"July 17, 2019","reviewText":"The camera is a amazing!! Some of the accessories it brings are a bit flimsy but everything has been working great so far! Honestly for the price and everything it brings it is a really good purchase!"},{"reviewerName":"dedub (tex)","rating":"4.0 out of 5 stars","reviewTitle":"great camera with crapy accessories","reviewDate":"June 21, 2018","reviewText":"The camera is great! Some of the accessories are junk though.... the lenses are fine but the tripod sucks"},{"reviewerName":"misty","rating":"5.0 out of 5 stars","reviewTitle":"Good price for what you get","reviewDate":"February 26, 2019","reviewText":"Came with everything in the picture the tripod is a little rickety might suggest getting a different tripod otherwise I am very satisfied and Hope to take lots and lots of pictures with it"},{"reviewerName":"Sydney Watkins","rating":"4.0 out of 5 stars","reviewTitle":"Good for beginner.","reviewDate":"August 17, 2019","reviewText":"I got this as a beginner I wanted to use it for my sister’s sports. It works great and is super easy to use. All the listed parts came with it and all fits in the bag provided. You might want to get another lens since it only comes with one but other than that I would definitely recommend for a beginner for the price that it is."},{"reviewerName":"Nelfeb","rating":"4.0 out of 5 stars","reviewTitle":"Durable","reviewDate":"February 4, 2018","reviewText":"Great set for beginners my son is only 13 and is just learning the basics this set is great"},{"reviewerName":"Dan","rating":"5.0 out of 5 stars","reviewTitle":"Nice camera package","reviewDate":"February 20, 2018","reviewText":"Gift for my wife, she was very pleased with it. Impressive amount of accessories."},{"reviewerName":"Lexie","rating":"4.0 out of 5 stars","reviewTitle":"Well worth the price","reviewDate":"August 12, 2018","reviewText":"This bundle is great! Well worth the money. I don’t trust the tripod just because it doesn’t seem quality made to put camera on it to possible fall from the weight and the bag isn’t great quality but the extra battery and additional lens are great. Perfect bundle for a beginner."},{"reviewerName":"David Madden","rating":"5.0 out of 5 stars","reviewTitle":"Having fun!","reviewDate":"January 9, 2019","reviewText":"I have enjoyed learning this camera. Lots of additional stuff with this package. Camera takes great pics. Very happy and continuing to learn how to shoot."},{"reviewerName":"Scot","rating":"5.0 out of 5 stars","reviewTitle":"Very happy we purcahsed","reviewDate":"December 19, 2017","reviewText":"Really remarkable accessory kit with the camera. Very happy we purcahsed."},{"reviewerName":"Mike C","rating":"4.0 out of 5 stars","reviewTitle":"Four Stars","reviewDate":"March 30, 2018","reviewText":"Love the camera. Some of the accessories are cheap. The bag works good."},{"reviewerName":"Peyton Strickland","rating":"5.0 out of 5 stars","reviewTitle":"I absolutely love my camera","reviewDate":"March 22, 2018","reviewText":"I absolutely love my camera!!! I was a little disappointed that it arrived a day late, but I know that was not their fault. It was UPS's fault!! I will recommend this anyone who says anything about getting a camera!!"},{"reviewerName":"Steve Ree","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"July 26, 2018","reviewText":"A handy package of products to get me started."},{"reviewerName":"B Fisher","rating":"4.0 out of 5 stars","reviewTitle":"Great starter kit","reviewDate":"May 23, 2019","reviewText":"Camera is a great product, lots of accessories for the beginner, though all are not great quality. Very good to get going in the DSLR area of photography,GREAT PRICE"},{"reviewerName":"Stacey","rating":"5.0 out of 5 stars","reviewTitle":"Great camera and customer service!","reviewDate":"June 7, 2018","reviewText":"I am very happy with the camera. It works great! The customer service was beyond my expectations. I highly recommend this seller!"},{"reviewerName":"Kristy Dowden","rating":"5.0 out of 5 stars","reviewTitle":"Great camera","reviewDate":"July 8, 2018","reviewText":"Easy to use and the picture quality leaves little editing."},{"reviewerName":"AMBER BOWERS","rating":"1.0 out of 5 stars","reviewTitle":"Doesn’t work","reviewDate":"March 14, 2019","reviewText":"The camera won’t read the card and won’t allow me to format the card. I have tried several different cards so it is clearly an issue with the camera and not the memory card. The camera was purchased for work and I was unfortunately outside of the return date before I had a chance to use it."},{"reviewerName":"Alice Blandelli","rating":"5.0 out of 5 stars","reviewTitle":"Well worth the money!","reviewDate":"November 7, 2018","reviewText":"I'm 19 and into nature photography this was definitely a great purchase! It took a bit to learn camera techniques and that lighting is one of the most important parts! This camera is amazing! And I really don't know how to explain how happy I am with my purchase"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Just what I wanted","reviewDate":"September 7, 2018","reviewText":"This is just what I wanted. I have yet to get the wifi to pair so that I can transfer the pictures to my phone. I am a bit confused but I will keep trying to figure it out."},{"reviewerName":"DM","rating":"5.0 out of 5 stars","reviewTitle":"Good stuff!","reviewDate":"August 12, 2018","reviewText":"You get a lot of stuff for the money. The tripod is poor quality and I would not recommend putting your camera on it. Otherwise it's great for a someone who is looking to get into the hobby of photography. The camera is excellent quality and I'm very happy with it."},{"reviewerName":"Amazon Customer","rating":"3.0 out of 5 stars","reviewTitle":"Tripod doesnt work/ fit camera. Very cheap","reviewDate":"November 8, 2018","reviewText":"Tripod came broken....well it doesnt even fits the camera. Every other picture is blurry. This definitely could have been better for the price"},{"reviewerName":"JHV007","rating":"5.0 out of 5 stars","reviewTitle":"Excellent Set","reviewDate":"August 12, 2017","reviewText":"gift for daughter - great set, nicely packaged; great value"},{"reviewerName":"Ashley","rating":"5.0 out of 5 stars","reviewTitle":"but I'm really happy with this set--The camera itself is great","reviewDate":"May 9, 2018","reviewText":"I had some experience with analog photography in high school, and I decided I wanted to pick the hobby up again (only digital this time around). I was a little nervous about getting a bundle since I saw a lot of mixed reviews, but I'm really happy with this set--The camera itself is great, and since a Canon PowerShot was one of my first digital cameras, I've found getting comfortable with the settings and menus has been pretty easy. I haven't had a ton of practice with some of the lens accessories, but the batteries and chargers, SD card, and bag are great additions.\n\nThe only thing I might I see myself replacing soon is the tripod--It feels really flimsy, and it makes me a little nervous leaving my camera on it if I'm not right next to it.\n\nOverall, though, the bundle is well-worth the cost, and I think it's a great starter kit for someone looking to get into photography as an art."},{"reviewerName":"Gerry","rating":"4.0 out of 5 stars","reviewTitle":"Good product","reviewDate":"January 21, 2019","reviewText":"The camera is good for beginners it’s a good middle of the road camera the kit is well made my only complaint is the tripod it’s cheap aluminum and is a bit smaller than I had expected I have no complaints otherwise the camera the bag and the lens are definitely worth the cost alone"},{"reviewerName":"C. Lee","rating":"5.0 out of 5 stars","reviewTitle":"Great Camera","reviewDate":"February 23, 2019","reviewText":"It is simple to use and takes near professional quality picutres."},{"reviewerName":"William T Palmatier","rating":"4.0 out of 5 stars","reviewTitle":"Needs more information on how to use some of the acceries.","reviewDate":"July 30, 2019","reviewText":"Easy to use after messing around with settings for a while. Not used on a professional level but could be. Instructions for how to use and when to use some of the acceries for, like the filters would help. That is why I gave it overall 4 stars and 3 for beginners."},{"reviewerName":"Brittany Reyes","rating":"5.0 out of 5 stars","reviewTitle":"Love it!","reviewDate":"August 25, 2017","reviewText":"Its is a great camera, everything worked well, I did get the wrong carrier bag, but i still like the one i got."},{"reviewerName":"RAYMELLA BROWN","rating":"4.0 out of 5 stars","reviewTitle":"Great value for the money","reviewDate":"March 6, 2019","reviewText":"It’s a great value but you need to take time to read through the Manual to get full perspective of the features"},{"reviewerName":"Tina H","rating":"5.0 out of 5 stars","reviewTitle":"Love!","reviewDate":"September 23, 2019","reviewText":"I don’t like the tripod it’s very small and thin plastic. Camera is amazing, beginners should what read up on to get to know the camera"},{"reviewerName":"lpotts13","rating":"5.0 out of 5 stars","reviewTitle":"Super cool","reviewDate":"April 18, 2019","reviewText":"This package has everything you'll need"},{"reviewerName":"melody pait","rating":"5.0 out of 5 stars","reviewTitle":"Very nice.","reviewDate":"August 31, 2019","reviewText":"My daughter loves it I purchased this for her since she started college for broadcasting and her hobby is photography."},{"reviewerName":"Emmett Decambre","rating":"5.0 out of 5 stars","reviewTitle":"Pleased","reviewDate":"May 10, 2019","reviewText":"Excellent"},{"reviewerName":"Kathie B","rating":"5.0 out of 5 stars","reviewTitle":"Great camera","reviewDate":"July 28, 2017","reviewText":"Have taken camera classes just so I would know how to use this camera correctly. The accessories that came with this bundle was great and I don't think I'm missing much if anything. I'm going to Nova Scotia in a couple of months and this will certainly get a lot of use."},{"reviewerName":"keith e thomas","rating":"5.0 out of 5 stars","reviewTitle":"Value","reviewDate":"March 23, 2019","reviewText":"Good product at a reasonable price"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"September 19, 2018","reviewText":"Excellent"},{"reviewerName":"Cindy Gannotta","rating":"5.0 out of 5 stars","reviewTitle":"Great gift!","reviewDate":"August 14, 2018","reviewText":"Bought it for my daughter as a graduation present. She loved it and uses it daily. Great bundle for a beginner!"},{"reviewerName":"Darman Wiens","rating":"5.0 out of 5 stars","reviewTitle":"Una de las mejores camaras relacion calidad/precio","reviewDate":"May 31, 2019","reviewText":"Excelente tanto para fotografia y video. De entre estos dos su mayor virtud radica en lo primero."},{"reviewerName":"Teresa McBee","rating":"4.0 out of 5 stars","reviewTitle":"This camera is great for those who want to go just a step beyond point and shoot.","reviewDate":"August 9, 2019","reviewText":"I lOVE this camera. Still playing with all the goodies included. The only thing bad is that the Canon charger quit working after a month or two."},{"reviewerName":"Jade","rating":"5.0 out of 5 stars","reviewTitle":"Excellent camera bundle","reviewDate":"May 17, 2019","reviewText":"I am very happy with my new camera, it was a mothers day gift from my hubby, the camera and bundle pack is a great value, and it showed up in 2 days, and in excellent condition."},{"reviewerName":"Ky'Airea Scruggs","rating":"5.0 out of 5 stars","reviewTitle":"Great Bundle For The Price","reviewDate":"June 15, 2019","reviewText":"This camera is one I will be using for school and the pictures that I have taken already are great and I received everything that they said was going to come which is a plus"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"So much for your money!","reviewDate":"March 4, 2019","reviewText":"I love my camera and all of the things that came with it! I'm a beginner photographer and I'm loving how easy it is work!"},{"reviewerName":"Kerry reinholt","rating":"5.0 out of 5 stars","reviewTitle":"Great Value","reviewDate":"April 13, 2019","reviewText":"This comes with everything you need to get started"},{"reviewerName":"Troy Butler","rating":"5.0 out of 5 stars","reviewTitle":"Saved money not having to go out individually and by all of the accessories and extra battery","reviewDate":"February 10, 2019","reviewText":"Great starter camera for my wife."},{"reviewerName":"Erik M.","rating":"5.0 out of 5 stars","reviewTitle":"Very Happy","reviewDate":"September 18, 2018","reviewText":"More than satisfied with this purchase. I know its an entry level camera but i love what it can do. and the value is amazing everywhere else it was at least $100 more for just the camera alone."},{"reviewerName":"Jennifer Garcia","rating":"5.0 out of 5 stars","reviewTitle":"Great Camara","reviewDate":"February 6, 2019","reviewText":"hight quality camera and pictures. All the extra accessories are pretty cool too. Definitely not for beginners but worth to learn."},{"reviewerName":"SB","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"March 6, 2018","reviewText":"Amazing Camera, works great!"},{"reviewerName":"Dj","rating":"5.0 out of 5 stars","reviewTitle":"Good camera","reviewDate":"April 15, 2019","reviewText":"Made a great gift for my fiance. Only thing I dislike is that I have to buy more lenses for her!"},{"reviewerName":"Deborah Gwinn","rating":"5.0 out of 5 stars","reviewTitle":"worth the money and more","reviewDate":"May 5, 2019","reviewText":"what a great find, you will love this camera!!!!!!"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Great buy","reviewDate":"May 8, 2019","reviewText":"Wanted to get a cannon for years gifted it from me to me for my 50th birthday"},{"reviewerName":"Alex","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"March 7, 2018","reviewText":"Excellent. Fast shipping and the product is great i"},{"reviewerName":"Lewys A.","rating":"5.0 out of 5 stars","reviewTitle":"Todo bien","reviewDate":"March 4, 2019","reviewText":"Todo bien"},{"reviewerName":"Edwaldo Wright","rating":"5.0 out of 5 stars","reviewTitle":"Great Buy!","reviewDate":"January 28, 2019","reviewText":"I bought this product, which was 'AMAZON'S CHOICE' during my search for a camera. A lot of accessories were included. Very PLEASED?"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Good","reviewDate":"December 25, 2018","reviewText":"My first camera. Work pretty good. Easy to use."},{"reviewerName":"Donna Scherber","rating":"4.0 out of 5 stars","reviewTitle":"Like it","reviewDate":"September 20, 2019","reviewText":"Like it"},{"reviewerName":"A.Baset Q.","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"August 12, 2018","reviewText":"Super item"},{"reviewerName":"Kimberly Y.","rating":"5.0 out of 5 stars","reviewTitle":"Awesome shooting","reviewDate":"January 6, 2019","reviewText":"Great camera! Doesn't give too many instructions for beginners.."},{"reviewerName":"Valeria","rating":"5.0 out of 5 stars","reviewTitle":"Good product","reviewDate":"August 7, 2018","reviewText":"Nice"},{"reviewerName":"Joe Duncan Jr","rating":"5.0 out of 5 stars","reviewTitle":"Bang for the buck!","reviewDate":"September 3, 2019","reviewText":"Great package for money spent"},{"reviewerName":"Jacquea Smith","rating":"5.0 out of 5 stars","reviewTitle":"Good for photography","reviewDate":"April 2, 2019","reviewText":"I like this camera I use it for YouTube photography follow my instagram jaup8"},{"reviewerName":"Dl Bailey","rating":"5.0 out of 5 stars","reviewTitle":"Easy to use.....","reviewDate":"January 28, 2018","reviewText":"Love my camera... there's not enough hours in the day or weekends to play!"},{"reviewerName":"Carey J.","rating":"5.0 out of 5 stars","reviewTitle":"Great Purchase","reviewDate":"September 7, 2018","reviewText":"Everything is good quality and perfect for a beginning photographer. Very satisfied!"},{"reviewerName":"Juan C.","rating":"5.0 out of 5 stars","reviewTitle":"Buena compra","reviewDate":"May 14, 2019","reviewText":"Excelente compra, viene con todos sus accesorios"},{"reviewerName":"Jennifer Perez","rating":"4.0 out of 5 stars","reviewTitle":"Happy customer","reviewDate":"September 8, 2017","reviewText":"Very Happy with everything!!!!"},{"reviewerName":"Chris Vitaris","rating":"5.0 out of 5 stars","reviewTitle":"Good Deal","reviewDate":"September 11, 2018","reviewText":"Like all the items it came with"},{"reviewerName":"Sara","rating":"5.0 out of 5 stars","reviewTitle":"Awesome bundle for a great price","reviewDate":"December 25, 2018","reviewText":"This bundle was amazing."},{"reviewerName":"Kershaw P.Leatherbury","rating":"4.0 out of 5 stars","reviewTitle":"I've been having a ball with my new camera. the photos of Awesome.","reviewDate":"August 9, 2018","reviewText":"I'm very pleased with my purchase I've Been Everywhere taking photos my pictures come out awesome."},{"reviewerName":"Julie","rating":"5.0 out of 5 stars","reviewTitle":"I upgraded. Few more options but basically the same camera. 👍","reviewDate":"May 20, 2019","reviewText":"Not sure in the flash /no flash"},{"reviewerName":"Joan","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"October 27, 2017","reviewText":"nice"},{"reviewerName":"Stephanie Thomas","rating":"5.0 out of 5 stars","reviewTitle":"Amazing deal","reviewDate":"November 7, 2017","reviewText":"Amazing deal! Will definitely recommend!"},{"reviewerName":"Ashley","rating":"5.0 out of 5 stars","reviewTitle":"Very easy to use","reviewDate":"June 20, 2019","reviewText":"I Love it"},{"reviewerName":"ANDY J","rating":"5.0 out of 5 stars","reviewTitle":"awesome product","reviewDate":"February 14, 2019","reviewText":"easy to use and affordadble"},{"reviewerName":"Chris Skipper","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"April 24, 2018","reviewText":"Great camera."},{"reviewerName":"Christina","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"February 28, 2018","reviewText":"I love it great"},{"reviewerName":"Ilirjana Cenaj","rating":"5.0 out of 5 stars","reviewTitle":"Like it","reviewDate":"February 12, 2019","reviewText":"I love it"},{"reviewerName":"Luis","rating":"5.0 out of 5 stars","reviewTitle":"excellent","reviewDate":"August 6, 2018","reviewText":"its a perfect camera and very fast delivery"},{"reviewerName":"Laura Connelly","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"February 27, 2018","reviewText":"Great camera. Great bundle for beginner."},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"March 13, 2018","reviewText":"I love all of the features."},{"reviewerName":"Tomas Morales","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"January 25, 2018","reviewText":"Excelente producto! Paquete Completo"},{"reviewerName":"John Brian Hughes","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"May 21, 2017","reviewText":"It came with everything that was described. No defects. No problems."},{"reviewerName":"Paris Glendenning","rating":"4.0 out of 5 stars","reviewTitle":"Four Stars","reviewDate":"January 27, 2018","reviewText":"Great package deal."},{"reviewerName":"TLV","rating":"5.0 out of 5 stars","reviewTitle":"Birthday gift so review is based on limited interaction with the camera.","reviewDate":"September 21, 2017","reviewText":"Everything seemed to be great as far as the contents of this order. It was a gift for our son, so don't have too much detailed information, but he has been sending us photos. He was extremely pleased when he opened his package."},{"reviewerName":"Joseph John Berdosh III","rating":"5.0 out of 5 stars","reviewTitle":"Great Camera that is easy to use","reviewDate":"October 6, 2017","reviewText":"My wife and I took the camera on our honeymoon cruise. We cannot be happier with the quality of the pictures. The camera is easy to use, and the accessories that came with the camera are great. There is a lot this camera has to offer and we will have fun figuring it out."},{"reviewerName":"Amy Cobb","rating":"5.0 out of 5 stars","reviewTitle":"Best boundle out there","reviewDate":"January 6, 2018","reviewText":"Camera brought so much more than i even know how to use!! Takes beatiful pictures as expected! Best boundle out there! And i’ve been looking since last April. Definitely worth it!"},{"reviewerName":"RK","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"July 31, 2017","reviewText":"Simply the best"},{"reviewerName":"SecretOkra","rating":"4.0 out of 5 stars","reviewTitle":"Four Stars","reviewDate":"November 20, 2017","reviewText":"Very basic camera, so far so good"},{"reviewerName":"Kindle Customer","rating":"4.0 out of 5 stars","reviewTitle":"Gift purchased for family member","reviewDate":"August 23, 2017","reviewText":"This was purchased as a gift for my adult daughter. She seemed happy with it."},{"reviewerName":"valeria","rating":"3.0 out of 5 stars","reviewTitle":"Faltaron productos, Tarjeta de memoria SDHC de 32 GB ...","reviewDate":"July 25, 2018","reviewText":"Faltaron productos, Tarjeta de memoria SDHC de 32 GB Clase 10 SanDisk , Lector de tarjetas USB, it de filtro de lente AC/DC cargador de viaje – Lens Hood – Batería extra, mando a distancia, y parasol del objetivo"},{"reviewerName":"Vallino salazar Gabriela","rating":"1.0 out of 5 stars","reviewTitle":"Urgente cambio de cámara no anda","reviewDate":"July 15, 2018","reviewText":"Necesito comunicarme urgente con el proveedor de productos\nNo anda la cámara"},{"reviewerName":"bert johnson","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"July 6, 2017","reviewText":"Great product and great shipping"},{"reviewerName":"Navive","rating":"2.0 out of 5 stars","reviewTitle":"Tripod is ABSOLUTE grabage!","reviewDate":"March 25, 2019","reviewText":"The tripod that comes with this is garbage. Serisouly, throw it in the trash. Try and adjust any of the fastenes, either ther get 'stripped' and cant tighten or they just snap because the cheap plastic. Heaven forbid you actually have your camera attached."}]}