{"title":"Canon EOS Rebel T7i DSLR Camera Deluxe Video Creator Kit with Canon EF-S 18-55mm f/3.5-5.6 IS STM Lens + Wide Angle Lens + 2x Telephoto Lens + Flash + SanDisk 32GB SD Memory Card + Accessory Bundle","manufacturer":"Canon","currentPrice":false,"rating":"4.3 out of 5 stars","totalRatings":"49 ratings","features":["\n         Make sure this fits\n                by entering your model number.\n        \n","This Canon Camera Bundle Kit comes complete with all manufacturer supplied accessories with 1-year USA warranty and includes:","Canon EOS Rebe T7i - 24.2MP APS-C CMOS Sensor - DIGIC 7 Image Processor - 3.0\" 1.04m-Dot Vari-Angle Touchscreen - Full HD 1080p Video Recording at 60 fps - 45-Point All Cross-Type Phase-Detect AF - Dual Pixel CMOS AF - Up to 6 fps Shooting and ISO 51200 - Built-In Wi-Fi with NFC, Bluetooth - HDR Movie and Time-Lapse Movie - Movie Electronic IS, Feature Assistant","Canon EF-S 18-55mm f/4-5.6 IS STM Lens with - EF-S Mount lens - 29-88mm (35mm Equivalent) - Aperture Range: f/3.5-38 - One Aspherical Element - Optical Image Stabilization - Stepping Motor, Internal Focusing System - Supports Movie Servo AF Feature - Manual Focus Override in AF Mode - Constant Minimum Focus Distance: 9.8\" - 58mm Filter Diameter. Optical Image Stabilization provides up to 4 stops of correction against camera shake, providing you with clearer images, even in dim light.","SanDisk 32GB Ultra Class 10 SDHC UHS-I Memory Card - Great choice for compact to mid-range point and shoot camera - Twice As Fast As Ordinary SDHC Cards, Allowing You To Take Pictures And Transfer Files Quickly, Class 10 rating for Full HD video (1080p), Remote, High speed memory card reader","Rode VideoMic GO Lightweight On-Camera Microphone, Backpack Camera Case, Flash Light, Professional 50 inch tripod, Wide angle lens, 2x Telephoto lens, Filter Kit, Macro close up filter set, Grip Strap, Lens Caps, Rubber Air Dust Blower, Lense Cleaning Pen, AC/DC Travel Charger"],"reviewsAspects":["easy to use","rode mic","everything else","memory card","love this camera","great camera","camera and mic","bought a camera","tripod","accessories","lens","video","bundle","flash","items","junk","microphone","pictures","worthless","beginner"],"productInformation":[{"Product Dimensions":"5.2 x 3.9 x 3 inches"},{"Item Weight":"9 pounds"},{"Shipping Weight":"8.5 pounds (View shipping rates and policies)"},{"ASIN":"B074V3J1TL"},{"Item model number":"Canon EOS Rebel T7i"},{"Batteries":"1 Lithium ion batteries required. (included)"},{"Customer Reviews":"4.3 out of 5 stars\n    49 ratings\n4.3 out of 5 stars"},{"Best Sellers Rank":"#8,429 in Camera & Photo (See Top 100 in Camera & Photo)\n#341 in DSLR Cameras\n"},{"Date first listed on Amazon":"August 15, 2017"}],"productDescription":[],"reviews":[{"reviewerName":"Misty Duerksen","rating":"3.0 out of 5 stars","reviewTitle":"Build your own Canon Video kit.","reviewDate":"August 6, 2018","reviewText":"I purchased this kit to do creative video projects and to record some of my interviews on my radio program.\n\nMy first impression of the accessories that come with the camera is that they are mostly cheap quality junk. The only except is the Rode mic. Not a fan of the quality of Rode microphones; they feel flimsy to me. However, this mic seems to be descent.\n\nThe camera works best in manual mode for video. The camera needs to be set at an ISO 800 or below for great quality video. The lens that comes with it has an f-stop of 4, descent for sunny outdoor shooting, but worthless for medium or low lit shooting. I purchased a cheap prime 50mm lens. MUCH BETTER! I do recommend getting a quiet STM lens so that the sound from the auto focus motor doesn’t get picked up by the on camera mic. I also recommend having independent audio recording equipment so that you can monitor audio quality.\n\nIf I were to do it again, I would purchase only the body. Then purchase some fast lens. For audio, I am using the Zoom H6.\n\nOn a side note: the back-and-forth with Canon to help me figure out why my camera was turning out crap for video (that’s how bad it was), I received quick responses and great service."},{"reviewerName":"Pink Penguin","rating":"3.0 out of 5 stars","reviewTitle":"No Rode mic :-(","reviewDate":"April 23, 2019","reviewText":"Please know, this review is solely of the kit. I have not tested the camera. As soon as I realized the problem I put everything back in the box.\nThere were several important items missing from the kit, including the memory chip, the card reader, a lens kit, and the RODE microphone. Please make sure you inspect your kits carefully and ensure everything is there before discarding your packaging!!\nLuckily I noticed right away but if the Rode mic had been there I might have missed the rest because I was needing a microphone. I’ve decided just to get a cheap one and not take a chance with this kit again because I need a camera by the weekend.\n\nI’m truly heartbroken. I really was excited for this and to have to send it back and wait for another is upsetting.\n\nAnyway,\nI am going to give them 3 stars. I’m not one of those jerks that lets one thing go wrong and gives 1 star for something that had a lot of good qualities.\nFrom what I can tell, the backpack is a great quality. It’s thick and has tough skin. I was expecting something cheap and thin. This is not at all that.\nThe tripod is clearly junk but if you’re using the camera just like comes, without heavy lenses, such as the telephoto lenses, you should be fine under normal circumstances. I wouldn’t take it to the beach, or a rocky area, and expect it to hold up though. You’re definitely going to knock it over if you bump it. It’s very light. But it is also very small. You would have no issues fitting it into a backpack or purse.\n\nThe lenses I did receive look great. There wasn’t an extra battery, which I thought was supossed to come with it, but eventually I realized was not (before it came) and I found some cheap ones on here that will suffice.\n\nI do think that if it comes with everything it’s overall not a bad kit for the price. I’m just heartbroken that I have to send it back.\n\nThey did pack this into two different boxes, both with other things in it, which made going through it confusing. That isn’t a fault of the seller, that’s all Amazon. I just wanted to mention that so readers know they may prefer to order this separate from other items."},{"reviewerName":"Jeremy","rating":"5.0 out of 5 stars","reviewTitle":"First timer here! Awesome camera for making videos and amazing still pics","reviewDate":"March 19, 2019","reviewText":"Super beginner here and purchased this off of hours of review reading and YouTube comparisons. I wanted to primarily make videos but have excellent still potential as well. The mic input and the dual pixel autofocus was the main selling point, as well as the touch screen. 80d is a bit higher and a little older, they'll drop something newer tomorrow I'm sure since I finally bought a camera but between the camera and the canon app I highly recommend it for anyone making content by yourself. The non canon accessories are kind of cheap but the rode mic and camera and memory card are a great bang for the buck with the \"freebies\"."},{"reviewerName":"Keith S.","rating":"5.0 out of 5 stars","reviewTitle":"Canon t7i -- A Great Camera","reviewDate":"February 2, 2019","reviewText":"I bought this camera to replace my 1st generation digital rebel after I dropped it and shadows appeared on my pics. I also have a Nikon 3700 which WAS my favorite till now. The T7i is very easy to use and takes beautiful pictures, it is a bit more bulkier as compared to my Nikon though. You can also rotate the flip out screen and take selfies by touching the screen. Wifi connectabilty is also a great feature. This camera came in a bundle with plenty of accessories. The card reader is very basic and cheap though. It is designed like a jump drive, but quality went out of the window. My favorite accessory is the external flash. I haven't had the occasion to use an external flash in the past, so I need to read the manual so I can understand how to use all the settings. I will say that I tested it to ensure it worked when I first got it and WOW. The whole room lit up like a flash grenade went off. I'm no pro, but this camera makes me feel like one. A definite 'BUY' in my poinion...also, the price was right!"},{"reviewerName":"Logan","rating":"4.0 out of 5 stars","reviewTitle":"Great camera, OK video, mixed bag accessories","reviewDate":"July 7, 2018","reviewText":"Great value kit for those interested in becoming photographers and videographers. Some of the accessories like the tripod are too low quality for much use, but just by the fact that the camera kit, microphone, and SD card makes up the cost of the kit alone, it's a great value for starting up and learning how to use each piece of equipment, like the slave flash and filters.\n\nThe telephoto and wide macros couldn't produce a clear image with the 18-55mm lens, so they might require a different lens to work properly.\n\nOne large downside is that the camera doesn't have a headphone jack, so you cannot monitor your audio live while recording. It will be fine for recording interviews, but filmmakers will want a separate device for recording sound and another, sturdier tripod.\n\nBottom line: great kit for people who want to experiment with photo /video, but limited video capabilities. Some accessories are low quality, but you basically get them for free with the camera, mic and memory card so if you use the it's a plus."},{"reviewerName":"Jordan Cowan","rating":"4.0 out of 5 stars","reviewTitle":"Canon T7i Creator kit","reviewDate":"August 28, 2018","reviewText":"So i bought this kit under a month ago and im in love with it. The camera performs better than i expected and the items in the bundle have all been put to good use, all except the tripod. I was expecting the tripod to be cheap and feeble but not THAT CHEAP AND FEEBLE. When extending the tripod legs they felt like they were about to snap. Since the day i got it to now i have not placed my camera on top of it and i don't ever plan to but who cares its technically a free accessory so it doesn't bother me that much and i bought a Joby Gorillapod 3k with the bundle which is always on my camera. Now that is a real tripod i have no complaints about anything else though everything works how it should and nothing was damaged :)"},{"reviewerName":"JD","rating":"4.0 out of 5 stars","reviewTitle":"+1 on cheap accessories...","reviewDate":"March 11, 2019","reviewText":"If it's in this kit and doesn't say Canon or Rode on it, it's probably junk. I don't trust the tripod to hold up my new camera indoors with nobody else around, it is that flimsy. Everything else with the exception of the bag is just about worthless. The bag, while cheap, does at least have some function.\nThe camera, 18-55 lens and mic are of good quality and the only reason thiskit gets 4 stars."},{"reviewerName":"Roy R.","rating":"5.0 out of 5 stars","reviewTitle":"This is a nice set","reviewDate":"April 10, 2019","reviewText":"I'm not new to cameras but this is my first DSLR. Ive been overly bust since I bought this set but the few times I did manage to grab a few shots, wow so amazing. Hard to believe how sharp and clear the pics are from this Canon. I did pick up the Canon 50mm STM lens. Icing on the cake right there. Excited to learn more about other features other then auto mode now that the weather is getting nice out. I'm pleased with my purchase and still blown away at the amazing pictures and colors that it takes."},{"reviewerName":"jason parde","rating":"1.0 out of 5 stars","reviewTitle":"Save your money and just purchase the camera alone. Bundle package is not worth it","reviewDate":"October 8, 2019","reviewText":"The camera is absolutely wonderful. As for the bundle package. I should have just bought the camera alone and saved some money as most of all the products besides the camera case are cheaply made and not of high quality. I do not trust the tripod to hold this expensive camera. Out of all the extras the only thing I am using is the camera bag, the memory card and a couple of the filters, the rest I put in a box on the shelf. Save your money. Don't buy a bundle pack"},{"reviewerName":"Alla","rating":"5.0 out of 5 stars","reviewTitle":"Great bundle for video","reviewDate":"December 14, 2018","reviewText":"Great starter bundle. Camera itself is fantastic and easy to use. The microphone is super sensitive and produces great sound for videos. Tripod is flimsy but light. Everything fits inside the provided bag, which is not super fancy but gets the job done well. Recommended."},{"reviewerName":"Maryvic Perez","rating":"5.0 out of 5 stars","reviewTitle":"Everything was great BUT tripod is TOO FLIMSY- Im going to buy ...","reviewDate":"March 7, 2018","reviewText":"Everything was great BUT tripod is TOO FLIMSY- Im going to buy a new one... my flash didnt come with the battery cap ugh! havent been able to use it -_-"},{"reviewerName":"Luis","rating":"5.0 out of 5 stars","reviewTitle":"Great camera bundle","reviewDate":"August 22, 2019","reviewText":"Love this camera and simple to set up the WiFi/Bluetooth. I am no professional or subject matter experts on cameras so I spent a lot of time researching before I purchased this one. This camera consistently popped with great reviews and I am not disappointed at all."},{"reviewerName":"kalin leonard","rating":"4.0 out of 5 stars","reviewTitle":"Great camera and mic, everything else worthless","reviewDate":"April 10, 2019","reviewText":"The camera and mic make this package worth it, but everything else is absolute junk. Like seriously you won’t use any of this stuff. Even the bag is worthless. The external flasher didn’t even work. I thought I’d use it until I was ready to invest in a real one, but nope."},{"reviewerName":"Chloe Felton","rating":"5.0 out of 5 stars","reviewTitle":"I switched from Nikon to Canon","reviewDate":"February 26, 2019","reviewText":"I love this camera, the entire kit was everything I needed and more. Some items I already have so it was a nice bonus and others were much needed to go with the camera. I'm using Canon for the first time and I'm loving it so far. I would definitely recommend this for anyone."},{"reviewerName":"Giovanni Iezzi","rating":"5.0 out of 5 stars","reviewTitle":"Tripod sucks, you should try to get a new one if it is really important for you","reviewDate":"January 31, 2019","reviewText":"It is great for any kind of photographer. The body its plastic however it does not feel like cheap plastic at all. Lens is pretty sharp for a kit lens, specially if you use it at f8. Iso noise performance is very good. About the accessories it comes with, it is a really good option in case you are starting out."},{"reviewerName":"James Heide","rating":"5.0 out of 5 stars","reviewTitle":"This camera ROCKS","reviewDate":"June 19, 2019","reviewText":"This feels like the fastest camera I have used by canon. It has a nice feel in the hand and the shutter moves quick and has a good response. The menu and touch screen are super easy to use vs older canon eos."},{"reviewerName":"thatboringasiangirl","rating":"5.0 out of 5 stars","reviewTitle":"SD adapter doesn’t work.","reviewDate":"March 30, 2018","reviewText":"I really like it so far, i haven’t seen any issues other than the SD card adapter, it doesn’t work lol. But other than that, the camera is great !"},{"reviewerName":"Peyton Redinger","rating":"4.0 out of 5 stars","reviewTitle":"Great camera, eh accessories.","reviewDate":"February 19, 2019","reviewText":"The camera, lense, and the lense kits that come with it are all really nice and good quality, however the tripod and backpack are lower quality, especially the tripod. The tripods almost like it's a child's toy like my camera would actually break it if i extended it all the way. But other than that its really nice and I'm very happy with my purchase."},{"reviewerName":"Issie","rating":"5.0 out of 5 stars","reviewTitle":"Great kit","reviewDate":"February 1, 2019","reviewText":"This is the best camera I’ve purchased. We’ve used to take photos great pictures. We will be using it for video blogging too. It basically comes with everything you need to get start."},{"reviewerName":"Cliente de Amazon","rating":"5.0 out of 5 stars","reviewTitle":"Buen paquete","reviewDate":"June 25, 2019","reviewText":"Excelente paquete, solo que el flash se ve muy corriente. La cámara trae muy buenas funciones, y el poderla usar desde el celular es fenomenal"},{"reviewerName":"Yaya","rating":"1.0 out of 5 stars","reviewTitle":"Nightmare don’t throw your money away..","reviewDate":"January 26, 2018","reviewText":"The whole bundle seemed excellent exactly like i needed it . But truth is my camera lense came scratched, so that messed up pictures and videos so much for vlogging mabey i will have better luck next time....."},{"reviewerName":"Lilian B.","rating":"2.0 out of 5 stars","reviewTitle":"Tripod","reviewDate":"June 5, 2019","reviewText":"I just tried to use the tripod for the first time and unfortunately it came broken to me. I just noticed today.\n\nI tried to call customer service, but I am not sure if it is a real phone number...."},{"reviewerName":"lola","rating":"5.0 out of 5 stars","reviewTitle":"Amazing set","reviewDate":"January 30, 2019","reviewText":"I love it"},{"reviewerName":"Darrell B.","rating":"3.0 out of 5 stars","reviewTitle":"remote came broken","reviewDate":"March 30, 2019","reviewText":"I have a lot of items that this kit comes with except for the wireless remote. At first I thought the battery was bad but when taking out the battery half the bracket to hold the battery was broken. Not cool. Now I have a lot of the stuff I don't need and no remote"},{"reviewerName":"Amazon Customer","rating":"3.0 out of 5 stars","reviewTitle":"It’s ok","reviewDate":"May 30, 2018","reviewText":"It come with everything as shown just the quality of these items is not so great for example the trippod it broke with only three uses and had item come damage it was some strap not a big deal for me but camera works fine and it all good till now 2 weeks after purchase"},{"reviewerName":"Sherry W.","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"April 5, 2018","reviewText":"Awesome"},{"reviewerName":"greg","rating":"5.0 out of 5 stars","reviewTitle":"You get A LOT for your money!","reviewDate":"August 3, 2019","reviewText":"This camera is more than I expected. It really stepped up my video game up to the next level. If you’re a beginner looking to get into video and looking to step up your game this is the product for you"},{"reviewerName":"Aracali Bertoldo","rating":"5.0 out of 5 stars","reviewTitle":"Best Gift","reviewDate":"August 11, 2018","reviewText":"I purchased this camera for my son for graduation and it was the Best decision because it has everything he needed to get started with his photography journey."},{"reviewerName":"B38","rating":"5.0 out of 5 stars","reviewTitle":"Great for a gift","reviewDate":"December 7, 2018","reviewText":"Nice set. Gift"},{"reviewerName":"ARGOS","rating":"5.0 out of 5 stars","reviewTitle":"HERMOSA NUEVA CAMARA","reviewDate":"August 31, 2018","reviewText":"TODO MUY BIEN COMPLETO COMO EQUIPADA PARA EMPEZAR A EXPLORAR ."},{"reviewerName":"Ranjit Abeyegoonewardene","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"July 4, 2018","reviewText":"very good"},{"reviewerName":"Rajesh k.","rating":"5.0 out of 5 stars","reviewTitle":"Best priced camera","reviewDate":"January 18, 2019","reviewText":"Super camera"},{"reviewerName":"Olivier nikwigize","rating":"4.0 out of 5 stars","reviewTitle":"Accessories are for trach not for sell","reviewDate":"August 2, 2019","reviewText":"Accessories are very cheap quality,,,,there are worst ever gad,,, only the mic can be used .... other are cabbages"},{"reviewerName":"Maria Viruet","rating":"5.0 out of 5 stars","reviewTitle":"Saving","reviewDate":"September 18, 2019","reviewText":"i did not dislike anything"},{"reviewerName":"amg","rating":"4.0 out of 5 stars","reviewTitle":"Kits part are cheap","reviewDate":"March 27, 2019","reviewText":"Camera is outstanding but stuff witch cake with kit is cheap and overpriced . Personally I use only big flash from the kit"},{"reviewerName":"Michael Beal","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"July 8, 2018","reviewText":"Pretty good bundle for the price"},{"reviewerName":"Daniel Delacruz","rating":"5.0 out of 5 stars","reviewTitle":"Amazing first camera","reviewDate":"May 16, 2019","reviewText":"Great first camera the bundle is nice but the lens adapters are pretty useless everything else can be used especially as a beginner"},{"reviewerName":"Connie Summers","rating":"5.0 out of 5 stars","reviewTitle":"Highly recommended and great price","reviewDate":"August 15, 2019","reviewText":"Great deal!!!! Husband loves it! Very easy to use and so many features!"},{"reviewerName":"Steven","rating":"5.0 out of 5 stars","reviewTitle":"Perfect!","reviewDate":"May 9, 2019","reviewText":"Great camera, came with everything I needed"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Best bang for your buck.","reviewDate":"February 21, 2019","reviewText":"Great bundle. Such a good deal."},{"reviewerName":"Kathleen Hempstead","rating":"5.0 out of 5 stars","reviewTitle":"Camera takes amazing photos","reviewDate":"October 25, 2019","reviewText":"I love this camera. Takes crystal clear photos. I probably didn't need all the accessories though"},{"reviewerName":"Jorge","rating":"5.0 out of 5 stars","reviewTitle":"Camara Canon EOS Rebel T7i","reviewDate":"February 6, 2019","reviewText":"lo que mas me gusto de la cámara Canon EOS Rebel T7i es todos los comandos Automáticos que tiene."},{"reviewerName":"Bri","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"May 9, 2018","reviewText":"The camera is a great camera, but the Canon EOS 70 D is a better option."},{"reviewerName":"Christine Davis","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"May 8, 2018","reviewText":"Love everything about this"},{"reviewerName":"Bryan Middelhof","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"May 15, 2018","reviewText":"Everything works great."},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Perfect! Happy wife","reviewDate":"March 6, 2018","reviewText":"Christmas present for my wife. Perfect! Happy wife, happy life!"},{"reviewerName":"Israel Erraez","rating":"5.0 out of 5 stars","reviewTitle":"Rápido y cencillo","reviewDate":"September 15, 2018","reviewText":"Excelente producto"},{"reviewerName":"Muhammad Mirza","rating":"5.0 out of 5 stars","reviewTitle":"Everything is nice","reviewDate":"July 6, 2018","reviewText":"Nice"},{"reviewerName":"DeLilah Brown","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"October 25, 2017","reviewText":"The camera is working fine."}]}