{"title":"Nikon D5600 24.2 MP DSLR Camera AF-P DX 18-55mm and 70-300mm NIKKOR Zoom Lens Kit and Accessory Bundle","manufacturer":"Ultimate Deals","currentPrice":"$699.00","rating":"4.2 out of 5 stars","totalRatings":"18 ratings","features":["\n         Make sure this fits\n                by entering your model number.\n        \n","BUNDLE INCLUDES: 32GB Extreme SD Memory UHS-I Card - Camera Bag .43x Wide Angle Lens with Macro - Pro 2x Telephoto Lens Converter - 55mm UV, Polarizer & FLD Deluxe Filter Kit (Set of 3 + Carrying Case) - Slave Flash - Remote Control - 12\" Rubberized Spider Tripod - Lens Cleaning Pen - Hi-Speed Memory Card Reader - Tri-fold Memory Card Wallet - Professional Blower Camera Dust Removal System – Ultimate Deals Microfiber Cleaning Cloth"],"reviewsAspects":["missing","sent","items","nikon","lenses","card","pictures"],"productInformation":[{"Shipping Information":"View shipping rates and policies"},{"ASIN":"B07NRRNNSV"},{"Customer Reviews":"4.2 out of 5 stars\n    18 ratings\n4.2 out of 5 stars"},{"Best Sellers Rank":"#7,412 in Camera & Photo (See Top 100 in Camera & Photo)\n#284 in DSLR Cameras\n"},{"Date first listed on Amazon":"March 26, 2019"}],"productDescription":[],"reviews":[{"reviewerName":"Derrick Picker","rating":"3.0 out of 5 stars","reviewTitle":"Good Bundle But Be Aware. Missing a number of items.","reviewDate":"June 6, 2019","reviewText":"So the bundle is good. Comes with everything you could ask for. I like the bag, it is big enough easily for 4 lenses and everything else. So a number of things are missing. First the picture and the description shows a 12\" tripod. It does not come with this. The USB Card reader is useless. Doesn't work at all. The D5600 does not allow for an IR remote however this bundle comes with one and is also useless. Many items missing I lost count."},{"reviewerName":"Amazon Customer","rating":"1.0 out of 5 stars","reviewTitle":"Did not work","reviewDate":"June 12, 2019","reviewText":"I was sent a \"brand new camera\" that did not have a manual. Also after being on the phone with Nikon, I learned that my SD card slot did not. Nikon told me to send it back. Waiting on the seller to contact me. Also, everything that is not the body and the two lenses is off brand."},{"reviewerName":"JJ Garcia","rating":"4.0 out of 5 stars","reviewTitle":"The lenses are decent but consider higher quality lenses as you will want to improve your craft.","reviewDate":"July 19, 2019","reviewText":"I purchased the camera days before going on vacation. The pictures I took on my recent vacation turned out great. The ease in which they uploaded to my phone so I could share them with family was amazing. The one problem I had was that I live in the US. The charger sent to me was European. The customer service representative tried to get that fixed but I received a portable mini memory card case and lens cleaning kit instead of the charger. I got tired and just ordered a charger on my own."},{"reviewerName":"Hebert Oliveira","rating":"5.0 out of 5 stars","reviewTitle":"Camera easy to user e very good!","reviewDate":"May 16, 2019","reviewText":"I bought this camera for my wife and she loved it! very easy to use and the accompanying accessories are very useful! the seller sent us very fast and we are very satisfied."},{"reviewerName":"Katy G.","rating":"2.0 out of 5 stars","reviewTitle":"No user manual and charger is European","reviewDate":"August 29, 2019","reviewText":"I don’t think this is a new camera. No user manual and the packaging is off. The charger is European. Leaving for vacation so hopefully I don’t have any issues with it."},{"reviewerName":"Brenda S.","rating":"5.0 out of 5 stars","reviewTitle":"Nice Product, Good customer Service.","reviewDate":"August 13, 2019","reviewText":"We have owned Nikon camera in the past and loved them. We just needed to replace an older one. We found this package deal and it was the one that met our needs. The only downfall that we had is when we had gotten the package we were missing the 3 filters that came with it. I sent the company an email and with in two hours they had responded and are sending out the missing items . That is very good service. Very happy with the purchase."},{"reviewerName":"Rebecca Contreras","rating":"5.0 out of 5 stars","reviewTitle":"Love it","reviewDate":"August 26, 2019","reviewText":"We looked around and compared bundles for over a month before we decided on this one. We are so glad we did. When it first arrived, we were missing a couple of things. We just sent them an email about it, they sent out the missing items plus a couple of bonus items. No big deal. Love the camera and quality of pictures. Easy to get started. Now just need to learn more about everything the camera is capable of doing."},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Perfect for beginner photographers","reviewDate":"May 23, 2019","reviewText":"Came on time and as expected......except the memory card ( ͡° ͜ʖ ͡°)"},{"reviewerName":"Ronnie Raley","rating":"5.0 out of 5 stars","reviewTitle":"Really nice camera","reviewDate":"August 16, 2019","reviewText":"Really nice camera to take on vacation."},{"reviewerName":"theblob654","rating":"5.0 out of 5 stars","reviewTitle":"Awesome service","reviewDate":"April 12, 2019","reviewText":"Amazing service from this company. Everything has been amazing"},{"reviewerName":"Cristians Rivas","rating":"5.0 out of 5 stars","reviewTitle":"Gorgeous pictures","reviewDate":"September 11, 2019","reviewText":"The picture quality is gorgeous. The camera is pretty light. For the purpose I bought it though, this was not the Camara for me. The 300mm lense has a nice zoom but not for what I needed it. Overall, the camera was great."},{"reviewerName":"Jan M.","rating":"5.0 out of 5 stars","reviewTitle":"great camera","reviewDate":"September 19, 2019","reviewText":"Everything was/is perfect"},{"reviewerName":"KEN","rating":"5.0 out of 5 stars","reviewTitle":"Portability","reviewDate":"July 19, 2019","reviewText":"Nice features. Nikon is very good brand. I have been using nikon for long time. I bought this for for portability."},{"reviewerName":"Oneida Aguilera","rating":"5.0 out of 5 stars","reviewTitle":"Excelente cámara","reviewDate":"July 5, 2019","reviewText":"We love it"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Awesome camera!","reviewDate":"July 12, 2019","reviewText":"This camera is amazing. There are lots of bells and whistles that I am still trying to figure out but everything is amazing!"},{"reviewerName":"kirt","rating":"5.0 out of 5 stars","reviewTitle":"Takes really great pictures","reviewDate":"July 14, 2019","reviewText":"very impressed"},{"reviewerName":"M. Val","rating":"5.0 out of 5 stars","reviewTitle":"Good. Good.","reviewDate":"August 24, 2019","reviewText":"Came safe and sound. It was delivered on time and without problem."},{"reviewerName":"STEVEN RABITO","rating":"5.0 out of 5 stars","reviewTitle":"Definitely got what I paid for","reviewDate":"August 24, 2019","reviewText":"Awesome camera kit"}]}