{"title":"Canon EOS Rebel T7 DSLR Camera Bundle with Canon EF-S 18-55mm f/3.5-5.6 is II Lens + 2pc SanDisk 32GB Memory Cards + Accessory Kit","manufacturer":"Canon","currentPrice":"$459.00","rating":"4.5 out of 5 stars","totalRatings":"99 ratings","features":["\n         Make sure this fits\n                by entering your model number.\n        \n","This Camera Bundle Kit comes complete with all manufacturer supplied accessories with a 1-year warranty and includes:","The EOS Rebel T7 DSLR Camera from Canon has a 24.1MP APS-C CMOS Sensor and DIGIC 4+ Image Processor. It has a 3.0\" 920k-Dot LCD Monitor with Full HD 1080/30p Video Recording capabilities. It offers sharp details, accurate colors and low-noise imaging in both bright and low-light shooting situations. The Rebel T& can continuously shoot up to 3 fps.","Canon 18-55mm II Lens - a standard zoom compatible with Canon APS-C format cameras. It features a focal length range of 18-55mm which is equivalent to 29-88mm in the 35mm format","2 x SanDisk 32GB SDHC Memory Cards + Deluxe Padded Camera Case + Flash Light + 3pc Filter Kit + Extra Battery Pack + AC/DC Car & Home Charger + High Speed USB Card Reader + 50\" Camera Tripod","0.43x Auxiliary Wideangle Lens - it conveniently mounts to the front of your fixed or zoom lens, and allows you to capture a wider field of view, 2.2x Auxiliary Telephoto Lens - brings you twice as close to the action. Perfect for long-distance photo situations such as sporting events"],"reviewsAspects":["easy to use","great value","worth the money","user friendly","long time","great camera","extra battery","everything you need","good quality","love with this camera","camera bag","accessories","flash","tripod","pictures","beginner","bundle","kit","cameras","lens"],"productInformation":[{"Product Dimensions":"5.1 x 4 x 3.1 inches"},{"Item Weight":"8.2 pounds"},{"Shipping Weight":"8.2 pounds (View shipping rates and policies)"},{"ASIN":"B07P15K8Q7"},{"Item model number":"Canon T7"},{"Batteries":"2 Lithium ion batteries required. (included)"},{"Customer Reviews":"4.5 out of 5 stars\n    99 ratings\n4.5 out of 5 stars"},{"Best Sellers Rank":"#192 in Camera & Photo (See Top 100 in Camera & Photo)\n#1 in DSLR Cameras\n"},{"Date first listed on Amazon":"February 21, 2019"}],"productDescription":[],"reviews":[{"reviewerName":"Meri","rating":"5.0 out of 5 stars","reviewTitle":"Good Starter kit","reviewDate":"April 13, 2019","reviewText":"I purchased this as a gift but I own several Canon products. This is a good starter kit as it provides enough for the person to experiment and learn about photography and the equipment before deciding what els they may need. The person was pleasantly surprised by the amount of things that actually came in the package."},{"reviewerName":"Renso Espino","rating":"1.0 out of 5 stars","reviewTitle":"Dear friend. The flash does not work the camera does not recognize it, you need me to make a change","reviewDate":"May 23, 2019","reviewText":"Dear friend. The flash does not work the camera does not recognize it, you need me to make a change"},{"reviewerName":"B Fisher","rating":"3.0 out of 5 stars","reviewTitle":"No center contact on hotshoe","reviewDate":"May 5, 2019","reviewText":"I like the camera, BUT, Canon pulled a fast one, they removed the center contact on the hotshoe. I can't use any flash or accessories that I already have with that connection and I have searched for an adapter, so far nothing available. Will probably have to return and get T6 or another model"},{"reviewerName":"Kathy M","rating":"5.0 out of 5 stars","reviewTitle":"Go for it","reviewDate":"May 5, 2019","reviewText":"Just beginning to look at and put all together. New to digital cameras so gonna take some time but excited about getting going. Have always wanted one and am 64 years old and decided not getting any younger and to go for it do something I will enjoy and for myself."},{"reviewerName":"Daniela Conejo","rating":"5.0 out of 5 stars","reviewTitle":"Is this 5 stars worthy?","reviewDate":"April 13, 2019","reviewText":"For years I had been looking for a god camera searching the best deal and I found it here. Great camera, great price and great customer service! At the last minute I was placing an order with a different seller and then I saw this one and was marvelous (the relation price/quality). This specific item doesn't have reviews but checking some others on the seller profile I read some comments and reviews and something that really caught my attention was all the people talking about the accessories and the \"low quality that they received\" I gonna be honest for me all these things are great for a beginner and is usually the market that bought these kind of cameras so you don't need a lot of fancy stuff if you're not really used it.\n(At the end the most important thing is the camera and the quality and that is something that corresponds to Canon not to the seller and for that you can check some reviews on YouTube for learning more about THE CAMERA)\n\nSo here are some comments about the accessories bundle:\n\n-Additional battery with additional charger that are from a great brand and these for traveling is super useful!\n-Case for protecting your camera good quality and good space for the basics.\n-Additional lenses that are okay for a beginner\n-Sd cards good brand as well are more than enough space.\n-The digital flash you just need to buy some batteries and that's it.\n\nNooow the tripod is super basic an cheap and will be a little bit dangerous for your camera to use it but basically you're receiving it for free soooo... Amazon has other options there that you can use if you think that a tripod is really necessary in your kit.\n\nBasically I was checking for this camera in my country (Costa Rica) and just for the camera you will be paying around $575 we are talking of a total $600\n$575 the camera\n$20 bag\n$20 extra battery and charger\n$25 extra lenses\n$35 SD cards\n\nWe're are talking that just with that will be around $675.\n\nAnd I pay for this $483.85 including taxes, 2 day delivery.\nArrived earlier, everything well packaged and safe! I bought this basically for moving my pictures from the quality of my cellphone to something more \"pro\" so if you are a beginner like me this will be amazing and super exciting. So definitely trought the process if I need a new camera I will be looking here again."},{"reviewerName":"Ultimaron","rating":"4.0 out of 5 stars","reviewTitle":"Not too bad, the sd cards that were in the kit were the best...","reviewDate":"July 13, 2019","reviewText":"Not too bad, the sd cards that were in the kit were the best part of the \"accessories \". The screw on wide/telephoto/macro \"lenses\" are pretty much a joke. The tripod was not worth the money, replaced it after the 2nd day. The canera bag is decent but the strap is small. Camera preforms fantastically, but if I could do it again I would buy the Camera alone."},{"reviewerName":"Cody Galand","rating":"5.0 out of 5 stars","reviewTitle":"Highly Recommend","reviewDate":"April 30, 2019","reviewText":"I highly recommend this! It's such a great bundle with everything a beginner needs."},{"reviewerName":"Dr. David Wintergerst","rating":"5.0 out of 5 stars","reviewTitle":"Expect better results with experience.","reviewDate":"April 23, 2019","reviewText":"As a gift for my wife, I could hear her frustration as she attempts to familiarize herself with this camera. My daughter has it and said the DVD that came with hers was a huge asset but that one can search the internet for helpful tips as well (Ours had no DVD). The quality of the pictures is professional and the WiFi connection will be utilized frequently."},{"reviewerName":"Amazon Customer","rating":"4.0 out of 5 stars","reviewTitle":"Great beginner Camera","reviewDate":"April 12, 2019","reviewText":"I like how is it easy to operate being a beginner. I cant wait for the weather to warm up a bit to test outside. In all the natural light. I'm glad I picked the whole package, all those small things you dont think of are there in the box. Instead of just buying just a body and you would have still needed to make additional purchases."},{"reviewerName":"Melaku D","rating":"3.0 out of 5 stars","reviewTitle":"The flash light is not compatible with the camera","reviewDate":"May 11, 2019","reviewText":"Hey the flash light is not compatible with the camera . They send me external flash light which is can’t be seated with the camera ."},{"reviewerName":"Workin' from home","rating":"3.0 out of 5 stars","reviewTitle":"Only one Canon battery included","reviewDate":"October 7, 2019","reviewText":"The extra battery that comes with the accessories is not a Canon battery and does not fit into the Canon charger. There is an extra charger included, but I'm a little worried about using this knock-off battery in the camera - the fit is different than the Canon battery. So, I thought I was getting two Canon batteries, but actually only one of the batteries included is a Canon. Some of the other accessories are pointless as well - but the camera itself is amazing and I love the photos I get with it. Just wish I had known about the battery difference, and I would have ordered an extra name brand battery - as it is now, there is not time for shipping to receive it before we leave on our trip."},{"reviewerName":"Chicken Nugget","rating":"5.0 out of 5 stars","reviewTitle":"Super good for beginners","reviewDate":"May 8, 2019","reviewText":"I’ve only ever had point and shoots and wanted to upgrade to a dslr. This camera is easy for me to use with the help of YouTube videos. Great pictures. Comes with lots of accessories."},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Great camera!","reviewDate":"July 14, 2019","reviewText":"This is a good camera. On its fully automatic setting, it will consistently take good pictures. It also allows the photographer to control various settings and leave most on automatic, or set it to fully manual and you can control everything. I'm still learning basic photography, but I can see this being used for a long time.\n\nP.S. I just bought a longer zoom lens (55-250mm) and it works great with this camera body!"},{"reviewerName":"Christine Hart","rating":"4.0 out of 5 stars","reviewTitle":"A very good starter bundle","reviewDate":"August 16, 2019","reviewText":"Was not disappointed. I was honestly expecting junk, camera aside, considering how much you were getting for the price. Yeah, the tripod is flimsy but it is very compact, good for hiking. The macro filters, no they won't perform like an actual macro lens but they're not bad at all (the pictures I added are with the macro filters). This is a very good entry level bundle. I haven't tried the slave flash yet, probably won't use it at all once I replace my speedlite as you can't aim the light. Over all, I'm very happy with this purchase. I'm seeing people complain about the flash so I just want to add that the flash is an external slave flash, not a hot shoe flash. It's not very good quality but it's basically free."},{"reviewerName":"Wily Girl","rating":"5.0 out of 5 stars","reviewTitle":"Great package","reviewDate":"June 4, 2019","reviewText":"I saw a package that was $60 less, and was the camera, bag and a supplemental lens. Having done photography a very long time ago, when I saw this I jumped on it. I would recommend buying the dummies book as well. Just for the extra memory card, battery, filters and tripod it is worth it. When I opened the box it was like Christmas with all the accessories! Now I need to find the time to refresh my skills and put it to use. Definitely worth the money and a great package for beginners, or those who have some experience and want to take it to the next level."},{"reviewerName":"Linda","rating":"4.0 out of 5 stars","reviewTitle":"Camera is nice...","reviewDate":"November 11, 2019","reviewText":"I have had DSLR cameras before but this one is taking a lot more time to figure out. The bundle is okay. The case isn’t much. I’m buying a more substantial one to put my camera in. I have never tried this type of “zoom” and “wide angle” lens adapter but hopefully I will get used to them before I need the camera. I purchased it for a trip next year. Right now, I would recommend it, just for the camera, filters and lens adapters. Not a fan of the flash that came with it. Price, I’m not so sure if. I have found nicer bundles at local camera shops. Should have done more research before buying. My mistake."},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Great Purchase","reviewDate":"June 12, 2019","reviewText":"Birthday gift for my 16 year old daughter. She has wanted a nice camera set up for a long time.... and this one has hit every aspect she was looking for! The pictures are so clear and she loves how quickly she can edit and send pictures to people. She already has people asking her to do their Senior pictures! Great value with everything coming in the bundle.... plus this made it so easy for me to purchase for her... everything she needed was already there! I definitely recommend this camera. Cannon has outdone themselves on this one."},{"reviewerName":"LN","rating":"3.0 out of 5 stars","reviewTitle":"Extra flash does not work","reviewDate":"September 5, 2019","reviewText":"Extra flash will not work with camera. I have tried everything. Called technical support and tried suggested setup on the side of camera and flash still does not work. Disappointed because a flash for camera is expensive."},{"reviewerName":"derrick brooks","rating":"5.0 out of 5 stars","reviewTitle":"First Camera, love it so far","reviewDate":"September 11, 2019","reviewText":"Great value for the money. Wish it came with a second lens though. But so far I love this as a first camera. The external flash ain't worth nothing though. It doesn't work with the hot shoe. Only the slave function. But it comes w plenty of attachments to play w. Tripod stands as low as 1 foot to about 3 or 4 foot."},{"reviewerName":"Paxjuno","rating":"5.0 out of 5 stars","reviewTitle":"Great set offered by amazon.","reviewDate":"May 7, 2019","reviewText":"Very nice camera you can go automatically or set the controls manually."},{"reviewerName":"Jazmine","rating":"3.0 out of 5 stars","reviewTitle":"Where's my second battery?","reviewDate":"July 11, 2019","reviewText":"Got everything but the second battery."},{"reviewerName":"Belinda Lathan","rating":"5.0 out of 5 stars","reviewTitle":"WHAT A STEAL!!!! AWESOME BARGAIN","reviewDate":"July 21, 2019","reviewText":"This camera set if sold separately would cost 3 times the amount! It comes with everything you need to start taking photos and video. Every accessory you can think of you get with this set. The camera is quality and the camera bag is the perfect size. I highly recommend this for your own use, but given as a gift....let's just say whoever receives it from you will be very happy!"},{"reviewerName":"Scott Simons","rating":"5.0 out of 5 stars","reviewTitle":"Great value.","reviewDate":"June 9, 2019","reviewText":"Got this for my daughter’s 18th birthday. Great value with all the additional items included. As a beginner she is still trying to figure everything out, but is having a fun time doing it."},{"reviewerName":"10 Brothers Photography","rating":"2.0 out of 5 stars","reviewTitle":"Tripod is very very gerneric.","reviewDate":"June 9, 2019","reviewText":"Hello, as A professional who has been to the Congressional Caucus under and for President Barack Hussein Obama, This camera package was the best on the market but was highly disappointed with the Tripod so much so I overlooked the high quality camera itself thus the overall rating on this package so low."},{"reviewerName":"Miguel","rating":"4.0 out of 5 stars","reviewTitle":"Missing Item","reviewDate":"November 10, 2019","reviewText":"I would of given this a five star rating if it weren't for the fact that my bundle didn't include the SD card reader shown in the previews. After I opened the package what I saw a small piece of blue and white plastic labeled SD card reader. The reader didn't work and was flimsy."},{"reviewerName":"Brandi","rating":"5.0 out of 5 stars","reviewTitle":"Love this!","reviewDate":"October 22, 2019","reviewText":"Love this camera and how light it is! It's easy to use and takes great pics! It came with one broken accessory but Amazon was good to replace that."},{"reviewerName":"Andrea Major","rating":"5.0 out of 5 stars","reviewTitle":"Love it!","reviewDate":"September 2, 2019","reviewText":"Definitely came with way more accessories than I expected! Camera is great, so much to learn. I have had fun playing with settings and lenses!"},{"reviewerName":"Andrew Spirit","rating":"4.0 out of 5 stars","reviewTitle":"Good camera, lens and bag, but everything else?......","reviewDate":"October 15, 2019","reviewText":"Great camera, but just buy the camera and kit lens all the extras are very cheap. Better off buying everything you need separately so get better quality accessories"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Excellent Image Quality - Many Options for both Still and Video","reviewDate":"June 19, 2019","reviewText":"I have 4 older Canon Cameras and all have been excellent - Bought this to eliminate the mandatory LCD screen shooting on the Point / Shoot cameras - Very difficult to use these outdoors on a sunny day. Have an Older Nikon DSLR but did not have movie capability - so this has all the features that I need."},{"reviewerName":"Dong Zhang","rating":"5.0 out of 5 stars","reviewTitle":"Nice device as usual","reviewDate":"August 15, 2019","reviewText":"It is Canon, brand of high quarlity and professional device. Work perfectly as my other Canon devices.\n— A Fan of Canon :-)"},{"reviewerName":"Amazon Customer","rating":"1.0 out of 5 stars","reviewTitle":"Shop around !","reviewDate":"September 15, 2019","reviewText":"Not very user friendly . Lots of cheap un need filters and junk tripod. Shop around before you buy .!!"},{"reviewerName":"SPG","rating":"5.0 out of 5 stars","reviewTitle":"Great Value","reviewDate":"September 15, 2019","reviewText":"Love all the possibilities with this camera. There were a lot of accessories with this bundle. Would suggest watching some videos if you're new to digital cameras."},{"reviewerName":"G. Scott","rating":"5.0 out of 5 stars","reviewTitle":"download the manuels, read it all!","reviewDate":"May 14, 2019","reviewText":"personal use, vacations"},{"reviewerName":"Amazon Customer","rating":"4.0 out of 5 stars","reviewTitle":"Fun to learn...","reviewDate":"April 27, 2019","reviewText":"I’m very happy. You get a lot for your money. Cameras have changes a lot from my first Cannon AE1 35mm."},{"reviewerName":"GG","rating":"5.0 out of 5 stars","reviewTitle":"Good buy for a camera","reviewDate":"June 2, 2019","reviewText":"I bought this camera for my granddaughter. She will be doing photography in Community College. Very good for the money."},{"reviewerName":"Momma P","rating":"5.0 out of 5 stars","reviewTitle":"Awesome product","reviewDate":"November 9, 2019","reviewText":"It's a great camera and easy to use. Definitely pleased with my purchase."},{"reviewerName":"george goggans","rating":"5.0 out of 5 stars","reviewTitle":"best deal ever!!","reviewDate":"June 18, 2019","reviewText":"unbelievable all the extras u get!! love it!!"},{"reviewerName":"lane robinson","rating":"5.0 out of 5 stars","reviewTitle":"Great little setup","reviewDate":"September 5, 2019","reviewText":"Love it, great little starter camera for family pics, outings, and some small jobs taking pics for website updates and my blog... will definitely need more add-ons in the future, but I love the case and extra battery, charger, sd cards, and filter lenses that came with it..."},{"reviewerName":"Jorge Caraballo","rating":"5.0 out of 5 stars","reviewTitle":"Great slr camera for small price","reviewDate":"November 1, 2019","reviewText":"Great camera for beginners ready to use and amazing graphics truly been a learning experince taking picture like a pro ......worth the money.....help that it came with every i needed to start my photography adventure"},{"reviewerName":"MissD","rating":"4.0 out of 5 stars","reviewTitle":"Great bundle expect for tripod","reviewDate":"November 11, 2019","reviewText":"Great camera I love it. The tripod is flimsy and balance is of."},{"reviewerName":"MrCreativity","rating":"5.0 out of 5 stars","reviewTitle":"Love my T7","reviewDate":"April 30, 2019","reviewText":"No complaints! Great price...great bundle...great pics. Get it now!"},{"reviewerName":"Joseph Bohn","rating":"5.0 out of 5 stars","reviewTitle":"Caution with spare battery","reviewDate":"May 17, 2019","reviewText":"Great camera for beginners. Everything included is great except for the spare battery. (Which I enclosed a pic of). It won’t fit in the camera because it appears to be broken."},{"reviewerName":"Mschelle","rating":"5.0 out of 5 stars","reviewTitle":"Hubby's Happy","reviewDate":"May 4, 2019","reviewText":"Bought for husband who wants to get into photography. He loves it!"},{"reviewerName":"Lucas","rating":"4.0 out of 5 stars","reviewTitle":"Futuros fotografos","reviewDate":"June 21, 2019","reviewText":"es la cámara ideal para el que quiere iniciarse en la fotografía profesional."},{"reviewerName":"Yordy Rosales","rating":"3.0 out of 5 stars","reviewTitle":"Research more","reviewDate":"September 24, 2019","reviewText":"I think you can get others for the same price"},{"reviewerName":"heather","rating":"5.0 out of 5 stars","reviewTitle":"Hubbys Xmas in July","reviewDate":"September 23, 2019","reviewText":"Got this for my hubby as a Christmas gift. It came in and it was given. My hubby really enjoys this camera and all the extras. great for first time users."},{"reviewerName":"Corey","rating":"5.0 out of 5 stars","reviewTitle":"Best purchase ever.","reviewDate":"July 16, 2019","reviewText":"I am absolutely in love with this camera. I’m a mom of 4 and needed a new hobby. It’s easy to use and I’ve captured so many beautiful images. The bundle provides you with so much."},{"reviewerName":"Asia","rating":"5.0 out of 5 stars","reviewTitle":"Super worth the price","reviewDate":"June 27, 2019","reviewText":"I loved everything that came with this package and this camera is super easy and light to use"},{"reviewerName":"Michael","rating":"5.0 out of 5 stars","reviewTitle":"As Described! Great buy","reviewDate":"July 25, 2019","reviewText":"Bought this product as a beginner and it could not have been better! Everything arrived well packaged and in perfect condition. Camera works well, and is user friendly :)"},{"reviewerName":"John Yarbro","rating":"3.0 out of 5 stars","reviewTitle":"INCOMPATIBLE EXTERNAL FLASH","reviewDate":"October 10, 2019","reviewText":"The flash provided with the camera kit does not work with the camera."},{"reviewerName":"Edwin Gonzalez","rating":"5.0 out of 5 stars","reviewTitle":"excellent choice","reviewDate":"September 25, 2019","reviewText":"very good price"},{"reviewerName":"Alyssa Norwood","rating":"5.0 out of 5 stars","reviewTitle":"Very user friendly, beautiful pictures!","reviewDate":"July 4, 2019","reviewText":"I don’t have any experience with cameras other than with my phone and this camera is super easy to use! Takes GORGEOUS pictures and connects to my phone easily!"},{"reviewerName":"Barb Tolles","rating":"3.0 out of 5 stars","reviewTitle":"Not what I expected.","reviewDate":"June 18, 2019","reviewText":"I would like to return the whole bundle.\nWas not what I expected. How can I get do that and get a refund."},{"reviewerName":"Stephen N Kuzy","rating":"5.0 out of 5 stars","reviewTitle":"Love it.","reviewDate":"September 2, 2019","reviewText":"Got this for work and needed a multifunction camera. This really fits the bill, my boss will be please with how I spent his money."},{"reviewerName":"walawaladingdong","rating":"5.0 out of 5 stars","reviewTitle":"Awesome","reviewDate":"November 3, 2019","reviewText":"The camera is more expensive in a brick-and-mortar store without the accessories. Glad I can find this cute kit"},{"reviewerName":"rayann74","rating":"5.0 out of 5 stars","reviewTitle":"Worth the price","reviewDate":"September 9, 2019","reviewText":"I'm so excited to put this to use! Going to the mountains next month for fall colors and can't wait to capture the vibrant colors"},{"reviewerName":"Unknown","rating":"4.0 out of 5 stars","reviewTitle":"Yes","reviewDate":"May 15, 2019","reviewText":"Just received camera too early to evaluate."},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Easy to use. Everything you need to get started","reviewDate":"July 6, 2019","reviewText":"The tripod could be better. Watch a bunch of YouTube videos to learn how to use it. The photos I posted were taken with what comes in the kit, unedited."},{"reviewerName":"Cliente Amazon","rating":"5.0 out of 5 stars","reviewTitle":"Excelente cámara","reviewDate":"October 1, 2019","reviewText":"Excelente"},{"reviewerName":"Lindsay Ludden","rating":"5.0 out of 5 stars","reviewTitle":"Don't drop it or set it on fire.","reviewDate":"June 22, 2019","reviewText":"Canon put alot of thought into this DSLR. Easy to use, great for beginners but much better all around than my previous DSLR, the Rebel t5."},{"reviewerName":"Ivan montiel","rating":"5.0 out of 5 stars","reviewTitle":"Great for beginners","reviewDate":"May 16, 2019","reviewText":"Great for beginners"},{"reviewerName":"HRutledge","rating":"5.0 out of 5 stars","reviewTitle":"Best value for money spent.","reviewDate":"August 27, 2019","reviewText":"It’s a little complicated to use without reading pages from the manual."},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Good camera","reviewDate":"August 17, 2019","reviewText":"Nice camera! Very good for new photographer."},{"reviewerName":"Patricia phillips","rating":"5.0 out of 5 stars","reviewTitle":"It is a great","reviewDate":"June 17, 2019","reviewText":"It is a great so far i love it"},{"reviewerName":"Ina","rating":"4.0 out of 5 stars","reviewTitle":"awesome","reviewDate":"April 10, 2019","reviewText":"great buy"},{"reviewerName":"Nae Nae","rating":"5.0 out of 5 stars","reviewTitle":"Great","reviewDate":"November 6, 2019","reviewText":"This camera is very nice, my daughter loves it too."},{"reviewerName":"Gerald Lange","rating":"5.0 out of 5 stars","reviewTitle":"Ease of use.","reviewDate":"November 2, 2019","reviewText":"It was very easy to set up and go, quite exciting to be able to start producing right from the beginning."},{"reviewerName":"Rational Consumer","rating":"5.0 out of 5 stars","reviewTitle":"Great products!","reviewDate":"October 9, 2019","reviewText":"Products as advertised! Great quality, fast delivery! Overall 100% satisfied."},{"reviewerName":"Carlos","rating":"4.0 out of 5 stars","reviewTitle":"Need lenses","reviewDate":"April 24, 2019","reviewText":"Good picture , flash not as expected"},{"reviewerName":"winston duncan","rating":"5.0 out of 5 stars","reviewTitle":"Good quality! Convenient packaging!","reviewDate":"October 5, 2019","reviewText":"I bought this as a birthday gift for myself. Will be using it on my upcoming vacation."},{"reviewerName":"Frankie","rating":"5.0 out of 5 stars","reviewTitle":"Great Bundle","reviewDate":"September 15, 2019","reviewText":"Great bundle that comes with alot of accessories for beginners at a good price."},{"reviewerName":"Joseph Vechiola","rating":"4.0 out of 5 stars","reviewTitle":"Great camera, VERY LOW quality accessories!","reviewDate":"May 20, 2019","reviewText":"Tripod broken immediately, same with strap for carry bag... disappointing. Love the camera!"},{"reviewerName":"Katelyn Theriault","rating":"5.0 out of 5 stars","reviewTitle":"Value","reviewDate":"November 5, 2019","reviewText":"Took our wedding photos with this camera, the photos come out fantastic!"},{"reviewerName":"Becky Poole","rating":"5.0 out of 5 stars","reviewTitle":"Great camera","reviewDate":"July 30, 2019","reviewText":"Amazing camera that takes amazing pictures!!!"},{"reviewerName":"Mady Sandoval","rating":"4.0 out of 5 stars","reviewTitle":"Execent camera for the price.","reviewDate":"October 26, 2019","reviewText":"Everything arrived perfectly with full instructions, ready to use and well worth the money."},{"reviewerName":"Sonar","rating":"5.0 out of 5 stars","reviewTitle":"Does the job","reviewDate":"August 27, 2019","reviewText":"Good camera"},{"reviewerName":"petra","rating":"5.0 out of 5 stars","reviewTitle":"great value!","reviewDate":"September 28, 2019","reviewText":"a lot of fantastic high quality products at a good price"},{"reviewerName":"rafael","rating":"5.0 out of 5 stars","reviewTitle":"Very good","reviewDate":"April 24, 2019","reviewText":"I love it"},{"reviewerName":"Jennifer Trivett","rating":"4.0 out of 5 stars","reviewTitle":"Great camera","reviewDate":"May 5, 2019","reviewText":"Love this camera!"},{"reviewerName":"stacey smith","rating":"5.0 out of 5 stars","reviewTitle":"Easy to use","reviewDate":"July 14, 2019","reviewText":"Bought it for graduation for my 17 yr. Old daughter.she LOVES it."},{"reviewerName":"Darius","rating":"5.0 out of 5 stars","reviewTitle":"Great Professional camera","reviewDate":"August 31, 2019","reviewText":"Great camera!"},{"reviewerName":"Antoinette Evans","rating":"5.0 out of 5 stars","reviewTitle":"Easy to use","reviewDate":"November 4, 2019","reviewText":"I got a lot for my money."},{"reviewerName":"Samuel Johnson","rating":"5.0 out of 5 stars","reviewTitle":"Great deal","reviewDate":"September 30, 2019","reviewText":"Good product, got everything just as it is in the picture"},{"reviewerName":"SS","rating":"5.0 out of 5 stars","reviewTitle":"1st DSLR","reviewDate":"May 16, 2019","reviewText":"still learning, but so far so good."},{"reviewerName":"patty rutledge","rating":"5.0 out of 5 stars","reviewTitle":"Quality","reviewDate":"September 30, 2019","reviewText":"Wonderful"},{"reviewerName":"Dustin","rating":"4.0 out of 5 stars","reviewTitle":"Good camera","reviewDate":"April 12, 2019","reviewText":"Easy to use"},{"reviewerName":"RICHARD","rating":"3.0 out of 5 stars","reviewTitle":"Definitely NOT for beginners!!","reviewDate":"June 5, 2019","reviewText":"I purchased this bundle for my wife for her birthday. She is not familiar with cameras of this type at all and it was completely overwhelming for her. I know a little about how to setup and use this level of camera and I too soon found out it is not for the novice user. Great package. Much more product than expected. Great for someone that is already fluid with camera products. Maybe not at the professional level but definitely not at the beginner level. Returned it for a refund. Perhaps someone more astute can use it."},{"reviewerName":"Falina5555","rating":"1.0 out of 5 stars","reviewTitle":"Don't waste your time on this one.","reviewDate":"October 30, 2019","reviewText":"This is the worst camera you can find. Picture is bed, colors are pale."},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Perfect","reviewDate":"July 10, 2019","reviewText":"Good"},{"reviewerName":"Mercedes C. Morgan","rating":"5.0 out of 5 stars","reviewTitle":"Excellent","reviewDate":"November 12, 2019","reviewText":"Super clear focus and fantastic colors, beautiful angles and exact expressions"}]}