{"title":"Canon EOS Rebel T7 Digital SLR Camera Bundle + EF-S 18-55mm f 3.5-5.6 is II Lens + 58mm 2X Professional Telephoto & 58mm Wide Angle Lens + 64GB Memory Card + Camera Case + 60\" Tripod + Slave Flash","manufacturer":"Canon","currentPrice":"$449.00","rating":"4.5 out of 5 stars","totalRatings":"72 ratings","features":["\n         Make sure this fits\n                by entering your model number.\n        \n","This Photo4Less Top Value Camera and Lens with USA Warranty and manufacturer's supplied Accessories Kit Includes:","Canon T7 EOS Rebel DSLR Camera - EF-S 18-55mm f/3.5-5.6 IS II Lens - 2x Transcend 32GB UHS-I U1 SD Memory Card - 58mm 2X Professional Telephoto Lens - High Definition 58mm Wide Angle Lens","Digital DSLR Auto Power Slave Flash - Photo4less DC59 Camera and Lens Case - RS-60 Remote Switch for Canon - 58mm Ultraviolet UV Protector Filter - Vivitar Memory Card Hardcase (24 Card Slots)","60\" Camera Video Tripod - 3 Piece Filter Kit (UV-CPL-FLD) 58mm - Hi-Speed SD USB Card Reader - LCD Screen Protectors (Clear) - Table Top Tripod - Lens Cap Holder","Shop With Confidence - Photo4Less is a CANON AUTHORIZED DEALER, so you can rest assure knowing that your purchase is fully backed by Canon USA Manufacturer’s WARRANTY and with Photo4less exceptional Customer Service."],"reviewsAspects":["easy to use","light weight","brand new","love this camera","great value","use the camera","camera to any beginner","great camera","pictures","bundle","accessories","kit","model","eos","included","lens","photos","rebel","online","photography"],"productInformation":[{"Product Dimensions":"23 x 13 x 8 inches"},{"Item Weight":"10.4 pounds"},{"Shipping Weight":"10.4 pounds (View shipping rates and policies)"},{"ASIN":"B07PBYQ62S"},{"Item model number":"Canon EOS Rebel T7"},{"Batteries":"1 Lithium ion batteries required. (included)"},{"Customer Reviews":"4.5 out of 5 stars\n    72 ratings\n4.5 out of 5 stars"},{"Best Sellers Rank":"#1,018 in Camera & Photo (See Top 100 in Camera & Photo)\n#23 in DSLR Cameras\n"},{"Date first listed on Amazon":"February 15, 2019"}],"productDescription":[],"reviews":[{"reviewerName":"Art","rating":"4.0 out of 5 stars","reviewTitle":"Bundle = NO. Camera = YES!","reviewDate":"May 19, 2019","reviewText":"Quick and to the point, the bundle is ABSOLUTELY NOT worth it. Very cheap items. your only saving about 20$-30$ and going to have to spend WAAAAY more to replace/upgrade the items for worth-while parts.\n\nThe Camera. Is an industry standard. The T7 is very nice for beginners or if you're not sure that this will stick with you and you want to give photography a fair and good shot. You can find the Camera only for about 400$-420$ if you keep searching here.\n\nTripod was the first to break (immediately upon first use) and the lens felt super cheap and didn't make the hugest of differences in image quality. The memory cards have crap stats, you can find a very good SanDisk Extreme 128GB capacity and 150Mb/s transfer speed for 30$ here on amazon. The transfer speed helps with saving image and disk reading for later. It's more than you need since the cam maxes at about 80Mb/s. Transfer speed comes into play when your taking a lot shots back to back and really trying to capture the moments as they happen.\n\nHowever, if you want to jump into the video/film field, I HIGHLY recommend looking into upgrading to the T7i for about 100$ more. you can find the 800D (EU model of the T7i) for 580$ here on Amazon. I upgraded after a week of playing with the T7, and this was fueled by having past experience with a T6i thanks to a friend. The little differences may seem minute, but the y really make a difference and will vastly help beginners who need a helping hand polishing and grinding out their skills.\n\nI do strongly recommend the T7i over the regular T7 in general, but this isn't a bad choice at all.\n\nJust to reiterate.\nThe <b>camera</b> is GREAT!\nThe bundle is trash."},{"reviewerName":"Johnathon Downs","rating":"5.0 out of 5 stars","reviewTitle":"Price","reviewDate":"March 27, 2019","reviewText":"The camera is wonderful, very to easy to use and I use the camera for my YouTube videos. The picture quality is above average. The product also came with tons of extras that I am using with the camera, what I great buy!"},{"reviewerName":"Kimberly French","rating":"5.0 out of 5 stars","reviewTitle":"Such a great deal","reviewDate":"April 7, 2019","reviewText":"This was an amazing deal. I was looking at the T6 models which I believe are two years older than this model and they were $450. So not only do you get a newer model camera, it's light weight, and you get so many accessories along with it. So happy I ordered this bundle, everything was brand new, in packaging, and arrived quickly. Thank you!"},{"reviewerName":"Chaotic","rating":"5.0 out of 5 stars","reviewTitle":"Canon EOS Rebel T7","reviewDate":"April 28, 2019","reviewText":"This is my first high end camera purchase, and I was really impressed right out of the box. The camera body is very nice, it's comfortable and sleek. The lens attaches smoothly and the zoom and autofocus work great. I have had a chance to shoot on many of the automatic settings, and the pictures are already nicer than anything else I have taken. I bought the \"EOS T7 for Dummies\" book as well, and I hope to maximize the potential of the camera with the help of the book. Overall it works great, I had no problems with any of the hardware."},{"reviewerName":"DAVID","rating":"5.0 out of 5 stars","reviewTitle":"Great camera","reviewDate":"April 12, 2019","reviewText":"Great for taking evidence pictures"},{"reviewerName":"Ritchie H","rating":"5.0 out of 5 stars","reviewTitle":"Amazing camera bundle!","reviewDate":"April 17, 2019","reviewText":"The T7 is an amazing camera for a beginner with all the functions needed to be a photographer and take high quality photos. Plus the bundle gives you everything you need."},{"reviewerName":"Timothy A Read","rating":"5.0 out of 5 stars","reviewTitle":"This is a great camera.","reviewDate":"May 3, 2019","reviewText":"Easy to use if you have some camera experience. You can always YouTube instructions or contact Canon with questions."},{"reviewerName":"michael mitchell","rating":"5.0 out of 5 stars","reviewTitle":"Great service","reviewDate":"March 23, 2019","reviewText":"Great camera and easy to use and light weight. Shipped on time thanks"},{"reviewerName":"John Rockefeller","rating":"3.0 out of 5 stars","reviewTitle":"Average camare","reviewDate":"April 10, 2019","reviewText":"Its average Camara but very difficult to use. Isnt one on point and shoot. Sometime when try to take picture it wont take it . U have to spend hours and reading manual to use the camera."},{"reviewerName":"Bill H in Tennessee","rating":"5.0 out of 5 stars","reviewTitle":"Surprising great pictures","reviewDate":"August 6, 2019","reviewText":"We bought this camera to take to Alaska for a cruise and land trip. We took over 1100 pictures of various subjects,glaciers, landscapes, and many pictures of our party. The pictures were clear and a came out great. One 32gb sd car held all our pictures with plenty more room left. All we had to do is go to our favorite processor and get all the prints we wanted. I downloaded the card to DVD so I can look or print at home. I would recommend this camera to any beginner to use and grow with."},{"reviewerName":"Mustafa","rating":"5.0 out of 5 stars","reviewTitle":"Great deal for a great price!!!!🤑","reviewDate":"June 23, 2019","reviewText":"At first I taught it would have some bad qualities or something would be wrong with it. Because of a very low price but when I got it. It was the best camera at a low price. I also saw other deal online and at stores like Best buy and Fry electronics it was expensive and also they did not had the extra gadgets with it.\nIt's worth it!"},{"reviewerName":"Fy","rating":"3.0 out of 5 stars","reviewTitle":"Had to send to Canon for repair 60 days after purchase.","reviewDate":"September 6, 2019","reviewText":"A vertical line showed up in all images. Canon said to send it in through their arrangement with UPS. Apparently my packaging didn't meet the \"requirements\" so it cost me $40 total to ship. Asurion refused to cover the $40 when I called to submit the claim saying I had to submit the claim prior to sending. Given the time crunch of having a major event in three weeks and wanting the 'new' camera for it...well lets just say neither Canon nor Photo4Less will be getting a five star from this consumer. Frustrating."},{"reviewerName":"CatDog2","rating":"2.0 out of 5 stars","reviewTitle":"Not for anyone wearing glasses","reviewDate":"July 5, 2019","reviewText":"The seller is good but the description should caution that 1. Viewfinder is too small and not useable with glasses, 2. the screen does not tilt (as most digital SLRs do) so awkward to sight and focus quickly or accurately 3. The semi-auto focus is too small (little black dots) to reference as shooting anything moving - got dozens of frames where everything BUT what I was focused on was in focus.\nNot a quick-learn, pick up and shoot camera, nor a pro model. Bottom line, I got better shots easier with my iPhone."},{"reviewerName":"Bran18","rating":"5.0 out of 5 stars","reviewTitle":"Thank you so much","reviewDate":"June 18, 2019","reviewText":"Bought for father’s day and daddy is love ! You get everything you need and more !!! Takes beautiful photos and very easy to figure out !"},{"reviewerName":"Lindsay I","rating":"5.0 out of 5 stars","reviewTitle":"Love this camera","reviewDate":"July 2, 2019","reviewText":"With twin newborn babies, I love this camera to help me catch unforgettable memories!"},{"reviewerName":"Amazon Customer","rating":"1.0 out of 5 stars","reviewTitle":"Broken Accesories","reviewDate":"August 7, 2019","reviewText":"Our kit came today and the Large Tripod was broken. So Sad... I paid more for these guys thinking I would get more of a quality product... So sad.."},{"reviewerName":"Amanda","rating":"5.0 out of 5 stars","reviewTitle":"Best deal ever","reviewDate":"July 17, 2019","reviewText":"I couldn't believe it when I saw this camera and accessories for this price! I knew I had to have it! The camera it's self is absolutely the best, and all of the accessories make it even better! I love my camera"},{"reviewerName":"Sanjay","rating":"5.0 out of 5 stars","reviewTitle":"Worth the money.","reviewDate":"August 21, 2019","reviewText":"It came with bunch of other kits, which was nice. The star the the camera, it took good pictures and videos, didn’t even read the manual. quite easy and fun to use once you get use to it."},{"reviewerName":"ireneo macasaet","rating":"4.0 out of 5 stars","reviewTitle":"fantastic camera.","reviewDate":"September 2, 2019","reviewText":"the product that was delever for me its brand new thats why i like it,even the package all in there complete. one thing that i notice i ddnt think before i buy that the hand strap not included to the package. i should be check first before i buy online sellers may be they had much more better than the rebel eos T7. honestly e really like it because this is my first time had a new canon camera."},{"reviewerName":"Joe","rating":"5.0 out of 5 stars","reviewTitle":"Good value if you price out all the pieces.","reviewDate":"August 24, 2019","reviewText":"Easy to use out of the box. Went on cruise to Alaska and took a lot of pictures. Looking forward to learning more about features. Think about getting a higher power lenses for wildlife shots."},{"reviewerName":"Marie Hollifield","rating":"5.0 out of 5 stars","reviewTitle":"Impressed with the quality!","reviewDate":"October 11, 2019","reviewText":"I was impressed with the light weight of the camera plus the lens, I was expecting it to be a little heavy. The lens were in perfect condition along with all of the accessories. The carrying bag was nice and cushioned with lots of storage pockets, very durable."},{"reviewerName":"Walter Thomas","rating":"5.0 out of 5 stars","reviewTitle":"Worth the money.","reviewDate":"May 2, 2019","reviewText":"Very pleased with my purchase."},{"reviewerName":"Claire M","rating":"5.0 out of 5 stars","reviewTitle":"Great set","reviewDate":"July 18, 2019","reviewText":"Great set, my teenage daughter is a beginner and this gives her a lot to experiment with. Camera itself is perfect, easy to use."},{"reviewerName":"Doris Jones","rating":"5.0 out of 5 stars","reviewTitle":"Price","reviewDate":"July 14, 2019","reviewText":"Grand daughter gift she’s trying to get better lighting"},{"reviewerName":"Wish It Would Rain","rating":"5.0 out of 5 stars","reviewTitle":"Accessories Galore","reviewDate":"August 10, 2019","reviewText":"More extras than you will likely use, but great incentive to learn more."},{"reviewerName":"salomon pacheco","rating":"5.0 out of 5 stars","reviewTitle":"EXCELENTE PRODUCTO","reviewDate":"May 4, 2019","reviewText":"Lo maximo"},{"reviewerName":"blezdman","rating":"5.0 out of 5 stars","reviewTitle":"Great camera","reviewDate":"August 18, 2019","reviewText":"Easy to use"},{"reviewerName":"david michaud","rating":"3.0 out of 5 stars","reviewTitle":"very good for the money","reviewDate":"July 12, 2019","reviewText":"it makes a pro"},{"reviewerName":"J Scime","rating":"1.0 out of 5 stars","reviewTitle":"Cheap attachments","reviewDate":"May 25, 2019","reviewText":"The accoutrements and and attachment quality products we're inferior"},{"reviewerName":"Anonymous","rating":"5.0 out of 5 stars","reviewTitle":"Great camera","reviewDate":"July 12, 2019","reviewText":"Great camera and even better buy with package."},{"reviewerName":"Jonathan Cox","rating":"5.0 out of 5 stars","reviewTitle":"Good deal for a beginner!","reviewDate":"July 11, 2019","reviewText":"Very nice camera and accessories that come with it"},{"reviewerName":"Dan","rating":"1.0 out of 5 stars","reviewTitle":"Not a kit. Lenses won’t fit camera","reviewDate":"August 14, 2019","reviewText":"This camera arrived fast and was in great condition but the model itself is bulky old and weird. The extra lenses won’t fit this camera so it’s not a kit"},{"reviewerName":"Branly Bernard","rating":"4.0 out of 5 stars","reviewTitle":"Extra lenses fail","reviewDate":"September 21, 2019","reviewText":"I’m in love with this camera, def worth the money. One thing tho the extra lenses doesn’t fit the camera. Read a review post on this and hoped it wouldn’t happen to me.......but just my luck"},{"reviewerName":"M. Dubray","rating":"5.0 out of 5 stars","reviewTitle":"GREAT CAMERA BUNDLE!","reviewDate":"June 30, 2019","reviewText":"Truly amazing deal! I love this camera and all the accessories it came with. I would highly recommend the bundle but make sure your at home when it arrives... it's huge!"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Great value","reviewDate":"September 16, 2019","reviewText":"We bought this for my son so he can start photography. This has everything he needs at a great price."},{"reviewerName":"Cristian reyes","rating":"5.0 out of 5 stars","reviewTitle":"👍👍","reviewDate":"June 19, 2019","reviewText":"is A pretty good bundle but the only thing doesn't work is the extra flashlight"},{"reviewerName":"William Nastasiak","rating":"5.0 out of 5 stars","reviewTitle":"Great Camera","reviewDate":"March 27, 2019","reviewText":"Great camera and easy to use. well worth the money"},{"reviewerName":"KB","rating":"5.0 out of 5 stars","reviewTitle":"Great for first timers","reviewDate":"July 14, 2019","reviewText":"Love this camera!! My family has had so much fun using it! The instructions that came with it were very helpful and not complicated."},{"reviewerName":"Shannon B.","rating":"5.0 out of 5 stars","reviewTitle":"Nice Camera!","reviewDate":"April 1, 2019","reviewText":"This camera is very nice and easy to learn. Super love it!"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Nice camera","reviewDate":"April 11, 2019","reviewText":"Pretty good camera. Just got it so still learning how to focus."},{"reviewerName":"Jahrahrah Gousby","rating":"5.0 out of 5 stars","reviewTitle":"Worth the money","reviewDate":"April 21, 2019","reviewText":"Everything was great except the tripod was broken."},{"reviewerName":"Angelina Turchyn","rating":"5.0 out of 5 stars","reviewTitle":"Amazing camera!","reviewDate":"July 27, 2019","reviewText":"Love it!!!"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Love it","reviewDate":"September 17, 2019","reviewText":"Love this camera"},{"reviewerName":"Cliente de Amazon","rating":"5.0 out of 5 stars","reviewTitle":"Delivered on time","reviewDate":"October 21, 2019","reviewText":"I am not in the US right now but I’m waiting to get there to start using my camera, I’m a beginner so I am exciting to learn about photography."},{"reviewerName":"Kristy Evans","rating":"5.0 out of 5 stars","reviewTitle":"Great Value. Quick shipping.","reviewDate":"August 11, 2019","reviewText":"I bought this for my daughter and she absolutely loves it. Takes great pictures. She uses to Vlog. Awesome price for everything you get."},{"reviewerName":"Shania","rating":"5.0 out of 5 stars","reviewTitle":"Great beginner kit","reviewDate":"July 30, 2019","reviewText":"The camera quality is great, it's a good beginner camera. You'll have to familiarize yourself with the functions and lenses. Ultimately a great camera."},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Awesome product!","reviewDate":"August 11, 2019","reviewText":"This package included everything a beginner photographer would need and then some! Fabulous product! Quick delivery!"},{"reviewerName":"Juan P.","rating":"5.0 out of 5 stars","reviewTitle":"Excellent, everything works great and arrived on time","reviewDate":"May 15, 2019","reviewText":"Love it"},{"reviewerName":"Austin O.","rating":"5.0 out of 5 stars","reviewTitle":"Great value!","reviewDate":"April 20, 2019","reviewText":"I got this as a starter photography kit for my girlfriend, and she loves it so far.. You get A LOT of stuff and for a great price!"},{"reviewerName":"Kindle Customer","rating":"4.0 out of 5 stars","reviewTitle":"a good value","reviewDate":"October 23, 2019","reviewText":"You need to play with the picture taking to get familiar with the camera"},{"reviewerName":"Martín galaxy","rating":"5.0 out of 5 stars","reviewTitle":"Great value","reviewDate":"October 31, 2019","reviewText":"I really like the camera. Some of the stuff in the kit seems cheap. But all in all a good buy!"},{"reviewerName":"Susana Lara","rating":"5.0 out of 5 stars","reviewTitle":"Calidad y precio","reviewDate":"July 3, 2019","reviewText":"Excelente producto pero me hubiera gustado que incluyera el cable para conectar la cámara a la computadora"},{"reviewerName":"sandy van cleef","rating":"5.0 out of 5 stars","reviewTitle":"This gift (the Canon EOS Rebel T7 DSLR Camera )is becomming a hobby for my son. :)","reviewDate":"April 14, 2019","reviewText":"Easy to work with. Accurate description o for the product."},{"reviewerName":"Karen","rating":"5.0 out of 5 stars","reviewTitle":"Everything you'll need and more","reviewDate":"April 25, 2019","reviewText":"I liked having everything I would need to get started and to make some really amazing pictures."},{"reviewerName":"juliet","rating":"5.0 out of 5 stars","reviewTitle":"Good quality","reviewDate":"June 26, 2019","reviewText":"Its really nice it. Comes eith everything it shows un the picture easy to use"},{"reviewerName":"Darla Redmond","rating":"5.0 out of 5 stars","reviewTitle":"It is easy to use.","reviewDate":"April 1, 2019","reviewText":"Wild life photos and personal use"},{"reviewerName":"mindy","rating":"5.0 out of 5 stars","reviewTitle":"Must have","reviewDate":"June 6, 2019","reviewText":"Most amazing camera"},{"reviewerName":"Maria Lolo","rating":"5.0 out of 5 stars","reviewTitle":"Very easy to use","reviewDate":"August 10, 2019","reviewText":"I am very happy with the camera, just used in my trip"},{"reviewerName":"rebecca leonard","rating":"5.0 out of 5 stars","reviewTitle":"Awesome!","reviewDate":"August 5, 2019","reviewText":"Love this camera and would recommend to anyone!"},{"reviewerName":"Paul Fortin","rating":"5.0 out of 5 stars","reviewTitle":"Gret value","reviewDate":"October 31, 2019","reviewText":"Good for non photographer"},{"reviewerName":"Amazon Customer","rating":"4.0 out of 5 stars","reviewTitle":"Price","reviewDate":"October 8, 2019","reviewText":"Picture Quality no good"},{"reviewerName":"Vadim L.","rating":"5.0 out of 5 stars","reviewTitle":"Thank you","reviewDate":"July 3, 2019","reviewText":"Thank you"},{"reviewerName":"Ori arouh","rating":"5.0 out of 5 stars","reviewTitle":"Good","reviewDate":"July 1, 2019","reviewText":"Good"},{"reviewerName":"Natosha Lucas","rating":"5.0 out of 5 stars","reviewTitle":"Compatible with all or almost all Canon accessories","reviewDate":"April 18, 2019","reviewText":"Very cool product. Wifi is awesome, good quality photos. Lots goodies included. Love it"},{"reviewerName":"Suzanne Robert","rating":"4.0 out of 5 stars","reviewTitle":"Wonderful","reviewDate":"July 4, 2019","reviewText":"The camera is wonderful and easy to use. But the picture quality is about average."},{"reviewerName":"Adrian","rating":"5.0 out of 5 stars","reviewTitle":"Good quality easy to use","reviewDate":"September 7, 2019","reviewText":"Great product"},{"reviewerName":"denise christopher","rating":"5.0 out of 5 stars","reviewTitle":"Not the best pic. but...","reviewDate":"May 24, 2019","reviewText":"The pic. is not even everything it comes with. I have wanted a Cannon rebel since the second one was out! I was weary at first spending so much online and on Amazon, from a seller at that, new to this, let me tell you though/ A+ to this company, also, the carry bag and probably some of the accessories that come with it (which is EVERYTHING a beginner or more advanced would need to start taking photos and saving, except an outlet for charging the little battery!) but the bag is nice quality too, actually has a lifetime warranty which is cool, the camera is a year warranty, it let me register no problem. It all is brand new, not one scratch. It is the entire camera, not just the body, some people get you with that if youre new looking for a kit, here it is. BUT if you don't plan to continue to use the camera you probably def. don't need all of this or to spend this much on a camera. I guess I'd say this is an in between, not professional use maybe, but not super beginner, yet I am a beginner and I'm making out fine. Its worth it, a picture really is worth 1000 words. I already took a really neat picture with this camera, beautiful. Love the feel, how it holds, the lanyard especially etc., filters and lenses included, so much for such a great quality camera. No not touch screen but who really needs that. No problems, came I think right before e.t.a.. I never write many reviews but I was very pleased with this. need to review the seller, awesome!!!!!! thank you! I see the price actually went down too everyone, this is a steal now. go figure lol."},{"reviewerName":"Derek Asher","rating":"4.0 out of 5 stars","reviewTitle":"Amazing","reviewDate":"April 30, 2019","reviewText":"This is an amazing Camera specially I would say for beginners, it is easy to use & easy to assemble."}],"qAndA":[{"question":"If I open the camera and I do not like it after 2 days, can I still return it?","answer":"Amazon allows you 30 days to return it"},{"question":"does it have a flip out screen?","answer":"No"},{"question":"How many mega pixels is this camera?","answer":"24"},{"question":"Lots of bad reviews is it as good as people say?","answer":"We love it !! Not one ounce of buyers remorse !"},{"question":"Is the camera in the kit (Canon Rebel T7) new?","answer":"Yes"},{"question":"Does the camera come in it's original box?","answer":"Yes! This was a great deal!"},{"question":"How good is the performance in low lighting conditions?","answer":"It depends what lens you are using. If you use the kit lens it comes with you'll get some grain (noise) in very dark situations. To avoid that I try to keep the ISO low and the shutter speed high"},{"question":"can you put a handstrap on this camera ?","answer":"Yes you can"},{"question":"Will the cannon 16 35 f4 lens work with this camera","answer":"It should"},{"question":"Does this come with a charger for the battery?","answer":"Yes it comes with the bundle."},{"question":"Use rechargable battery or replaceable batteries ?","answer":"Rechargeable"},{"question":"Does this camera kit come with a case or camera bag?","answer":"Yes it does! It is really great and comes with everything you need to get started right away, and, carry everything with you!"},{"question":"does this kit come with a mounting bracket for the slave slave flash?","answer":"Yes but the supplied flash isn’t compatible with the camera. The camera has a non standard hot shoe mount and only works with a flash made by Canon."},{"question":"Does the camera have a gps sensor?","answer":"As far as I can tell, it does not. I bought it to take pictures in Alaska, glaciers and wild life. The auto settings enabled us to take over 1100 pictures with few bad ones. This camera is great for beginners."},{"question":"who is the actual seller for this kit?","answer":"Photo4less"},{"question":"Does it really work?","answer":"Yes- takes great pics! Easy too."},{"question":"Does it have a mic","answer":"Yes, it has a mic included"},{"question":"Does this camera have an external audio port","answer":"Yes"},{"question":"Does this kit come with batteries for the camera? If not, do I need them and where can I get them?","answer":"It comes with 1 battery"},{"question":"Is this a camera with interchangeable lenses","answer":"yes it comes with two lenses an three filter"},{"question":"Does this camera have continuous shot? If so how is it?","answer":"If you are in the action mode yes. I actually have not used that feature. I suggest you look up a u tube video they are great!"},{"question":"What kind / size batteries does this need ?","answer":"It is a rechargeable battery pack 7.4V that comes with the camera, also comes with the charger."},{"question":"Does this have a clean hdmi output?","answer":"Bought fir my grand daughter"},{"question":"What’s the difference between this and the T6?","answer":"One big difference between canon T7 and T6 is that the T7 sensor resolution is 24MP and the T6 is 18MP.\nOn other hand the T7 weight less than T6 so it is easier to hold while taking pictures. T6 weight 485g and T7 weight 475g."},{"question":"Can this record at 60fps?","answer":"I believe it can, to be safe I would check with Canon."},{"question":"Is it WiFi compatible ?","answer":"Yes it is. You can also connect it to your phone and get the photos instantly"},{"question":"Does the camera have optional manual settings?","answer":"Yes, there is a little switch/button near the lens."},{"question":"So the headline says it comes with a 64 gig card yet the description says 2x 32 gig cards. Which is it?","answer":"It comes with (2) 32 gig cards, which equals 64 gigs"},{"question":"How long can I video with this camera?","answer":"I could record up to 2 hours before my battery died. I would recommend getting an extra battery if you're recording a lot of video. The memory card that comes with the bundle is really good."},{"question":"can older cannon lenses be used on this camera?","answer":"Depends how old. I know it's not compatible with very old lenses."},{"question":"Would you suggest this camera for someone who hasn't used an SLR in over 25 years?","answer":"Absolutely."},{"question":"Does it have a mic jack?","answer":"yes"},{"question":"Can it take raw pictures?","answer":"yap"},{"question":"Does this camera autofocus?, and are the images sharp?","answer":"I have the 1500 which has AF/MF. I just got it and am playing with it, no pics have been developed yet."},{"question":"Why is this t7’s cheaper then the t6’s ? is this just a great deal or is the t7 lacking something the t6’s have ?","answer":"One difference is that a standard hot shoe flash does not fit on the T7...the flash supplied with the kit doesn’t even fit! If you want to use an external flash, the only one I’ve found that works is made by Canon specifically for this new type of hot shoe. Of course that costs half what this camera does. : ("},{"question":"will these work on my product?","answer":"Yes"},{"question":"Does it come with a manual","answer":"Yes it does"},{"question":"does this camera have crop factor","answer":"I don’t know bought it for my grand daughter but she’s loving it. I just bought her the small printer and carrying case for selepy 1300 printer."},{"question":"Can this camera take good moon shots?","answer":"Yeah it can take picture in any lighting."},{"question":"Does this bundle come with a camera bag?","answer":"Mine did, yes."},{"question":"Does it automatically adjust focus while video recording?","answer":"No."},{"question":"Is this the canon t7 1500d or the t7 2000 d?","answer":"It is a T7"}]}