{
    "productInformation": [
        {
            "Product Dimensions": "4.7 x 8.8 x 4.8 inches"
        },
        {
            "Item Weight": "1.4 pounds"
        },
        {
            "Shipping Weight": "1.4 pounds (View shipping rates and policies)"
        },
        {
            "Manufacturer": "Mr. Coffee"
        },
        {
            "ASIN": "B00005OTXM"
        },
        {
            "Item model number": "IDS57-RB"
        },
        {
            "Customer Reviews": "4.0 out of 5 stars\n    749 ratings\n4.0 out of 5 stars"
        },
        {
            "Best Sellers Rank": "#3,908 in Kitchen & Dining (See Top 100 in Kitchen & Dining)\n#6 in Electric Coffee Blade Grinders\n"
        },
        {
            "Date first listed on Amazon": "August 5, 2002"
        }
    ],
    "productDescription": [
        "The Mr. Coffee Electric Coffee Bean and Spice Grinder makes it easy to grind 4-12 cups of coffee or spices exactly how you like them. The transparent lid allows you to monitor your grind while it's happening, and it's large enough to provide convenient, mess-free pouring.",
        "\n",
        "\n",
        "\n",
        "Unlock the delicious characteristics of the roast right before brewing.",
        "As coffee brews, its richness, complexity, and freshness slowly unfolds.",
        "Extract the fullest flavor and enjoy the truest taste as it's meant to be.",
        "\t\t\t\n\tCoffee and Spice Grinder\tCoffee Grinder w/Chamber Maid Cleaning System\tBurr Mill Coffee Grinder\nCoffee Grinding\t?\t?\t?\nSpice Grinding\t?\t?\t\nGrinding Technology\tBlade\tBlade\tBurr Mill for ultimate grind size control\nCapacity\t4-12 Cups\t4-12 Cups\t4-18 Cups\nSafety On/Off Switch\t?\t?\t\nTransparent Lid\t?\t?\t?\nCup Size Auto-Selection\t\t?\t?\nCleaning Features\t\tExclusive Cleaning System\t?\nProgrammable Grind\t\t3 Settings\t18 Settings\nHands Free Operation\t\t\t?"
    ],
    "reviews": [
        {
            "reviewerName": "darthmikey",
            "rating": "2.0 out of 5 stars",
            "reviewTitle": "(Was) My favorite grinder design!",
            "reviewDate": "October 1, 2017",
            "reviewText": "This has been by far my favorite grinder. My last one died after 11 years of daily use, and finding a local replacement was tough--Amazon comes through again! Pros: This will grind a full 12-cup pot's worth in one fill, as fine as you like, with a nice deep cup so no overflow all over the counter. Plus, the round shape makes it easy to get those stubborn clumps of oily dark roast all out. Just a great design. And did I mention my last one lasted 11 years?\n\nUpdate: this one died in less than 3 months. Rating revised."
        },
        {
            "reviewerName": "CE 4Roo",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "4+ Years and Grinding Strong",
            "reviewDate": "December 12, 2016",
            "reviewText": "I purchased this grinder February 1, 2012 on Amazon. It has been grinding away for 4 years 10 months. It has known only coffee beans and no issues. I have never had an issue with the bean volume either. I fill it to where beans might start to tumble out and then I cap it. The longer the grind the finer the coffee gets. So, the blades seem to work just as well as on day one near as I can tell. I do a 9 one-thousand count in my head and get consistent results. It cleans easy enough. I just wipe it out with a moist paper towel from time to time. If it were to break tomorrow I would buy it again knowing I'd likely get five more years."
        },
        {
            "reviewerName": "Kirsten Klug",
            "rating": "1.0 out of 5 stars",
            "reviewTitle": "DON'T WASTE YOUR MONEY AND TIME",
            "reviewDate": "April 9, 2019",
            "reviewText": "Bought online and used probably less than 10 times until it died and felt hot. Called company and they were very nice and sent a new one for free. I have suspect they know these are defective and that's why they sent a replacement so quickly with no proof of purchase. Unfortunately, the 2nd one died the first time I used it and started smoking. I'm not going to bother to call and sit on hold again. DON'T WASTE YOUR MONEY/TIME"
        },
        {
            "reviewerName": "G. McDuffie",
            "rating": "3.0 out of 5 stars",
            "reviewTitle": "Works, but not the easiest to clean.",
            "reviewDate": "October 19, 2016",
            "reviewText": "This little grinder does the job... but is a pain to clean and only does a small amount. It works for my purposes, but I wouldn't want to grind a 1-cup full of beans. You have to grind a dozen beans at a time and them empty. It isn't easy to clean, so it becomes cumbersome if you use it a lot."
        },
        {
            "reviewerName": "zaozaokitty",
            "rating": "4.0 out of 5 stars",
            "reviewTitle": "perfect for quick grinding herbs",
            "reviewDate": "May 25, 2018",
            "reviewText": "bought for grinding herbs, which it is excellent for. few pulses, and can reduce whole dried herbs into powder for rubs within seconds. yay!\n\nhowever, not sure this would be a good plan for coffee beans, because it is a pulse type grinder - only grinds when you push down, keeps going as long as the 'button lid' is pushed down, and has no settings for amount/type of grind... so grinding is completely by eye/best judgement - not consistent measurable settings. considering types of brews DEPEND on the consistency of the bean grind, i can not, in good conscious, suggest this item for coffee grinding."
        },
        {
            "reviewerName": "Thorne Hamstring",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "A Fabulous Coffee Grinder For A Lot Less $$ Than A Burr-style",
            "reviewDate": "February 17, 2018",
            "reviewText": "This grinder really works well.\n\nI make Arabic coffee (not the same as Turkish) and the beans are roasted to a light yellow. This means they are still hard as small rocks that burr grinders have a very difficult time turning into the sandy powder I require. Other grinders, similar to this, have not been able to get to the consistency I need. I believe that was due to blade sharpness and rotation speed.\n\nThe Mr. Coffee grinder works very well for my purposes and can certainly product the results you'll need for regular roast beans from light roasts to dark espressos and for a lot less money.\n\nI highly recommend this product."
        },
        {
            "reviewerName": "psyche",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Simple design that works great",
            "reviewDate": "October 23, 2017",
            "reviewText": "I have gone back to this basic grinder because it works so much better than two other more expensive machines I have bought in the last couple of years. The unit is small so it doesn't take up much space but works great. After grinding, flip to fill the cover with beans and use the cover to transport to the coffee maker."
        },
        {
            "reviewerName": "M",
            "rating": "4.0 out of 5 stars",
            "reviewTitle": "Great grinder!",
            "reviewDate": "December 18, 2016",
            "reviewText": "I've always hated blending things, because of how loud it is. This coffee grinder is very quiet and is very easy to use. It crushes beans very well and you have the option of crushing it for however long you want, and it's easy to get the coarseness that you want from your beans. You can easily make single cup coffee or even 2 cups of coffee using this grinder. My only one complaint about this is that the grinds sometimes get stuck behind the blades (which aren't sharp - so you can run your finger around it), and it is very difficult to clean."
        },
        {
            "reviewerName": "Grace",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Great!",
            "reviewDate": "January 10, 2019",
            "reviewText": "After seeing several coffee grinders I chose this one. I am very satisfied. it is very easy to use and can grind thin or coarse coffee. I clean it immediately after use, anyway, just follow the manual that comes with the grinder. Very good grinder."
        },
        {
            "reviewerName": "C A",
            "rating": "3.0 out of 5 stars",
            "reviewTitle": "Good for the price",
            "reviewDate": "January 3, 2019",
            "reviewText": "I have a hand grinder that produces a very uniform grind. This item does not produce a uniform grind, as many pieces are very large unless you grind down to a very fine consistency. I do not mind using the manual grinder, but my wife hates having to grind by hand. She wanted a cheap electric grinder, and this item fit the bill. I cannot tell a huge difference in taste between this grinder and the hand grinder. Using this grinder and higher quality coffee beans definitely beats the stuff that comes from big box stores.\n\nThe grinder is functional and cheap, but look elsewhere if you are a coffee snob that needs a very uniform grind."
        },
        {
            "reviewerName": "Steve Hanson",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "I have owned several and am pleased",
            "reviewDate": "February 24, 2019",
            "reviewText": "We have had two of these for years (one for coffee and one for grinding spices). After quite a few years of daily service our coffee grinder finally died when the grinding blade broke. I've owned several other brands over the years and this one actually lasted longer than the more expensive brands, though I AM disappointed that there does not seem to be any source for a replacement blade- when I owned some other brands I could get just a new blade to fix the grinder when that happened. Still, all in all, for the price I am very happy."
        },
        {
            "reviewerName": "Anthony Evich",
            "rating": "4.0 out of 5 stars",
            "reviewTitle": "Simple Fast Coffee Grinder",
            "reviewDate": "March 25, 2019",
            "reviewText": "This Mr. Coffee Coffee bean grinder grinds beans fast... just a few seconds and the beans are well ground. Not too hard to clean, just use a small toothbrush. It's a cost effective solution for a bachelor on a budget! Took a star off because of the grounds tend to stick to the bottom and don't like to shake out easily. I use a clean toothbrush to dislodge them. If you aren't in the position to get a conical burr grinder, this is the way to go."
        },
        {
            "reviewerName": "Amazon Customer",
            "rating": "3.0 out of 5 stars",
            "reviewTitle": "Works, but ...",
            "reviewDate": "August 22, 2019",
            "reviewText": "I primarily use a manual ceramic burr grinder by Hario, but lately I have been falling behind in schedule and needed a small electric grinder to fill in the gaps.\nThis one works, but its hard to tell if all the grinds are going to be the size I want .. and with no timer or pre-programmed setting - its almost a guessing game (even though the instruction manual has approximated times).\nAfter some experiments, I figured what worked best but another constant bothered me - its a mess to transfer over. Well, more of a mess than Im used to anyways, but grinds were lost during transfer to the coffee maker (french press, aeropress, or pour over).\nIt does get the job done and it doesnt take up a lot of room - and it does work in a pinch."
        },
        {
            "reviewerName": "Peter Griffin",
            "rating": "1.0 out of 5 stars",
            "reviewTitle": "Stopped working after a month",
            "reviewDate": "October 23, 2018",
            "reviewText": "We were happy with this grinder until it just stopped working. Worked perfectly one day, and didn't work the next day. It isn't a fancy or expensive grinder, but I would expect it to last longer than a month. Disappointed."
        },
        {
            "reviewerName": "Bill W.",
            "rating": "4.0 out of 5 stars",
            "reviewTitle": "Good performer, good value.",
            "reviewDate": "October 1, 2018",
            "reviewText": "Grinding cup is a little small for a strong 12 cup pile of grounds. I have to flip the unit over after grinding, to place the grounds into the cap to transfer the grounds to the coffee maker.\n\nWorks every time, and does a good job grinding coffee. Use it daily in the office for 2+ pots every day.\n\nBottom Line: I would recommend this grider, especially based on the price."
        },
        {
            "reviewerName": "gs",
            "rating": "1.0 out of 5 stars",
            "reviewTitle": "Stopped working immediately",
            "reviewDate": "May 5, 2019",
            "reviewText": "It stopped working almost immediately. I was trying to make oatmeal flour grinding a total of 3 cups of oatmeal before it stopped working. On the last half cup it wouldn't work and felt warm and had small wisps of smoke coming out of the bottom after I unplugged it."
        },
        {
            "reviewerName": "Emily Ann Frances May",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Good, basic coffee grinder without bells and whistles",
            "reviewDate": "October 31, 2018",
            "reviewText": "What I love about this coffee bean grinder is that you can use it after quickly reading the booklet it comes with. It's that simple and that's why I love it. I have no desire to fuss with a grinder when craving my morning cup of coffee made from freshly ground coffee beans."
        },
        {
            "reviewerName": "Edward Abba Bear",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "My go to Coffee Grinder",
            "reviewDate": "February 17, 2019",
            "reviewText": "This is hands down my favorite grinder. I've tried other fancy brands that does it automatic for you. I prefer manual and like my beans ground fine for my espressos. I've bought 2 of these already. One for home and the other for my office. Just make sure you don't run it for more than 20 seconds and let it rest for at least 45 seconds. Just don't want to burn up the motor. Hope this helps."
        },
        {
            "reviewerName": "Alexander Miller",
            "rating": "1.0 out of 5 stars",
            "reviewTitle": "Worked great for 30 seconds",
            "reviewDate": "March 26, 2018",
            "reviewText": "I began grinding 1 pound of my favorite coffee and after 2 cups I got the hang of it and thought \"hey, this thing works pretty well\" then with about half of my pound of beans to go, it stops working. Completely dies. Tried several outlets with no success."
        },
        {
            "reviewerName": "Lori A Moody",
            "rating": "1.0 out of 5 stars",
            "reviewTitle": "I didn't have good luck with the Mr. Coffee grinder!",
            "reviewDate": "November 10, 2018",
            "reviewText": "I bought the coffee grinder first of September, have only used it a few times and went to use it and it's not working- bummer!\nI would like to return it to Mr. Coffee but for a $13.00 product it's a throw away world!"
        },
        {
            "reviewerName": "Koolala",
            "rating": "1.0 out of 5 stars",
            "reviewTitle": "Seldom used and didn't last a year.",
            "reviewDate": "September 6, 2018",
            "reviewText": "I haven't even had this for a year yet and the motor died. I use it once a month or every other month. 8 or 9 uses is not what I expected from Mr. Coffee."
        },
        {
            "reviewerName": "Mark D. Eggers",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Compact, fast",
            "reviewDate": "October 30, 2019",
            "reviewText": "Grinding coffee beans is nice, easy, and complete. There's only one speed, so you're a little limited to the fineness control. However, that doesn't matter when grinding coffee for a small drip coffee maker.\n\nAbout the only issue I have with this grinder is that the interlock between the top and the grinder is a little difficult to clean manually. I imagine a toothbrush should do the job nicely. It's probably worth the effort, since if the interlock doesn't engage, the grinder won't start when you press the button."
        },
        {
            "reviewerName": "Darren W. Olsen",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Now this is quite the nice device. My old grinder pooped out after 12 ...",
            "reviewDate": "December 27, 2016",
            "reviewText": "Now this is quite the nice device. My old grinder pooped out after 12 years. It was a Krups. Not bad at all by the way. I needed a new grinder. So doing some research, I settled upon this. I couldn't be happier. I like the feature that after a grind, you can up end this unit and the grinds are in the top plastic \"cup\". Easy transfer of grinds to the cone filter. I've had this for a while with no signs of failing. I have a good feeling this unit will last me for some time. A bit noisy, but aren't they all? That is unless you want to spend serious money on a quiet grinder."
        },
        {
            "reviewerName": "Arctic Lebowski",
            "rating": "2.0 out of 5 stars",
            "reviewTitle": "Didn't meet expectations!",
            "reviewDate": "February 28, 2016",
            "reviewText": "This coffee grinder lasted 7 1/2 months. It is not responding anymore when we push down on the button. We have never used frozen beans. We have not waterlogged it or splashed any fluid on it. It gets used one to three times a day every day, and we only use it for coffee.\nWe had higher expectations for this machine because of the reviews I read before purchasing. Perhaps we got a bad one."
        },
        {
            "reviewerName": "Amazon Customer",
            "rating": "1.0 out of 5 stars",
            "reviewTitle": "Low quality..motor froze after brief use.",
            "reviewDate": "July 1, 2018",
            "reviewText": "Purchased on April 21st...after 2 months of low level use....now the motor is frozen..unit never abused or got wet...probably can't return...very disappointed..."
        },
        {
            "reviewerName": "Ashton",
            "rating": "1.0 out of 5 stars",
            "reviewTitle": "Motor died after a week",
            "reviewDate": "March 22, 2019",
            "reviewText": "Motor died after a week. It worked great until that but definitely not buying another one."
        },
        {
            "reviewerName": "musiclover13",
            "rating": "4.0 out of 5 stars",
            "reviewTitle": "Great!",
            "reviewDate": "January 16, 2019",
            "reviewText": "This coffee grinder is great! It's very easy to use and grinds the coffee perfectly and just to my desired specifications. It's not the easiest to clean, but I find with a little patience, it doesn't take very long. If you're looking for an inexpensive coffee grinder this is great option!"
        },
        {
            "reviewerName": "Nico",
            "rating": "1.0 out of 5 stars",
            "reviewTitle": "Died Just a Little Over a Month from Purchase",
            "reviewDate": "September 12, 2018",
            "reviewText": "Grinder was great to start, but it died after only a month of VERY light use. Followed all suggestions online and it is just dead. Will not buy again."
        },
        {
            "reviewerName": "Rick E.",
            "rating": "3.0 out of 5 stars",
            "reviewTitle": "Cheap coffee grinder is ok",
            "reviewDate": "April 18, 2019",
            "reviewText": "For the price, it's a good value. You hold down the black button on the lid to make it run, so there's no timer or any variable settings. It grinds the beans kind of unevenly, so you'll get some larger chunks as well as fine dust, which clogs my Keurig cup a bit."
        },
        {
            "reviewerName": "Scootersaurus",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Works great for flax & chia seeds!",
            "reviewDate": "December 29, 2018",
            "reviewText": "I use this for a seed mix that I like to add to my smoothies. It grinds them perfectly - no more seeds stuck in my teeth! There's nothing to take out & wash, so it's just a matter if wiping it out. I'm a bit of a germaphobe so it's not ideal, but as well as it works, I'll live with it!"
        },
        {
            "reviewerName": "Truthfulblogger",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Grinds Fine and Fast",
            "reviewDate": "July 26, 2019",
            "reviewText": "This coffee bean grinder is a lot better than my previous one. It's fast, and grinds the beans to a nice, fine texture, which lets me get more flavor using less coffee beans. Easy to use, and pretty easy to clean.\n\nJohn 3:16-21"
        },
        {
            "reviewerName": "gakmail",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Works great! Exactly what expected. Use most days for grinding whole bean and coarse ground coffee.",
            "reviewDate": "January 23, 2015",
            "reviewText": "Works great! I use it most days to grind my morning coffee from either whole beans or already coarse ground coffee (sometimes I buy coarse ground for my french press and then grind them more when I use my auto-drip) and I prefer it to the one I use at work that is a different brand. It also seems to hand already ground coffee grounds better than some others I have tried. Obviously with this style grinder you don't really expect to be able to \"select\" how finely ground the beans are, but you can sorta guess after some practice. Also watching through the top how the grinds fall helps."
        },
        {
            "reviewerName": "Amazon Customer",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Great little grinder!",
            "reviewDate": "March 19, 2019",
            "reviewText": "This grinds my coffee beans perfectly. You can determine how coarse or fine you grind by the length of time. Next time, I will probably buy a larger one that can grind a whole bag of beans at once. But I do love this little grinder."
        },
        {
            "reviewerName": "Olive",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Better then other expensive brand ones!",
            "reviewDate": "August 28, 2019",
            "reviewText": "This is one of the best coffee grinders out there, and its not the case of you get what you pay for for the price this works so much better & is easier to clean, then the expensive cuisinart one I perviously purchased."
        },
        {
            "reviewerName": "Vicki",
            "rating": "4.0 out of 5 stars",
            "reviewTitle": "Does the Job!",
            "reviewDate": "July 28, 2019",
            "reviewText": "I have only used this grinder a few times but so far works very well. It does not have all the bells and whistles on it like some of the others, but it does what it's intended to do. Generally takes about a minute to grind enough beans for 6 cups of coffee. The cord is 36 inches in length and there is no cord storage. Just your basic coffee grinder."
        },
        {
            "reviewerName": "Nancy Pelosi",
            "rating": "1.0 out of 5 stars",
            "reviewTitle": "just fine, then on the 3rd go around it just ...",
            "reviewDate": "June 2, 2018",
            "reviewText": "Ordered this on May 23rd and it is already broken. I got to use this 2 times, just fine, then on the 3rd go around it just didn't want to work. Made sure only to put about 2 cups of coffee worth of beans in it as well, so no I did not overfill. Made sure there was nothing stuck in it and even changed plug-ins and it's just done for."
        },
        {
            "reviewerName": "Roo",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Great! Excellent for the price!",
            "reviewDate": "August 12, 2019",
            "reviewText": "This grinder works great! Will grind coarse or fine. Friends have remarked it is quieter than most. Great product for the price. Works better than more expensive ones I have used"
        },
        {
            "reviewerName": "carlos jimenez",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Great for the price",
            "reviewDate": "September 7, 2019",
            "reviewText": "after reading reviews, the good and the bad i thought id buy this one. Ive had one in the past and worked well for me. got my new grinder pretty quick and used right away, works great for the price. I would recommend this product."
        },
        {
            "reviewerName": "Laura Jean",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "This is an easy to use coffee grinder that does the job quickly ...",
            "reviewDate": "December 4, 2016",
            "reviewText": "This is an easy to use coffee grinder that does the job quickly and efficiently. I was able to easily grind the coffee beans very fine for expresso, a course grind for my french press and a medium grind for my chemex with ease. It's a very good value."
        },
        {
            "reviewerName": "RJW",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Coffee Grinder",
            "reviewDate": "October 26, 2018",
            "reviewText": "We had the previous model of this grinder for at least 5 years. Deep well for beans. I also use it for herbs and spices. I bought a different grinder at WMT but it failed in comparison to this product in usability and price."
        },
        {
            "reviewerName": "CR",
            "rating": "4.0 out of 5 stars",
            "reviewTitle": "Decent and effective for price",
            "reviewDate": "January 23, 2017",
            "reviewText": "Pros: sturdy and stays in place. Easy to handle and buttons make it user friendly.\nCons: cord is somewhat short. Doesn't grind beans evenly so has to be readjusted at times.\nTip: pour beans slightly below inner silver cup line. Grind pause shake to even out then repeat. Pour grinds into cap to transfer into filter."
        },
        {
            "reviewerName": "msp1",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "A simple and reliable coffee grinder",
            "reviewDate": "July 12, 2018",
            "reviewText": "Just finally retired my last Mr. Coffee grinder like this one after 15 years. Hopefully this one will last as long. I like them because they're simple, reliable, and consistently just do what they are designed to do."
        },
        {
            "reviewerName": "Dustin Parsons",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Great design, long life",
            "reviewDate": "August 25, 2019",
            "reviewText": "I used one of these grinders for more than a decade before it stopped working. I tried another, more expensive, grinder but had trouble putting the lid on when it was full of beans and it broke on me after a couple days (smoke rising from inside the machine). So I bought another one of these and it's been working great, just like my old one. Would definitely recommend."
        },
        {
            "reviewerName": "Steve Horvath",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "A great grinder.",
            "reviewDate": "January 10, 2019",
            "reviewText": "I like this small grinder because it is handy and easy to use. I have one that I bought 10 years ago that is still in good working condition. I bought the second one in case the first one stops working."
        },
        {
            "reviewerName": "Ralphcg",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Powerful Grinder!",
            "reviewDate": "November 18, 2018",
            "reviewText": "This is a powerful little machine. Works extremely well. Have to be careful when emptying grounds into storage container. It can get messy. Cleans extremely well. Glad we bought it. Hopefully the motor will last??"
        },
        {
            "reviewerName": "B. Lynn",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Great Little Grinder",
            "reviewDate": "April 14, 2019",
            "reviewText": "I got this as a spice grinder. It does a lovely job of grinding. The cap is easy to pop in the dishwasher but it is quite a project to clean the area where the spices are ground."
        },
        {
            "reviewerName": "Nicole Rennie",
            "rating": "2.0 out of 5 stars",
            "reviewTitle": "Good while it lasted",
            "reviewDate": "April 14, 2019",
            "reviewText": "This coffee grinder was great at first. I bought it in November and used it about once a week to grind coffee for that week. It just recently stopped working in April. I went to turn it on to grind coffee beans and it started whirling and then smoking and just stopped. Will now be trying another brand, one that hopefully will last longer than 5 months with moderate use."
        },
        {
            "reviewerName": "Mortimer snerd",
            "rating": "2.0 out of 5 stars",
            "reviewTitle": "Okay if you like stuck grounds in the bottom of the grinder. I don't.",
            "reviewDate": "May 15, 2016",
            "reviewText": "Coffee grounds tend to stick to the bottom part of the grinder. Have to brush it out to get all of them. Nothing better stand between me and my coffee in the morning.Sending it back and ordering the Kitchen Aid. Why? Because the Kitchen Aid has a removable stainless steel cup that is easy to dump. The Kitchen Aid is about $6. more."
        },
        {
            "reviewerName": "Amazon Customer",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Coffee Grinder",
            "reviewDate": "July 17, 2019",
            "reviewText": "I bought this 3 years ago and still works great , the secret is don't run the motor a long time and it will last a long time."
        },
        {
            "reviewerName": "Amazon Customer",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Exactly what I was looking for",
            "reviewDate": "January 16, 2019",
            "reviewText": "My fianc loves it! I ordered it for him and he used it as soon as we received it. The ground does get stuck to the bottom lightly but very easy to clean with a paper towel.."
        },
        {
            "reviewerName": "Michael Vani",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Perfect little grinder",
            "reviewDate": "February 7, 2018",
            "reviewText": "Grinds whole beans with ease, I usually put in 3 big scoops and no issues. Kind of loud, but not worth removing a star. I use a French press so the I go for a coarse grind. Comes with directions for how much you put in as well."
        },
        {
            "reviewerName": "Barbara McClure",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Grind Away",
            "reviewDate": "April 25, 2019",
            "reviewText": "My husband received a French Press and loves grinding his own coffee! This was a perfect addition to his love of coffee! Great Job, Thank you!!"
        },
        {
            "reviewerName": "Ashley Singleton Samsung 7",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Reasonable price and does its job.",
            "reviewDate": "November 22, 2018",
            "reviewText": "Not the fanciest thing in the world but it does its job well. Can be hard to clean but not overly so. Recommended to me by a friend and I would recommend it to a friend."
        },
        {
            "reviewerName": "Michael D Bailey",
            "rating": "4.0 out of 5 stars",
            "reviewTitle": "Great coffee grinder",
            "reviewDate": "February 11, 2013",
            "reviewText": "I received the shipment within 2 days of placing the order and everything is great . . . with one small exception. This coffee grinder is supposed to have 3 little round rubber \"feet\" to keep it from sliding around on a countertop. My coffee grinder was missing the 3 rubber feet. I searched the packaging but could not find them anywhere. I'm beginning to suspect that maybe this was part of a rejected bath of product from Mr. Coffee. I had a Mr. Coffee grinder before this one and it had the rubber feet. So did my Mom's Mr. Coffee grinder."
        },
        {
            "reviewerName": "mia Garfield",
            "rating": "3.0 out of 5 stars",
            "reviewTitle": "Misleading description",
            "reviewDate": "November 13, 2019",
            "reviewText": "I chose this one to replace the one I've had for 21yrs. I picked this grinder because in description it sounded as though there are different levels of grinding, fine to coarse. No, it's how long you activate the blade by pulsing...should have known it was too good to be true"
        },
        {
            "reviewerName": "LISA",
            "rating": "4.0 out of 5 stars",
            "reviewTitle": "Gave as gift",
            "reviewDate": "January 18, 2019",
            "reviewText": "Bought as a gift. It was well received. Now I've been told it was a wonderful choice and was working well. She said it was easy to use and was very sturdy."
        },
        {
            "reviewerName": "Vik Mead",
            "rating": "1.0 out of 5 stars",
            "reviewTitle": "One Star",
            "reviewDate": "May 30, 2016",
            "reviewText": "Grinds coffee pretty well. Stopped working shortly after a month (which passed return policy timeline... Yipee)."
        },
        {
            "reviewerName": "steve j. graver",
            "rating": "4.0 out of 5 stars",
            "reviewTitle": "Would've given 5 stars but the grinder died on my ...",
            "reviewDate": "March 26, 2018",
            "reviewText": "Would've given 5 stars but the grinder died on my after about a month of light use. Contacted Mr. Coffee customer service on the online chat function. They immediately shipped me a new one. Does what its supposed to do: grinds my coffee beans and didn't cost an arm and a leg."
        },
        {
            "reviewerName": "Klefbom.O",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Don't waste money on expensive grinders",
            "reviewDate": "June 28, 2018",
            "reviewText": "Don't waste money on expensive grinders. This will literally do exactly what the expensive ones can. I use it for the french press and also an espresso maker. (two opposite ends of the grind spectrum). I've had it for about three years now and it acts new."
        },
        {
            "reviewerName": "Catherine Hansen",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Works very well so far",
            "reviewDate": "September 30, 2018",
            "reviewText": "I love it and the fact that I can have fresh ground coffee each morning! Great price and easy to control and use. Definitely recommend for any home."
        },
        {
            "reviewerName": "B Wright",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Good for the average joe",
            "reviewDate": "August 13, 2019",
            "reviewText": "If you just care about your coffee being decently blended this will do the job. If you're trying to get fancy you may need something more...fancy."
        },
        {
            "reviewerName": "Kwhit42",
            "rating": "4.0 out of 5 stars",
            "reviewTitle": "Good",
            "reviewDate": "November 13, 2018",
            "reviewText": "It was the right price, no problems with it so far. It's worked with no issues from the start! I don't love that to get the proper grind on 9+ table spoons coffee some of it is such a fine powder that it goes through the filter, but that's probably just me being nit-picky."
        },
        {
            "reviewerName": "Amazon Customer",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "THIS IS THE BEST COFFEE GRINDER EVER!!!",
            "reviewDate": "February 12, 2017",
            "reviewText": "I LOVE THIS COFFEE GRINDER!!!! There is nothing better than the smell of fresh ground coffee in the morning. I bought this same grinder when I got my first apartment. It lasted 15 YEARS before it died on me last year. I cried that morning. I couldn't find this one in the stores anymore, so I bought a Hamilton Beach one that claimed it was quieter... It wasn't, AND it died in 2 months! I am VERY VERY happy that I found this Mr.Coffee one again. I hope it has a full life like my first one did!"
        },
        {
            "reviewerName": "S. Petty",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "I now have 2 of these, one for herbs, one for coffee.",
            "reviewDate": "December 16, 2017",
            "reviewText": "I bought this as a herb grinder because I already have one of these as a coffee grinder. This is a good product."
        },
        {
            "reviewerName": "lp-TN-001",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "I'd buy this again.",
            "reviewDate": "March 21, 2018",
            "reviewText": "I bought this specifically to grind small amounts of flax seeds. It works well. I cannot say what it will do to coffee beans as I buy my coffee already ground. I'm happy with this. It does the job."
        },
        {
            "reviewerName": "Tennessee Sunrise",
            "rating": "4.0 out of 5 stars",
            "reviewTitle": "So Far So Good",
            "reviewDate": "September 14, 2018",
            "reviewText": "This grinder does what we bought it for: Grinding to Expresso level fine grain. Would like to see it a little easier to load/unload, but no real complaints."
        },
        {
            "reviewerName": "Rene Harris",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Great price, grinds all kinds of things in the kitchen",
            "reviewDate": "July 3, 2019",
            "reviewText": "Perfect for grinding coffee, seeds, and weed! Powerful for its size, great value."
        },
        {
            "reviewerName": "RJK York SC",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Great product",
            "reviewDate": "July 31, 2018",
            "reviewText": "Love it. Way better than others in durability. It doesn't feel as though it will break easily. Quick grind. Not a jet engine either!"
        },
        {
            "reviewerName": "Manuela Canotilho",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Just great!",
            "reviewDate": "January 7, 2018",
            "reviewText": "We use this little guy for everything, from coffee to walnuts. Very easy to clean and friendly size."
        },
        {
            "reviewerName": "B-Lou",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Great coffee grinder",
            "reviewDate": "November 1, 2018",
            "reviewText": "Great little buy. Shipped quickly. Easy to use. Just add beans and pulse to desired consistency. Pleased with it!"
        },
        {
            "reviewerName": "Adam Inferrera",
            "rating": "3.0 out of 5 stars",
            "reviewTitle": "Too many crevices",
            "reviewDate": "August 9, 2019",
            "reviewText": "Not happy with how much coffee is left behind in crevices and under the blade"
        },
        {
            "reviewerName": "A Fluffy Husky",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Simple, Cheap & Effective",
            "reviewDate": "July 29, 2018",
            "reviewText": "Simple little grinder that works well. Its not going to give you a uniform grind but for something like spices that we use it for it perfect."
        },
        {
            "reviewerName": "Meagen Yeazel",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Gets the job done",
            "reviewDate": "March 5, 2019",
            "reviewText": "I waited to post the review until Ive had it for a few months and had enough time to use it to see how well it will hold up, and I use it every other day and it gets the job done, and its holding up very well!"
        },
        {
            "reviewerName": "Jennifer Waldron",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Good price, glad I purchased",
            "reviewDate": "August 8, 2019",
            "reviewText": "Does its job. Can grind to a fine dust if needed."
        },
        {
            "reviewerName": "Jayne",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Have already used this several times and love it. We have a large coffee maker at ...",
            "reviewDate": "January 15, 2017",
            "reviewText": "Have already used this several times and love it. We have a large coffee maker at work and they love that I bring small containers of freshly ground coffee from home."
        },
        {
            "reviewerName": "Madison Marshall",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Great for your beans",
            "reviewDate": "August 8, 2019",
            "reviewText": "Push, push and you have freshly ground coffee!"
        },
        {
            "reviewerName": "Dennis Sapp",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Nice grinder",
            "reviewDate": "February 23, 2019",
            "reviewText": "Grinds coffee as fine as powder if you like it that way. I do last longer"
        },
        {
            "reviewerName": "William",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Four years and still going strong!",
            "reviewDate": "March 7, 2017",
            "reviewText": "It grinds the perfect amount of coffee beans for a typical household 12 cup coffee pot."
        },
        {
            "reviewerName": "Todd Adrian",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Product just as described, fast shipping.",
            "reviewDate": "October 21, 2019",
            "reviewText": "Product just as described, fast shipping."
        },
        {
            "reviewerName": "Marileewee",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Wonderful",
            "reviewDate": "April 11, 2019",
            "reviewText": "Great little grinder. I only buy \"beans\" once in a while, so this size is perfect."
        },
        {
            "reviewerName": "Kristy",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "I love this little thing",
            "reviewDate": "November 25, 2018",
            "reviewText": "I use this to grind herbs for incense. It's small, it's quiet, and it works perfectly for what I needed it for."
        },
        {
            "reviewerName": "Kayla",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Its a good product",
            "reviewDate": "March 31, 2019",
            "reviewText": "Its good, easy to clean, grinds the beans well but is quite loud."
        },
        {
            "reviewerName": "JL",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Works great!",
            "reviewDate": "February 26, 2019",
            "reviewText": "I mean it grinds, so I can grind all day. God bless you coffee bean grinder."
        },
        {
            "reviewerName": "Mary Tupper",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Works great",
            "reviewDate": "May 8, 2019",
            "reviewText": "Just what I needed and looks good on counter"
        },
        {
            "reviewerName": "ExpertAuthority",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Gets the Job Done -- No Frills",
            "reviewDate": "July 4, 2013",
            "reviewText": "Scoop coffee beans into the grinder, put the lid on, and press the grind button. Ten or fifteen seconds later you will have perfectly ground coffee. This thing is easy to clean, too. Just rinse out the top potion (clear plastic part), and wipe the blade area with a damp paper towel. That's all.\n\nCoffee brewed from freshly ground beans tastes way better than already ground stuff. This is a must have for any coffee aficionado."
        },
        {
            "reviewerName": "JENA",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Five Stars",
            "reviewDate": "March 14, 2017",
            "reviewText": "Ground up my coffee and chopped up garlic perfectly!"
        },
        {
            "reviewerName": "Animal Chiro",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Good grinder",
            "reviewDate": "December 3, 2017",
            "reviewText": "Does a good job, as expected. We use for coffee grinding"
        },
        {
            "reviewerName": "Angela",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Easy to use",
            "reviewDate": "March 4, 2019",
            "reviewText": "Gets the job done for the best tasting coffee!"
        },
        {
            "reviewerName": "Carla",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Works Great",
            "reviewDate": "February 3, 2019",
            "reviewText": "This grinder works so well I have two. One for coffee and one for everything else"
        },
        {
            "reviewerName": "April Carl",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Great little gadget!",
            "reviewDate": "October 19, 2018",
            "reviewText": "Really like this little gadget. Use it daily to grind flax and pumpkin seeds for my breakfast smoothy."
        },
        {
            "reviewerName": "Grace",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Five Stars",
            "reviewDate": "October 22, 2017",
            "reviewText": "Not the most perfect grind ever, but it works fine and it's oddly great for grinding spices!"
        },
        {
            "reviewerName": "Bogdan Ogorek",
            "rating": "1.0 out of 5 stars",
            "reviewTitle": "Motor burned after a month",
            "reviewDate": "April 26, 2019",
            "reviewText": "Broke after a month....smoke came out from underneath and it stopped working."
        },
        {
            "reviewerName": "Roy G",
            "rating": "2.0 out of 5 stars",
            "reviewTitle": "Small & poor quality",
            "reviewDate": "July 20, 2019",
            "reviewText": "Cheap & not quality grind. Had to buy a better one"
        },
        {
            "reviewerName": "Amazon Customer",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Great product",
            "reviewDate": "June 17, 2019",
            "reviewText": "has worked just fine so far"
        },
        {
            "reviewerName": "FasaRow",
            "rating": "1.0 out of 5 stars",
            "reviewTitle": "It stopped working a little over a month",
            "reviewDate": "August 7, 2019",
            "reviewText": "I bought this on June 26 and stopped working on August 7. While it lasted, it did a good job grinding the coffee. The cleaning process could be improved. But because it only lasted a little over a month I can't recommend it."
        },
        {
            "reviewerName": "R. S.",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Great simple grinder",
            "reviewDate": "January 28, 2018",
            "reviewText": "Previously owned a delonghi grinder. This is so much simpler, takes just a touch. Much much quieter and really fast. Wish the cord was longer."
        },
        {
            "reviewerName": "Kendall Webber",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Five Stars",
            "reviewDate": "September 20, 2017",
            "reviewText": "It's a coffee grinder. It does the job. It grinds coffee."
        },
        {
            "reviewerName": "Clarence Booker Jr",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Wow it did what it was supposed to do",
            "reviewDate": "November 27, 2018",
            "reviewText": "It was fast and quick . First of all brought a bag of coffee beans by mistake....didn't want to go back to store...so I order this baby at a great price and in morning drop two table spoons of beans, 6 seconds later....fresh ground of your favorite coffee .....and a cup of goodness to my morning....I love it"
        },
        {
            "reviewerName": "Laura",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Works Great!",
            "reviewDate": "November 16, 2018",
            "reviewText": "Perfect cup every time. Great for cold brewing as well."
        },
        {
            "reviewerName": "J. Kirk",
            "rating": "2.0 out of 5 stars",
            "reviewTitle": "Cheap wont last",
            "reviewDate": "April 27, 2019",
            "reviewText": "Only had it a few months and it died."
        },
        {
            "reviewerName": "LaurenW",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Great",
            "reviewDate": "July 14, 2019",
            "reviewText": "Great"
        },
        {
            "reviewerName": "Sage60",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Inexpensive and works great!",
            "reviewDate": "April 9, 2013",
            "reviewText": "It's inexpensive compared to some models offered and it works great. No fancy bells and whistles - just does what it is supposed to do - grind coffee beans and for me, it will grind already store bought ground coffee a bit finer to use with Melitta filters in the Javajig for use in my Keurig. I find that the finer the grind is, the easier the water can flow through the paper filter since the bottom is not punctured by the pin in the Keurig the way it punctures K-cups.\n\nI am very pleased with it! Easy to keep clean, too!"
        },
        {
            "reviewerName": "JJ",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "NICE",
            "reviewDate": "June 16, 2019",
            "reviewText": "very easy to use and small enough to store"
        },
        {
            "reviewerName": "Jon R.",
            "rating": "1.0 out of 5 stars",
            "reviewTitle": "Gross.",
            "reviewDate": "January 5, 2019",
            "reviewText": "Disgusting! I ordered a brand new coffee grinder and I got a filthy dirty one that had already been used."
        },
        {
            "reviewerName": "Cheryl Glassman",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Does a great job",
            "reviewDate": "November 7, 2016",
            "reviewText": "My daughter sent me coffee from New York and I needed a coffee grinder. I didn't want to get one very expensive because I wasn't sure if I would continue to use it. This little grinder does the trick. I will be using it a lot as the coffee is great and it has a wonderful grinding ability. Very good grinder for the money."
        },
        {
            "reviewerName": "Lydia E. Andino Demyan",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Great product",
            "reviewDate": "August 11, 2018",
            "reviewText": "This is the only brand of coffee grinder I always buy! Just great!"
        },
        {
            "reviewerName": "Linda Watkins",
            "rating": "1.0 out of 5 stars",
            "reviewTitle": "Broken the first use",
            "reviewDate": "October 21, 2019",
            "reviewText": "Worked for like a minute then quit. Didn't overheat or anything, I pulsed like the directions said. Just completely stopped working, I'm returning it as defective and won't accept a replacement of the same type."
        },
        {
            "reviewerName": "Jason &amp;amp; Cassie Buchert",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Works as expected",
            "reviewDate": "December 9, 2016",
            "reviewText": "Grinds coffee as expected, not too loud either. Small enough to stay on the counter and not take up too much space."
        },
        {
            "reviewerName": "Sharon L. McCormick",
            "rating": "4.0 out of 5 stars",
            "reviewTitle": "Good product for the $$$",
            "reviewDate": "January 5, 2019",
            "reviewText": "Works well & would recommend."
        },
        {
            "reviewerName": "Dawn",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Great price",
            "reviewDate": "June 17, 2019",
            "reviewText": "Works great"
        },
        {
            "reviewerName": "Mike",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Does the job.",
            "reviewDate": "December 31, 2018",
            "reviewText": "Small and compact, good to keep at an office cubicle. Does the job just fine for the price."
        },
        {
            "reviewerName": "Cozall",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "I want thick Plastic",
            "reviewDate": "September 21, 2018",
            "reviewText": "My last one lasted for ever .. hope this one does too .. the plastic looks thinner"
        },
        {
            "reviewerName": "Regena L Johnson",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Very good grinder.",
            "reviewDate": "January 17, 2018",
            "reviewText": "Does a very good job and is fast. I like the size too."
        },
        {
            "reviewerName": "stefanie mott",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Great product for a great price",
            "reviewDate": "February 21, 2018",
            "reviewText": "It works really well! Great product for a great price! You just have to wipe out the base after each use or else you would have a lot of coffee buildup."
        },
        {
            "reviewerName": "Katerina Dons",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Excellent",
            "reviewDate": "November 27, 2018",
            "reviewText": "Super easy. Well worth the price."
        },
        {
            "reviewerName": "Magic Persia",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Good quality",
            "reviewDate": "November 13, 2018",
            "reviewText": "I love my Grinder. Works PERFECT. I can even grind my saffron with it and it gets really powdery which is awesome."
        },
        {
            "reviewerName": "Donna",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "coffee bean grinder",
            "reviewDate": "July 26, 2019",
            "reviewText": "worked great."
        },
        {
            "reviewerName": "Elizabeth F.",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Good",
            "reviewDate": "August 21, 2019",
            "reviewText": "Got as a gift. Works fine"
        },
        {
            "reviewerName": "hessah",
            "rating": "1.0 out of 5 stars",
            "reviewTitle": "Bad",
            "reviewDate": "July 31, 2019",
            "reviewText": "It worked one time just"
        },
        {
            "reviewerName": "c. tolson",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "also great for spices",
            "reviewDate": "July 4, 2018",
            "reviewText": "A must have if you grind your own coffee beans, also great for spices."
        },
        {
            "reviewerName": "Wendy D.",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Cute, effective, and can fit in small spaces...",
            "reviewDate": "January 3, 2018",
            "reviewText": "Luv it! I use it to grind down regular grind coffee to a finer grind and fill my reusable K-cups. The coffee comes out stronger like an espresso, so you get a bigger cup of coffee for 1/2 the price!!"
        },
        {
            "reviewerName": "Titan and Aphrodite",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Five Stars",
            "reviewDate": "August 29, 2018",
            "reviewText": "This is my second one. The last one lasted years!"
        },
        {
            "reviewerName": "M'ette",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "I love it !",
            "reviewDate": "August 22, 2016",
            "reviewText": "Grinds pounds of coffee w/out overheating! Looks great and shipped quickly!"
        },
        {
            "reviewerName": "DPaul",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Good inexpensive grinder",
            "reviewDate": "January 22, 2019",
            "reviewText": "I use two or three times a week and it works great. For the price this is a great deal."
        },
        {
            "reviewerName": "Thomas",
            "rating": "2.0 out of 5 stars",
            "reviewTitle": "It's hard to pour",
            "reviewDate": "August 11, 2019",
            "reviewText": "My issue with this coffee grinder is that to pour your ground coffee, you have to take off the whole top cover; this means you've got a pretty wide opening, and coffee grounds go everywhere. It's usable, but its messy and it's a pain."
        },
        {
            "reviewerName": "Carol T.",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Coffee grinder",
            "reviewDate": "October 13, 2018",
            "reviewText": "Does what it is made for. Grind fresh beans"
        },
        {
            "reviewerName": "f.lastname",
            "rating": "1.0 out of 5 stars",
            "reviewTitle": "Invest in a sturdier model",
            "reviewDate": "March 27, 2019",
            "reviewText": "Broke after 3 uses"
        },
        {
            "reviewerName": "Denise Phelps",
            "rating": "4.0 out of 5 stars",
            "reviewTitle": "Decent grinder for the price",
            "reviewDate": "January 15, 2019",
            "reviewText": "Nice grinder for the price"
        },
        {
            "reviewerName": "Amazon Customer",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "works great!",
            "reviewDate": "August 14, 2019",
            "reviewText": "Love this new grinder! It is much quieter than my previous one & can blend to a fine powder!"
        },
        {
            "reviewerName": "Amazon Customer",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "I can grind my flax seed which I add to my hot cereal.",
            "reviewDate": "October 23, 2018",
            "reviewText": "To grind my flax seed...."
        },
        {
            "reviewerName": "Zackery Kersh",
            "rating": "1.0 out of 5 stars",
            "reviewTitle": "This grinder broke within 1 week",
            "reviewDate": "January 22, 2019",
            "reviewText": "This is a straightforward coffee grinder that worked well the first week. Unfortunately, after one week the product stopped working. I tried cleaning out the grinds and plugging the grinder into a new outlet, but it simply won't work.\n\nWould not recommend for this purpose."
        },
        {
            "reviewerName": "Amazon Customer",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "great",
            "reviewDate": "September 24, 2018",
            "reviewText": "works great to grind anything"
        },
        {
            "reviewerName": "Tiffany P.",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Works nicely",
            "reviewDate": "November 15, 2018",
            "reviewText": "Works great for our single grinds in our store"
        },
        {
            "reviewerName": "Joseph",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "It grinds",
            "reviewDate": "March 12, 2019",
            "reviewText": "Stuff"
        },
        {
            "reviewerName": "noel32",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Five Stars",
            "reviewDate": "April 22, 2018",
            "reviewText": "Love this little powerful machine. Does a great job grinding coffee."
        },
        {
            "reviewerName": "Hal G",
            "rating": "1.0 out of 5 stars",
            "reviewTitle": "Junk",
            "reviewDate": "November 12, 2018",
            "reviewText": "worked once and only once. returned"
        },
        {
            "reviewerName": "Me+Three",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Five Stars",
            "reviewDate": "March 18, 2018",
            "reviewText": "Easy to use, basic but does the job. Highly recommend and the price is great!"
        },
        {
            "reviewerName": "Tami Rhoads Amazon Customer",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Nice grinder",
            "reviewDate": "April 17, 2018",
            "reviewText": "Nice grinder not as loud as my old grinder, grinds quickly."
        },
        {
            "reviewerName": "Ol\"boi",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Cleaning is easy",
            "reviewDate": "February 3, 2019",
            "reviewText": "Perfect for just me and takes up no room"
        },
        {
            "reviewerName": "Amazon Customer",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Works fine. Hopefully",
            "reviewDate": "June 30, 2018",
            "reviewText": "Works fine. Hopefully, it will last a while and I do not have to come here to change the review."
        },
        {
            "reviewerName": "CRM",
            "rating": "2.0 out of 5 stars",
            "reviewTitle": "Broke",
            "reviewDate": "July 7, 2018",
            "reviewText": "Purchased in February. Stopped working in July."
        },
        {
            "reviewerName": "Jeremy Edgmon",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Good product.",
            "reviewDate": "January 13, 2019",
            "reviewText": "Works great! No issues."
        },
        {
            "reviewerName": "Michelle",
            "rating": "4.0 out of 5 stars",
            "reviewTitle": "Four Stars",
            "reviewDate": "September 2, 2018",
            "reviewText": "Does the job. Nothing special, but nothing wrong with it."
        },
        {
            "reviewerName": "Kindle Customer",
            "rating": "2.0 out of 5 stars",
            "reviewTitle": "Eh",
            "reviewDate": "July 30, 2018",
            "reviewText": "Grinder is amazing at grinding coffee! My only issue was after using it for only the third time the motor blew up. You kinda get what you pay for unfortunately."
        },
        {
            "reviewerName": "O H",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "I love this",
            "reviewDate": "August 6, 2018",
            "reviewText": "So simple but works very well. I've had other Mr. Coffee coffee grinders and they're the best."
        },
        {
            "reviewerName": "Drew Smith",
            "rating": "3.0 out of 5 stars",
            "reviewTitle": "I've used better coffee grinders for sure",
            "reviewDate": "January 11, 2017",
            "reviewText": "Coffee sticks in this a bit just below the blades, requires frequent wiping out. I've used better coffee grinders for sure, but this one does get the job done!"
        },
        {
            "reviewerName": "Chelsea",
            "rating": "1.0 out of 5 stars",
            "reviewTitle": "Broke after 2 weeks",
            "reviewDate": "October 30, 2018",
            "reviewText": "I now have to buy a new one. I was just filling beans in it and it made a large sound and has since stopped working. Seems a coffee grinder should be made to be used multiple times."
        },
        {
            "reviewerName": "Amazon Customer",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Great product for a great price",
            "reviewDate": "January 7, 2019",
            "reviewText": "Works perfect and a great price!"
        },
        {
            "reviewerName": "FB",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Five Stars",
            "reviewDate": "May 12, 2017",
            "reviewText": "Love it. My last one lasted 15 years!"
        },
        {
            "reviewerName": "Connie Fig",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Nothing",
            "reviewDate": "April 16, 2019",
            "reviewText": "Good quality"
        },
        {
            "reviewerName": "Eva Canaya",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Easy to",
            "reviewDate": "March 12, 2018",
            "reviewText": "Finally found one that is not too loud.\nEasy to use"
        },
        {
            "reviewerName": "Amazon Customer",
            "rating": "1.0 out of 5 stars",
            "reviewTitle": "Product is very low quality",
            "reviewDate": "July 3, 2019",
            "reviewText": "Stop working after 2 months. Dont buy them"
        },
        {
            "reviewerName": "Amazon Customer",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Easy to use, works well.",
            "reviewDate": "November 21, 2018",
            "reviewText": "This coffee grinder is great. It is compact, with clean lines, and doesn't take up much space on the countertop. It is simple to use, very intuitive. Best of all it works well with all kinds of coffee beans, even flavored beans that may clog larger grinders."
        },
        {
            "reviewerName": "Briteni",
            "rating": "4.0 out of 5 stars",
            "reviewTitle": "Love it",
            "reviewDate": "January 8, 2019",
            "reviewText": "Its really simple. The ONLY thing I didnt like was it doesnt really grind the beans evenly. Some are a fine powder, some are large chunks. Its not a huge deal, because my coffee still tastes great."
        },
        {
            "reviewerName": "RJ Vacc",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Works fine. Great buy for the price",
            "reviewDate": "April 23, 2017",
            "reviewText": "Works fine. Great buy for the price."
        },
        {
            "reviewerName": "imtheWiz",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Good bean breaker. Good price",
            "reviewDate": "February 9, 2019",
            "reviewText": "Breaks beans into very tiny pieces like it is its job."
        },
        {
            "reviewerName": "L J S",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "What a wonderful coffee grinder",
            "reviewDate": "November 22, 2016",
            "reviewText": "I bought this as part of a gift but have owned one and have used it daily for over 5 years with great results. Better than the more expensive brands"
        },
        {
            "reviewerName": "Frog",
            "rating": "4.0 out of 5 stars",
            "reviewTitle": "Served my purpose.",
            "reviewDate": "December 27, 2016",
            "reviewText": "Served my purpose. I mainly use it for grinding flax and other seeds. Excellent and a good price."
        },
        {
            "reviewerName": "Jason Pinola",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Worth the money",
            "reviewDate": "June 29, 2019",
            "reviewText": "Good buy. Works like it should"
        },
        {
            "reviewerName": "AnthonysMaMa",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Five Stars",
            "reviewDate": "March 14, 2018",
            "reviewText": "Great product for the price. Small enough to fit in my cabinet but does the job!"
        },
        {
            "reviewerName": "Fernando Mendoza Lopez",
            "rating": "3.0 out of 5 stars",
            "reviewTitle": "Stopped working after a month of daily use",
            "reviewDate": "March 14, 2019",
            "reviewText": "The product did a solid job for grinding, and I appreciated that it was a very simple mechanism, but it just stopped working way too quickly."
        },
        {
            "reviewerName": "Anon",
            "rating": "3.0 out of 5 stars",
            "reviewTitle": "Coffee ground to espresso level fineness tends to stick and ...",
            "reviewDate": "February 3, 2017",
            "reviewText": "Coffee ground to espresso level fineness tends to stick and clump to the sides, especially around the inner lip where plastic meets metal."
        },
        {
            "reviewerName": "AMBER",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Good product",
            "reviewDate": "March 20, 2018",
            "reviewText": "Works as expected good quality for the price."
        },
        {
            "reviewerName": "Woods",
            "rating": "1.0 out of 5 stars",
            "reviewTitle": "Died first use",
            "reviewDate": "February 28, 2019",
            "reviewText": "First use started smoking and died. Returned."
        },
        {
            "reviewerName": "Lionlvr",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Useful",
            "reviewDate": "December 19, 2013",
            "reviewText": "I love the simplicity of this product. I bought it to use with my stove top espresso maker and I have noticed that when you grind the beans just prior to making the espresso it tastes much better. This is easy to use and grinds the beans to a perfect consistency. It doesn't take up much space."
        },
        {
            "reviewerName": "Captain Fantastic",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Five Stars",
            "reviewDate": "March 1, 2018",
            "reviewText": "It grinds my coffee every time I use it. The End."
        },
        {
            "reviewerName": "Colin Thomas",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Five Stars",
            "reviewDate": "January 25, 2018",
            "reviewText": "Great little reasonably priced coffee grinder that performs nicely."
        },
        {
            "reviewerName": "Jules Agee",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "These grinders are great.",
            "reviewDate": "January 20, 2018",
            "reviewText": "I am so glad they still make these. I've had an identical one for probably twenty years. The power cord wore out before the motor or blades did."
        },
        {
            "reviewerName": "At Home in the Bluegrass",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Five Stars",
            "reviewDate": "August 22, 2017",
            "reviewText": "very happy"
        },
        {
            "reviewerName": "Ray",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Does a good job",
            "reviewDate": "May 2, 2013",
            "reviewText": "Bought two! Good price! This little unit does a good job and is easy to use. We've had it a few months and use it every day.\n\nUpdate: Have been using the one unit most days for almost three years, and works like new. The second one I had bought we gave to our daughter in college, and she was pleased with it."
        },
        {
            "reviewerName": "JH",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Quick and simple",
            "reviewDate": "July 13, 2018",
            "reviewText": "works great, quick and easy. Better coffee for sure."
        },
        {
            "reviewerName": "Paul Johnson",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Ground your own coffee beans",
            "reviewDate": "February 9, 2019",
            "reviewText": "Love it. Makes a real difference and smoothe tasting coffee. Never going back to pre-ground coffee."
        },
        {
            "reviewerName": "Peter J Scibelli",
            "rating": "1.0 out of 5 stars",
            "reviewTitle": "Didn't last.",
            "reviewDate": "March 24, 2019",
            "reviewText": "It didn't last a month and broke. I was loud. It was great because it was easy to use, clean and store."
        },
        {
            "reviewerName": "Adam",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "You're going to get a variety of grain sizes but at this price point it's pretty hard to get disappointed",
            "reviewDate": "February 7, 2017",
            "reviewText": "Hard to beat for the price. You're going to get a variety of grain sizes but at this price point it's pretty hard to get disappointed."
        },
        {
            "reviewerName": "Chris Henrici",
            "rating": "2.0 out of 5 stars",
            "reviewTitle": "Cant select desired grind level",
            "reviewDate": "August 25, 2018",
            "reviewText": "The idea that you can customize the courseness of your beans is laughable. There is a time chart on how long to hold down the power to achieve desired grind level, which is not only inexact but ineffective. This product is pretty useless for me."
        },
        {
            "reviewerName": "pnwflyfisher",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Works awesome.",
            "reviewDate": "March 12, 2018",
            "reviewText": "I use this for mixing dubbing for fly tying. Works awesome."
        },
        {
            "reviewerName": "Alandete",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Nice",
            "reviewDate": "October 7, 2018",
            "reviewText": "Nice"
        },
        {
            "reviewerName": "Gayle Hunt",
            "rating": "1.0 out of 5 stars",
            "reviewTitle": "Not worth even the $10 paid",
            "reviewDate": "July 24, 2019",
            "reviewText": "Purchased 11/18/18. It stopped functioning 7/20/19. Purchased cuz I owned one just like it for 20 YEARS! Though I didn't expect 20 on this one, I sure expected to get more than 8 months of use."
        },
        {
            "reviewerName": "Michael Morse",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Great",
            "reviewDate": "November 18, 2018",
            "reviewText": "Works great"
        },
        {
            "reviewerName": "Mark Hodorowicz",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Works very well",
            "reviewDate": "January 9, 2019",
            "reviewText": "Does the job well"
        },
        {
            "reviewerName": "Maria Luisa Mrquez",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Exelente moledor de caf.",
            "reviewDate": "October 10, 2018",
            "reviewText": "Me encant!!! No ocupa mucho espacio y le pongo la misma cantidad de caf que a otro ms grande, mueble el caf con una facilidad y lo deja muy bien molido, lo recomiendo 100%. Exelente moledor de caf a un muy buen precio."
        },
        {
            "reviewerName": "David Herman",
            "rating": "4.0 out of 5 stars",
            "reviewTitle": "Works great",
            "reviewDate": "August 26, 2018",
            "reviewText": "Very easy to use and grinds very well. Id highly recommend this grinder"
        },
        {
            "reviewerName": "Mr. Richard H. Hansen",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "for me a single person the product is excellent. you can vary the grind by how many ...",
            "reviewDate": "March 13, 2016",
            "reviewText": "for me a single person the product is excellent. you can vary the grind by how many times you pulse the beans. for one cup i do 3 short bursts.\neasy to clean"
        },
        {
            "reviewerName": "birdie",
            "rating": "1.0 out of 5 stars",
            "reviewTitle": "Died!",
            "reviewDate": "September 10, 2019",
            "reviewText": "Sadly this little gem died after 2 uses....plugged it in to use for the third day and it wouldn't turn on. Returned for a refund"
        },
        {
            "reviewerName": "theoandamy",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Easy to use and speedy too!",
            "reviewDate": "November 14, 2011",
            "reviewText": "I like this grinder a lot. It does grind the beans very quickly and seems to be thorough as well. The cap is large enough to turn over and collect the ground beans, unlike the grinder this one replaced. I also like that it is black as our old one was white and got dirty looking no matter how much I cleaned it."
        },
        {
            "reviewerName": "Jeffrey M.",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Five Stars",
            "reviewDate": "July 27, 2018",
            "reviewText": "Quiet!!"
        },
        {
            "reviewerName": "Lydia",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "This is a great product! My husband and I are using it ...",
            "reviewDate": "March 17, 2017",
            "reviewText": "This is a great product! My husband and I are using it everyday to grind fresh coffee. Perfect little grinder. I love it!"
        },
        {
            "reviewerName": "Ryan busby",
            "rating": "1.0 out of 5 stars",
            "reviewTitle": "Doesnt last",
            "reviewDate": "October 10, 2018",
            "reviewText": "Ground the beans very well until about the sixth time I used it........it stopped working completely..... glad to know I wasted $15.00 on a coffee grinder that has only 6 uses in its life.......very irritated!!!!!"
        },
        {
            "reviewerName": "Cavell",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Makes fir better, stronger coffee.",
            "reviewDate": "March 26, 2018",
            "reviewText": "This is great. Grinds in a flash. Love it."
        },
        {
            "reviewerName": "Karen",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Five Stars",
            "reviewDate": "January 27, 2018",
            "reviewText": "As described, no issues"
        },
        {
            "reviewerName": "Pam Miller",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "This is a great coffee grinder.",
            "reviewDate": "May 9, 2017",
            "reviewText": "I bought this coffee grinder for a gift along with coffee beans. My brother in law love it and the coffeee I bought on Amazon."
        },
        {
            "reviewerName": "Dick Kelvey",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Almost perfect.",
            "reviewDate": "March 29, 2017",
            "reviewText": "Amazingly quiet. Works great. Only downside is there is no power cord storage. It just hangs off like a lamp cord. Needs some way to manage the cord."
        },
        {
            "reviewerName": "Amazon Customer",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "A beautiful and useful item",
            "reviewDate": "September 20, 2018",
            "reviewText": "I used this product and I am very happy with it. This is easy to use and clean and dutiable. This is a good addition for my kitchen. I will recommend it to buy Mr. Coffee Grinder."
        },
        {
            "reviewerName": "Jacob",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Happy",
            "reviewDate": "October 10, 2019",
            "reviewText": "Two thumbs up"
        },
        {
            "reviewerName": "Michelle A Emrick",
            "rating": "1.0 out of 5 stars",
            "reviewTitle": "Stopped working after 1 month",
            "reviewDate": "October 14, 2018",
            "reviewText": "We had a Mr. Coffee grinder just like this one for over 10 years, so when the cord finally frayed on it we purchased a replacement. I guess the quality has declined over the years, the replacement broke after one month. Do not buy."
        },
        {
            "reviewerName": "Pdselvan",
            "rating": "4.0 out of 5 stars",
            "reviewTitle": "Coffee / Spice grinder",
            "reviewDate": "August 24, 2010",
            "reviewText": "I bought Mr.Coffee's coffee grinder for the explicit use of grinding spices. And I should say that so far I am not disappointed. I have tried grinding various indian spices and the job has had its fair share of ups and downs.\nSome spices (like cinnamon, cloves, etc) were powdered very finely, just like how I wanted it. But some others, like Cumin seeds, were still a little coarse and I do not know why.\nThe only drawback that I saw in using the grinder was the difficulty in transferring the end result to a container...it is quite tricky to work around the blades and carefully spoon out the powder! That is my only time-consuming gripe. Apart, I am pretty happy with the purchase!"
        },
        {
            "reviewerName": "PAL",
            "rating": "4.0 out of 5 stars",
            "reviewTitle": "Four Stars",
            "reviewDate": "February 17, 2018",
            "reviewText": "Good value."
        },
        {
            "reviewerName": "Jennifer Gil",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Grinding spices",
            "reviewDate": "November 18, 2018",
            "reviewText": "I enjoy this grinder for coffee and spices. Im actually using it a lot during November for cooking. Depending on how fine of coarse you want the coffee or spices, the grinder is easy to manage and control."
        },
        {
            "reviewerName": "Kendall Hissem",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Five Stars",
            "reviewDate": "May 3, 2018",
            "reviewText": "Love it, easy to use"
        },
        {
            "reviewerName": "LisaMB",
            "rating": "4.0 out of 5 stars",
            "reviewTitle": "Good basic coffee grinder",
            "reviewDate": "January 24, 2016",
            "reviewText": "Works well, as expected. Nice look. Have not had any problems after a year. Occasionally have to shake it to get it to grind fully but otherwise fine."
        },
        {
            "reviewerName": "Harold E. Luse",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "As advertized",
            "reviewDate": "February 12, 2016",
            "reviewText": "I bought this unit to replace a Mr Coffee grinder that I had for 21 years. This model has thicker plastic and is a little heavier than my old one."
        },
        {
            "reviewerName": "Jesse Jennings",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Five Stars",
            "reviewDate": "December 27, 2017",
            "reviewText": "Great grinder at a great price!"
        },
        {
            "reviewerName": "Michael Honeycutt",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Thumbs up!",
            "reviewDate": "April 9, 2017",
            "reviewText": "Nice little grinder works well.. only way it could be better if it was battery operated!!"
        },
        {
            "reviewerName": "Renee",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Easy to use",
            "reviewDate": "May 9, 2019",
            "reviewText": "It works great, it is easy to use, and it is sturdy."
        },
        {
            "reviewerName": "Colorado",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Great Grinder",
            "reviewDate": "October 26, 2016",
            "reviewText": "So far it's been a great ginder. It's not as noisy as the previous one I owned and I appreciate that."
        },
        {
            "reviewerName": "Brent Martin",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Five Stars",
            "reviewDate": "January 28, 2018",
            "reviewText": "This is a great grinder because it is quiet and fast."
        },
        {
            "reviewerName": "Angel",
            "rating": "1.0 out of 5 stars",
            "reviewTitle": "One Star",
            "reviewDate": "December 5, 2016",
            "reviewText": "This grinder lasted about five months. I used it three or four times per week."
        },
        {
            "reviewerName": "Barbara Jo Thomas",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Five Stars",
            "reviewDate": "May 17, 2018",
            "reviewText": "Fine product"
        },
        {
            "reviewerName": "Amazon Customer",
            "rating": "1.0 out of 5 stars",
            "reviewTitle": "Don't waste your money",
            "reviewDate": "April 13, 2018",
            "reviewText": "Broke on 2nd use"
        },
        {
            "reviewerName": "Amazon Customer",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Great little grinder!",
            "reviewDate": "April 8, 2016",
            "reviewText": "Had it for a couple days but already in love with this little grinder."
        },
        {
            "reviewerName": "Jenna P.",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Perfect grind!",
            "reviewDate": "December 28, 2018",
            "reviewText": "Loved it! Super quiet."
        },
        {
            "reviewerName": "JL",
            "rating": "3.0 out of 5 stars",
            "reviewTitle": "Cant handle a lot of beans",
            "reviewDate": "June 14, 2018",
            "reviewText": "Dont fill it too full or the motor will seize and youll be SOL"
        },
        {
            "reviewerName": "Sweet frenchy",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Five Stars",
            "reviewDate": "March 21, 2018",
            "reviewText": "Kool"
        },
        {
            "reviewerName": "Holly Graves",
            "rating": "1.0 out of 5 stars",
            "reviewTitle": "Stopped working after 2 uses.",
            "reviewDate": "February 19, 2018",
            "reviewText": "Used it twice. Stopped working when I tried to use it for the third time. Of course, the return window is closed now."
        },
        {
            "reviewerName": "wthw_us_4nk410x",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Love it!",
            "reviewDate": "February 10, 2018",
            "reviewText": "Works flawlessly. Love it!"
        },
        {
            "reviewerName": "miss kittybooboo",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Fresh grounds smell so much nicer",
            "reviewDate": "January 1, 2017",
            "reviewText": "Love it. Cute and easy to clean. Love the smell of fresh ground coffee again"
        },
        {
            "reviewerName": "Izzy K.",
            "rating": "4.0 out of 5 stars",
            "reviewTitle": "so I would not recommend it if that is something that you prefer",
            "reviewDate": "July 23, 2018",
            "reviewText": "Grinds coffee beans well. However, the inside part does not detach, so I would not recommend it if that is something that you prefer."
        },
        {
            "reviewerName": "Kara",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Love this grinder",
            "reviewDate": "April 27, 2016",
            "reviewText": "Love this grinder. I ruined my last one but cleaning it with too much water. Gotta have one of these to grind my spices!"
        },
        {
            "reviewerName": "KQ",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Gets the job done.",
            "reviewDate": "January 4, 2019",
            "reviewText": "Gets the job done for cheap."
        },
        {
            "reviewerName": "Erica",
            "rating": "2.0 out of 5 stars",
            "reviewTitle": "Stopped working",
            "reviewDate": "February 13, 2019",
            "reviewText": "After 1&1/2 months it just stopped working. Easy to clean and use but not with it."
        },
        {
            "reviewerName": "Will Richmond II",
            "rating": "4.0 out of 5 stars",
            "reviewTitle": "Works well. Looks good.",
            "reviewDate": "September 5, 2019",
            "reviewText": "Simple, handsome works well."
        },
        {
            "reviewerName": "PMAN",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "GLAD I GAVE IT A SHOT!",
            "reviewDate": "February 28, 2016",
            "reviewText": "I LOVE THE NICE EVEN COARSE GRIND AND THE COFFEE DOESNT CLING TO THE SIDES LIKE MY OLD KRUPP DID. THIS PROVES YOU DONT NEED TO SPEND ALOT FOR A GOOD GRIND."
        },
        {
            "reviewerName": "Anthony Tabor",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Good for medical marijuana grinding. Fluffs it right up. 3 taps and done. The lid holds all the kief",
            "reviewDate": "August 21, 2019",
            "reviewText": "Fluffs up medical marijuana really nice for rolling joints."
        },
        {
            "reviewerName": "manuel santana",
            "rating": "4.0 out of 5 stars",
            "reviewTitle": "Good buy",
            "reviewDate": "August 28, 2018",
            "reviewText": "Grind the coffee beans good, and it's small didn't take a lot of space on my limited space counter."
        },
        {
            "reviewerName": "mayra gomez",
            "rating": "4.0 out of 5 stars",
            "reviewTitle": "Good for the money spent",
            "reviewDate": "September 19, 2019",
            "reviewText": "Works well"
        },
        {
            "reviewerName": "Samantha G.",
            "rating": "4.0 out of 5 stars",
            "reviewTitle": "Keeps on going ...",
            "reviewDate": "June 26, 2013",
            "reviewText": "This little grinder has been great. I've used it for nuts, grains, egg shells, sugar in the raw as well as coffee and it just keeps on going. As long as you give it a bit of a rest in between grindings, it'll last a long time. Recommended."
        },
        {
            "reviewerName": "SAR",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Five Stars",
            "reviewDate": "February 11, 2018",
            "reviewText": "Works great, easy to use, and inexpensive"
        },
        {
            "reviewerName": "Amazon Customer",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "It works",
            "reviewDate": "October 9, 2018",
            "reviewText": "Perfect for single servings"
        },
        {
            "reviewerName": "Joseph E Kenol",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Good value",
            "reviewDate": "November 9, 2019",
            "reviewText": "Works really well."
        },
        {
            "reviewerName": "Nik",
            "rating": "1.0 out of 5 stars",
            "reviewTitle": "Doesn't last!",
            "reviewDate": "June 8, 2018",
            "reviewText": "Complete dud. Died in less than 2 months with minimal use."
        },
        {
            "reviewerName": "Paul W. Mahler",
            "rating": "4.0 out of 5 stars",
            "reviewTitle": "works well, hard to control",
            "reviewDate": "January 1, 2019",
            "reviewText": "works well, but it is hard to time the right grind size."
        },
        {
            "reviewerName": "Debbie",
            "rating": "1.0 out of 5 stars",
            "reviewTitle": "Breaks fast",
            "reviewDate": "August 26, 2019",
            "reviewText": "It broke after like 5 uses. I had one that lasted like 10 years.. but I needed a new one. Disappointed. Not worth it"
        },
        {
            "reviewerName": "Amanda",
            "rating": "2.0 out of 5 stars",
            "reviewTitle": "Worked great....twice and then....",
            "reviewDate": "September 13, 2018",
            "reviewText": "Got this thing a few weeks ago, and used it twice.....Worked great, and then it didn't work at all.. Followed the directions for using/cleaning, but for whatever reason it's not working."
        },
        {
            "reviewerName": "Gerald S.",
            "rating": "4.0 out of 5 stars",
            "reviewTitle": "Good price, a little smaller than I thought.",
            "reviewDate": "October 28, 2018",
            "reviewText": "Great grinder for coffee."
        },
        {
            "reviewerName": "Tim",
            "rating": "4.0 out of 5 stars",
            "reviewTitle": "Quality and Value rolled into one.",
            "reviewDate": "August 9, 2018",
            "reviewText": "Cant go wrong with the product for the price. Performs as expected. Extremely satisfied."
        },
        {
            "reviewerName": "Michael L",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Good product",
            "reviewDate": "February 20, 2019",
            "reviewText": "Works as expected. I didn't rate durability as i haven't owned it long enough to give it a fair assessment."
        },
        {
            "reviewerName": "Lanie",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Five Stars",
            "reviewDate": "September 23, 2017",
            "reviewText": "great product for a great price!"
        },
        {
            "reviewerName": "Nathalie",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "It works",
            "reviewDate": "February 16, 2019",
            "reviewText": "It works like it supposed to ??"
        },
        {
            "reviewerName": "IRod",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Daily grind",
            "reviewDate": "September 11, 2018",
            "reviewText": "Great tool for the grind. Works great!"
        },
        {
            "reviewerName": "2BR02b",
            "rating": "1.0 out of 5 stars",
            "reviewTitle": "It didn't last 2 months.",
            "reviewDate": "August 25, 2017",
            "reviewText": "It didn't last 2 months. Need I say more?"
        },
        {
            "reviewerName": "April",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Mr. Coffee is the BEST",
            "reviewDate": "January 3, 2018",
            "reviewText": "You COULD go with a higher priced grinder... but MR. Coffee has served me well for years. I bought this one for a gift. I have the same one and have had it for years with no issues. Grinds perfectly."
        },
        {
            "reviewerName": "Jay Johnson",
            "rating": "4.0 out of 5 stars",
            "reviewTitle": "It Grinds!",
            "reviewDate": "January 23, 2013",
            "reviewText": "Totally basic grinder. It grinds beans, and grinds them well. It can get a bit messy removing the top to dump the grounds into the coffee maker, but I can't imagine that isn't the case for any grinder. Cheap and simple, a great bargain!"
        },
        {
            "reviewerName": "RHoy",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "and works great! For someone who usually buys coffee ground and ...",
            "reviewDate": "April 15, 2018",
            "reviewText": "Small, simple, and works great! For someone who usually buys coffee ground and recently switched to whole beans this was perfect for me."
        },
        {
            "reviewerName": "Emma B.",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": ":)",
            "reviewDate": "August 7, 2018",
            "reviewText": "Love this coffee grinder!"
        },
        {
            "reviewerName": "Kindle Customer",
            "rating": "1.0 out of 5 stars",
            "reviewTitle": "One Star",
            "reviewDate": "December 3, 2016",
            "reviewText": "The product has already quit i would not recommend it to anyone."
        },
        {
            "reviewerName": "Amazon Customer",
            "rating": "1.0 out of 5 stars",
            "reviewTitle": "No Good",
            "reviewDate": "February 3, 2017",
            "reviewText": "Lousy quality. Used 3 times and motor burned out. Save your money and buy some other brand."
        },
        {
            "reviewerName": "ShermanFamily",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Just bought my second one for the office.",
            "reviewDate": "October 20, 2012",
            "reviewText": "These are great little grinders. I've had my first one going on 6 years now. The only difference between now and when I bought it is that it takes a little longer since the blades are no doubt dull. I would definitely recommend one of these."
        },
        {
            "reviewerName": "Kayla",
            "rating": "4.0 out of 5 stars",
            "reviewTitle": "good price, gets the job done but you kind ...",
            "reviewDate": "January 7, 2016",
            "reviewText": "good price, gets the job done but you kind of have to turn it upside down when you're done to get all the grounds out."
        },
        {
            "reviewerName": "erica carriere",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Great customer service",
            "reviewDate": "November 15, 2018",
            "reviewText": "Awesome customer service. The product is really neat. It's perfect for fresh ground pepper and pink himalayan sea salt."
        },
        {
            "reviewerName": "Irene",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Needed one",
            "reviewDate": "August 12, 2019",
            "reviewText": "Love it!"
        },
        {
            "reviewerName": "Amazon Customer",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Works great. I bought this because I have the same ...",
            "reviewDate": "October 10, 2015",
            "reviewText": "Works great. I bought this because I have the same one for coffee beans already and needed one for flax seeds. The one I have for the coffee beans is almost 10 years old and still works like new with use almost every day."
        },
        {
            "reviewerName": "BuckCarew",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "MMMM Good, The Coffee Just Tastes Better!",
            "reviewDate": "January 29, 2011",
            "reviewText": "This is my third or fourth of this grinder, each as lasted me 3-4 years, when I over fill it tends to burn it out. I love this grinder, my coffee tastes best from this one, I don't know why but it must grind it better or finer than the others I've tried and I've tried a bunch including oster and kitchen aid."
        },
        {
            "reviewerName": "Jeanne Pray",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Good",
            "reviewDate": "August 20, 2017",
            "reviewText": "Good"
        },
        {
            "reviewerName": "georgia",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Makes a good gift.",
            "reviewDate": "November 18, 2018",
            "reviewText": "This coffee grinder is very easy to use. Works well. Great product for the price. Will definitely but again as a gift for others."
        },
        {
            "reviewerName": "Joffrey",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Five Stars",
            "reviewDate": "January 23, 2017",
            "reviewText": "I have been using this product for 5 months now. No issues so far."
        },
        {
            "reviewerName": "J. P.",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "it works",
            "reviewDate": "January 5, 2019",
            "reviewText": "works"
        },
        {
            "reviewerName": "Allyson",
            "rating": "1.0 out of 5 stars",
            "reviewTitle": "Died after 5 months",
            "reviewDate": "September 22, 2019",
            "reviewText": "I bought this in April 2019 and it died in September 2019. The blade will no longer turn."
        },
        {
            "reviewerName": "Deborah C Busemeyer",
            "rating": "1.0 out of 5 stars",
            "reviewTitle": "Coffee like this that worked great for 18 years",
            "reviewDate": "July 13, 2018",
            "reviewText": "DO NOT BUY! We had a Mr. Coffee like this that worked great for 18 years. This product had less than 2 months of use and died. Total garbage. Will never buy a Mr. Coffee product again."
        },
        {
            "reviewerName": "Billsfan",
            "rating": "1.0 out of 5 stars",
            "reviewTitle": "Lasted one month. :( lack of durability",
            "reviewDate": "October 7, 2018",
            "reviewText": "Used one month and stopped working. Outside of my return date by one week. Do not bother purchasing."
        },
        {
            "reviewerName": "Susan E",
            "rating": "1.0 out of 5 stars",
            "reviewTitle": "It lasted for a month. Then the motor burned ...",
            "reviewDate": "July 2, 2014",
            "reviewText": "It lasted for a month. Then the motor burned out."
        },
        {
            "reviewerName": "Albert M.",
            "rating": "1.0 out of 5 stars",
            "reviewTitle": "One Star",
            "reviewDate": "September 20, 2017",
            "reviewText": "product worked two times and stopped and smelled like it caught fire"
        },
        {
            "reviewerName": "Nyx",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Five Stars",
            "reviewDate": "September 25, 2018",
            "reviewText": "been using it for a while now and have 0 problems"
        },
        {
            "reviewerName": "Lisa Pauline Germain",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Five Stars",
            "reviewDate": "November 13, 2016",
            "reviewText": "I love this grinder! Fresh coffee every morning."
        },
        {
            "reviewerName": "Maria",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "You need this grinder!",
            "reviewDate": "December 3, 2016",
            "reviewText": "Very easy to use and clean. recommend this little gadget for every kitchen"
        },
        {
            "reviewerName": "Andie",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Simply Efficient",
            "reviewDate": "August 11, 2013",
            "reviewText": "I had one of these for 10 years and when it died I couldn't find this style anywhere. Thank you Amazon. This is a great easy to use coffee grinder. No fuss, no frills. Just grinds the beans perfectly.."
        },
        {
            "reviewerName": "Dan",
            "rating": "1.0 out of 5 stars",
            "reviewTitle": "Already broke. Only been 5months.",
            "reviewDate": "March 3, 2019",
            "reviewText": "Bought in September and it already stopped working."
        },
        {
            "reviewerName": "Amazon Customer",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Good product",
            "reviewDate": "July 1, 2019",
            "reviewText": "Works great, shipped fast."
        },
        {
            "reviewerName": "KF",
            "rating": "3.0 out of 5 stars",
            "reviewTitle": "Three Stars",
            "reviewDate": "January 2, 2017",
            "reviewText": "Wish it had a place to wrap cord around like older styles."
        },
        {
            "reviewerName": "Lawrence",
            "rating": "1.0 out of 5 stars",
            "reviewTitle": "One Star",
            "reviewDate": "June 9, 2018",
            "reviewText": "Broke after a year and 3 months of use"
        },
        {
            "reviewerName": "linden allman",
            "rating": "1.0 out of 5 stars",
            "reviewTitle": "usability limited",
            "reviewDate": "November 12, 2018",
            "reviewText": "don't know how this product is being sold to consumers,, if you make more than a pot of coffee a day this would be a disaster when it only works 2 to 3 times"
        },
        {
            "reviewerName": "Lori",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Better than Black and Decker",
            "reviewDate": "November 8, 2013",
            "reviewText": "Lasts much much much longer than the Black and Decker coffee grinder we HAD. I noticed my mom had one from way way waaaaay back and it was still working. So we got this one in hopes of the same thing. Sure, it doesn't have settings for a fine grind or a thick mix. But after a few uses, you'll be able to hear when it's done grinding to your liking. It's also great with dry spices!"
        },
        {
            "reviewerName": "Jerome A Budde",
            "rating": "4.0 out of 5 stars",
            "reviewTitle": "It works as you would expect",
            "reviewDate": "October 3, 2018",
            "reviewText": "Grinds coffe beans as well as you would expect. Only have it for for a couple of months. Last one was 10 yrs"
        },
        {
            "reviewerName": "ALC",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Five Stars",
            "reviewDate": "July 24, 2016",
            "reviewText": "This is a great little grinder.. I use it all the time. great price.."
        },
        {
            "reviewerName": "Amazon Customer",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Five Stars",
            "reviewDate": "January 26, 2018",
            "reviewText": "Work perfect"
        },
        {
            "reviewerName": "G. Paige",
            "rating": "4.0 out of 5 stars",
            "reviewTitle": "Four Stars",
            "reviewDate": "April 12, 2017",
            "reviewText": "works good"
        },
        {
            "reviewerName": "Risa VanOvermeir",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Grinder",
            "reviewDate": "July 1, 2015",
            "reviewText": "Great little item to grind coffee beans, I actually use mine to grind spices and seeds because of it's size, works better for me."
        },
        {
            "reviewerName": "Keith",
            "rating": "4.0 out of 5 stars",
            "reviewTitle": "grinds",
            "reviewDate": "February 3, 2017",
            "reviewText": "Niece says does the job, could be easier to clean"
        },
        {
            "reviewerName": "Online Shopper",
            "rating": "3.0 out of 5 stars",
            "reviewTitle": "Three Stars",
            "reviewDate": "June 29, 2016",
            "reviewText": "Easy to clean but grounds stick to the bottom of the grinder under the blades."
        },
        {
            "reviewerName": "Rogelio",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "GRINDER",
            "reviewDate": "June 9, 2017",
            "reviewText": "WORKS GREAT"
        },
        {
            "reviewerName": "Edgard Schmidt",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "but it does the job very good!",
            "reviewDate": "February 5, 2018",
            "reviewText": "Light coffee grinder, but very practical! No very big capacity, but it does the job very good!"
        },
        {
            "reviewerName": "Meir",
            "rating": "3.0 out of 5 stars",
            "reviewTitle": "... extremely uneven but the impact on taste isn't too bad. Would be better to have an even grind",
            "reviewDate": "January 19, 2018",
            "reviewText": "The grind is extremely uneven but the impact on taste isn't too bad. Would be better to have an even grind. Also a lot of the coffee gets turned into a fine powder and just sticks to the side so it's basically wasted."
        },
        {
            "reviewerName": "Justine",
            "rating": "1.0 out of 5 stars",
            "reviewTitle": "I would NOT recommend.",
            "reviewDate": "June 4, 2018",
            "reviewText": "Broke after 5 uses! I would NOT recommend."
        },
        {
            "reviewerName": "Amazon Customer",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "great grinder",
            "reviewDate": "January 25, 2016",
            "reviewText": "Greatest little grinder, I am very pleased. I will buy more. Very fast delivery."
        },
        {
            "reviewerName": "Amazon Customer",
            "rating": "1.0 out of 5 stars",
            "reviewTitle": "purchased May 5th of 2018. on May 29th, ...",
            "reviewDate": "May 29, 2018",
            "reviewText": "purchased May 5th of 2018. on May 29th, following the grinding of 4 cups of coffee beans , a cup of nuts, the item does not run any more. I am hoping they offer a replacement."
        },
        {
            "reviewerName": "JSantos",
            "rating": "4.0 out of 5 stars",
            "reviewTitle": "Mr. Coffee grinder",
            "reviewDate": "January 10, 2014",
            "reviewText": "I bought this grinder for my coworker and she loved it. She's been looking for one for some time now and I surprised her with it. She used it right away and it worked perfect."
        },
        {
            "reviewerName": "Sarah J Frahm",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "You wont be disappointed.",
            "reviewDate": "May 6, 2016",
            "reviewText": "This thing is great! It replaces an older one just like it that finally died (RIP, Mr. Coffee grinder). I pretty much over fill it every day and it perfectly grinds my coffee (for drip coffee) in 10 seconds. I love this thing! It completely out performs the more expensive Bodum grinder."
        },
        {
            "reviewerName": "MD",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Love this little grinder.",
            "reviewDate": "December 2, 2014",
            "reviewText": "I have one that I bought about 10 years ago and it is still going. This one is a Christmas gift for someone and I know they will love it!"
        },
        {
            "reviewerName": "No. Cal.",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Godd Buy",
            "reviewDate": "October 5, 2015",
            "reviewText": "Works as it should. My last one lasted about 15 years.\nYou can buy a second on and use it to grind spices"
        },
        {
            "reviewerName": "Alecia Aguilar",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Fast and easy!",
            "reviewDate": "February 1, 2019",
            "reviewText": "Works great! Fast and have no problems!"
        },
        {
            "reviewerName": "Lisa Laird",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Five Stars",
            "reviewDate": "July 27, 2018",
            "reviewText": "Love using it every morning. Works like a gem!"
        },
        {
            "reviewerName": "Anna Partee",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Coffee grinder",
            "reviewDate": "March 28, 2019",
            "reviewText": "Grinds really well and isnt that loud either and cheaper than the ones I seen at Walmart ."
        },
        {
            "reviewerName": "Jennifer Parker",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Five Stars",
            "reviewDate": "December 9, 2016",
            "reviewText": "Perfect for grinding herbs for smoking."
        },
        {
            "reviewerName": "Renee",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Five Stars",
            "reviewDate": "January 24, 2017",
            "reviewText": "perfect."
        },
        {
            "reviewerName": "Kevin",
            "rating": "4.0 out of 5 stars",
            "reviewTitle": "So far so good!",
            "reviewDate": "February 16, 2018",
            "reviewText": "So far so good! Just wish the grind didn't stick to the sides due to the static."
        },
        {
            "reviewerName": "CHUCK COUGHLIN",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Five Stars",
            "reviewDate": "April 22, 2018",
            "reviewText": "Easy to use - great for price !"
        },
        {
            "reviewerName": "Jeff L",
            "rating": "1.0 out of 5 stars",
            "reviewTitle": "Item stopped working within 3 months.",
            "reviewDate": "May 27, 2018",
            "reviewText": "Item stopped working within 3 months. Ground a total of about 2lbs of coffee during that time. I would not buy this item again or recommend it."
        },
        {
            "reviewerName": "greenheart1964",
            "rating": "4.0 out of 5 stars",
            "reviewTitle": "Great grinder",
            "reviewDate": "May 8, 2013",
            "reviewText": "This grinder is easy to use and easy to clean. It has a nice big lid which makes it easy to get the ground coffee from the grinder to the coffee maker. Looks sharp on my counter."
        },
        {
            "reviewerName": "Penelope Pitstop",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Five Stars",
            "reviewDate": "January 6, 2017",
            "reviewText": "Works great!"
        },
        {
            "reviewerName": "LEBII69",
            "rating": "4.0 out of 5 stars",
            "reviewTitle": "Recommended!",
            "reviewDate": "December 2, 2018",
            "reviewText": "Very good seller, very good product. As advertised, very satisfied."
        },
        {
            "reviewerName": "Carrie Koeller",
            "rating": "1.0 out of 5 stars",
            "reviewTitle": "Stopped working after 2 months",
            "reviewDate": "April 28, 2019",
            "reviewText": "Stopped working after 2 months. Disappointing."
        },
        {
            "reviewerName": "rafael",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Good product",
            "reviewDate": "November 28, 2018",
            "reviewText": "Grate and comfortable"
        },
        {
            "reviewerName": "Ron L",
            "rating": "1.0 out of 5 stars",
            "reviewTitle": "Grinder burned up during second use.",
            "reviewDate": "April 6, 2018",
            "reviewText": "During the first full coffee bean grinding the Mr. Coffee grinder got hot and quit. Had I known it has only a one month warranty I would never bought it. Now I can't return it."
        },
        {
            "reviewerName": "eliseo",
            "rating": "1.0 out of 5 stars",
            "reviewTitle": "Trabajo mal",
            "reviewDate": "April 24, 2019",
            "reviewText": "No bueno porque moli pocas semillas y se apago quisiera mi dinero para atras"
        },
        {
            "reviewerName": "Kindle Customer",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Awesome",
            "reviewDate": "March 3, 2017",
            "reviewText": "Use this everyday. Can't live without it!"
        },
        {
            "reviewerName": "Lee Sullivan",
            "rating": "1.0 out of 5 stars",
            "reviewTitle": "stopped working 6 weeks after purchase. There is only ...",
            "reviewDate": "March 14, 2017",
            "reviewText": "stopped working 6 weeks after purchase. There is only a 30 day return policy from amazon so I guess I'm stuck with it."
        },
        {
            "reviewerName": "Jack Dunn",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Five Stars",
            "reviewDate": "December 11, 2016",
            "reviewText": "Super product.."
        },
        {
            "reviewerName": "Shiloh S.",
            "rating": "1.0 out of 5 stars",
            "reviewTitle": "Quit working after first 30 seconds of use.",
            "reviewDate": "November 22, 2018",
            "reviewText": "The first time I took it out of the box.. I used it for about 30 seconds.. And it quit working... Total piece of junk."
        },
        {
            "reviewerName": "chilipepper",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "A very good quality basic coffee grinder",
            "reviewDate": "July 12, 2014",
            "reviewText": "A very good quality basic coffee grinder. I purchased this after my old Mr. Coffee grinder crapped out after about 6-7 years."
        },
        {
            "reviewerName": "Andrew B. Jordan",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Great Value",
            "reviewDate": "September 26, 2018",
            "reviewText": "Quiet, works perfectly."
        },
        {
            "reviewerName": "Chaudhry",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Good one",
            "reviewDate": "September 1, 2018",
            "reviewText": "Bery good product"
        },
        {
            "reviewerName": "Christopher A. DeBruyn",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Five Stars",
            "reviewDate": "November 12, 2018",
            "reviewText": "Works great!"
        },
        {
            "reviewerName": "Heather and Jordan",
            "rating": "4.0 out of 5 stars",
            "reviewTitle": "Four Stars",
            "reviewDate": "May 5, 2016",
            "reviewText": "Not as easy to empty as the older version, but gets the job done"
        },
        {
            "reviewerName": "Smc0401",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Five Stars",
            "reviewDate": "March 12, 2018",
            "reviewText": "Works great, looks nice"
        },
        {
            "reviewerName": "Cassandra",
            "rating": "1.0 out of 5 stars",
            "reviewTitle": "Absolute piece of junk",
            "reviewDate": "April 8, 2019",
            "reviewText": "Broke during the first use."
        },
        {
            "reviewerName": "Marybeth",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "it works",
            "reviewDate": "April 12, 2019",
            "reviewText": "Does the job. Works. would buy again."
        },
        {
            "reviewerName": "Rai",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Five Stars",
            "reviewDate": "March 5, 2018",
            "reviewText": "great"
        },
        {
            "reviewerName": "charles klingler",
            "rating": "1.0 out of 5 stars",
            "reviewTitle": "Busted",
            "reviewDate": "March 13, 2019",
            "reviewText": "Broke in 4 weeks"
        },
        {
            "reviewerName": "Manuel R.",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Excelente producto",
            "reviewDate": "November 11, 2019",
            "reviewText": "hace su trabajo en forma correcta"
        },
        {
            "reviewerName": "Ron S",
            "rating": "4.0 out of 5 stars",
            "reviewTitle": "grinds coffee beans",
            "reviewDate": "March 28, 2015",
            "reviewText": "works very well- I only use it on the weekends but so far after 6 months it has worked perfectly."
        },
        {
            "reviewerName": "Joe K.",
            "rating": "1.0 out of 5 stars",
            "reviewTitle": "Broke right away.",
            "reviewDate": "August 29, 2018",
            "reviewText": "Machine was great for five grinds, stopped working on the sixth. Motor seized."
        },
        {
            "reviewerName": "Andrea Lee",
            "rating": "1.0 out of 5 stars",
            "reviewTitle": "Coffee Grinder Got on Fire and Almost Burned my Hand",
            "reviewDate": "July 10, 2017",
            "reviewText": "It was set on fire last week as I was grinding coffee. It almost burnt my hand."
        },
        {
            "reviewerName": "Amazon Customer",
            "rating": "4.0 out of 5 stars",
            "reviewTitle": "Four Stars",
            "reviewDate": "January 29, 2017",
            "reviewText": "does the job"
        },
        {
            "reviewerName": "dragonfly",
            "rating": "2.0 out of 5 stars",
            "reviewTitle": "Two Stars",
            "reviewDate": "August 4, 2018",
            "reviewText": "It broke after 6 months of use and I only used it for coffee beans. Following the directions."
        },
        {
            "reviewerName": "Katie",
            "rating": "4.0 out of 5 stars",
            "reviewTitle": "Love the Grinder, Watch Out for Coffe Dust",
            "reviewDate": "December 27, 2013",
            "reviewText": "I love this grinder and use it every morning.\nHere are a few tips for how to get the most out of it:\n1] Short pulses instead of holding it down works best\n2] Flip it over to take out the grinds is so much easier then fussing with the blades\n3] Wipe it out everyday!"
        },
        {
            "reviewerName": "Cindy Lyles",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Five Stars",
            "reviewDate": "February 11, 2015",
            "reviewText": "Quick and easy to use. Coffee does taste differently when freshly ground...yum"
        },
        {
            "reviewerName": "Peter Walker",
            "rating": "4.0 out of 5 stars",
            "reviewTitle": "Four Stars",
            "reviewDate": "January 13, 2015",
            "reviewText": "Excellent. I gave 4 stars because of its size. It only grinds 3 cups of coffee at a time"
        },
        {
            "reviewerName": "Amazon Customer",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Good deal for the money",
            "reviewDate": "December 27, 2018",
            "reviewText": "Works as it should."
        },
        {
            "reviewerName": "Olivia Wolf",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Five Stars",
            "reviewDate": "April 12, 2017",
            "reviewText": "It works!!"
        },
        {
            "reviewerName": "Maggie's Mom",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Gr-r-r-r-i-n-d!",
            "reviewDate": "March 5, 2014",
            "reviewText": "I love my grinder and have used it daily since its purchase for my morning coffee. Who doesn't love the Mr. Coffee brand?"
        },
        {
            "reviewerName": "Justin",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Good product.",
            "reviewDate": "July 12, 2018",
            "reviewText": "This is a good grinder. I use it for cocoa beans and it does the job very well."
        },
        {
            "reviewerName": "WP",
            "rating": "4.0 out of 5 stars",
            "reviewTitle": "Does its job",
            "reviewDate": "May 5, 2016",
            "reviewText": "Does its job"
        },
        {
            "reviewerName": "SBNGME",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Great shopping experience",
            "reviewDate": "November 25, 2018",
            "reviewText": "Just as described"
        },
        {
            "reviewerName": "Robert long III",
            "rating": "4.0 out of 5 stars",
            "reviewTitle": "Received >it in a timely fashion.",
            "reviewDate": "March 22, 2019",
            "reviewText": "Does what it's built to do!"
        },
        {
            "reviewerName": "Brittany",
            "rating": "1.0 out of 5 stars",
            "reviewTitle": "Broke after TWO DAYS",
            "reviewDate": "September 3, 2018",
            "reviewText": "The motor stopped working on it after TWO DAYS of using it."
        },
        {
            "reviewerName": "littlelyralover",
            "rating": "4.0 out of 5 stars",
            "reviewTitle": "Motor overheats, smells like burnt plastic.",
            "reviewDate": "June 6, 2013",
            "reviewText": "We use this daily. It worked perfectly first few months, and still does. But the motor can get too hot and smells like burnt plastic. Also makes coffee taste like burnt plastic. We have to clean it out thoroughly before use to get rid of the smell, and use very lightly to prevent overheating. Good for the price, but I'd probably get a different one next time."
        },
        {
            "reviewerName": "Doug F.",
            "rating": "4.0 out of 5 stars",
            "reviewTitle": "Four Stars",
            "reviewDate": "November 4, 2015",
            "reviewText": "Very good purchase - well pleased"
        },
        {
            "reviewerName": "Amazon Customer",
            "rating": "1.0 out of 5 stars",
            "reviewTitle": "One Star",
            "reviewDate": "February 27, 2018",
            "reviewText": "Died after two uses."
        },
        {
            "reviewerName": "Kendall Thomas",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Five Stars",
            "reviewDate": "January 11, 2017",
            "reviewText": "Use it everyday!"
        },
        {
            "reviewerName": "Hawaii 5-0",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Great Grinder",
            "reviewDate": "July 5, 2016",
            "reviewText": "I had one of these for years, but recently left it at our vacation home. Bought another brand here on Amazon with a retractable cord, used it for a week, then gave it away and ordered this Mr. Coffee grinder. It is powerful and grinds the coffee very well (the other one left large chunks of the beans unground). If this little machine had a retractable cord, it would be the perfect grinder. To clean it, I just use a damp paper towel."
        },
        {
            "reviewerName": "Dena Kronfeld",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "I like it!",
            "reviewDate": "April 28, 2017",
            "reviewText": "Fairly quiet motor, easy to clean, and grinds really well!"
        },
        {
            "reviewerName": "Reviewman",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "perfect",
            "reviewDate": "December 30, 2015",
            "reviewText": "perfect grind ! count to 10"
        },
        {
            "reviewerName": "Amazon Customer",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Five Stars",
            "reviewDate": "February 16, 2017",
            "reviewText": "Perfect gift"
        },
        {
            "reviewerName": "Mario Vet Guitar.",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Five Stars",
            "reviewDate": "July 24, 2014",
            "reviewText": "Perfect for home use, well made and no issues, working perfect. Thank's."
        },
        {
            "reviewerName": "K Grasher",
            "rating": "2.0 out of 5 stars",
            "reviewTitle": "not great at grinding",
            "reviewDate": "August 4, 2015",
            "reviewText": "Hard to clean, not great at grinding."
        },
        {
            "reviewerName": "Amazon Customer",
            "rating": "4.0 out of 5 stars",
            "reviewTitle": "Inexpensive; easy to use",
            "reviewDate": "April 17, 2013",
            "reviewText": "It grinds quickly and is designed well. It is attractive and easy to clean. It takes about 9 seconds to do its job."
        },
        {
            "reviewerName": "Amazon Customer",
            "rating": "1.0 out of 5 stars",
            "reviewTitle": "Will break after two uses",
            "reviewDate": "September 29, 2018",
            "reviewText": "Leaves a mess and motor burned up after the third time to use."
        },
        {
            "reviewerName": "GWE",
            "rating": "4.0 out of 5 stars",
            "reviewTitle": "Does the job",
            "reviewDate": "March 24, 2013",
            "reviewText": "No problems with it, grinds in 10 seconds! The cover and casing are very thin plastic. Hopefully it won't fall apart later."
        },
        {
            "reviewerName": "Edward Cox",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Awesome flax seed grinder",
            "reviewDate": "March 27, 2016",
            "reviewText": "I use this grinder to grind up my flax seed for my morning smoothie. Works great for what I bought it for"
        },
        {
            "reviewerName": "R. E. MCCOY",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Glad to find this one",
            "reviewDate": "March 18, 2018",
            "reviewText": "Had one before. Used it until it didn't work anymore.Glad to find this one."
        },
        {
            "reviewerName": "Ernie Cataloni",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Great",
            "reviewDate": "January 7, 2019",
            "reviewText": "Love it"
        },
        {
            "reviewerName": "Katelyn",
            "rating": "1.0 out of 5 stars",
            "reviewTitle": "Not reliable",
            "reviewDate": "November 25, 2018",
            "reviewText": "Used it twice and it burnt out. Bad product."
        },
        {
            "reviewerName": "Kevin K.",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Great Value",
            "reviewDate": "June 26, 2016",
            "reviewText": "Great Value. Does the job and the power cord is a good length. I have only used it for coffee beans."
        },
        {
            "reviewerName": "Steven C.",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Good value",
            "reviewDate": "February 4, 2019",
            "reviewText": "Can't say there is anything I dislike."
        },
        {
            "reviewerName": "Amazon Customer",
            "rating": "3.0 out of 5 stars",
            "reviewTitle": "Three stars",
            "reviewDate": "January 11, 2017",
            "reviewText": "Not bad, but wish the body is detachable to make it easier to clean."
        },
        {
            "reviewerName": "Rebecca Ellis",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Five Stars",
            "reviewDate": "April 13, 2017",
            "reviewText": "good price! working well ;)love it"
        },
        {
            "reviewerName": "Jaime",
            "rating": "2.0 out of 5 stars",
            "reviewTitle": "I wouldn't recommend this product to somebody that cherishes a well rounded ...",
            "reviewDate": "March 20, 2017",
            "reviewText": "It works as intended 1 speed. I wouldn't recommend this product to somebody that cherishes a well rounded course-ness."
        },
        {
            "reviewerName": "AnSu",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Works great",
            "reviewDate": "July 21, 2017",
            "reviewText": "Gets my coffee ground to the right size and is fast. I do wish the item was battery operated and didn't have a plug-in but oh well. It works conveniently for me."
        },
        {
            "reviewerName": "Paul J. Cherry",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Run time is accurate.",
            "reviewDate": "September 8, 2018",
            "reviewText": "Grinds the beans perfectly"
        },
        {
            "reviewerName": "BARUCH DANINO",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Small coffee grinder",
            "reviewDate": "September 18, 2018",
            "reviewText": "Good for only small amount of coffee"
        },
        {
            "reviewerName": "Jessica Petty",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Five Stars",
            "reviewDate": "April 1, 2015",
            "reviewText": "Great product. Very quite while grinding and efficient."
        },
        {
            "reviewerName": "Christelle",
            "rating": "1.0 out of 5 stars",
            "reviewTitle": "One Star",
            "reviewDate": "May 18, 2018",
            "reviewText": "Stopped working after first use."
        },
        {
            "reviewerName": "Wayne D Allen",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Five Stars",
            "reviewDate": "May 31, 2015",
            "reviewText": "Does the job."
        },
        {
            "reviewerName": "Hetal Patel",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Good product for the value",
            "reviewDate": "February 19, 2019",
            "reviewText": "Love it"
        },
        {
            "reviewerName": "Joseph Kovar III",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Does the job",
            "reviewDate": "December 13, 2010",
            "reviewText": "Does the job. Takes a little while to get used to how long to grind the beans, it's perfectly capable of turning beans into a cocoa like powder if given enough time."
        },
        {
            "reviewerName": "Sabeth Miller",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Easy to use",
            "reviewDate": "January 24, 2019",
            "reviewText": "Great"
        },
        {
            "reviewerName": "Lesley Nash",
            "rating": "4.0 out of 5 stars",
            "reviewTitle": "Four Stars",
            "reviewDate": "December 15, 2016",
            "reviewText": "Works great. Very loud in the morning in a small house."
        },
        {
            "reviewerName": "Amazon Customer",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Small",
            "reviewDate": "November 7, 2018",
            "reviewText": "Nice"
        },
        {
            "reviewerName": "Brent",
            "rating": "4.0 out of 5 stars",
            "reviewTitle": "Great Buy",
            "reviewDate": "June 23, 2018",
            "reviewText": "Works as advertised!"
        },
        {
            "reviewerName": "Amazon Customer",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Mix",
            "reviewDate": "September 28, 2018",
            "reviewText": "Very easy"
        },
        {
            "reviewerName": "Amazon Customer",
            "rating": "1.0 out of 5 stars",
            "reviewTitle": "Poor quality- shattered with first use!",
            "reviewDate": "February 12, 2017",
            "reviewText": "This was a gift I purchased for my husband for Christmas. We use our Keurig normally but I thought this would be something different to try out for a weekend off where he might drink a few cups at a time. He pulled it out this evening to try out and here it completely SHATTERED. Now I went to request a refund and we missed the refund window. This is really frustrating and must be a very cheaply made item. I feel we've been ripped off."
        },
        {
            "reviewerName": "S. B.",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "a 10",
            "reviewDate": "October 26, 2016",
            "reviewText": "Works super great"
        },
        {
            "reviewerName": "Angel Solomon",
            "rating": "4.0 out of 5 stars",
            "reviewTitle": "coffee grinder",
            "reviewDate": "July 28, 2013",
            "reviewText": "Works well for crushing seeds as well. I use it for my nutrabullet. Saves the blades and easy to clean."
        },
        {
            "reviewerName": "Dennis S Parteka",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Five Stars",
            "reviewDate": "August 19, 2015",
            "reviewText": "Nice product"
        },
        {
            "reviewerName": "FAITH",
            "rating": "4.0 out of 5 stars",
            "reviewTitle": "Every day ok",
            "reviewDate": "June 1, 2013",
            "reviewText": "OK to make powders of chia and flax seeds, as well as coffee. Does seeds ok but not make a fine powder. A little effort to clean but under the blades takes more creative effort. I quit grinding when it gets hot after steady 15-20 minute use, let it cool a few minutes, then finish. Flax seed oily so I stir build up off the sides and blend more. I tilt it while grinding to mix and reach more to grind finer. It is very easy to use."
        },
        {
            "reviewerName": "Amazon Customer",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Five Stars",
            "reviewDate": "March 25, 2018",
            "reviewText": "Great coffee grinder! Exceeded my expectations for the price."
        },
        {
            "reviewerName": "Amazon Customer",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Five Stars",
            "reviewDate": "May 5, 2016",
            "reviewText": "great"
        },
        {
            "reviewerName": "Michael O. Adams",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "long lasting",
            "reviewDate": "June 24, 2010",
            "reviewText": "My wife uses this to grind spices and herbs and it does not burn out even witn a lot of extensive use."
        },
        {
            "reviewerName": "ncdweller",
            "rating": "4.0 out of 5 stars",
            "reviewTitle": "Grinds very well",
            "reviewDate": "November 16, 2012",
            "reviewText": "This grinder works great but you it isn't the easiest machine to clean. I would recommend this grinder to all."
        },
        {
            "reviewerName": "Elizabeth",
            "rating": "1.0 out of 5 stars",
            "reviewTitle": "Cheap!",
            "reviewDate": "March 11, 2013",
            "reviewText": "This is a great grinder! That is, until it breaks.... One week into using it, the motor was completely blown. It just stopped working. I Couldn't feel more ripped off!"
        },
        {
            "reviewerName": "Kim Pugh",
            "rating": "1.0 out of 5 stars",
            "reviewTitle": "quit working < 3 months",
            "reviewDate": "March 31, 2018",
            "reviewText": "Product quit working prior to using for 3 months."
        },
        {
            "reviewerName": "Jack",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "It grinds beans.",
            "reviewDate": "May 28, 2013",
            "reviewText": "Do you have beans you need to ground? Are they coffee beans? Great! Buy this grinder. It's simple and it will grind your beans in 5 seconds. Done."
        },
        {
            "reviewerName": "Jerry Osborne",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Works Exactly Like a Coffee Grinder",
            "reviewDate": "October 23, 2016",
            "reviewText": "This is a coffee grinder. IT works exactly like a coffee grinder. Except when you use it as a spice grinder. Then it acts exactly like a coffee grinder except that you get ground spices instead of ground coffee."
        },
        {
            "reviewerName": "Mike",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Five Stars",
            "reviewDate": "March 16, 2018",
            "reviewText": "Works well. And it's not noisy. :-)"
        },
        {
            "reviewerName": "Thomas Minnicks",
            "rating": "4.0 out of 5 stars",
            "reviewTitle": "Easy cleanup.",
            "reviewDate": "January 29, 2018",
            "reviewText": "Grind beans fast. Easy cleanup."
        },
        {
            "reviewerName": "Alexis Marzullo",
            "rating": "1.0 out of 5 stars",
            "reviewTitle": "DO NOT WASTE YOUR MONEY!",
            "reviewDate": "March 21, 2018",
            "reviewText": "BROKE AFTER 2 MONTHS & ONLY 5 USES!"
        },
        {
            "reviewerName": "Riley",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Five Stars",
            "reviewDate": "March 1, 2017",
            "reviewText": "Great grinder for the money that you pay. Great deal glad I got it."
        },
        {
            "reviewerName": "Derek O",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Not just good for coffee beans",
            "reviewDate": "January 28, 2016",
            "reviewText": "I use for grinding up joint rolling material...it works great!"
        },
        {
            "reviewerName": "slr",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Five Stars",
            "reviewDate": "May 9, 2015",
            "reviewText": "Excellent grinder for the price."
        },
        {
            "reviewerName": "Jennifer Roche",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Five Stars",
            "reviewDate": "September 10, 2014",
            "reviewText": "Even use it to grind up rice to make rice cereal for my little one."
        },
        {
            "reviewerName": "Michael McCoy",
            "rating": "4.0 out of 5 stars",
            "reviewTitle": "Four Stars",
            "reviewDate": "February 15, 2016",
            "reviewText": "Works well but I wish it could hold more beans"
        },
        {
            "reviewerName": "John Cotter",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Excellent",
            "reviewDate": "July 27, 2013",
            "reviewText": "I have used a Mr. Coffee Grinder for my coffee needs since I started drinking coffee, This particular grinder is fast and easy to clean."
        },
        {
            "reviewerName": "Amazon Customer",
            "rating": "3.0 out of 5 stars",
            "reviewTitle": "You get what you pay for",
            "reviewDate": "October 18, 2016",
            "reviewText": "For the price it is what it is.\n\nPros: Relatively cheap compared to other versions. Grinds coffee adequately and is nice that you can grind as long or as little as you want to to obtain whatever size coffee grind you want.\n\nCons: The design where you have to essentially turn it upside down to get the coffee out (back into the lid to then pour out) is a tad inconvenient and in my opinion poorly designed. Because the coffee sits where it is ground sometimes you get inconsistent grind (especially when you put a larger quantity of beans in). You end up with some very small finely ground coffee and an occasional large chunk of coffee bean."
        },
        {
            "reviewerName": "stgycor",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Simple, reliable coffee grinder",
            "reviewDate": "November 2, 2010",
            "reviewText": "I purchased this one to replace a nearly identical one from Mr. Coffee that we broke the switch blade on. Love it. After grinding, we just invert the grinder and dump the contents into the top to transfer to the coffee filter. It's small, reliable, and never fails."
        },
        {
            "reviewerName": "Karen",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Five Stars",
            "reviewDate": "January 8, 2017",
            "reviewText": "Works great!"
        },
        {
            "reviewerName": "mark greg momb",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Five Stars",
            "reviewDate": "February 21, 2018",
            "reviewText": "great price and works very well"
        },
        {
            "reviewerName": "Emily Jo",
            "rating": "1.0 out of 5 stars",
            "reviewTitle": "Does NOT work!",
            "reviewDate": "September 28, 2016",
            "reviewText": "Won't work after only a few weeks of having it. Amazon won't post my review. Good to know. Don't waste your money."
        },
        {
            "reviewerName": "dano",
            "rating": "4.0 out of 5 stars",
            "reviewTitle": "very nice unit",
            "reviewDate": "September 15, 2012",
            "reviewText": "a few things about this grinder....price is great,,,,works great,,its QUIET,,,,,and has a long cord so you can drag it around the counter ...if it had a bigger grinding capacity it would get 5+ stars,,,,for the money,,,outstanding unit,,,,did i mention quiet..!!!!!"
        },
        {
            "reviewerName": "Mairad Swyney",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Nothing grinds my beans quite like Mr. Coffee IDS57-4 Coffee Grinder",
            "reviewDate": "October 7, 2016",
            "reviewText": "Nothing grinds my beans quite like Mr. Coffee IDS57-4 Coffee Grinder, Black ... by Mr. Coffee. Mostly I just like that it's called Mr. Coffee. It's cute and quite space efficient and minimal. It can be difficult to know how fine your grind is getting, but if you're less of a perfectionist and more of a just-give-me-my-goddamn-morning-coffee-I-am-a-caffeine-addict, this should work absolutely fine for you."
        },
        {
            "reviewerName": "vex snyder",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "I recommend it!",
            "reviewDate": "August 6, 2016",
            "reviewText": "Does the job, I recommend it!"
        },
        {
            "reviewerName": "Lenka",
            "rating": "1.0 out of 5 stars",
            "reviewTitle": "One Star",
            "reviewDate": "December 17, 2014",
            "reviewText": "Broke after third use."
        },
        {
            "reviewerName": "Amazon Customer",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "great pruduct!",
            "reviewDate": "June 14, 2013",
            "reviewText": "such an awesome product! So easy to use, easy to clean. Love waking up to the kitchen smelling like freshly ground coffee!"
        },
        {
            "reviewerName": "Orville A.",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Bought this to grind peppers and it works great! It takes seconds to grind into powder",
            "reviewDate": "October 21, 2015",
            "reviewText": "Bought this to grind peppers and it works great! It takes seconds to grind into powder! I love it and highly recommend it"
        },
        {
            "reviewerName": "jasman",
            "rating": "4.0 out of 5 stars",
            "reviewTitle": "Four Stars",
            "reviewDate": "June 4, 2016",
            "reviewText": "Works perfectly"
        },
        {
            "reviewerName": "JJ",
            "rating": "4.0 out of 5 stars",
            "reviewTitle": "Good grinder for the money....",
            "reviewDate": "December 12, 2016",
            "reviewText": "Grinds up beans just fine. I've used and abused this thing for a little while now and I haven't run into any real problems. My only complaint thus far is that the resulting powder sometimes gets between the top cover and the bottom portion so when you remove the top cover you may get some minor spillage. It's nothing major it's just a slight annoyance."
        },
        {
            "reviewerName": "1Rodbuster",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Get a BETTER GRIND",
            "reviewDate": "February 4, 2017",
            "reviewText": "Helps me make FRESH COFFEE FAST daily. Dependable!"
        },
        {
            "reviewerName": "sitwat",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Five Stars",
            "reviewDate": "June 12, 2015",
            "reviewText": "excellent performance"
        },
        {
            "reviewerName": "JUAN CASTILLO",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Five Stars",
            "reviewDate": "December 8, 2016",
            "reviewText": "Great buy!"
        },
        {
            "reviewerName": "Jessica Fox",
            "rating": "4.0 out of 5 stars",
            "reviewTitle": "A pretty good low cost coffee grinder.",
            "reviewDate": "December 10, 2013",
            "reviewText": "I like it because it does what it's supposed to do. One thing I'd like more about any coffee grinder would be if they could be taken apart for cleaning."
        },
        {
            "reviewerName": "Jungler",
            "rating": "4.0 out of 5 stars",
            "reviewTitle": "Price can be lower.",
            "reviewDate": "July 15, 2016",
            "reviewText": "Not such a good price"
        },
        {
            "reviewerName": "Sandchelle",
            "rating": "1.0 out of 5 stars",
            "reviewTitle": "Will not last",
            "reviewDate": "February 10, 2017",
            "reviewText": "This coffee grinder works fine until it dies. This was my fifth replacement, the first four quit working after 2-5 uses. The fifth one lasted 1.5 months. I am very disappointed in this product, what a waste of money."
        },
        {
            "reviewerName": "paul gillespie",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Five Stars",
            "reviewDate": "May 13, 2016",
            "reviewText": "I tried them all and this was the absolute best and most reliable"
        },
        {
            "reviewerName": "Blake Gaines",
            "rating": "3.0 out of 5 stars",
            "reviewTitle": "Its works great. Not beautiful but inexpensive",
            "reviewDate": "May 10, 2013",
            "reviewText": "Good if you don't care what it looks like. I don't really leave it out so it is perfect for me."
        },
        {
            "reviewerName": "TheOne",
            "rating": "4.0 out of 5 stars",
            "reviewTitle": "Works good.",
            "reviewDate": "June 20, 2013",
            "reviewText": "This is value for money. Works pretty good and gives you enough ground coffee for a cup every morning. Hope it was easy to clean as well."
        },
        {
            "reviewerName": "Noel Buller",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Five Stars",
            "reviewDate": "November 14, 2016",
            "reviewText": "Works great!"
        },
        {
            "reviewerName": "Angel Smith",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Great Product",
            "reviewDate": "February 16, 2013",
            "reviewText": "Use for everyday use with ease. Love that it gives my coffee such a find grind and that it takes up little room."
        },
        {
            "reviewerName": "Amazon Customer",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Great buy",
            "reviewDate": "February 1, 2016",
            "reviewText": "So far thus grinder is working out very well."
        },
        {
            "reviewerName": "Crystal",
            "rating": "4.0 out of 5 stars",
            "reviewTitle": "Works well",
            "reviewDate": "March 18, 2013",
            "reviewText": "I have had this for a few days and it works well. It is not very loud at all. It does not make all the grinds the same size but close enough for me. Good for the price!"
        },
        {
            "reviewerName": "Nomad",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Bought this after my old one died after many years ...",
            "reviewDate": "November 28, 2016",
            "reviewText": "Bought this after my old one died after many years of use. Have used for a few months and it is still holding up well. It's about as loud as the one I had previously. The sound can be a bit much to deal with before coffee, but it's about the same with any coffee grinder."
        },
        {
            "reviewerName": "Cierra Kozlowski",
            "rating": "4.0 out of 5 stars",
            "reviewTitle": "Four Stars",
            "reviewDate": "March 14, 2015",
            "reviewText": "Works just fine. A little loud... but it's a grinder."
        },
        {
            "reviewerName": "Sean McConnell",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Five Stars",
            "reviewDate": "December 17, 2015",
            "reviewText": "Great grinder, fantastic capacity, good buy!"
        },
        {
            "reviewerName": "billy bob joe",
            "rating": "4.0 out of 5 stars",
            "reviewTitle": "Four Stars",
            "reviewDate": "March 11, 2015",
            "reviewText": "Good deal."
        },
        {
            "reviewerName": "Johnny TT",
            "rating": "1.0 out of 5 stars",
            "reviewTitle": "Broken after the first time of use.",
            "reviewDate": "January 2, 2015",
            "reviewText": "Broken after the first time of use. Can't believe this is such a named brand."
        },
        {
            "reviewerName": "J. Tubb",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Makes a great homemade calcium citrate",
            "reviewDate": "November 4, 2016",
            "reviewText": "No complaints, I use mine for grinding black seeds and chicken egg shells for a homemade calcium citrate. Grind dry, sterile egg shells to a powder, add teaspoon powder to a glass, squeeze 1/2 lemon in, mix well, let bubble up, stir, let stand 3-4 hours. Stir again, drink, chase grit with water. Makes a great homemade calcium citrate."
        },
        {
            "reviewerName": "Scott",
            "rating": "1.0 out of 5 stars",
            "reviewTitle": "Started smoking after 6 weeks of use",
            "reviewDate": "July 12, 2017",
            "reviewText": "This worked great for 6 weeks. It was used in a classroom so it probably ran about 10 times a day, 4 days a week. After 6 weeks, it smelled funny when it ran and started smoking. Would recommend investing in a better grinder."
        },
        {
            "reviewerName": "Trumpet vine",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Five Stars",
            "reviewDate": "October 1, 2014",
            "reviewText": "Works well."
        },
        {
            "reviewerName": "forewardleaning",
            "rating": "1.0 out of 5 stars",
            "reviewTitle": "don;t buy did not last 4 months",
            "reviewDate": "August 3, 2016",
            "reviewText": "This grinder is broken and thats not acceptable, that, it can not be returned\nI bought this grinder less than 4 months ago, of which 7 weeks i was out of country\nand unable to use it .My last Mr coffee grinder was Identical to this one, at least appearance wise\nand survived 14 yrs and was still running perfect when I replaced it with this facade of a coffee grinder .\nI don't think any manufacturer or Amazon should be able to sell a machine that fails so soon."
        },
        {
            "reviewerName": "Jessica Bourne",
            "rating": "1.0 out of 5 stars",
            "reviewTitle": "Super bummed. I can't not recommend this brand enough",
            "reviewDate": "May 18, 2017",
            "reviewText": "Bought it on March 17th. Used it about 7 times. Died on May 13th. It just stopped working. RIP Mr. Coffee. Super bummed. I can't not recommend this brand enough."
        },
        {
            "reviewerName": "Kenneth S. Lambert",
            "rating": "3.0 out of 5 stars",
            "reviewTitle": "It works fine - rather pay more for a less messy grinder",
            "reviewDate": "January 12, 2017",
            "reviewText": "My previous grinder - got grinds all over the counter. Same here. It works fine - rather pay more for a less messy grinder. Overall, happy - just wanted an upgrade from my previous - not so much."
        },
        {
            "reviewerName": "Mehret",
            "rating": "1.0 out of 5 stars",
            "reviewTitle": "Not working",
            "reviewDate": "January 4, 2014",
            "reviewText": "It doesn't work at all when I put coffe and I push it blend it it doesn't work so that's why I returned it"
        },
        {
            "reviewerName": "sapper",
            "rating": "2.0 out of 5 stars",
            "reviewTitle": "Unremovable grinding chamber",
            "reviewDate": "January 14, 2017",
            "reviewText": "Not happy because the grinder chamber is not removable."
        },
        {
            "reviewerName": "Wayne",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Five Stars",
            "reviewDate": "November 1, 2016",
            "reviewText": "This little grinder work's great at a good price."
        },
        {
            "reviewerName": "Venus Hinnant Willins",
            "rating": "2.0 out of 5 stars",
            "reviewTitle": "Dissapointed....",
            "reviewDate": "June 20, 2013",
            "reviewText": "It stopped working after the 2nd use, I really believe that it's just a malfuntion with mine, i use this product all the time, I would like a replaceament?? it still looks brand new in the box.."
        },
        {
            "reviewerName": "G Boettcher",
            "rating": "2.0 out of 5 stars",
            "reviewTitle": "Smaller than I thought",
            "reviewDate": "September 6, 2016",
            "reviewText": "The manual states this will grind up to 11 tablespoons of beans to make 12 cups of coffee. The bean container doesn't hold more than 6 tablespoons."
        },
        {
            "reviewerName": "edry jimenez",
            "rating": "1.0 out of 5 stars",
            "reviewTitle": "Didn't last a month!",
            "reviewDate": "August 21, 2018",
            "reviewText": "Worked great the first 2 times we used it and then it just stopped working. Didn't even last a month. We literally used it once a week and it stopped working. I'm not happy with this product at all."
        },
        {
            "reviewerName": "Neat",
            "rating": "1.0 out of 5 stars",
            "reviewTitle": "worthless",
            "reviewDate": "February 22, 2016",
            "reviewText": "Broke the second time I used it. Can't even return it. Dumb."
        },
        {
            "reviewerName": "Justin",
            "rating": "1.0 out of 5 stars",
            "reviewTitle": "Awful product",
            "reviewDate": "July 14, 2013",
            "reviewText": "Motor burnt out after 3 uses. It was a ten dollar item, so I didn't bother sending it back. Junk."
        },
        {
            "reviewerName": "Diane Freaney",
            "rating": "1.0 out of 5 stars",
            "reviewTitle": "Can Not Recommend Mr. Coffee Grinder",
            "reviewDate": "March 11, 2017",
            "reviewText": "The grinder uses electricity which means I have to find a place to plug in and risk breaker failure to get a cup of coffee. I just ground up what I thought was enough coffee for one cup. My coffee was weak, coffee was all over the counter and the coffee grinder was difficult to clean. I looked for a Manual on Amazon and also online but found none. I thought perhaps I was \"doing it wrong\" and reading the manual would help.\n\nFor the future, I will be purchasing beans at New Season's grocery store or my local coop and using their grinder to grind a week's worth of coffee at a time.\n\nI will be putting this coffee grinder in the \"free\" box with a copy of this review."
        },
        {
            "reviewerName": "Frogger",
            "rating": "1.0 out of 5 stars",
            "reviewTitle": "Doesn't last.",
            "reviewDate": "January 12, 2018",
            "reviewText": "Was great while it worked. Stopped working the 4th time I used it."
        },
        {
            "reviewerName": "Don D. Basina",
            "rating": "4.0 out of 5 stars",
            "reviewTitle": "The only way to enjoy home brewed coffee!",
            "reviewDate": "May 12, 2005",
            "reviewText": "It has been about six months since I started grinding my own coffee beans with this Mr. Coffee grinder. I usually use it three times a week. And my Mr. Coffee grinder is still going strong.\n\nOf course, I read all of the instructions before attempting to use. (Like everyone one does right?) The instructions state in big bold letters to use only for grinding coffee beans. This grinder should not be used as a nut grinder or any other food items. There could be some cross contamination of flavors. \"Good idea!\" I said. But. What if I wanted some nut flavor with my coffee? Hint: If you did grind another food source, put in some bread pieces and grind. The food particles should be picked up with the bread. It is now back to its original state.\n\nThe grinders size is perfect for up to a 12-cup coffee maker. I always fill my 12-cup coffee pot, so I wanted to know how much whole beans to use. So once again I found this from the instructions. Six tablespoons. This is the maximum holding capacity for this grinder. Perfect.\n\nConsistency ground size comes next. Yes after nine seconds the size should be perfect for my automatic drip coffee maker. And it was. Any longer than that the grounds would become powder, which is good for espresso and coffee in your cup. Some people like that so that would work for them.\n\nA safety switch will automatically shut off when not in use. That is a nice feature for the safety conscience. When done grinding your beans, turn the unit over, tap a couple times, and \"Walla\" a pouring device. Pour right into your coffee filter. Turn on coffee machine and now you have time to clean out the grinder.\n\nThe grinder needs to be cleaned after each use to keep it in tiptop shape. And have a longer shelf life. One drawback is that some powder sticks to the bottom of the grinder. I just get a paper towel and wipe it out. Presto, cleaned until next time.\n\nGrinding coffee beans at home gives the freshest coffee I can get at home!"
        },
        {
            "reviewerName": "AllenatHome",
            "rating": "1.0 out of 5 stars",
            "reviewTitle": "Does not Last Long",
            "reviewDate": "January 28, 2018",
            "reviewText": "Piece of Junk. Save your money. Lasted a few months, and poof."
        },
        {
            "reviewerName": "T. Miller",
            "rating": "3.0 out of 5 stars",
            "reviewTitle": "Inconsistent",
            "reviewDate": "January 23, 2016",
            "reviewText": "Got this at HEB for $15. My opinion about it is mixed. It seems to work well when you do medium-fine to fine grinding but when you try to do more course grinds the results is half of the beans are in chunks and the other half is medium. So the grinding is very inconsistent and tricky with the larger grinds. I think I would have rather bought a hand grinder or something that produces an even result. Using bread to clean the unit works well. (Smarty pants whoever thought of doing that.) I've forgetten to unplug it before when flipping the unit over to put the grinds into the cup. It will scare you if you hit the power button. The unit is small so it can sit on your counter top not taking up too much space. If you are on the edge about this unit, i'd say look elsewhere, for something that you can set a dial to produce a texture and get that texture. I use this to grind beans for drip coffee."
        },
        {
            "reviewerName": "BrandyB",
            "rating": "4.0 out of 5 stars",
            "reviewTitle": "Good for grinding spices, but hard to clean!",
            "reviewDate": "March 26, 2006",
            "reviewText": "I asked for a spice grinder for Christmas, and recieved this. I was a little wary of it at first, but it has worked well grinding spices and dried herbs so far (I have never used it to grind coffee). I have only used it several times, so I don't know how durable it is. I was concerned that the plastic would absorb the odors of the spices, but I store it without the clear lid to air it out, and that seems to work. My only complaint with it is that it is a pain to clean! The lid is easily washed by hand, but the grinder cannot be immersed in water, so it's a bit difficult. I have ended up using my fingers to wipe most of the spice residue out, and then I use a damp paper towel to get the rest. Thankfully there aren't TOO many crevices. So if it were easier to clean, or if you could at least remove the blade to clean it, then I would give it five stars.\nUPDATE 12/2/06: This is great for grinding small amounts of flax seeds as well. Much more fresh that way than buying preground seeds. Also good for grinding oats for oat flour when a recipe calls for small amounts."
        },
        {
            "reviewerName": "Aviva",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Awesome and works as described!",
            "reviewDate": "July 28, 2018",
            "reviewText": "This grinder is awesome! My preference is to only push the button a few times for a second, but I'm sure you could grind however you like your beans."
        },
        {
            "reviewerName": "Sunny",
            "rating": "4.0 out of 5 stars",
            "reviewTitle": "Good One",
            "reviewDate": "March 27, 2019",
            "reviewText": "Decent product. Very small in size. Need to run multiple times since quantity inn is very less."
        },
        {
            "reviewerName": "Scooter",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Grinds egg shells",
            "reviewDate": "December 26, 2018",
            "reviewText": "I use this to grind dried egg shells to make pet food. It does a great job of it!"
        },
        {
            "reviewerName": "PSUGrammy",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Perfect Grinder - I have two",
            "reviewDate": "December 10, 2010",
            "reviewText": "I have had two of these coffee grinders for more years than I can count, although I think it is at least ten. Mine were purchased prior to black being a popular kitchen color. One is used for grinding coffee, the other flax seeds, etc.(this one was really purchased as a back-up in case the first one \"died\" one morning). So far they are both working perfectly. I can't imagine spending more for a coffee grinder - these are very sturdy and do a superb job of grinding the beans. I use it every morning and sometimes again in the evening. Everyone loves my coffee, but we will give credit to the freshly ground beans, not the grinder!"
        },
        {
            "reviewerName": "Hannah Schurr",
            "rating": "1.0 out of 5 stars",
            "reviewTitle": "Quit working after just 2 weeks!",
            "reviewDate": "April 1, 2018",
            "reviewText": "Poor quality grind AND only lasted a coupled weeks! I wouldn't recommend this product to anyone. My husband has a Mr. Coffee coffeemaker, which he loves, so we were really bummed that this grinder stopped functioning after only 2 weeks of use. Maybe ours was a \"lemon\", but it's safer to spend your money on another grinder!"
        },
        {
            "reviewerName": "Joe Madden",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Years of use!",
            "reviewDate": "March 26, 2014",
            "reviewText": "We have had this grinder so long i can't remember how many years it has been. We have ground nuts, coffee, chocolate, and other things and the grinder continues to work just great. It is big enough to grind and flip upside down getting the grounds into the lid to then dump them. The Krups we use at work doesn't hold all the coffee and tends to spill out, plus after a year the button is stuck down. Unfortunately, I dropped our Mr. Coffe on the floor and broke the button. So, we are now ordering a new one and hope it lasts just as long as the first."
        },
        {
            "reviewerName": "John Kranig",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Love my grinder",
            "reviewDate": "September 14, 2016",
            "reviewText": "I have an older model. I've had it for 10+ years. FABULOUS grinder. Had to buy another brand for camping because I forgot mine. Don't like it. And it cost more. Mr. Coffee makes a great grinder. Highly recommend. I use mine every day. I only grind when I make a cup. No better coffee than fresh ground. There is a difference. I love my Mr. Coffee grinder."
        },
        {
            "reviewerName": "Leon",
            "rating": "1.0 out of 5 stars",
            "reviewTitle": "A piece of JUNK!!!!!",
            "reviewDate": "December 12, 2015",
            "reviewText": "Item died after two months of regular/moderate daily use, just flaxseed only. It looks like the engine got burnt out. Horrible experience.I hate this little thing."
        },
        {
            "reviewerName": "D. Tilghman",
            "rating": "1.0 out of 5 stars",
            "reviewTitle": "Another burn out here...",
            "reviewDate": "January 6, 2016",
            "reviewText": "Grinder started seizing for some reason (was full but not that full), then completely burned out on me. This was the third time I have ever used it, and I'd run it \"pulsing\" for maybe 30-60 seconds?\n\nTotal piece of cr@$, definitely not the quality product our parents had. So sad..."
        },
        {
            "reviewerName": "Jan Buckland Reynolds",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Works great, easy to clean.",
            "reviewDate": "November 5, 2018",
            "reviewText": "Mr Coffee products work well, I trust the name."
        },
        {
            "reviewerName": "amily",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Good quality.",
            "reviewDate": "January 4, 2017",
            "reviewText": "Does the job. Good quality."
        },
        {
            "reviewerName": "AnneMaj21",
            "rating": "4.0 out of 5 stars",
            "reviewTitle": "I like it!",
            "reviewDate": "October 27, 2015",
            "reviewText": "This is a good coffee grinder, gets the job done, easy to use and it's sturdy."
        },
        {
            "reviewerName": "Jennifer L. Secrest",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "easy cleaning",
            "reviewDate": "February 8, 2008",
            "reviewText": "an easy way to clean your coffee/spice grinder: put a small peice of bread in it (about a 1/4 slice) and pulse a few times then dump it out...and you're done:)"
        },
        {
            "reviewerName": "Mark Kelly",
            "rating": "1.0 out of 5 stars",
            "reviewTitle": "Already dead, will not buy again",
            "reviewDate": "April 28, 2017",
            "reviewText": "Already dead!"
        },
        {
            "reviewerName": "Amazon Customer",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Five Stars",
            "reviewDate": "November 16, 2015",
            "reviewText": "Nice and easy to use."
        },
        {
            "reviewerName": "R. LEE",
            "rating": "1.0 out of 5 stars",
            "reviewTitle": "Junk. Dead in 45 days.",
            "reviewDate": "October 31, 2014",
            "reviewText": "Dead in under 45 days. Used to grind oatmeal about 2 times a week. Junk. Unable to refund."
        },
        {
            "reviewerName": "Amandlila",
            "rating": "1.0 out of 5 stars",
            "reviewTitle": "ground for ten seconds as per comments and it was perfect. The second time (next day) the beans would ...",
            "reviewDate": "March 21, 2017",
            "reviewText": "Upon second use, motor seized up. The first use, ground for ten seconds as per comments and it was perfect. The second time (next day) the beans would not fall to the blades like they did the first time, so kept having to shake and press until the third ten second pulse at which time it wouldn't grind any longer. I dumped out the contents and saw smoke coming from blade area. Ah well, not sure why I expected something so inexpensive to work as expected."
        },
        {
            "reviewerName": "James D. Carlson",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Great, dependable coffee grinder",
            "reviewDate": "January 14, 2016",
            "reviewText": "I just bought my second grinder for my daughter's house so we would have one when we visit. I just used my original one to grind its umpteenth batch of coffee. I don't know how long we have had it, but I'm sure it is at least six years. It is a simple grinder - no settings, no removable grinding chamber. It turns out an evenly ground batch of coffee each and every time.\n\nIt also holds a large amount of ground coffee. We like our coffee strong. We fill the grinding chamber over the top, pet the lid on and grind away. We bought the Hamilton Beach Removable Chamber Grinder Model 80350 from another retailer for my daughter's house and just hated it. The grinding chamber is much too small and it did not grind consistently.\n\nForget all the fancy bells and whistles and buy this bad boy. You'll be using it a long time."
        },
        {
            "reviewerName": "Fat Cinnamon",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Easy to use and works well!",
            "reviewDate": "January 7, 2018",
            "reviewText": "I needed a grinder for some Ecuadorian coffee beans we recently purchased to use in a new french press coffee maker. My thinking was that I did not want to spend too much if I didn't like the coffee. This little grinder works perfectly! I really like that I can make the beans grind very fine or not depending on how long it's on. Very easy to use with just a push on the top, and it wipes clean easily. A good buy!"
        },
        {
            "reviewerName": "W. Larson",
            "rating": "4.0 out of 5 stars",
            "reviewTitle": "Works for the price",
            "reviewDate": "October 19, 2018",
            "reviewText": "Overall the coffee grinder works how you would expect for the price and it gets the job done. It is a little more bulky than my last one. It also does not have the option to wind the cord into the base which makes the cord a hassle when trying to put it away. The lid that is pressed down in order to grind also feels loose but so far (about 3 months) it has worked just fine.\n\nIn a pinch, Id buy this again but I wish I would have found one with a retractable cord."
        },
        {
            "reviewerName": "Katy M",
            "rating": "3.0 out of 5 stars",
            "reviewTitle": "Not like my previous Mr Coffee grinder that just wore out and needed replacement",
            "reviewDate": "May 7, 2019",
            "reviewText": "Did not meet expectations. I thought it would control the time it takes to grind size (fine, medium, course), like my previous Mr Coffee grinder. This one, you have to count out the seconds and stop it on your own. Also the part where you add the beans is not removable, so you can never ever really clean it as my previous Mr Coffee grinder could be cleaned. This can only be dry cleaned as it is all attached to a power cord and non-submergable."
        },
        {
            "reviewerName": "Russell",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "For advanced coffee drinkers",
            "reviewDate": "August 25, 2018",
            "reviewText": "The grind is dependant on how hard you press. If you want a turkish grind, press and hold for more than 30 seconds. If you want a french press grind press and hold for 5 to 10 seconds. You'd have to be familiar with the different types of grinds and experiment before finding the right grind."
        },
        {
            "reviewerName": "Steve D.",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Sturdy grinder",
            "reviewDate": "March 23, 2019",
            "reviewText": "I have had no problems with this grinder. Works great and even grinds the hazelnuts in my favorite coffee bean blend. I have a manual hand burr grinder which does well for just beans but when you try to grind blends of beans and hazelnuts or almonds it doesnt work as well as this little grinder. And after some practice you will learn the best amount of time to get the grind your wanting."
        },
        {
            "reviewerName": "ThomasRosalia",
            "rating": "1.0 out of 5 stars",
            "reviewTitle": "Product BROKE after just a few times, TWICE !",
            "reviewDate": "October 8, 2018",
            "reviewText": "I never write reviews but this is very disappointing.\nI had one product shipped to me which broke after 5/6 times using it. It simply stopped working.\nThen the product was exchanged very easily which was cool. But the second one did the same thing!\nSo my recommendation to anyone that doesn't want to be left alone with just coffee beans and nothing to but in their coffee maker is - Do not buy this product."
        },
        {
            "reviewerName": "S atkins",
            "rating": "2.0 out of 5 stars",
            "reviewTitle": "Can only grind coffee with it!",
            "reviewDate": "November 8, 2017",
            "reviewText": "It makes a shrill noise at the beginning of each grinding session, but after that its not too loud. Its supposed to grind up to 12 cups worth of beans Are haps ifyou drink it really watered Down. Worst of all, the description at Amazon says you can use it on foods other than copies, but the directions in the box say that will ruin the taste of the coffee. Dont get it for both!"
        },
        {
            "reviewerName": "R. Hart",
            "rating": "3.0 out of 5 stars",
            "reviewTitle": "Broke after less than 6 months of light use.",
            "reviewDate": "August 19, 2018",
            "reviewText": "Worked for 5 and a half months. I only used it to occasionally grind coffee beans, approximately 2-3 times per week. Now it makes a very quiet humming sound, and the blades do not spin. Considering the little use this has received, this was money not well-spent.\n\nUpdate: The first one broke after 5 and a half months of light use. However, Mr. Coffee sent me a replacement unit free of charge. So far, this unit has been working as expected for about two months. I will report again on the longevity of this second unit."
        },
        {
            "reviewerName": "Amazon Customer",
            "rating": "1.0 out of 5 stars",
            "reviewTitle": "It was DOA on arrival and it had grounds in it Missed return window",
            "reviewDate": "November 29, 2018",
            "reviewText": "My mistake for not returning it but it was a housewarming gift and I bought it a month before the move. My son threw all the packaging away and then noticed that there were grounds in it and it didn't work. I still may have been able to return it but just kept forgetting to print the label and send back. Still, it looks like they resold me a returned product."
        },
        {
            "reviewerName": "CP",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Outstanding operation and cost - lasting for years with daily use",
            "reviewDate": "August 28, 2019",
            "reviewText": "We use it daily for Black Rifle beans and when we give bags of them to those friends who do not have a coffee grinder, we include on of the Mr. Coffee grinders. That is five or six of them in the past year or so. We also have one that is only used for grinding spices."
        },
        {
            "reviewerName": "Don Walker",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Needed a replacement for a like grinder which was wearing out after many years of ...",
            "reviewDate": "January 10, 2018",
            "reviewText": "Needed a replacement for a like grinder which was wearing out after many years of daily grinds. Hard to find in a store for some reason. Arrived in good condition and on time. Love it. And it's grinding away our favorite Dark Roast beans daily."
        },
        {
            "reviewerName": "gelli",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "This is the perfect sized grinder",
            "reviewDate": "October 3, 2017",
            "reviewText": "This is the perfect sized grinder. IT really gets the job done. I bought this as I wanted to do more fresh coffee and use it also to make coarsely grinded coffee beans for cold brew. I have been impressed with the power of this thing. It can really grind however I want the beans to be to my liking. It's just a soft touch to start grinding and you easily just slide the lid off and on when you are ready. For the price, I don't think this product can be beat. This has become a quick staple to my morning routine."
        },
        {
            "reviewerName": "Amazon Customer",
            "rating": "1.0 out of 5 stars",
            "reviewTitle": "Plastic contamination",
            "reviewDate": "October 22, 2019",
            "reviewText": "The cup, which is made with clear plastic, got damaged by grinding (spinning upwards) coffee beans. Eventually one ends up with drinking coffee with shredded plastic particles. To me is a major health concern!"
        },
        {
            "reviewerName": "ACSN",
            "rating": "4.0 out of 5 stars",
            "reviewTitle": "Good product, but obstructive blades are annoying.",
            "reviewDate": "March 1, 2015",
            "reviewText": "This is my first experience with a personal coffee grinder and I love finally having the convenience of grinding beans at home. It works well and gives good grind.\n\nI do get really irritated when I have to continuously maneuver the obstructive blades to remove all the grinds and during cleaning. I don't know, given my experience, if this irritant is common with grinders like this one, small and little extra room in the grinding chamber, or not, but the next time I buy one, I will definitely be looking for one with less obstructive blades."
        },
        {
            "reviewerName": "stepin",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "still good",
            "reviewDate": "September 5, 2017",
            "reviewText": "still using it for spice, coffee, weed, awesome grinder!"
        },
        {
            "reviewerName": "Nancy",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "For the cost, it is a nice grinder",
            "reviewDate": "March 14, 2019",
            "reviewText": "I like how quickly it grinds the coffee beans. It is easy to clean and simple to use. I have only used it a few times so Im also not sure how long it will hold up. I only grind a few beans at a time. It works for me."
        },
        {
            "reviewerName": "RubyVern",
            "rating": "1.0 out of 5 stars",
            "reviewTitle": "Grinds to a Halt (Hunk O Junk)",
            "reviewDate": "November 17, 2015",
            "reviewText": "The first one arrived broken - would not work. The replacement worked for 2 months and just stopped working. And it's no longer replaceable. It's sad what's happened to Mr. Coffee."
        },
        {
            "reviewerName": "De",
            "rating": "1.0 out of 5 stars",
            "reviewTitle": "Hunk of junk",
            "reviewDate": "November 5, 2018",
            "reviewText": "This thing only worked for 20 seconds... then dead. Nothing, not even a conciliatory buzz. My last mr coffee grinder lasted us 13 years! Obviously somethings changed."
        },
        {
            "reviewerName": "Stacey",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Seems to work well!",
            "reviewDate": "August 9, 2018",
            "reviewText": "I bought this specifically for grinding up spices- it will probably never see a coffee bean! I ground some dried chilis into a fine powder and it works well. Just be aware that you cannot remove the blades for cleaning. I will grind some lemon peel and salt to clean it."
        },
        {
            "reviewerName": "Laura & Nick Crawley",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Gets the job done!",
            "reviewDate": "May 6, 2019",
            "reviewText": "Very simple coffee grinder to use! I got this because I accidentally got whole bean from a company and didnt want to return. This little guy is so easy to use and worth every penny!"
        },
        {
            "reviewerName": "teri",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Mr. Coffee electric grinder works like a charm",
            "reviewDate": "October 19, 2018",
            "reviewText": "I do love this coffee grinder! It is very easy to use, it grinds the hell out of the beans each and every time. I make 2 pot of coffee each and every day so this grinder gets used twice a day, everyday."
        },
        {
            "reviewerName": "Amazon Customer",
            "rating": "2.0 out of 5 stars",
            "reviewTitle": "Grinds the beans fine, but not easy to clean since it says ...",
            "reviewDate": "April 30, 2018",
            "reviewText": "Grinds the beans fine, but not easy to clean since it says you shouldn't get the blade area wet. Also, you have to tilt it over to pour out the ground coffee. I ended up buying a different brand that has a removable chamber that can be washed and makes it much easier to pour the grounds out. It was $10 more, but well worth it if you ask me. The better one I purchased is also basically automatic. You push one button and it knows when to stop. The Mr Coffee one you have to hold down until you're it's as fine as you'd like."
        },
        {
            "reviewerName": "Amazon Customer",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Simple, effective, and at a low cost!",
            "reviewDate": "March 4, 2018",
            "reviewText": "Purchased this item due to buying whole beans at the coffee store for the first time, and didnt want to break the bank. This product delivered! We arent coffee experts by any means, but this item is very easy to use, and does a great job. If you are looking for a simple options to grind up your coffee beans, without spending too much, this is the item for you!"
        },
        {
            "reviewerName": "Sunanda A.",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Works great!!",
            "reviewDate": "September 14, 2017",
            "reviewText": "Works great !!. Bought it for my daughter who moved to another state to pursue her studies. She likes it very much. Grinds coffee beans regularly to make fresh coffee. Thanks for the good product."
        },
        {
            "reviewerName": "seung",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Easy to use and works great",
            "reviewDate": "January 16, 2018",
            "reviewText": "I only use it to grind coffee. Easy to use and works great. A little smaller than I expected... but still love it for that price."
        },
        {
            "reviewerName": "Sam De Long",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "It grinds coffee....",
            "reviewDate": "March 6, 2018",
            "reviewText": "Oldschool quality coffee grinder. Why buy all those pods when you can select the beans and make a fresh cup of coffee every morning to your exact liking. My parents have owned a similar Mr. Coffee model from since I was born (1990). Good brand name."
        },
        {
            "reviewerName": "Jesse Spychalla",
            "rating": "4.0 out of 5 stars",
            "reviewTitle": "Simple and effective",
            "reviewDate": "May 16, 2018",
            "reviewText": "The product is exactly what I expected, it's simple and effective. I get coffee grounds all over when I use it, just like every other one I've used. I'm writing this review after one day so I can't speak to reliability, but I'll update if something major happens."
        },
        {
            "reviewerName": "Luke Kreykes",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Great",
            "reviewDate": "October 11, 2019",
            "reviewText": "My first coffee grinder. Works great, not sure what else to say. Very easy to get grounds to exactly the size you want."
        },
        {
            "reviewerName": "Ryan Esposito",
            "rating": "1.0 out of 5 stars",
            "reviewTitle": "At least I only wasted $12.",
            "reviewDate": "April 5, 2018",
            "reviewText": "Purchased this to replace one I purchased about 15 years ago. Got 1 use out of it and it quit working. Been trying to contact customer service about this issue. Ive been on hold 20 minutes at a time at least 3 times now without resolution. Save the money and put it towards a little more pricey one. At least I only wasted $12."
        },
        {
            "reviewerName": "Danielle",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "perfect size for one",
            "reviewDate": "February 4, 2019",
            "reviewText": "great size to make one cup of coffee, can fit much more in there but i use mine every day for one cup.\nlittle difficult to clean out but other than that works great"
        },
        {
            "reviewerName": "C. Lange",
            "rating": "1.0 out of 5 stars",
            "reviewTitle": "Not new, obviously used product",
            "reviewDate": "September 11, 2018",
            "reviewText": "It was supposed to be new. Obviously used as there was still bits of coffee in the grinder portion, box was not sealed, and poorly repacked. It took over a week to get to us so we will probably keep it if it works."
        },
        {
            "reviewerName": "Dennis Sherwood",
            "rating": "1.0 out of 5 stars",
            "reviewTitle": "Premature failure.",
            "reviewDate": "April 20, 2017",
            "reviewText": "Grinder already failed. Started smoking and then wouldn't turn on. We've only made about 10 pots of coffee with it so far. Didn't run it for excessive time periods and didn't put anything besides coffee beans into it. We used it as it should be used."
        },
        {
            "reviewerName": "Maggie",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Just what I needed!",
            "reviewDate": "August 16, 2018",
            "reviewText": "I was looking for something to grind up my flax seeds. This was perfect!"
        },
        {
            "reviewerName": "kevboy",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "GREAT LITTLE TOOL!",
            "reviewDate": "February 6, 2019",
            "reviewText": "It does a fantastic job for such a small coffee grinder. Perfect for if you are just grinding beans for a cup or two of coffee. I really love it."
        },
        {
            "reviewerName": "herbgal7",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "small and effective",
            "reviewDate": "August 26, 2019",
            "reviewText": "Bought this to replace the same grinder I'd had for decades after it finally stopped working."
        },
        {
            "reviewerName": "Emjay W.",
            "rating": "3.0 out of 5 stars",
            "reviewTitle": "Does what its suppose to do.. no bells ...",
            "reviewDate": "December 8, 2017",
            "reviewText": "Does what its suppose to do.. no bells and whistles. It works. Only using for spices. Is a pain to clean though."
        },
        {
            "reviewerName": "LaJuana C. Glaze",
            "rating": "4.0 out of 5 stars",
            "reviewTitle": "It's compact and user-friendly.",
            "reviewDate": "August 9, 2018",
            "reviewText": "This product meets my need for a coffee grinder."
        },
        {
            "reviewerName": "MGP",
            "rating": "2.0 out of 5 stars",
            "reviewTitle": "Lasted 3 months",
            "reviewDate": "October 8, 2018",
            "reviewText": "I liked this product, easy to use and easy to clean. Of course I expected it to last more than 3 months. I definitely recommend buying something else."
        },
        {
            "reviewerName": "David W.",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Yassssss",
            "reviewDate": "February 13, 2017",
            "reviewText": "Changed my life! Nothing beats Fresh ground coffee AND you can grind up herbs in it as well! What? Shut up and take my money!"
        },
        {
            "reviewerName": "Oldocfoster",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Excellent, basic everyday grinder.",
            "reviewDate": "September 23, 2013",
            "reviewText": "For everyday use in drip coffee maker, or french press, this workhorse grinder is hard to beat. I absolutely love it.\nDoes not get grind fine enough, in my opinion, for espresso, but that is not what this blade grinder is for. I have a separate burr coffee grinder (La Pavoni) that does an excellent jog of grinding fresh coffee beans fine enough for espresso, but is simply not worth the time and mess (electorstatic) for me to use on an everyday basis for my everyday drip coffee."
        },
        {
            "reviewerName": "Theresa I Aldrich",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Personal Coffee grinder",
            "reviewDate": "July 12, 2018",
            "reviewText": "It grinds for one cup at a time. This is perfect for a single person."
        },
        {
            "reviewerName": "Andrea B.",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Where has this been all my life?!",
            "reviewDate": "February 12, 2019",
            "reviewText": "I had never ground my own coffee beans until this grinder. It is so easy and awesome. I wish I'd had it years ago! Definitely recommend."
        },
        {
            "reviewerName": "Neicy Fay",
            "rating": "1.0 out of 5 stars",
            "reviewTitle": "Product lasted four months and then completely died. I ...",
            "reviewDate": "January 23, 2017",
            "reviewText": "Product lasted four months and then completely died. I contacted Mr Coffee and they said they received my question but never addressed it. This is the second Mr Coffee grinder that I've had in the last year and both have done the same thing. I would never buy one of these again."
        },
        {
            "reviewerName": "J. Black",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Works like a charm!",
            "reviewDate": "March 13, 2019",
            "reviewText": "I love this grinder!! It works great! Not so easy to clean, but not too much trouble. Great product!"
        },
        {
            "reviewerName": "winnie",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "it works great and makes a great aroma in my",
            "reviewDate": "March 16, 2017",
            "reviewText": "A small coffee grinder that doesn't take up a lot of countertop space, it works great and makes a great aroma in my kitchen"
        },
        {
            "reviewerName": "Amazon Customer",
            "rating": "1.0 out of 5 stars",
            "reviewTitle": "USED IT TWICE AND IT DIED",
            "reviewDate": "May 9, 2019",
            "reviewText": "UGH!! why is it you can't buy anything and NOT have it break immediately---this Mr. Coffee grinder SUCKS!"
        },
        {
            "reviewerName": "Mark Dolak",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Great for fresh coffee",
            "reviewDate": "August 25, 2019",
            "reviewText": "Great for fresh beans to get your morning cup of joe"
        },
        {
            "reviewerName": "Lisa M.",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Best Grinder of this Type on the Market!!",
            "reviewDate": "August 15, 2013",
            "reviewText": "This Mr. Coffee Grinder is excellent quality and is much sturdier and holds up better than the newer version of grinders by another company. **Details: the grinding activator button on this grinder is sturdy and is much more easily used. Pour in the coffee beans, replace the cap and press down on the grinding activator button. This is the second one of this style/brand I have owned. ( Made the mistake of buying a newer version/other brand and the activator switch is flimsy and it cracked in less than 4 months) NOTE: My First one of this style lasted well over 10+ years! Was used every single day at least once or twice per day on average. Great grinder! I highly recommend this over most of the other grinders of this style."
        },
        {
            "reviewerName": "Jennifer Marie",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Does its job",
            "reviewDate": "August 4, 2019",
            "reviewText": "Ive had this for 4 months now and its still going strong."
        },
        {
            "reviewerName": "Chris",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Good buy.",
            "reviewDate": "January 17, 2019",
            "reviewText": "No complaints. I bought two. Use one for coffee and the other for nuts. Recomended."
        },
        {
            "reviewerName": "MeaganS",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Five Stars",
            "reviewDate": "January 17, 2018",
            "reviewText": "it grinds well the few times I have used it."
        },
        {
            "reviewerName": "Nancy I. Sirico",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Terrific and durable.",
            "reviewDate": "January 1, 2019",
            "reviewText": "Ive owned one for years. Gave this one to a friend. He loves it."
        },
        {
            "reviewerName": "M. Cooper",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Just right, for the best price",
            "reviewDate": "September 25, 2019",
            "reviewText": "Works perfect, for a great price."
        },
        {
            "reviewerName": "Our Reviews",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Five Stars",
            "reviewDate": "June 15, 2018",
            "reviewText": "Works great! Great price!"
        },
        {
            "reviewerName": "vabnous",
            "rating": "1.0 out of 5 stars",
            "reviewTitle": "Bad product",
            "reviewDate": "March 28, 2018",
            "reviewText": "This product is no good!! It did not even make it past one pound of coffee and it burned out and did not work anymore. It was recommended by amazon and it absolutely was a bad product will never buy it again."
        },
        {
            "reviewerName": "Cj milli",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Perfect. Does the job.",
            "reviewDate": "November 2, 2018",
            "reviewText": "I absolutely love this thing. Works great! Does exactly what I need it to do."
        },
        {
            "reviewerName": "Amazon Customer",
            "rating": "1.0 out of 5 stars",
            "reviewTitle": "DONT WASTE YOUR MONEY",
            "reviewDate": "September 18, 2018",
            "reviewText": "Broke like a week in. Absolutely terrible and barely even grounded the coffee beans. DONT go cheap with a coffee grinder, its not worth it."
        },
        {
            "reviewerName": "Marie T. Neff",
            "rating": "2.0 out of 5 stars",
            "reviewTitle": "Find another one",
            "reviewDate": "September 7, 2017",
            "reviewText": "It was great while it lasted but it only lasted about a month before it stopped grinding. Find another one."
        },
        {
            "reviewerName": ".",
            "rating": "4.0 out of 5 stars",
            "reviewTitle": "grind longer for finer grind. Works as expected as a basic coffee ...",
            "reviewDate": "July 26, 2018",
            "reviewText": "One setting, hard to load and remove grinds ...grind longer for finer grind. Works as expected as a basic coffee grinder."
        },
        {
            "reviewerName": "Kevin",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "We are very happy with the product and the service",
            "reviewDate": "July 4, 2018",
            "reviewText": "Everything went well from start to finish. We are very happy with the product and the service!"
        },
        {
            "reviewerName": "Rick B.",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "WORKS FINE, DOES NOT FEEL",
            "reviewDate": "March 7, 2017",
            "reviewText": "AS ADVIRTISED, WORKS FINE, DOES NOT FEEL CHEAP"
        },
        {
            "reviewerName": "Jimster",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Does a Great Job!",
            "reviewDate": "October 11, 2018",
            "reviewText": "I've been using this grinder for almost a year. Works for me and easy to clean. Warm water on the lid and a toothbrush and a paper towel on the grinder...takes less than a minute."
        },
        {
            "reviewerName": "Elizabeth",
            "rating": "1.0 out of 5 stars",
            "reviewTitle": "Don't use this consecutively",
            "reviewDate": "March 12, 2019",
            "reviewText": "Do not use it multiple times in one sitting. This thing almost caught on fire when I used it a second time in a row."
        },
        {
            "reviewerName": "LJM",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "A great deal!",
            "reviewDate": "March 16, 2018",
            "reviewText": "My husband loves it! He uses it very regularly and was very glad that I bought it. It grinds exactly how he likes it. A great deal!"
        },
        {
            "reviewerName": "JH",
            "rating": "3.0 out of 5 stars",
            "reviewTitle": "Is good for short use but gets hot if you use ...",
            "reviewDate": "March 25, 2017",
            "reviewText": "Bought to powder my dehydrated foods. Is good for short use but gets hot if you use too long. Using for coffee would be fine if you're not trying to grind the whole bag."
        },
        {
            "reviewerName": "tam",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Grind",
            "reviewDate": "February 22, 2019",
            "reviewText": "Perfectly grinds n empties"
        },
        {
            "reviewerName": "Tara",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Easy to use",
            "reviewDate": "April 15, 2019",
            "reviewText": "Used for few months now, not a single problem."
        },
        {
            "reviewerName": "Nellann",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": ":)",
            "reviewDate": "July 21, 2019",
            "reviewText": "Easy to use"
        },
        {
            "reviewerName": "Millicent Williams",
            "rating": "4.0 out of 5 stars",
            "reviewTitle": "Good purchase",
            "reviewDate": "April 6, 2019",
            "reviewText": "Very easy to use and very compact"
        },
        {
            "reviewerName": "ReviewPro2000",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "As expected.",
            "reviewDate": "February 15, 2019",
            "reviewText": "Been using about 4 weeks. No issues. Coffee tasted great!"
        },
        {
            "reviewerName": "doggylover",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Five Stars",
            "reviewDate": "April 7, 2017",
            "reviewText": "I love that this is small and gets the job done."
        },
        {
            "reviewerName": "L. Elliott",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Good quality - fair pricing",
            "reviewDate": "May 2, 2017",
            "reviewText": "Great little grinder. I would buy it again."
        },
        {
            "reviewerName": "Mary Ann",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Handy grinder for all home cooks",
            "reviewDate": "November 25, 2018",
            "reviewText": "The best for coffee grounds & herbs which is what I use it for."
        },
        {
            "reviewerName": "Kindle Customer",
            "rating": "3.0 out of 5 stars",
            "reviewTitle": "Wonderful grinder until it dies too soon.",
            "reviewDate": "September 2, 2019",
            "reviewText": "Lasted one year and two months. Worked great until then."
        },
        {
            "reviewerName": "Lisha",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Works great! I use it for so many things",
            "reviewDate": "April 14, 2018",
            "reviewText": "Works great! I use it for so many things. My only problem with it is that it's hard to clean since you can't just wash it."
        },
        {
            "reviewerName": "Kelly M.",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Powerful little grinder",
            "reviewDate": "September 17, 2018",
            "reviewText": "Very powerful little guy. Grinds up enough to make a few pots of coffee."
        },
        {
            "reviewerName": "Christina Carlisle",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Easy to use and grinds well.",
            "reviewDate": "April 7, 2019",
            "reviewText": "Great little coffee grinder."
        },
        {
            "reviewerName": "suzanne cooley",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Five Stars",
            "reviewDate": "June 4, 2018",
            "reviewText": "I really like this grinder. It grinds quickly and gets every bean."
        },
        {
            "reviewerName": "Goose",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Grinds coffee",
            "reviewDate": "October 4, 2017",
            "reviewText": "Grinds coffee. Nuf said."
        },
        {
            "reviewerName": "LarRF",
            "rating": "1.0 out of 5 stars",
            "reviewTitle": "Junk Don't buy!!",
            "reviewDate": "June 8, 2018",
            "reviewText": "When I received the grinder it was great, did everything it's predecessor did for 12 years. but to have it just quite out of hand for no apparent reason is more than a little absurd. The first one was made in Brazil and was an amazing work horse grinding coffee for 12 years. After 3 months with this model (made in China) and we were out of the country for a month when it just sat, it decided to no longer do anything. I can see why Amazon only gives you a 1 month window to return the item. Total Junk."
        },
        {
            "reviewerName": "Amazon Customer",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Great",
            "reviewDate": "September 23, 2019",
            "reviewText": "This is a good if you just want a simple coffee grinder. Does the trick. Easy to use and great for the price"
        },
        {
            "reviewerName": "Michael",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Works great",
            "reviewDate": "March 6, 2018",
            "reviewText": "Had an old mr coffee grinder that was 10+ years old. Accidentally knocked it off the counter and broke it. Got this as a replacement and works great. Can feel it has more power than the old one. If it holds up as long they have a happy customer here"
        },
        {
            "reviewerName": "James Koehlinger",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Does a good job.",
            "reviewDate": "July 17, 2018",
            "reviewText": "We have three of these now for two houses and for traveling. Does a good job."
        },
        {
            "reviewerName": "Posty",
            "rating": "4.0 out of 5 stars",
            "reviewTitle": "Good product!",
            "reviewDate": "July 9, 2018",
            "reviewText": "it's not as big as I thought it would be, but it works great for a 12 cup blend."
        },
        {
            "reviewerName": "filmy",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "I like it - don't *love* it",
            "reviewDate": "December 29, 2016",
            "reviewText": "I like it - don't *love* it, but wasn't fair to dock it one star for the price/value. Does what it says, but very basic."
        },
        {
            "reviewerName": "Veluet",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "De-facto blade grinder",
            "reviewDate": "November 17, 2013",
            "reviewText": "I hit this thing against the counter everyday to get the last little bits of coffee or spice out of the grinder. It has a rigid and sleek build and stands the test of time.\n\nI only suggest grinding coffee in this if you're using a process that has a paper filter, like an aero-press or drip coffee. Get a burr grinder for anything filter-less like a french press."
        },
        {
            "reviewerName": "Kiara",
            "rating": "1.0 out of 5 stars",
            "reviewTitle": "Broken",
            "reviewDate": "December 27, 2018",
            "reviewText": "Broke after a couple of weeks of use."
        },
        {
            "reviewerName": "ari",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Grinds coffee beans to perfection",
            "reviewDate": "April 5, 2018",
            "reviewText": "Neat little thing. I use it only for coffee beans and it does a great job. Very easy to clean."
        },
        {
            "reviewerName": "Scott",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Exactly what we wanted",
            "reviewDate": "March 15, 2019",
            "reviewText": "Ordered this to replaced an older version that had died"
        },
        {
            "reviewerName": "Ray",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "It works.",
            "reviewDate": "January 9, 2019",
            "reviewText": "Easy to use, works as advertised"
        },
        {
            "reviewerName": "Eric simmen",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Five Stars",
            "reviewDate": "March 7, 2018",
            "reviewText": "Reliable and cheap. This device also grinds coffee to mere perfection"
        },
        {
            "reviewerName": "Ophelia",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Five Stars",
            "reviewDate": "April 30, 2018",
            "reviewText": "We got it earlier than expected and it works as advertised. Thank you"
        },
        {
            "reviewerName": "Larry McGuire",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Excellent product",
            "reviewDate": "May 28, 2013",
            "reviewText": "I have tried several coffee grinders over the past years (most given to me as gifts) and I always return to the old, reliable IDS-57 from Mr. Coffee. It's easy to use. Put in the beans (a little over 1/2 cup of beans per pot of coffee) run the grinder for about 6 seconds, turn it upside down, remove the lid and dump the coffee into the basket. The ground coffee is always uniform. There is no mix of real fine and extra course grounds as there is with burr grinders. This grinder last me about 4 years using it for 4-5 pots of coffee a day. Costco has great whole-bean coffee, too."
        },
        {
            "reviewerName": "Siomara",
            "rating": "4.0 out of 5 stars",
            "reviewTitle": "Durability",
            "reviewDate": "January 4, 2019",
            "reviewText": "Very simple"
        },
        {
            "reviewerName": "Benjamin Tanner",
            "rating": "4.0 out of 5 stars",
            "reviewTitle": "My only complaint is that grounds like to stick to the bottom",
            "reviewDate": "December 26, 2016",
            "reviewText": "My only complaint is that grounds like to stick to the bottom. Based on my experience with older models, this gets better with time."
        },
        {
            "reviewerName": "Indian12",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Good grinder",
            "reviewDate": "May 31, 2018",
            "reviewText": "a little messy but does a good job of grinding the beans"
        },
        {
            "reviewerName": "Amazon Customer",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Works great",
            "reviewDate": "February 14, 2019",
            "reviewText": "Just exactly what I needed."
        },
        {
            "reviewerName": "Tom",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "exactly what was needed",
            "reviewDate": "August 30, 2018",
            "reviewText": "coffee grinder does exactly what its supposed to"
        },
        {
            "reviewerName": "Chris in Colorado",
            "rating": "4.0 out of 5 stars",
            "reviewTitle": "Works like it's designed",
            "reviewDate": "January 15, 2017",
            "reviewText": "It's a cheap, functional blade coffee grinder. Works like it's designed. Still functioning for us in a pinch, we use the burr grinder more."
        },
        {
            "reviewerName": "Darrell B. Eason",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Functional",
            "reviewDate": "September 3, 2018",
            "reviewText": "I am extremely pleased that I brought Mr. Coffee bean grinder. Very happy."
        },
        {
            "reviewerName": "Jessica Docasar",
            "rating": "2.0 out of 5 stars",
            "reviewTitle": "Two Stars",
            "reviewDate": "May 8, 2018",
            "reviewText": "Had very simple ingredients in my smoothie and it didn't break anything up. RETURNED!"
        },
        {
            "reviewerName": "Thomas A. Hill",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Five Stars",
            "reviewDate": "February 19, 2018",
            "reviewText": "Great product, so far. I've ground a bag of coffee beans and have had no problems."
        },
        {
            "reviewerName": "Wayne Barnes",
            "rating": "1.0 out of 5 stars",
            "reviewTitle": "No grinder in showed up!",
            "reviewDate": "September 19, 2018",
            "reviewText": "No grinder showed up"
        },
        {
            "reviewerName": "Neil Best",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "I like it.",
            "reviewDate": "June 13, 2018",
            "reviewText": "Very quiet compared to other grinders I've had. I like it."
        },
        {
            "reviewerName": "Wolfine",
            "rating": "4.0 out of 5 stars",
            "reviewTitle": "Great purchase.",
            "reviewDate": "July 27, 2015",
            "reviewText": "The plastic cover cracked on first test use, to be expected when it is made from plastic however. It is good that you can use this as a container to catch it after it's ground.\nIt runs well, the blades are sharp and it is quite powerful. Small size which is great to fit on the counter."
        },
        {
            "reviewerName": "Claire",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Many uses for this product!",
            "reviewDate": "December 20, 2016",
            "reviewText": "I'm obsessed with this coffee bean grinder!! I've used it to grind coffee beans, nuts, and make powdered sugar. Works great and multifunctional!"
        },
        {
            "reviewerName": "Todd A. Hooper",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Great product!",
            "reviewDate": "May 2, 2017",
            "reviewText": "Great grinder, it's well made and works great!"
        },
        {
            "reviewerName": "Anthony",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Works great",
            "reviewDate": "August 11, 2018",
            "reviewText": "Love it"
        },
        {
            "reviewerName": "Tim Novak",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Great little grinder.",
            "reviewDate": "February 11, 2018",
            "reviewText": "Great little grinder. I've used it for a couple weeks now. Perfect grind."
        },
        {
            "reviewerName": "AmazonAddict",
            "rating": "1.0 out of 5 stars",
            "reviewTitle": "Dissatisfied",
            "reviewDate": "April 3, 2019",
            "reviewText": "motor stopped working after using only three times!"
        },
        {
            "reviewerName": "Commando Big",
            "rating": "4.0 out of 5 stars",
            "reviewTitle": "Best Reputation",
            "reviewDate": "September 25, 2013",
            "reviewText": "I have used many grinders...from Krup to the most expensive on the market. I cam back to Mr. Coffee because I shouldn't have changed years ago. I had a Mr. Coffee grinder and I thought I would trade up to a more expensive brand...bad move. Glad I went back to a familiar name and quality brand."
        },
        {
            "reviewerName": "A Fulton",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Our favorite grinder",
            "reviewDate": "February 10, 2013",
            "reviewText": "Over the years we have had different coffee grinders. Regardless of price, none are immortal so why not buy an inexpensive grinder that does the job the way you like. This Mr. Coffee is that grinder. I have read all the reviews by coffee aficionados who say you must have a \"burr\" grinder. But those are higher priced and don't work as quickly as this little number. We fill the top plastic cover with beans (no measurement - want it all full for 12 cups), insert the black bottom upside down, flip it right side up, and grind to proper consistency. We love it."
        },
        {
            "reviewerName": "Parker",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Five Stars",
            "reviewDate": "February 18, 2018",
            "reviewText": "So far its working good and getting the job done. No complaints."
        },
        {
            "reviewerName": "David Martin",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Five Stars",
            "reviewDate": "June 4, 2018",
            "reviewText": "Sharp blades nice quality feel"
        },
        {
            "reviewerName": "Lisa Godman",
            "rating": "1.0 out of 5 stars",
            "reviewTitle": "No reset",
            "reviewDate": "October 16, 2019",
            "reviewText": "I used this twice and it stopped working."
        },
        {
            "reviewerName": "Lance Morris",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Good product. Met the need in budget.",
            "reviewDate": "May 8, 2017",
            "reviewText": "Good product. Met the need in budget. Good product. Met the need in budget. Good product. Met the need in budget."
        },
        {
            "reviewerName": "lesam",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Easy machine",
            "reviewDate": "October 22, 2018",
            "reviewText": "Super easy to use, works fast."
        },
        {
            "reviewerName": "Dr. Bohannon",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Five Stars",
            "reviewDate": "February 17, 2018",
            "reviewText": "Good grinder. Hard to clean but they all are. Metal cup and large capacity lid."
        },
        {
            "reviewerName": "Bill Nickley",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Works great",
            "reviewDate": "January 18, 2019",
            "reviewText": "Happy with purchase"
        },
        {
            "reviewerName": "Bernardino Tamayo",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Five Stars",
            "reviewDate": "April 22, 2018",
            "reviewText": "works great, no problems love using it"
        },
        {
            "reviewerName": "Dinah",
            "rating": "4.0 out of 5 stars",
            "reviewTitle": "Does the job..",
            "reviewDate": "May 16, 2018",
            "reviewText": "No surprises here. Had one just like it earlier, but lost it in the divorce."
        },
        {
            "reviewerName": "Dianne",
            "rating": "4.0 out of 5 stars",
            "reviewTitle": "Doing the job",
            "reviewDate": "March 8, 2019",
            "reviewText": "Grind perfect . It's doing its job"
        },
        {
            "reviewerName": "RedCardinal",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Super fast grind",
            "reviewDate": "July 6, 2017",
            "reviewText": "Holy Moly - does it grind fast"
        },
        {
            "reviewerName": "Meg",
            "rating": "4.0 out of 5 stars",
            "reviewTitle": "Great for making your own baby cereal",
            "reviewDate": "October 30, 2013",
            "reviewText": "I use this coffee grinder to grind up cereal for my baby - rice, millet, oats, quinoa, amaranth. It does a great job. It takes about 30-45 seconds to really pulverize the grains. You have to tap the top of the grinder in order to keep the grain flour in the bottom. We use it quite a bit (2 times a day, bought 3 months ago) and the blade is still sharp and grinding great. It makes quite a smooth cereal."
        },
        {
            "reviewerName": "Angelina Edge",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Spin, brew, then sip!",
            "reviewDate": "June 25, 2018",
            "reviewText": "Does the job!!! Love it for my coffee beans!"
        },
        {
            "reviewerName": "General Sanchez",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Nice!",
            "reviewDate": "February 13, 2017",
            "reviewText": "Very nice little gadget. Serves it's purpose well. I am very satisfied with my purchase."
        },
        {
            "reviewerName": "Danny Welbeck",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Seems like it will last",
            "reviewDate": "January 29, 2018",
            "reviewText": "Clean design, runs relatively quiet. Seems like it will last."
        },
        {
            "reviewerName": "Lilly",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Works",
            "reviewDate": "December 23, 2015",
            "reviewText": "This works well and can fit enough beans for a few cups of coffee. This is my first coffee grinder so I'm not sure if others are better but I have no complaints about this one so far so I'm happy!"
        },
        {
            "reviewerName": "Igor B.",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Five Stars",
            "reviewDate": "August 29, 2018",
            "reviewText": "What I needed!"
        },
        {
            "reviewerName": "Carl Freeman",
            "rating": "4.0 out of 5 stars",
            "reviewTitle": "Get what you pay for",
            "reviewDate": "September 22, 2018",
            "reviewText": "It's ok"
        },
        {
            "reviewerName": "Karen",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "It works",
            "reviewDate": "May 1, 2018",
            "reviewText": "Grinds coffee quickly, works great!"
        },
        {
            "reviewerName": "Dakota Moen",
            "rating": "1.0 out of 5 stars",
            "reviewTitle": "Stopped working after 3 uses",
            "reviewDate": "March 17, 2019",
            "reviewText": "Worked well/very easy to use. Unfortunately stopped working after the 3rd use."
        },
        {
            "reviewerName": "Marcel Alicea",
            "rating": "4.0 out of 5 stars",
            "reviewTitle": "I wish there was a better way to clean the unit",
            "reviewDate": "November 21, 2016",
            "reviewText": "With the amount of competition and brands available, I was pleasantly surprised. Especially with the punch this small machine packs! I wish there was a better way to clean the unit, but all In all it gets the job done."
        },
        {
            "reviewerName": "Amazon Customer",
            "rating": "4.0 out of 5 stars",
            "reviewTitle": "Four Stars",
            "reviewDate": "February 12, 2018",
            "reviewText": "A gift for my daughter last xmas. She likes it."
        },
        {
            "reviewerName": "Anna F. Gerber",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Good for the price",
            "reviewDate": "January 26, 2019",
            "reviewText": "Good for the price easy to use"
        },
        {
            "reviewerName": "mahja",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Five Stars",
            "reviewDate": "March 1, 2018",
            "reviewText": "gets the job done."
        },
        {
            "reviewerName": "Stephanie Perry",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Pleasantly Surprised!",
            "reviewDate": "April 16, 2018",
            "reviewText": "WOW.. super powerful! Excellent quality for the price. Highly recommend!"
        },
        {
            "reviewerName": "WC",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Five Stars",
            "reviewDate": "July 11, 2018",
            "reviewText": "Good grind, easy to clean. Great price."
        },
        {
            "reviewerName": "Trainer",
            "rating": "4.0 out of 5 stars",
            "reviewTitle": "Good grinder. But I miss the previous one with ...",
            "reviewDate": "January 3, 2017",
            "reviewText": "Good grinder. But I miss the previous one with a place at the bottom to wind the cord."
        },
        {
            "reviewerName": "Genny",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Grinds like it should.",
            "reviewDate": "May 4, 2016",
            "reviewText": "Grinds great, does what it's supposed to do. Course grind in about 5 seconds for the french press, espresso grind in 7 or 8. Perfect."
        },
        {
            "reviewerName": "Amazon Customer",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Five Stars",
            "reviewDate": "January 4, 2018",
            "reviewText": "easy to use, small and portable"
        },
        {
            "reviewerName": "pmlewando",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Well worth it!",
            "reviewDate": "July 19, 2017",
            "reviewText": "Great price, great quality, small and portable. Well worth it!"
        },
        {
            "reviewerName": "Susan Grieves",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Best grinder for the money. They last a long time.",
            "reviewDate": "May 1, 2019",
            "reviewText": "Fast grinder."
        },
        {
            "reviewerName": "Decepticon warlord",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Grinds like a boss!",
            "reviewDate": "September 21, 2018",
            "reviewText": "Easy use, grinds very well for what I needed it for."
        },
        {
            "reviewerName": "Carla H.",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "PERFECT and quick",
            "reviewDate": "January 7, 2017",
            "reviewText": "I used this to render dried rosemary, basil, and mint into powder form to put in my spice jars. PERFECT and quick!"
        },
        {
            "reviewerName": "Independent Reviewer",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "and it is still working like new.",
            "reviewDate": "February 10, 2018",
            "reviewText": "Very solid piece of coffee grinder. This is a gift to a friend. I have one for years myself, and it is still working like new."
        },
        {
            "reviewerName": "john",
            "rating": "4.0 out of 5 stars",
            "reviewTitle": "Grinds up coffee well",
            "reviewDate": "February 23, 2013",
            "reviewText": "Bought one for my father for his birthday so that he could grind fresh beans. I judge the success of this product on the fact that the giant costco container of folgers is gone. The product is sturdy and well made. I have a previous version that I have used for ten years."
        },
        {
            "reviewerName": "Ellie",
            "rating": "1.0 out of 5 stars",
            "reviewTitle": "Suddenly stopped working!",
            "reviewDate": "October 6, 2018",
            "reviewText": "it stopped working after a few times!"
        },
        {
            "reviewerName": "kimbacaffeinate",
            "rating": "4.0 out of 5 stars",
            "reviewTitle": "works like a charm",
            "reviewDate": "October 5, 2016",
            "reviewText": "Grinds beans evenly and is easy to clean. Slim design."
        },
        {
            "reviewerName": "Leigh Feigenbaum",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Five Stars",
            "reviewDate": "April 29, 2018",
            "reviewText": "Its a Mr Coffee !"
        },
        {
            "reviewerName": "Jerry",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "It's a yes!",
            "reviewDate": "July 22, 2017",
            "reviewText": "Works like a champ, great value plus fresh ground coffee every day."
        },
        {
            "reviewerName": "Randy Huey",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Five Stars",
            "reviewDate": "May 12, 2018",
            "reviewText": "Outstanding machine"
        },
        {
            "reviewerName": "CovertOps",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Does the job at a great price",
            "reviewDate": "March 9, 2018",
            "reviewText": "Works like other coffee grinders I've used, very reliable for daily use."
        },
        {
            "reviewerName": "Hector Mondragon",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Five Stars",
            "reviewDate": "December 5, 2016",
            "reviewText": "Great price, great product, fast shipping...Can't ask for much more than that. Thank you!"
        },
        {
            "reviewerName": "Rybread",
            "rating": "2.0 out of 5 stars",
            "reviewTitle": "Buyer Beware",
            "reviewDate": "June 22, 2018",
            "reviewText": "This broke after 2 months of not even daily use. I would look elsewhere."
        },
        {
            "reviewerName": "Amazonfan",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Five Stars",
            "reviewDate": "May 17, 2018",
            "reviewText": "I use this grinder to grind flax seeds and it works well."
        },
        {
            "reviewerName": "John C.",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Five Stars",
            "reviewDate": "February 3, 2016",
            "reviewText": "Way better than the Black and Decker and cheaper. Small footprint and grinds coffee perfectly."
        },
        {
            "reviewerName": "Darlene Sall",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "quality",
            "reviewDate": "November 29, 2018",
            "reviewText": "Works easily and well. Could over grind"
        },
        {
            "reviewerName": "Alwood",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Funtion",
            "reviewDate": "October 30, 2018",
            "reviewText": "Works well for entended purpose."
        },
        {
            "reviewerName": "Kelly Carpenter",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Awesome grinder!",
            "reviewDate": "March 25, 2018",
            "reviewText": "I've used this for grinding coffee beans, flax seeds, chia seeds, oats into flour, etc. It works great!"
        },
        {
            "reviewerName": "mudge51",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Powerful",
            "reviewDate": "October 16, 2018",
            "reviewText": "For the price, it is good. It is small but powerful."
        },
        {
            "reviewerName": "Amazon Customer",
            "rating": "4.0 out of 5 stars",
            "reviewTitle": "Works well",
            "reviewDate": "May 11, 2018",
            "reviewText": "Cheap price and gets the job done. Easy for storage as well. Just be sure to unplug it before dumping it out or you may lose a finger."
        },
        {
            "reviewerName": "faye boughton",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Five Stars",
            "reviewDate": "March 8, 2018",
            "reviewText": "Solid inexpensive coffee grinder."
        },
        {
            "reviewerName": "Raven",
            "rating": "3.0 out of 5 stars",
            "reviewTitle": "Pretty darn handy though",
            "reviewDate": "March 13, 2018",
            "reviewText": "This product is not irritate so be careful if you use the coffee grinder to mix acrylic nail powder"
        },
        {
            "reviewerName": "Wendy",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Perfect gift",
            "reviewDate": "November 24, 2014",
            "reviewText": "This was bought as a Christmas gift for my grandmother's caregiver who keeps buying whole bean coffee when she does not have a grinder."
        },
        {
            "reviewerName": "Viperone",
            "rating": "4.0 out of 5 stars",
            "reviewTitle": "Small and powerful.",
            "reviewDate": "December 1, 2016",
            "reviewText": "Wow, surprised me just how quick this little baby grinds them beans. Works great. Delivered on time. Thanks Prime!"
        },
        {
            "reviewerName": "Chris Taylor",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Works great.",
            "reviewDate": "February 27, 2018",
            "reviewText": "Great value for occasional use."
        },
        {
            "reviewerName": "Pam K",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Must have",
            "reviewDate": "June 16, 2017",
            "reviewText": "It is so nice to have fresh ground coffee every morning. This grinder works beautifully."
        },
        {
            "reviewerName": "Kathleen Kultys",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Great coffee grinder!!",
            "reviewDate": "February 25, 2018",
            "reviewText": "It worked great. Love it."
        },
        {
            "reviewerName": "zehaye ghebre",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Okay",
            "reviewDate": "March 2, 2019",
            "reviewText": "Okay"
        },
        {
            "reviewerName": "Stargazer",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Nice product and good price!",
            "reviewDate": "February 22, 2016",
            "reviewText": "This is a nice product. I use it to grind Flax Seeds only, it's a little workhorse and the price is right too!"
        },
        {
            "reviewerName": "Harika",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Functional",
            "reviewDate": "December 1, 2018",
            "reviewText": "Very functional"
        },
        {
            "reviewerName": "Shane",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Five Stars",
            "reviewDate": "May 1, 2017",
            "reviewText": "fresh beans, son"
        },
        {
            "reviewerName": "Andy",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Five Stars",
            "reviewDate": "August 14, 2017",
            "reviewText": "works great"
        },
        {
            "reviewerName": "L-Roy Jetson",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "it being black is perfect cause it matches my black and stainless steal stove &refrigerator",
            "reviewDate": "August 4, 2018",
            "reviewText": "it came on time &works perfectly and as described"
        },
        {
            "reviewerName": "Koffi",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Five Stars",
            "reviewDate": "October 28, 2016",
            "reviewText": "this gringder works great. simple and at that price you cant beat it"
        },
        {
            "reviewerName": "Florence Weeble",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Great coffee grinder for the $",
            "reviewDate": "February 25, 2013",
            "reviewText": "I love how compact it is. I do not like wasting counter-top space on bulky appliances. Attractive, sleek design on outside. Grounds beans fine enough for my purpose, and also it's not an expensive item."
        },
        {
            "reviewerName": "JAMESON",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Five Stars",
            "reviewDate": "January 27, 2017",
            "reviewText": "Great for the price."
        },
        {
            "reviewerName": "Amazon Customer",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Five Stars",
            "reviewDate": "March 3, 2018",
            "reviewText": "Has been working perfectly."
        },
        {
            "reviewerName": "Kindle Customer",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Ok already...here's the review I'm being pestered for.",
            "reviewDate": "November 10, 2016",
            "reviewText": "Doesn't work well with fava beans"
        },
        {
            "reviewerName": "eljayalee",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Love it!",
            "reviewDate": "December 8, 2016",
            "reviewText": "This is my first coffee grinder. It works great!"
        },
        {
            "reviewerName": "itsjosidyyy",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "I love this coffee grinder",
            "reviewDate": "May 25, 2016",
            "reviewText": "I love this coffee grinder! It gets quite warm after a couple of usage, but definitely does its job. It's also easy to use so that's a plus!"
        },
        {
            "reviewerName": "Big Al",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "It doesn't take up much space on my counter and is easy to clean",
            "reviewDate": "December 20, 2016",
            "reviewText": "It does the job. I use it every morning and grind about six cups of coffee beans at a time. It doesn't take up much space on my counter and is easy to clean."
        },
        {
            "reviewerName": "Jan from California",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "5 Stars",
            "reviewDate": "July 26, 2016",
            "reviewText": "Works great, does the job of grinding coffee perfectly."
        },
        {
            "reviewerName": "Tim Goshen",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "works great.",
            "reviewDate": "April 13, 2018",
            "reviewText": "As expected. works great."
        },
        {
            "reviewerName": "cassie",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Works",
            "reviewDate": "October 29, 2016",
            "reviewText": "Works great, just what I needed"
        },
        {
            "reviewerName": "gypsyT",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Good value",
            "reviewDate": "November 24, 2015",
            "reviewText": "Have owned this brand/model coffee grinder in the past. Great value. Simple to use."
        },
        {
            "reviewerName": "Kelly F",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "this works great!",
            "reviewDate": "March 23, 2016",
            "reviewText": "I wanted something to turn my dehydrated veggies into a powdered spice, this works great!"
        },
        {
            "reviewerName": "william c freeh",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Five Stars",
            "reviewDate": "February 18, 2017",
            "reviewText": "great little grinder."
        },
        {
            "reviewerName": "JD",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "My 3rd one. I will get it again if ...",
            "reviewDate": "May 8, 2016",
            "reviewText": "My 3rd one. I will get it again if this one get old enough to replace!"
        },
        {
            "reviewerName": "Villam L",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Five Stars",
            "reviewDate": "December 20, 2016",
            "reviewText": "works awesome, at a great price"
        },
        {
            "reviewerName": "fan of Kate Chopin",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Perfect Grinder",
            "reviewDate": "August 8, 2015",
            "reviewText": "I now own two of these grinders. The original grinder was purchased in 2008 and going strong. I just want a back up."
        },
        {
            "reviewerName": "Karen",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Better than so-called automatic grinders",
            "reviewDate": "July 6, 2016",
            "reviewText": "Works great, simple and easy to use and clean."
        },
        {
            "reviewerName": "kallentx",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Five Stars",
            "reviewDate": "February 15, 2015",
            "reviewText": "Ordered these for the hotel and the Guests' absolutely love them! Great quality and a great product!"
        },
        {
            "reviewerName": "kchercmech",
            "rating": "2.0 out of 5 stars",
            "reviewTitle": "Does not hold same amount of beans as the Krups ... Seized up after 25 months.",
            "reviewDate": "March 29, 2015",
            "reviewText": "Does not hold same amount of beans as the Krups, but this is slightly quieter. So far I do not regret the purchase of this machine.\n\nUPDATE - 2 years and 1 month after buying this and it seized up just like the 3 Krups grinders I bought. I dropped this to just 2 stars as it did freeze up; however, it lasted a full year longer than the Krups machines did. I bought a Ambiano grinder from Aldi supermarket for just $12 to replace this Mr. Coffee grinder. The Ambiano holds three more tablespoons of beans too.\n\nIn summary, I had this as a 4 star as it held less than the Krups. Dropped it to two stars as it did last much longer than the Krups, but it did fail in the end."
        },
        {
            "reviewerName": "Lupe G. M.",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Five Stars",
            "reviewDate": "February 15, 2018",
            "reviewText": "Love it. Small but powerful."
        },
        {
            "reviewerName": "Jeff",
            "rating": "4.0 out of 5 stars",
            "reviewTitle": "Four Stars",
            "reviewDate": "August 17, 2016",
            "reviewText": "Works good for the price."
        },
        {
            "reviewerName": "R. LANE",
            "rating": "3.0 out of 5 stars",
            "reviewTitle": "Three Stars",
            "reviewDate": "October 27, 2016",
            "reviewText": "Christmas gifts!"
        },
        {
            "reviewerName": "Philip M. Kruger",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Great brand",
            "reviewDate": "July 2, 2013",
            "reviewText": "I previously had other brands of coffee grinders. I liked how you could take out the top portion and clean them under water. Mr Coffee does not allow you to do that. To clean it, you unfortunately have to use a paper towel. But, Mr Coffee does a superior job in grinding and hopefully it does not burn out as fast as my other models have."
        },
        {
            "reviewerName": "loriv",
            "rating": "4.0 out of 5 stars",
            "reviewTitle": "Four Stars",
            "reviewDate": "June 9, 2017",
            "reviewText": "I've purchased this brand before and it lasted 15+ yrs. I hope this one does the same!"
        },
        {
            "reviewerName": "Tabitha",
            "rating": "1.0 out of 5 stars",
            "reviewTitle": "One Star",
            "reviewDate": "August 24, 2016",
            "reviewText": "The motor already burned up within two months."
        },
        {
            "reviewerName": "FRED DELGADO",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "A FINE GRIND RENDERS MORE COFFEE FLAVOR WITH LESS",
            "reviewDate": "September 13, 2016",
            "reviewText": "GRINDS EXTREMELY WELL ..... A FINE GRIND RENDERS MORE COFFEE FLAVOR WITH LESS VOLUME"
        },
        {
            "reviewerName": "jason tsang",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Five Stars",
            "reviewDate": "May 7, 2018",
            "reviewText": "Perfect for grinding coffee beans."
        },
        {
            "reviewerName": "vogelle",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Five Stars",
            "reviewDate": "January 8, 2017",
            "reviewText": "Works great! Thanks"
        },
        {
            "reviewerName": "B-Fabulous",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Nice grinder. Does just what it should do",
            "reviewDate": "April 5, 2016",
            "reviewText": "Nice grinder. Does just what it should do."
        },
        {
            "reviewerName": "Amazon Customer",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Five Stars",
            "reviewDate": "November 11, 2016",
            "reviewText": "This is a really good coffee grinder me and my wife are enjoying it very much!"
        },
        {
            "reviewerName": "Phil Ecker",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Great Grinder",
            "reviewDate": "October 6, 2013",
            "reviewText": "This is a nice little grinder, I don't grind much coffee because I tend to just use K-cups. But when I brewing fresh coffee this does exactly what I need."
        },
        {
            "reviewerName": "MTalbot",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Five Stars",
            "reviewDate": "March 15, 2017",
            "reviewText": "Gets the job done!"
        },
        {
            "reviewerName": "J. Shuler",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Good as ever",
            "reviewDate": "January 28, 2019",
            "reviewText": "Mr. Coffee holds up"
        },
        {
            "reviewerName": "PC",
            "rating": "4.0 out of 5 stars",
            "reviewTitle": "Four Stars",
            "reviewDate": "February 7, 2017",
            "reviewText": "Works Great. I use this 2-4 times a week. Six months with no issues"
        },
        {
            "reviewerName": "Inquisitive",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Five Stars",
            "reviewDate": "February 28, 2016",
            "reviewText": "Great product, great price!!!!"
        },
        {
            "reviewerName": "3athlt",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Nice grinder, works as advertised",
            "reviewDate": "April 24, 2018",
            "reviewText": "Excellent grinder, works as advertised. Why buy pre-ground beans? Grind your own and taste the difference! No matter what beans you like, I'll put fresh ground beans up against the same exact pre-ground coffee any day and come out on top. You could spend a lot more money on products that do a \"better\" job, but at the end of the day, I believe a grinder should - grind the beans and this little guy does a great job. I definitely recommend this product"
        },
        {
            "reviewerName": "Michelle McLaughlin",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Works as expected.",
            "reviewDate": "January 1, 2016",
            "reviewText": "Works as expected."
        },
        {
            "reviewerName": "Park Lee",
            "rating": "4.0 out of 5 stars",
            "reviewTitle": "Still going strong with this one!",
            "reviewDate": "January 11, 2014",
            "reviewText": "I bought this while ago and it still works great. I enjoy grinding my coffee beans every morning! Make sure you wash it regularly."
        },
        {
            "reviewerName": "Kindle Customer",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Good Design",
            "reviewDate": "July 28, 2014",
            "reviewText": "Like the feature that the removable top cap is larger than the grinder compartment."
        },
        {
            "reviewerName": "jjsharkbait",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Good Traditional Grinder",
            "reviewDate": "April 17, 2015",
            "reviewText": "Replacement item. Just as good as the first."
        },
        {
            "reviewerName": "alicia ann eason",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Five Stars",
            "reviewDate": "June 14, 2016",
            "reviewText": "Perfect"
        },
        {
            "reviewerName": "Barefootmom",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Back to the grind...",
            "reviewDate": "March 23, 2017",
            "reviewText": "Bought this to replace our THIRD burr grinder. We had a Mr Coffee grinder for years for the house, but switched to a burr style grinder because of the amount of beans we grind. Three burr grinders failed within 18 months, so we decided to go back to our \"old reliable\" Mr Coffee. Works great and I love that it's compact. We also use one in our RV. Don't leave home without it!"
        },
        {
            "reviewerName": "patricia danielson",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Five Stars",
            "reviewDate": "March 3, 2016",
            "reviewText": "Perfect"
        },
        {
            "reviewerName": "K. Wilburn",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Does what it is meant to do",
            "reviewDate": "April 8, 2013",
            "reviewText": "Grinds like its supposed to for a very little amount of money. When you grind your fresh beans everyday (the beans are never cheap), it's nice to know that the grinder didn't make your wallet squeal!"
        },
        {
            "reviewerName": "Kathleen Knowlton",
            "rating": "4.0 out of 5 stars",
            "reviewTitle": "Four Stars",
            "reviewDate": "May 4, 2017",
            "reviewText": "reasonably priced and does a good job on the beans"
        },
        {
            "reviewerName": "John Peterson",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Five Stars",
            "reviewDate": "September 30, 2014",
            "reviewText": "Great little machine. The last one lasted for 8 years!"
        },
        {
            "reviewerName": "Miguel Bort",
            "rating": "4.0 out of 5 stars",
            "reviewTitle": "Muy potente",
            "reviewDate": "September 28, 2018",
            "reviewText": "Muy potente"
        },
        {
            "reviewerName": "Sheila Beall",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Good investment.",
            "reviewDate": "August 16, 2014",
            "reviewText": "Very quiet and effective coffee grinder! Good investment."
        },
        {
            "reviewerName": "appgirlNC",
            "rating": "4.0 out of 5 stars",
            "reviewTitle": "Great Coffee Bean Grinder",
            "reviewDate": "December 31, 2011",
            "reviewText": "Love it. Grinds the beans to the consistency I want them. Did have to experiment of few times to make sure all the beans got ground."
        },
        {
            "reviewerName": "Amanda Vickerson",
            "rating": "4.0 out of 5 stars",
            "reviewTitle": "Perfect little grinder",
            "reviewDate": "December 22, 2013",
            "reviewText": "This seems to be sturdily made and is perfect for spices, seeds, & nuts. I give it 4 stars because I wish the blade were removable for easier washing."
        },
        {
            "reviewerName": "Wijobo42",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Five Stars",
            "reviewDate": "August 22, 2014",
            "reviewText": "Perfect for my needs. Is exactly as.advertised."
        },
        {
            "reviewerName": "Midge",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Great little grinder",
            "reviewDate": "May 15, 2014",
            "reviewText": "It's just like our old one which conked out, except black instead of retro silver. It does the job. Takes up little space."
        },
        {
            "reviewerName": "Amazon Customer",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Five Stars",
            "reviewDate": "May 24, 2018",
            "reviewText": "Very quiet considering what it does."
        },
        {
            "reviewerName": "Evelyn Sherwood",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Five Stars",
            "reviewDate": "January 11, 2015",
            "reviewText": "Very pleased, good quality, would buy again!"
        },
        {
            "reviewerName": "gary bussjaeger",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Five Stars",
            "reviewDate": "February 12, 2015",
            "reviewText": "Very happy"
        },
        {
            "reviewerName": "NormalGuy",
            "rating": "1.0 out of 5 stars",
            "reviewTitle": "Bad product. Failed after only 6 weeks.",
            "reviewDate": "December 6, 2016",
            "reviewText": "Worked only 6 weeks. It is just a bad product. Don't waste your time and money.\nThis was my second and last Mr. Coffee grinder. It simply does not worth it."
        },
        {
            "reviewerName": "Delores Eddins",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Five Stars",
            "reviewDate": "August 18, 2014",
            "reviewText": "Works great and quick."
        },
        {
            "reviewerName": "R Danson",
            "rating": "4.0 out of 5 stars",
            "reviewTitle": "Good Coffee Chopper (not a grinder).",
            "reviewDate": "November 12, 2013",
            "reviewText": "I prefer a grinder with variable course ness, but this high speed chopper is effective by length of time. I prefer a finer ground, so I hold it down for 12 seconds."
        },
        {
            "reviewerName": "Kenneth",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Replace a Decade or older exact grinder",
            "reviewDate": "November 27, 2016",
            "reviewText": "Replaced one that's been around the house for years which was more than likely purchased at a thrift store (exact same though other was white). No parking at the thrift store. Not going back there ever again....nor to donate to them....all donations to Salvation now - plus they do with the money what they say. Amazon makes out on this deal. Amazon and other online retailers, unless its an emergency, only the grocery store and 7-11 will be blessed with my presence.\nGlad they still make this one."
        },
        {
            "reviewerName": "Desiree Garcia",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Reliable",
            "reviewDate": "March 9, 2017",
            "reviewText": "Easy to use, easy to clean. Not meant for huge quantities."
        },
        {
            "reviewerName": "Barbara Z. Gunter",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "best price",
            "reviewDate": "December 11, 2014",
            "reviewText": "best price"
        },
        {
            "reviewerName": "feelssogood",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Five Stars",
            "reviewDate": "February 20, 2017",
            "reviewText": "Works great"
        },
        {
            "reviewerName": "Dave Pavlicek",
            "rating": "4.0 out of 5 stars",
            "reviewTitle": "Four Stars",
            "reviewDate": "April 28, 2015",
            "reviewText": "Works great. A little loud, but gets the job done."
        },
        {
            "reviewerName": "Audrey Eve",
            "rating": "4.0 out of 5 stars",
            "reviewTitle": "From whole beans to ground beans like that!",
            "reviewDate": "May 28, 2013",
            "reviewText": "The coffee grinder works great, it produces evenly grinded coffee beans, but it is a little on the noisy side~"
        },
        {
            "reviewerName": "Giacomo",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Five Stars",
            "reviewDate": "March 24, 2016",
            "reviewText": "Gets the job done day in and day out."
        },
        {
            "reviewerName": "dave smythe",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Five Stars",
            "reviewDate": "October 17, 2016",
            "reviewText": "works great"
        },
        {
            "reviewerName": "Lyubov Lyalko Busch",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Five Stars",
            "reviewDate": "November 7, 2016",
            "reviewText": "Easy to use and does what it is supposed to do,"
        },
        {
            "reviewerName": "Michael Calabro",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Five Stars",
            "reviewDate": "January 23, 2016",
            "reviewText": "Came when expected and works great!"
        },
        {
            "reviewerName": "Amazon Customer",
            "rating": "4.0 out of 5 stars",
            "reviewTitle": "Good product. Simple to use but effective",
            "reviewDate": "December 2, 2016",
            "reviewText": "Good product\n. Simple to use but effective."
        },
        {
            "reviewerName": "Grammie Snyder",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Five Stars",
            "reviewDate": "April 2, 2016",
            "reviewText": "Great grinder for the price''"
        },
        {
            "reviewerName": "Jean M. Kuhl",
            "rating": "4.0 out of 5 stars",
            "reviewTitle": "Four Stars",
            "reviewDate": "July 3, 2016",
            "reviewText": "works well, use it every day."
        },
        {
            "reviewerName": "karen hollands",
            "rating": "4.0 out of 5 stars",
            "reviewTitle": "Does the job",
            "reviewDate": "January 22, 2014",
            "reviewText": "This is a simple coffee bean grinder - great for the price. I hope it lasts - no reason to think it won't."
        },
        {
            "reviewerName": "Mary C. Baker",
            "rating": "4.0 out of 5 stars",
            "reviewTitle": "Four Stars",
            "reviewDate": "July 15, 2015",
            "reviewText": "Works great."
        },
        {
            "reviewerName": "Kenny D",
            "rating": "4.0 out of 5 stars",
            "reviewTitle": "Four Stars",
            "reviewDate": "January 9, 2018",
            "reviewText": "works just fine for me. love that fresh ground smell and taste when ever I brew"
        },
        {
            "reviewerName": "Samuel Liberatore",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Five Stars",
            "reviewDate": "June 27, 2015",
            "reviewText": "Awesome grinder, basic, and holds up well. use it daily. Great purchase"
        },
        {
            "reviewerName": "Darryl Rogers",
            "rating": "1.0 out of 5 stars",
            "reviewTitle": "POS",
            "reviewDate": "January 5, 2015",
            "reviewText": "Motor burned up After three months... do not buy."
        },
        {
            "reviewerName": "Libby",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Five Stars",
            "reviewDate": "January 22, 2016",
            "reviewText": "Perfect for everyday use"
        },
        {
            "reviewerName": "Andres Jesus Hernandez",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Five Stars",
            "reviewDate": "September 6, 2014",
            "reviewText": "the best coffee grinder"
        },
        {
            "reviewerName": "moreynj",
            "rating": "1.0 out of 5 stars",
            "reviewTitle": "Junk.........lasted 3 months only",
            "reviewDate": "October 10, 2016",
            "reviewText": "Purchased 3 months ago, and after a number of uses, it no longer works! And I guess thru Amazon, I can't return this poor quality product. My last coffee grinder lasted over 20 years, this Mr.Coffee, 3 months!"
        },
        {
            "reviewerName": "J. Syptak",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "High value",
            "reviewDate": "November 30, 2015",
            "reviewText": "Strong and solid performance."
        },
        {
            "reviewerName": "cyndi",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Coffeekona.com purchase",
            "reviewDate": "March 21, 2017",
            "reviewText": "This is a great grinder. Just the right size and I love the site, Coffeekona.com, that I purchased this through. Tons of items, coffees, etc. Thank you!!"
        },
        {
            "reviewerName": "David W. Whitten",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "this is a nice machine. I dropped my other one and the ...",
            "reviewDate": "July 11, 2014",
            "reviewText": "Oh, this is a nice machine. I dropped my other one and the top cracked, but it still worked. If you get bored, this also works on cannabis."
        },
        {
            "reviewerName": "RudeDog",
            "rating": "4.0 out of 5 stars",
            "reviewTitle": "Very good grinder. I only wish Mr",
            "reviewDate": "November 29, 2016",
            "reviewText": "Very good grinder. I only wish Mr. Coffee would have\npackaged a small brush to clean out the grind bowl of\ngrounds!!"
        },
        {
            "reviewerName": "Electra Caddell",
            "rating": "1.0 out of 5 stars",
            "reviewTitle": "pooped out.......",
            "reviewDate": "June 18, 2015",
            "reviewText": "Used it two times and it stopped working. We bought it because we had one just like it for years and it was great but this one bought from Amazon pooped out right away."
        },
        {
            "reviewerName": "Jordan Beard",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Works well, solid build",
            "reviewDate": "December 2, 2016",
            "reviewText": "Works great, large grinding cup allows for large scoops of coffee at a time"
        },
        {
            "reviewerName": "franklin d eslinger",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Five Stars",
            "reviewDate": "February 13, 2016",
            "reviewText": "Love it"
        },
        {
            "reviewerName": "DK",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Does the job, I'd buy it again.",
            "reviewDate": "February 2, 2017",
            "reviewText": "So I'm a newbie to grinding my own coffee beans, but I LOVE this thing. There is nothing better than freshly ground coffee. Especially if you are a single parent to a toddler and you are a zombie daily! It's not the best in the world to clean, but I figured out if you can let it sit for awhile to let the coffee left dry out some, then wipe it out with a dry paper towel, and use a small brush (even a toothbrush would probably work), then it gets pretty clean. It's a little loud at first, but not for more than a couple seconds."
        },
        {
            "reviewerName": "Amazon Customer",
            "rating": "1.0 out of 5 stars",
            "reviewTitle": "lame",
            "reviewDate": "November 22, 2014",
            "reviewText": "this came broken :( the top doesn't lock onto the bottom of the grinder"
        },
        {
            "reviewerName": "philbee",
            "rating": "1.0 out of 5 stars",
            "reviewTitle": "Bad",
            "reviewDate": "May 8, 2013",
            "reviewText": "Of the 3 different blade grinder brands I've tried, this is not good. I will not wait for this blade to break. Uneven grind size and I find it awkward. Maybe that is because I've been shaking it up and down while running to break the large bean pieces. Bought for the name, but disappointed."
        },
        {
            "reviewerName": "Amazon Customer",
            "rating": "1.0 out of 5 stars",
            "reviewTitle": "Lasted 4 months and did not sufficiently grind coffee beans",
            "reviewDate": "August 22, 2019",
            "reviewText": "Purchased one of these in March, and by August, it was completely kaput. Do not buy one. Just buy ground coffee. You will save yourself many headaches, also because it took nearly two weeks for Mr. Coffee to write me back about customer service. Now, I am out the money and do not have a bean grinder. It probably was used 7 times, by the way. Please save yourself the hassle and buy any other, better-rated grinder, this one is too flimsy, and not well constructed enough."
        },
        {
            "reviewerName": "Doc Holladay",
            "rating": "4.0 out of 5 stars",
            "reviewTitle": "Classic",
            "reviewDate": "December 31, 2012",
            "reviewText": "I bought this same Mr. Coffee Grinder in 1998, and it still works--I just ground a pound of beans with it, in fact. Seriously, 14 years? Who makes devices that last that long anymore? I don't know how many coffee makers I've had since 1998, but I know how many grinders I've owned...1.\n14 years, and it still grinds beans like a champ. 'Nuff said."
        },
        {
            "reviewerName": "D. Rivera",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Grinds Beans Well",
            "reviewDate": "October 19, 2013",
            "reviewText": "I bought the grinder at my local Target for $18 after buying some Organic Coffee Co. whole bean coffee from Amazon. My brother has a Braun coffee grinder that is very similar in style, so I thought why not try the Mr. Coffee version.\n\nIt grinds the beans exactly as I need them for my coffee maker. The longer I hold down the safety-power button the finer the beans are ground. With a 130 watt motor, it is powerful enough to yield any grind you like.\n\nFreshly ground beans make for excellent fresh coffee, and I also use bottled water to ensure the best taste possible. Leave no stone un-turned as \"they\" say. Fresh-brewed french roast coffee with heavy whipping cream and I'm wired for work :)\n\nI made a Youtube video about this Mr. Coffee grinder and a different Mr. Coffee grinder in case anyone would like to see it in action before buying one."
        },
        {
            "reviewerName": "Dr C.",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Excellent, grinds fast and is quiet",
            "reviewDate": "January 20, 2017",
            "reviewText": "I wanted a coffee grinder for temporary use, so I bought the least expensive one that I could find. This model is excellent. The result of my using it temporarily is that I order coffee beans instead of pre-ground coffee. This modest model is quiet, grinds quickly, and grinds completely in a few seconds. I grind enough beans for two refillable pods for my Keurig, and I'm totally sold on using freshly ground coffee after buying this product."
        },
        {
            "reviewerName": "greendragon",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Cheap, but a good automatic grinder",
            "reviewDate": "November 25, 2018",
            "reviewText": "It grinds coffee, and for the price it doesn't do a bad job. I can pulse or continuously grind beans or spices and clean up is pretty easy. I bought this to replace one that we had at work that had broken (same type) and it has done a pretty good job so far."
        },
        {
            "reviewerName": "CCSF prof",
            "rating": "3.0 out of 5 stars",
            "reviewTitle": "Lid cracked",
            "reviewDate": "September 25, 2016",
            "reviewText": "I have this exact model, but bought it elsewhere many years ago. The grinding mechanisms and the motor are still working great, only problem is the plastic lid - it's cracked in so many places. It is currently held it together with electrical tape. Is there any way to avoid this in the future? I'll try being more gentle with it. ... Wonder if Mr Coffee sells replacement parts."
        },
        {
            "reviewerName": "Mephistophocles",
            "rating": "1.0 out of 5 stars",
            "reviewTitle": "Junk",
            "reviewDate": "August 30, 2017",
            "reviewText": "Died, completely, after one use. On the second use, it spun slower and slower and then died altogether. Avoid."
        },
        {
            "reviewerName": "Dawn Hartley",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Mr. Coffee coffee grinder",
            "reviewDate": "December 26, 2016",
            "reviewText": "Bought as Christmas gift for my son. My husband and I had one just like this so I was already familiar with how it worked. He used the the night he got it and was very happy with how it performed. He just needs to get familiar with how to adjust the grind he wants. Would recommend if looking for coffee grinder"
        },
        {
            "reviewerName": "Gman.",
            "rating": "3.0 out of 5 stars",
            "reviewTitle": "LEAVES A MESS ON THE COUNTER",
            "reviewDate": "September 22, 2016",
            "reviewText": "I have one of these that I bought elsewhere. It grinds coffee fine, but it LEAVES A MESS on the counter top. Why does it have to leak ground coffee out of the bottom??\n\nAbsent that, it's a great little grinder for the price."
        },
        {
            "reviewerName": "Diana",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "last a very long time",
            "reviewDate": "March 14, 2013",
            "reviewText": "I bought this grinder in 2002, it just died after very heavy duty use on the average of twice a day every day.\nYou really get your money worth it even if it lasted 2 years, let alone over 10!!\nIt does a great job grinding coffee very fine. Design is great too. I always used a dried brush to clean up the chamber and get the maximum amount of ground coffee.\nI am buying a new one of the same brand. To highly suggested it to"
        },
        {
            "reviewerName": "Nan Barber",
            "rating": "3.0 out of 5 stars",
            "reviewTitle": "We feel that to have any of the 2 green ...",
            "reviewDate": "May 2, 2018",
            "reviewText": "We feel that to have any of the 2 green lights on 24/7 is unneeded. Time will tell as to how long it lasts. Weighs a lot more than our smaller grinder we had (brand unknown). Why? https://www.amazon.com/Mr-Coffee-Electric-Grinder-Black/product-reviews /B00005OTXM /ref=cm_cr_dp_d_acr_sr?ie=UTF8&reviewerType=all_reviews"
        },
        {
            "reviewerName": "Danny Beans",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Simple and durable",
            "reviewDate": "November 15, 2014",
            "reviewText": "I received one of these as a Christmas gift in 2001, and after 13 years of near-daily use, it's still going strong. Operation is simple, and grind size is as consistent as any burr grinder I've ever encountered. On the off chance mine ever dies, I'll be replacing it with the same model."
        },
        {
            "reviewerName": "Rob",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Five Stars",
            "reviewDate": "February 19, 2018",
            "reviewText": "Ours lasted fifteen years. Simple machines, and they do the job."
        },
        {
            "reviewerName": "Brian M",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Five Stars",
            "reviewDate": "May 16, 2017",
            "reviewText": "Grinds coffee beans. That's all it needs to do."
        },
        {
            "reviewerName": "OAT",
            "rating": "1.0 out of 5 stars",
            "reviewTitle": "Grinded poorly for 2 weeks , then died",
            "reviewDate": "March 29, 2014",
            "reviewText": "I realize that $15 is not much but 2 weeks of daily usage and then it dies?\nNever mind the fact that it did grind unevenly, I could have lived with that.\nI don't get it; my parents used their grinder for over 30 years without a problem.\nThen again it was not made in China with cheap parts and cheap labor and no quality control."
        },
        {
            "reviewerName": "new2new",
            "rating": "1.0 out of 5 stars",
            "reviewTitle": "A piece of junk.",
            "reviewDate": "February 2, 2017",
            "reviewText": "A piece of junk. The first grinder stopped working on the second use. Got it replaced. The second one stopped working on the third use."
        },
        {
            "reviewerName": "Richanne",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Great product.",
            "reviewDate": "November 28, 2014",
            "reviewText": "I've had this grinder for over 2 years now and it still looks and runs like it's brand new! It's not too loud and easy to clean."
        },
        {
            "reviewerName": "Paul Klipp",
            "rating": "2.0 out of 5 stars",
            "reviewTitle": "Not durable? These things are fragile!",
            "reviewDate": "May 1, 2003",
            "reviewText": "I went through my first one in four months. The second one burnt out a motor the very first time I used it. With much better models going for just a couple of dollars more, there's no reason to miss a single morning's cup of coffee because of this product. To it's credit, it worked well during its short life."
        },
        {
            "reviewerName": "Kristina",
            "rating": "1.0 out of 5 stars",
            "reviewTitle": "Yes, it grinds..... once",
            "reviewDate": "February 1, 2013",
            "reviewText": "Really, zero stars would be better. The first one actually worked a few times. Then it simply stopped working. Push the button, nothing. I bought another one. You might ask: why? Honestly, I don't know. It is good looking, there were not many choices at the store... I don't know. Big mistake. The second one only worked once. Push the button, nothing."
        },
        {
            "reviewerName": "Gwenvy",
            "rating": "1.0 out of 5 stars",
            "reviewTitle": "One Star",
            "reviewDate": "March 6, 2018",
            "reviewText": "Did any body who brought this product read the disclaimer"
        },
        {
            "reviewerName": "Milasman",
            "rating": "1.0 out of 5 stars",
            "reviewTitle": "Avoid, burns up quickly.",
            "reviewDate": "May 12, 2012",
            "reviewText": "These grinders are weak, read the instructions which will instruct you to wait a minute between grinding coffee beans. If you have one, it will burn the motor out, just a matter of time. Works good if you only grind small amounts, do not grind a full lid full. Went through two of these, total junk!"
        }
    ],
    "title": "Mr. Coffee Electric Coffee Grinder|Coffee Bean Grinder| Spice Grinder, Black",
    "manufacturer": "Mr. Coffee",
    "currentPrice": "$14.96",
    "rating": "4.0 out of 5 stars",
    "totalRatings": "749 ratings",
    "features": [
        "\n         Make sure this fits\n                by entering your model number.\n        \n",
        "Customize the grounds for all your brewing methods from coarse to super-fine.",
        "4- to 12-cup capacity",
        "Safety on/off switch",
        "Cord length: 36\"",
        "Height:6.9\" x Width:3.8\" x Depth:3.8\" , Weight:1.1 lbs."
    ],
    "reviewsAspects": [
        "stopped working",
        "easy to use",
        "easy to clean",
        "french press",
        "job done",
        "every day",
        "paper towel",
        "gets the job",
        "flax seeds",
        "coffee maker",
        "fresh ground",
        "freshly ground",
        "great price",
        "grinder works",
        "little grinder",
        "egg shells",
        "grinds coffee",
        "waste your money",
        "much space",
        "every morning"
    ],
    "qAndA": [
        {
            "question": "Can you adjust for coarse vs. fine grind?",
            "answer": "No adjustment is necessary. It all depends on how long you run it. I use a medium to fine grind and I count to 10 when I run it. I've used several burr grinders that are far more expensive and they tend to clog and some of the grind is fine and some course in the same batch. Right now I'm using a grind-n-brew coffe see more"
        },
        {
            "question": "Can you grind flax seeds to fine powder in it?",
            "answer": "I grind flax seeds in it all the time."
        },
        {
            "question": "Do I have to buy filter cups to use this grinder?",
            "answer": "No"
        },
        {
            "question": "Is this strong enough to crush dry dog food?",
            "answer": "Not made for it; I wouldn't recommend it. I only use it for the most perfect cup of coffee every morning. And I don't even use it for spices although it states it will handle them."
        },
        {
            "question": "In my country the current is 220v, do you have this product manufactured for that current?",
            "answer": "Answer not available"
        },
        {
            "question": "Is this coffee grinder really loud?",
            "answer": "One of the quietest I've ever used. I was pleasantly surprised."
        },
        {
            "question": "Has anyone used for ryo tobacco? how did it work?",
            "answer": "Answer not available"
        },
        {
            "question": "It says electric. whats the source - battery or 120vac?",
            "answer": "plugs into the wall socket- so 120"
        },
        {
            "question": "Is the bean reservoir on this grinder metal or plastic?",
            "answer": "The lower half of the reservoir is metal, the upper half is plastic."
        },
        {
            "question": "where is it made?",
            "answer": "Made in China"
        },
        {
            "question": "Will this grind lightweight herbs? I am needing it fine enough for capsules",
            "answer": "Mr. Coffee will grind fine enough, however, you will have to pulse grind. What I mean is, push the on off button up and down to get the herbs fine enough. The $15 dollar price for the grinder would be worth the try. My opinion!"
        },
        {
            "question": "can you use this with 220 current/",
            "answer": "I would say no. The bottom of the base says 120V. Many items have a range of currents (100-240volts) but this one specifies 120V."
        },
        {
            "question": "Can I use this to make 1-2 cups of coffee?",
            "answer": "Yes..and it works fantastic. Best coffee I ever had"
        },
        {
            "question": "would you recommend for a coarse or extra coarse grind? I want to use it for cold brew.",
            "answer": "Cannot answer that as I only fine grind. It does that very well so probably would be a great for coarse grind as you need.\nHope that helps."
        },
        {
            "question": "Is it a 220 volt?",
            "answer": "110 volt"
        },
        {
            "question": "Will this grind espresso beans?",
            "answer": "It sure will! This grinder can grind all sorts of coffee/espresso beans."
        },
        {
            "question": "Can you grind eggshells?",
            "answer": "unknown"
        },
        {
            "question": "i want to use this to grind coffee for a regular coffee maker nothing fancy, how long do i keep the button pressed? Say about 6 cups?",
            "answer": "Great question, the grind time for your normal peculator would be 9 seconds, the grind time for a drip grind would be 15 seconds and and espresso grind would be 12 to 15 seconds. Thank you!"
        },
        {
            "question": "Does this model have measuring lines on the cup like the old one?",
            "answer": "No it does not. I wish it did but other than that it's a great product."
        },
        {
            "question": "I just ground some course grains and it chipped the lid all around the bottom ... can I get just a new lid?",
            "answer": "Call Mr Coffee customer service. Would think theyll send you a replacement."
        },
        {
            "question": "how many watts it has?",
            "answer": "Answer not available"
        },
        {
            "question": "How loud is it? Can you run it without waking the family up?",
            "answer": "I think it is somewhat loud, but it is significantly less loud if you hold it in your hands rather than have it sitting on the counter. If you need it really quiet, you can always put a towel around it (I've done this when grinding coffee at night)."
        },
        {
            "question": "How much coffee can fit in this grinder?",
            "answer": "About 5-6 cups worth of coffee to grind."
        },
        {
            "question": "where is it made?",
            "answer": "My coffee grinder is made in China."
        },
        {
            "question": "why is black grinder has less cost comparing to white? does it grain indian spices ?",
            "answer": "Sorry, I can't explain pricing policies. And as far as I know, this will grind any dry spices and nuts."
        },
        {
            "question": "Will it grind tiny chia seeds?",
            "answer": "yes It does"
        },
        {
            "question": "Is there any way to wind the cord up into the unit? Or does it always dangle?",
            "answer": "You will not be able to wind the cord up in this grinder."
        },
        {
            "question": "How many Amps speed?",
            "answer": "Answer not available"
        },
        {
            "question": "Do you have to hold the button or is it automatic?",
            "answer": "Hold the button"
        },
        {
            "question": "Can it make chutney or herbs with little liquid?",
            "answer": "I would have to say no as it states, it grinds coffee. Maybe you could go to manufacturers website and ask them."
        },
        {
            "question": "How do I customize the grind for coarse? I pressed the grind for 2-3 seconds and some had find grind while others were still a whole bean.",
            "answer": "Hi\nI dont think you can customize the grind, this simple coffee grinder is mainly for fine - espresso"
        },
        {
            "question": "Is it a burr or blade grinder?",
            "answer": "blade"
        },
        {
            "question": "Does this work with 220V?",
            "answer": "Answer not available"
        },
        {
            "question": "My cover/lid broke. Is it possible to buy just the lid?",
            "answer": "Call Mr Coffee customer service. Would think theyll replace it for free."
        },
        {
            "question": "Will this grind Herb?",
            "answer": "It's a coffee grinder. A blender might do the job!"
        },
        {
            "question": "Can i use it for spices? And is it easy to clean?",
            "answer": "I would think you could grind spices. But, it is not too easy to clean, if you intend to use it for coffee then. The clear top is ok to wash manually, but the inside part with the blades has to be just wiped out. I only use it for coffee for a French press and like that I can control how fine the coffee is ground.  see more"
        },
        {
            "question": "can it grind tortilla chips ?",
            "answer": "Yes I would suppose so"
        },
        {
            "question": "Se puede conectar a 220v directamente? Gracias",
            "answer": "Answer not available"
        },
        {
            "question": "I want a grinder to use daily. I use about 4 tablespoons of grounded coffee daily. This thing is for 4-8 cups of beans (I think)? Is this overkill?",
            "answer": "I hope you mean this grinder is for 4 to 8 cups of coffee. That is more or less accurate.\nI use it for a 4 cup drip coffee maker daily and it does the job. Good inexpensive grinder.\nHope this helps your hunt for a grinder!"
        },
        {
            "question": "what`s the speed of this machine ?",
            "answer": "This Coffee Grinder operates at around 20,000 RPMs with no beans in the chamber."
        },
        {
            "question": "How much beans can it hold",
            "answer": "Up to 11 Tbsp to make 12 cups coffee. Click on user manual in descriptions and it will answer most of your questions. I was pleased with how fine it can grind in seconds."
        },
        {
            "question": "I need to grind coffee and grind herbs and spices, so need one I can thoroughly clean. I don't want to taste cumin in my coffee. Is this cleanable?",
            "answer": "You can clean the cap in with soap and water like washing the dishes but you can't immerse the lower unit in water. You can easily wipe out the grinding chamber though. Maybe even use dish soap on a wet cloth and then use a cloth with water only to remove soap residue."
        },
        {
            "question": "Can I tighten the blades",
            "answer": "We do not recommend to tighten the blades."
        },
        {
            "question": "is there a warranty on this?",
            "answer": "Mr. Coffee"
        },
        {
            "question": "Has anybody used this to grind Bentonite Clay?",
            "answer": "Within 60 days it burned out grinding coffee, so no way for clay."
        },
        {
            "question": "is it plug or battery power?",
            "answer": "This grinder has a plug. Thanks!"
        },
        {
            "question": "Does this grinds spices like cinnamon, cloves, pepper, dry chillies,etc,, ?",
            "answer": "I havent used mine for that but Im sure it will"
        },
        {
            "question": "Does the inside (blade portion) pop out so you can wash it?",
            "answer": "I don't think so."
        },
        {
            "question": "What is the power voltage of this grinder?",
            "answer": "Mr. Coffee products run off of 110/120 Volts."
        },
        {
            "question": "I am interested in only the grinder...does it have it own timer for on and off? is there a manual on/off switch that does not have to be held down?",
            "answer": "No timer. It only runs while you press down on the button that's attached to the lid. The button has to be held down to keep the grinder running."
        },
        {
            "question": "what is the capacity",
            "answer": "It's listed as a 12 cup capacity for a traditional drip coffee maker."
        },
        {
            "question": "What is the minimum amount of beans you can load?",
            "answer": "There is no minimal setting and there is no minimum requirement as far as I know. I bought mine used so I did not receive a manual with the grinder. Maybe it says something in the manual."
        }
    ]
}