{
    "title": "Cuisinart DCG-20BKN Coffee Bar Coffee Grinder, Black",
    "manufacturer": "Cuisinart",
    "currentPrice": "$15.96",
    "rating": "4.3 out of 5 stars",
    "totalRatings": "632 ratings",
    "features": [
        "\n         Make sure this fits\n                by entering your model number.\n        \n",
        "Stainless steel bowl and blades On/Off switch with safety interlock",
        "Transparent cover with measurement markings 2.5oz/70g capacity - enough for 12 cups",
        "Easy-to-clean bowl and lid",
        "Convenient cord storage",
        "Limited 18-month warranty"
    ],
    "reviewsAspects": [
        "works great",
        "french press",
        "easy to clean",
        "works well",
        "easy to use",
        "job done",
        "every day",
        "gets the job",
        "little grinder",
        "highly recommend",
        "great little",
        "make 8 cups",
        "flax seeds",
        "waste of money",
        "coffee maker",
        "burr grinder",
        "grinds coffee",
        "cord storage",
        "coffee grinders",
        "years ago"
    ],
    "productInformation": [
        {
            "Product Dimensions": "4 x 4 x 7 inches"
        },
        {
            "Item Weight": "1.57 pounds"
        },
        {
            "Shipping Weight": "1.65 pounds (View shipping rates and policies)"
        },
        {
            "Manufacturer": "Cuisinart"
        },
        {
            "ASIN": "B00004S9CY"
        },
        {
            "Item model number": "DCG-20BKN"
        },
        {
            "Customer Reviews": "4.3 out of 5 stars\n    632 ratings\n4.3 out of 5 stars"
        },
        {
            "Best Sellers Rank": "#1,706 in Kitchen & Dining (See Top 100 in Kitchen & Dining)\n#4 in Electric Coffee Blade Grinders\n"
        },
        {
            "Date first listed on Amazon": "April 26, 2000"
        }
    ],
    "productDescription": [
        "Pair your coffeemaker with the Cuisinart Coffee Grinder to bring out the freshest flavor from your whole beans. With a simple On/Off switch, you can grind enough 70g/2.5oz of coffee beans to make 12 fresh cups in no time!"
    ],
    "reviews": [
        {
            "reviewerName": "James Morrison",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Can't beat it. Burr shmurr.",
            "reviewDate": "September 4, 2017",
            "reviewText": "I've tried super expensive grinders, butt grinders, auto grinders and I keep coming back to this one. NY Times goes on and on about the need for a burr grinder to get a consistent grind to avoid bitter coffee, but I think that's getting way too laboratory soecific. 99 percent of people won't know the difference. You'll get a consistent (enough) grind out of this if you know what you're doing and give it a little time for trial and error to get a specific grind dialed in. I use a Bialetti Italian press and this grinder helps me make fantastic and consistent coffee all day, every day."
        },
        {
            "reviewerName": "kris10_ch",
            "rating": "3.0 out of 5 stars",
            "reviewTitle": "Study this description closely...",
            "reviewDate": "August 3, 2017",
            "reviewText": "This product Cuisinart DCG-20BK Coffee Bar Coffee Grinder, Black DISCONTINUED BY MANUFACTURER would probably be great if all I wanted to do with it was grind spices. As a coffee grinder, it will only work if you need to grind enough for a 4-cup coffee maker. (The descriptor stating 12-cups is quite misleading.) Also, you can't overfill it with beans--if you do, it doesn't grind at all. AND, the little engine gets pretty hot, which only adds to my frustration at having not just purchased a burr.\n\nMy Cuisinart coffee maker? Now, that's five-star awesome; this little grinder, not so much. BUT, had I read the descriptor more closely, it does give little clues that it might be a little grinder..."
        },
        {
            "reviewerName": "Skyland",
            "rating": "1.0 out of 5 stars",
            "reviewTitle": "Plastic start tab broke at first grind.",
            "reviewDate": "May 27, 2017",
            "reviewText": "Didn't even get to grind one batch. The tiny plastic tab which pushes down the motor start mechanism broke off on the first push. Sending this back same day I got it."
        },
        {
            "reviewerName": "KDA",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Works better than any other coffee grinder I've had.",
            "reviewDate": "March 13, 2018",
            "reviewText": "I was a little startled to see the manual says not to grind spices in it. I decided to do so anyway, since that's what I bought it for. I can't believe how quickly and quietly it pulverizes things like flax seeds.\n\nUpdate: I bought a second one of these, so now I have one for coffee and one for spices. The first one os still going strong. The only way this could be better is if it had a slightly larger, removable cup, so that you could use it for wet and dry grinding. There are some like that on the market, but they have very mixed reviews."
        },
        {
            "reviewerName": "Lee",
            "rating": "4.0 out of 5 stars",
            "reviewTitle": "Bought in 2009",
            "reviewDate": "October 29, 2018",
            "reviewText": "I’m not sure if these are still good, but I bought one in 2009 and it’s still grinding. It gets less use than it used to, and I’ve had to tweak it a little but it still runs strong."
        },
        {
            "reviewerName": "Robert Johnson",
            "rating": "2.0 out of 5 stars",
            "reviewTitle": "The \"bowl\" does not remove for cleaning.",
            "reviewDate": "October 21, 2017",
            "reviewText": "EDIT - After a few months of use I threw it away and bought a new one.\n\nI got used to the bowl that would not remove but the cord storage was UTTERLY MADDENING! It was nigh on impossible to stuff the cord in that little, uh, pouch they provided for it. When I say I threw it away I mean I literally opened my back door and threw it as hard as I could! (I have to go pick up the pieces now)\n\nOriginal post--\nI don’t use these for coffee, I use them for herbs and spices. With my old one, I ran the bowl through the dishwasher, after each use, so my cinnamon did not taste like mustard. (or vice versa) ;) Not a deal breaker by any means but I miss that ability. I DO like having cord storage though!"
        },
        {
            "reviewerName": "Charlie Griffin",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Nice, even grind.",
            "reviewDate": "December 29, 2017",
            "reviewText": "Really like this bean grinder. Stick to coffee beans. The instructions say other things will dull the blades. The bowl is rather small, but I think that actually means the beans grind faster and more thoroughly. I find the grind of a full bowl very fine in about 15 seconds. Highly recommend."
        },
        {
            "reviewerName": "TwoCentsTomlinson",
            "rating": "4.0 out of 5 stars",
            "reviewTitle": "Cuisinart DCG-20BK Coffee Bar Coffee Grinder, Black",
            "reviewDate": "December 9, 2018",
            "reviewText": "Used my coffee grinder this morning for the first time. Worked great. I looked at a lot of different coffee grinders before settling on this particular one and bought this one because of the great reviews. Wonder why Cuisinart stopped making it? That would have been a concern with a larger appliance but since I know better than to expect that this small inexpensive appliance is \"fixable,\" it wasn't a consideration. Hope it holds up as well as people report it does. Fingers crossed."
        },
        {
            "reviewerName": "Sam and Linda",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Basic and super efficient. If your looking for a classic electric ...",
            "reviewDate": "July 31, 2017",
            "reviewText": "Basic and super efficient.\n\nIf your looking for a classic electric grinder this is great. I'm a sort of coffee snob, so I don't use it for coffee (I use a burr grinder instead), but if your looking for a quick and easy spice grinder or for flax seeds, it's great."
        },
        {
            "reviewerName": "Amazon Customer",
            "rating": "2.0 out of 5 stars",
            "reviewTitle": "NOT FOR COFFEE but can be made to work for spices, with a little work.",
            "reviewDate": "December 28, 2017",
            "reviewText": "I tried to use this to grind coffee. IT DOES NOT GRIND COFFEE WORTH A S&$%. But then neither does any other blade grinder I have tried. Finally got a burr grinder and will NEVER go back. However, this grinder can be made to grind spices if you are mechanically inclined. The blade on this and Cuisinart's hand held mixer is blunt and just about worthless.\n\nHowever, unlike their hand held mixer, this blade can be easily removed. Just take a roughly 3/8\" dowel (a stick or handle of a wooden spoon) and place it on the right side of either blade pointed away from you. Now, whack the dowel with a wooden spoon or something. The blade will unscrew counter clockwise. Use a file or a Dremel with a stone and sharpen the blade. Now you have a fair to good grinder for spices.\n\nOne note of caution. DO NOT EVER GET ANY WATER IN THE GRINDING BOWL. The only thing separating the motor shaft from the bearing (actually a bushing) is a felt washer. Get it wet and it stays wet, corroding the shaft and speeding its demise. Also, DO NOT FILL THE GRINDING BOWL MORE THAT 3/4 OF THE WAY FULL (less for hard to grind substances). The full line is where the metal bowl ends and the plastic starts. OVERLOAD THIS CHEAP MOTOR AND IT WILL DIE."
        },
        {
            "reviewerName": "Cheri Adams",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Quality Product",
            "reviewDate": "August 9, 2018",
            "reviewText": "Such good quality. Had one before and was so sad when it broke. Nice quiet motor. Easy to clean with a little brush."
        },
        {
            "reviewerName": "Amazon Customer",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Grinds our coffee as expected. It was my first ...",
            "reviewDate": "January 26, 2018",
            "reviewText": "Grinds our coffee as expected. It was my first time buying a coffee grinder and so I don't have anything to compare it to, but it is fairly quiet and grinds enough beans to make our 8 cups of coffee at one time. I'm not sure how to \"hide\" the cord though and so I just wrap it around the grinder when storing it."
        },
        {
            "reviewerName": "H. Brown",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Perfect grinder for French press coffee",
            "reviewDate": "May 14, 2019",
            "reviewText": "I have wasted so much money on coffee grinders - I use a French press daily to make my cups of coffee and the grinders always grind the coffee too finely for a French press and they create static so the coffee grinds to everywhere.\nI recently stayed at a Airbnb and they had this coffee grinder, I used it and instantly fell in love. With a few quick presses of the triangular button it grinds the coffee beans into coarse pieces perfect for a French press, plus the amount of coffee it grinds is perfect AND no clean up! I dump the grinds straight into my French press for the perfect morning coffee. The price is unbeatable."
        },
        {
            "reviewerName": "JC",
            "rating": "2.0 out of 5 stars",
            "reviewTitle": "I don't know whether that's a defect or whether it is meant to be tilted like that. I don't like it",
            "reviewDate": "July 11, 2017",
            "reviewText": "Bought it two months before we went to South Carolina, intending to use it in our condo there. When we finally used it here in Charleston, it ground the coffee beans OK; but we noticed that the grinder leans forward. It is lower in the front than the back because its front leg appears to be pushed in. I don't know whether that's a defect or whether it is meant to be tilted like that. I don't like it. Maybe that was why it sold so inexpensively, because it was a defective model being pushed off on an unsuspecting customer!"
        },
        {
            "reviewerName": "Paul Peretic",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Awesome grinder!",
            "reviewDate": "April 13, 2018",
            "reviewText": "I got this grinder to grind up my coffee beans. It's very simple to use and doesn't make a ton of noise. Depending on how long you grind, you can adjust how fine your coffee is. Only thing that would make it perfect is if you could take it apart in order to get at your grind a little easier. The blade does get in the way a bit. But I just use a small spoon and it works. Great if you like to grind your own coffee beans."
        },
        {
            "reviewerName": "John",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Great little smaller volume grinder.",
            "reviewDate": "February 23, 2017",
            "reviewText": "This is a great little grinder machine. But, keep this in mind: It grinds a smaller volume at a time (for us this represents less than 10 cups of coffee that we can brew with one helping full of ground beans. There are other grinders like some of the Krups models that grind more beans at a time than this Cuisinart model. For us it works just fine. We keep it packed up and ready to go and use it when we travel."
        },
        {
            "reviewerName": "Luke Kelly",
            "rating": "4.0 out of 5 stars",
            "reviewTitle": "good for one or two people",
            "reviewDate": "December 12, 2018",
            "reviewText": "If you are looking to serve more than three people I would suggest getting another one just in terms of the quantity of beans per usage. I usually need to fill it up two times. My wife and I like our coffee strong. It is easy to use and it is relatively quiet especially if you hold it in your hand when you engage the button to grind the beans vs leaving it on the counter top"
        },
        {
            "reviewerName": "P Diaz",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Replaced a Cuisinart with a Cuisinart",
            "reviewDate": "April 16, 2015",
            "reviewText": "I had one of these for probably 10 years and it finally gave out. I replaced it with a Krups which costs more and, in my opinion, is an inferior product for a variety of reasons. After returning it to Amazon, I immediately replaced my broken Cuisinart with exactly the same one, only 10 years newer. This is a great coffee grinder that stands up over the long haul."
        },
        {
            "reviewerName": "JAHMAKER",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Great value for a excellent coffe grinder.",
            "reviewDate": "January 8, 2019",
            "reviewText": "This a replacement for the old one that finally died. Great coffe grinder,no spills,fine grind to make those expresso."
        },
        {
            "reviewerName": "Joann D.",
            "rating": "1.0 out of 5 stars",
            "reviewTitle": "One Star",
            "reviewDate": "February 15, 2018",
            "reviewText": "Item came used!"
        },
        {
            "reviewerName": "SeeGee",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Great little grinder!",
            "reviewDate": "June 5, 2015",
            "reviewText": "My boyfriend has the same coffeemaker and I really liked it. The Mr. Coffee one I had worked fine but was noisier and seemed to take longer to grind the beans. Also, it is easier to remove all the grounds from the Cuisinart than from the Mr. Coffee grinders. My cat always ran upstairs when I used the Mr. Coffee grinder. Now he still runs but not as far and the Cuisinart grinds in less time so he can return sooner."
        },
        {
            "reviewerName": "Cid Herman",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "I'm very pleased with this purchase .",
            "reviewDate": "December 28, 2017",
            "reviewText": "I'm very happy with this. It does exactly what it is supposed to do and it works great."
        },
        {
            "reviewerName": "L. Moor",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Definitely a Keeper",
            "reviewDate": "September 8, 2018",
            "reviewText": "Second purchase of the same grinder, because my daughter took hers when she moved out of state. Had to get my own, because I couldn't live without it!"
        },
        {
            "reviewerName": "rick",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "provides a quality product for a good price",
            "reviewDate": "September 15, 2019",
            "reviewText": "this is a replacement product for the same item. We have used the original grinder for over 13 years and it finally gave out. We can only hope for a similar lifetime. We used it only for coffee beans."
        },
        {
            "reviewerName": "diverdude",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Can Grind Fine!!",
            "reviewDate": "October 14, 2017",
            "reviewText": "I bought this because my bride and I upgraded to an espresso maker and needed to be able to finely grind our beans. My experience with this product is consistent with the great reviews and I have no problem getting a fine grind for our favorite coffee beverages."
        },
        {
            "reviewerName": "Scott Hoeflich",
            "rating": "1.0 out of 5 stars",
            "reviewTitle": "Motor blew 1st try",
            "reviewDate": "July 24, 2018",
            "reviewText": "Worthless - motor started smoking during the first use."
        },
        {
            "reviewerName": "Macha Drake",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Powerful grinder",
            "reviewDate": "August 27, 2017",
            "reviewText": "I actually purchased this to crush glass into powder. It works great and the blade is holding up well."
        },
        {
            "reviewerName": "NINA",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Worth it.",
            "reviewDate": "September 15, 2019",
            "reviewText": "I'm am always intimidated by devices with fast moving blades, but this one is a piece of cake. It is easy to clean, and does the job. It is definitely worth what you pay for it."
        },
        {
            "reviewerName": "pseudonym",
            "rating": "4.0 out of 5 stars",
            "reviewTitle": "6 years and going strong",
            "reviewDate": "December 8, 2013",
            "reviewText": "held up to daily use for six years. does the job. i use it for a french press, which is a coarse grind, and small capacity, but i've also occasionally did a fine espresso grind. i also don't mind having to grind a second time for a larger pot of coffee.\nUpdate: 1-2 uses per day, 8 years and counting. working perfectly."
        },
        {
            "reviewerName": "K. Jacobs",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Great little grinder",
            "reviewDate": "September 18, 2017",
            "reviewText": "Read all the reviews before I purchased this. If you're making a huge mess with this, you must have tremors or something. It's not hard to get a good grind and get it into your coffee maker without spilling anything. For the price, I'd recommend this in a heartbeat."
        },
        {
            "reviewerName": "K. Elkins",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Perfect Coffee Grinder",
            "reviewDate": "February 9, 2019",
            "reviewText": "This is a perfect coffee grinder, I had bought this to grind up flax seeds, and a different coffee grinder to grind coffee. I ended up switching them and use this one instead and grinds up the grinds just perfectly!"
        },
        {
            "reviewerName": "JILL SHIMKO",
            "rating": "3.0 out of 5 stars",
            "reviewTitle": "Good Product....but",
            "reviewDate": "January 10, 2019",
            "reviewText": "It works fine, except was smaller than I expected. I needed a more commercial use product - this is fine for small family need."
        },
        {
            "reviewerName": "Thomas M. Nathe",
            "rating": "4.0 out of 5 stars",
            "reviewTitle": "Nothing fancy.",
            "reviewDate": "January 8, 2018",
            "reviewText": "Does the job. I'm getting used to how fine I need to grind the coffee beans."
        },
        {
            "reviewerName": "Malinda Lane",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Grinds coffee beans",
            "reviewDate": "September 14, 2019",
            "reviewText": "My dad needed a grinder and this did the trick. Ground up his beans to how he wanted. Coffee made in no time. He's very happy."
        },
        {
            "reviewerName": "tcstenor",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Great little grinder",
            "reviewDate": "March 22, 2018",
            "reviewText": "I use it most for grinding whole spices and herbs. Powerful and fast!!"
        },
        {
            "reviewerName": "krissiecl",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "efficient but imperfect",
            "reviewDate": "October 21, 2019",
            "reviewText": "It's very easy and intuitive to use...except for cleaning. Coffee definitely gets stuck in a lot of little nooks and crannies"
        },
        {
            "reviewerName": "LollieC",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Works great!",
            "reviewDate": "August 12, 2019",
            "reviewText": "I purchased the coffee grinder for grinding dried silver metal clay. I grinds the dried clay to a fine powder."
        },
        {
            "reviewerName": "Judy A",
            "rating": "3.0 out of 5 stars",
            "reviewTitle": "Light weight use.",
            "reviewDate": "March 27, 2017",
            "reviewText": "It does grind beans and that's what I wanted, but the marks for reading the cup measurement is very difficult to read and I can't see how it could hold more than 4 cups at a time, even though it states it can make more than that."
        },
        {
            "reviewerName": "LR",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "perfect to grind a small amount",
            "reviewDate": "July 21, 2019",
            "reviewText": "It works well. This is the third one I have. I use it to grind spices and it is perfect to grind a small amount. Switch to a different product if you need to process larger amount."
        },
        {
            "reviewerName": "K. Mcfeely",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Nice little grinder.",
            "reviewDate": "January 2, 2018",
            "reviewText": "Very nice little grinder for your smaller coffee or spice grinding needs. It is basic, but does the job."
        },
        {
            "reviewerName": "matheojim",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Excellent grinder",
            "reviewDate": "October 8, 2017",
            "reviewText": "This is a great coffee grinder. Great price and performance!"
        },
        {
            "reviewerName": "JB",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Like it",
            "reviewDate": "September 18, 2017",
            "reviewText": "Makes about a1/2 cup ground coffee. Good size"
        },
        {
            "reviewerName": "Leo S",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Great choice for the money",
            "reviewDate": "August 8, 2017",
            "reviewText": "Works well, costs little. I like the blade and cap design. Only thing I don't like is the bulge on the side. Hope this works 20 years like the last one."
        },
        {
            "reviewerName": "Gabianza",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Five stars",
            "reviewDate": "November 5, 2019",
            "reviewText": "As described, works well. And looks really pretty!"
        },
        {
            "reviewerName": "Bruedinger",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Great value",
            "reviewDate": "December 11, 2017",
            "reviewText": "Works great. Zero issues. Fast shipping"
        },
        {
            "reviewerName": "vance ginther",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Works well, is quiet.",
            "reviewDate": "October 26, 2019",
            "reviewText": "I use it to grond the different type of coffee I drink. I can grind for French Press, Espreso, or Pod. It woeks well for all levels of griding."
        },
        {
            "reviewerName": "Jill D.",
            "rating": "4.0 out of 5 stars",
            "reviewTitle": "I works great, but it would be nicer if there was ...",
            "reviewDate": "March 25, 2018",
            "reviewText": "I works great, but it would be nicer if there was an insert that could be removed to pour the ground coffee out of. It would also be easier to get ALL of the coffee out of the grinder and have the ability to wash it."
        },
        {
            "reviewerName": "dana",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "awesome affordable grinder",
            "reviewDate": "November 2, 2017",
            "reviewText": "awesome affordable grinder, the only thing I didn't like is that you can't wash the grinder itself (only the lid), you must clean it with a wet towel but can't pull it put. I still gave it 5 stars because it's not a real mess to clean , and it grinds coffee and even nutmeg like a ninja"
        },
        {
            "reviewerName": "Moon",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Exactly what I was looking for",
            "reviewDate": "December 17, 2017",
            "reviewText": "Looks nice, works great and price is just right.\nHighly recommended."
        },
        {
            "reviewerName": "Homer D. Storkamp",
            "rating": "3.0 out of 5 stars",
            "reviewTitle": "Could be a bit larger",
            "reviewDate": "July 2, 2008",
            "reviewText": "Product works as expected but if you like to make 10 or more cups of coffee at once you will find the grinding chamber too small on this unit. I also don't like the lid which has a plastic inner ring that the coffee beans like to get stuck in. These beans make it tough to close the top so you can engage the start switch and won't get ground up if you do manage to start it. It is also difficult to dump the ground product into the coffee maker as the lid won't hold all the coffee so you have to unplug the unit and tip the whole machine over to empty it. On the plus side unit has plenty of power and has a reasonable quality feel to it."
        },
        {
            "reviewerName": "Chundy",
            "rating": "4.0 out of 5 stars",
            "reviewTitle": "Worked",
            "reviewDate": "September 9, 2019",
            "reviewText": "Bought for grinding chia seeds. Worked perfect"
        },
        {
            "reviewerName": "Minerva Mars",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Excellent Coffee Grinder",
            "reviewDate": "September 26, 2019",
            "reviewText": "Cuisinart...same as it ever was."
        },
        {
            "reviewerName": "OCpillcounter",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "great machine, don't hesitate to place an order on this",
            "reviewDate": "September 5, 2017",
            "reviewText": "this performs job to grind coffee beans perfectly, it's easy to handle, no short chord , easy to clean with a paper towel"
        },
        {
            "reviewerName": "Amazon Customer",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Five Stars",
            "reviewDate": "September 14, 2018",
            "reviewText": "Great product, easy to care for and durable."
        },
        {
            "reviewerName": "Channy",
            "rating": "4.0 out of 5 stars",
            "reviewTitle": "Runs well",
            "reviewDate": "July 19, 2019",
            "reviewText": "Good product but prefer my other one"
        },
        {
            "reviewerName": "Joan S",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Good product",
            "reviewDate": "August 3, 2019",
            "reviewText": "Good product that does a nice job on whole beans."
        },
        {
            "reviewerName": "Amazon Customer",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Nice little grinder",
            "reviewDate": "January 2, 2018",
            "reviewText": "Quieter than most I have used. Frequently buy cuisinart products, so not disappointed in the least."
        },
        {
            "reviewerName": "andy v.",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "perfect",
            "reviewDate": "March 5, 2019",
            "reviewText": "Received the grinder a day early. It does what it is advertised for. Why would you redesign something that works perfectly?\nwhat a great value!"
        },
        {
            "reviewerName": "The Woodsider",
            "rating": "4.0 out of 5 stars",
            "reviewTitle": "Packs a lot of punch, but bean capacity on the smaller size",
            "reviewDate": "June 27, 2017",
            "reviewText": "This grinder has a nice aesthetic design and powerful motor/blade. Only takes a few seconds to make very finely ground coffee. Only drawback is the coffee bean capacity. If you want to make more than a couple cups of coffee at a time, you need to grind multiple batches of beans."
        },
        {
            "reviewerName": "SGrace",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Great gift for a coffee lover",
            "reviewDate": "December 11, 2018",
            "reviewText": "Cuisinart is the best..very simple, easy to use and clean, I use it for dried herbs as well"
        },
        {
            "reviewerName": "Lesley Shaw",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Grind those dried shrooms!",
            "reviewDate": "September 25, 2019",
            "reviewText": "Great for grinding dried shrooms"
        },
        {
            "reviewerName": "Lindy",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Two thumbs up!",
            "reviewDate": "July 10, 2017",
            "reviewText": "It's not as loud as I expected it to be and it grinds 6 scoops in under 30 seconds. I would recommend this grinder."
        },
        {
            "reviewerName": "neil mcdadd",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Of course great for grinding coffee",
            "reviewDate": "April 24, 2018",
            "reviewText": "Of course great for grinding coffee, but I also use it for grinding nuts. It's easy to clean, and doesn't take up much space."
        },
        {
            "reviewerName": "punkindrublk",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "This one works beautifully. Very happy",
            "reviewDate": "February 11, 2018",
            "reviewText": "I've bought 3 grinders here on Amazon and ended up throwing the first two away. This one works beautifully. Very happy."
        },
        {
            "reviewerName": "R. JIDY",
            "rating": "4.0 out of 5 stars",
            "reviewTitle": "You get to Grind your Beans for $20 Dollars",
            "reviewDate": "June 18, 2005",
            "reviewText": "This is the second Cuisinart I own. The motor burned on the first one. I bought the same one as to preserve the Lid from the first one as a Spare. I had the Braun counterpart before and the lid broke on me. The only real complain I have about this unit is the fact that the lid is very dark and you can't see well inside to evaluate the grinding process.\n\nI liked the Braun better as the lid is clear and you can see what's happening inside; this way you can achieve the proper grind without opening the lid to check.\n\nThe Braun has 150 Watt motor while the Cuisinart has 130 W. The Cuisinart looks more modern and sharper. With either you can get a good grind, but I would go with the Braun.....I'm currently considering a Burr grinder, but I can't sell my self that it'll be worth all that counter realstate....I keep my coffee in the fridge, and after grinding it to fine it does not feel hot, maybe warm if I grind to a super fine. From the reviews I read on the Burr Grinders, it looks like a lot more hassle, but what the heck, we love to complicate our lives...."
        },
        {
            "reviewerName": "Savannah",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Good value",
            "reviewDate": "August 9, 2019",
            "reviewText": "Great for grinding for espresso"
        },
        {
            "reviewerName": "GrinNpick",
            "rating": "4.0 out of 5 stars",
            "reviewTitle": "Four Stars",
            "reviewDate": "May 16, 2018",
            "reviewText": "It works great but will only grind enough for 4 to 5 cups at a time."
        },
        {
            "reviewerName": "cagerber",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Thank you",
            "reviewDate": "September 2, 2019",
            "reviewText": "Thank you"
        },
        {
            "reviewerName": "Marie",
            "rating": "3.0 out of 5 stars",
            "reviewTitle": "Not a fine grind",
            "reviewDate": "June 17, 2019",
            "reviewText": "I’m sorry I chose this machine. It will grind quickly, but it does not grind finely enough, even if you persist. If you want expresso grind: avoid. 🙁"
        },
        {
            "reviewerName": "Alyssa",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Great value for money!",
            "reviewDate": "August 7, 2019",
            "reviewText": "This little thing works great."
        },
        {
            "reviewerName": "Heydenise",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Works great",
            "reviewDate": "April 7, 2018",
            "reviewText": "I am on the Trim Healthy Mama diet. I bought this to grind sugar. It works great in making large granules smaller."
        },
        {
            "reviewerName": "Peter H Lefebvre",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Works great. Thanks for the quick shipping",
            "reviewDate": "December 7, 2017",
            "reviewText": "Works great. Thanks for the quick shipping"
        },
        {
            "reviewerName": "heiny arias del orbe",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Buena",
            "reviewDate": "November 6, 2019",
            "reviewText": "Lo fácil de usar aunque un poquito tediosa para limpiar"
        },
        {
            "reviewerName": "D. Baker",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "it does the job",
            "reviewDate": "May 8, 2017",
            "reviewText": "This coffee grinder does just what is supposed to do grind coffee, very simple and efficient; no problems so far."
        },
        {
            "reviewerName": "W.A.Wright",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "grinder",
            "reviewDate": "August 14, 2019",
            "reviewText": "it works"
        },
        {
            "reviewerName": "FRANCIS W. PARNELL",
            "rating": "2.0 out of 5 stars",
            "reviewTitle": "Hard to scoop out the coffee",
            "reviewDate": "March 20, 2019",
            "reviewText": "Grinds well. Hard to get teaspoons out . Blade makes it difficult to get out the coffee. Not easily cleaned.\nBut it grinds well . It is the second one we have had over the years. Inexpensive."
        },
        {
            "reviewerName": "Kathryn",
            "rating": "1.0 out of 5 stars",
            "reviewTitle": "Piece of junk",
            "reviewDate": "November 12, 2018",
            "reviewText": "Broke on the second day. Motor burned out."
        },
        {
            "reviewerName": "J.M.",
            "rating": "2.0 out of 5 stars",
            "reviewTitle": "Something to Keep your Garbage Can Company",
            "reviewDate": "December 6, 2017",
            "reviewText": "Chunky uneven grind threw it in the garbage, you should too!"
        },
        {
            "reviewerName": "The Garveys",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Great Coffee Grinder",
            "reviewDate": "January 18, 2014",
            "reviewText": "I'm not a gourmet coffee drinker - just been drinking coffee for the last \"50\" Years! That said I've tried many different grinders and found this to be easy to use, grinds beans consistently every time, and stays sharp for yeas. Don't waste your money on one of those exotic grinders - keep it simple with this Cuisinart grinder."
        },
        {
            "reviewerName": "Kathy Turner",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Awesome!",
            "reviewDate": "February 17, 2019",
            "reviewText": "THE best grinder, I use mine for herb only."
        },
        {
            "reviewerName": "HUNTERSOLSTICEDRUID",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Excellent buy!",
            "reviewDate": "May 27, 2018",
            "reviewText": "Works beautifully, and handsome too."
        },
        {
            "reviewerName": "CycleGuy",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Five Stars",
            "reviewDate": "July 4, 2018",
            "reviewText": "It really grinds my coffee beans into a nice consistency quickly. It is also easy to clean."
        },
        {
            "reviewerName": "Connie N.",
            "rating": "1.0 out of 5 stars",
            "reviewTitle": "Coffeedrinker",
            "reviewDate": "December 24, 2018",
            "reviewText": "Out of the box was broken. I have used these grinders for years — never an issue. This one seems cheap with parts moving around in the housing."
        },
        {
            "reviewerName": "C. Perry",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "The best grinder out there",
            "reviewDate": "October 22, 2016",
            "reviewText": "The best grinder out there! I ordered this one for my son. My daughter got me one several years ago and it's still working like a champ. So it deserves a place on everyone's shelf! Money well spent!"
        },
        {
            "reviewerName": "Jenny H-B",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Gift to a relative",
            "reviewDate": "August 4, 2019",
            "reviewText": "I gave this as a gift to a relative."
        },
        {
            "reviewerName": "Patrick Marro",
            "rating": "4.0 out of 5 stars",
            "reviewTitle": "Good",
            "reviewDate": "September 30, 2016",
            "reviewText": "Much improved design over previous Cuisinart coffee grinder I used which sold at relatively same price point. Good product. Fairly priced."
        },
        {
            "reviewerName": "YOLANDA A. BANKS",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Best grinder",
            "reviewDate": "September 11, 2019",
            "reviewText": "Lovvvvvve it"
        },
        {
            "reviewerName": "Pineapple",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Great product!",
            "reviewDate": "September 26, 2013",
            "reviewText": "This little coffee grinder is fantastic. I do not use it to grind coffee, I use it to grind spices. I make my own curries from scratch and I needed a little grinder to grind the tiny spice seeds like cumin, coriander and mustard. It is wonderful and all of the women in my family would like one. I already bought one for my mom and I am going to purchase more."
        },
        {
            "reviewerName": "Paul Williams",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "EXCELLENT",
            "reviewDate": "December 17, 2018",
            "reviewText": "Grinder works really well all my coffee needs."
        },
        {
            "reviewerName": "Traci Seaman",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "5 thumbs up!",
            "reviewDate": "July 23, 2018",
            "reviewText": "Works great! I love grinding my own beans!"
        },
        {
            "reviewerName": "hounddog",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Not necessary",
            "reviewDate": "May 13, 2019",
            "reviewText": "Very good small capacity grinder for the price."
        },
        {
            "reviewerName": "tom snyder",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "works great",
            "reviewDate": "January 15, 2019",
            "reviewText": "I use it for spice and it works very well!"
        },
        {
            "reviewerName": "sm",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Five Stars",
            "reviewDate": "June 28, 2017",
            "reviewText": "This is a great little tool! Freshly ground coffee tastes soooooooo much better!"
        },
        {
            "reviewerName": "CreativeBug",
            "rating": "4.0 out of 5 stars",
            "reviewTitle": "Does what is intended",
            "reviewDate": "February 23, 2019",
            "reviewText": "Sleek design, does the job it’s intended to,\nEasy cleaning."
        },
        {
            "reviewerName": "SG",
            "rating": "4.0 out of 5 stars",
            "reviewTitle": "Does the job",
            "reviewDate": "April 15, 2019",
            "reviewText": "It’s decent for grinding beans for a cup or two of coffee. I would give it 5 stars if it was easier to clean."
        },
        {
            "reviewerName": "Kelly Miller",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Awesome",
            "reviewDate": "October 28, 2018",
            "reviewText": "Great product just what we wanted"
        },
        {
            "reviewerName": "Amazon Customer",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Five Stars",
            "reviewDate": "October 12, 2017",
            "reviewText": "These really last - replacing my old one which I used for everyday for 4 years."
        },
        {
            "reviewerName": "NNA ELAEN",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Five Stars",
            "reviewDate": "March 22, 2018",
            "reviewText": "excellent product. powerful grinder. love it."
        },
        {
            "reviewerName": "Heynow",
            "rating": "3.0 out of 5 stars",
            "reviewTitle": "Three Stars",
            "reviewDate": "February 6, 2018",
            "reviewText": "A little small"
        },
        {
            "reviewerName": "J Brooks",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Great coffee bean grinder",
            "reviewDate": "September 24, 2017",
            "reviewText": "Grinds coffee beans perfectly and quickly. No complaints!"
        },
        {
            "reviewerName": "Amazon Customer",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "I grind fresh coffee beans everyday and this grinder is a good one for the price",
            "reviewDate": "September 5, 2017",
            "reviewText": "Met my needs. I grind fresh coffee beans everyday and this grinder is a good one for the price."
        },
        {
            "reviewerName": "Erwin Coffee",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "A solid purchase!",
            "reviewDate": "November 11, 2019",
            "reviewText": "Durable & long lasting. Used as spice grinder as well as coffee grinder. A staple in my kitchen."
        },
        {
            "reviewerName": "S.Hettena",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Still grinding coffee well",
            "reviewDate": "July 13, 2018",
            "reviewText": "Very good product. Lasts for a long time. Had it for years and still grinding very well."
        },
        {
            "reviewerName": "Amazon Customer",
            "rating": "4.0 out of 5 stars",
            "reviewTitle": "Getting the job done",
            "reviewDate": "February 2, 2019",
            "reviewText": "Simply to use"
        },
        {
            "reviewerName": "Peggy Sue",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Supplement to the Kuerig",
            "reviewDate": "May 22, 2017",
            "reviewText": "I have the kuerig 2.0 and I wanted to occasionally grind different beans for coffee. This had worked out perfectly."
        },
        {
            "reviewerName": "Robin",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Love it!",
            "reviewDate": "December 28, 2018",
            "reviewText": "My family and I love the coffee bean grinder. It’s so easy to use and quickly grinds the beans for fresh coffee"
        },
        {
            "reviewerName": "Francine Goodwin",
            "rating": "1.0 out of 5 stars",
            "reviewTitle": "Defective",
            "reviewDate": "October 7, 2019",
            "reviewText": "The product burned out on the first try."
        },
        {
            "reviewerName": "Brian E Day",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Excellent",
            "reviewDate": "May 5, 2017",
            "reviewText": "Great product for the price. I can take coffee or sugar and grind it to a fine powder if needed."
        },
        {
            "reviewerName": "stecar79",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Compact and efficient",
            "reviewDate": "May 21, 2019",
            "reviewText": "I use strictly for coffee beans. Works like a charm. Would highly recommend"
        },
        {
            "reviewerName": "CB",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Five Stars",
            "reviewDate": "July 15, 2018",
            "reviewText": "Love this product. It simple and easy to use."
        },
        {
            "reviewerName": "Steven",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Disappointed with Cuisinart",
            "reviewDate": "February 4, 2019",
            "reviewText": "Motor burned out on the 3rd day, very disappointing for a Cuisinart product. I had a Mr. Coffee grinder for 12 years and I dropped it and broke the lid...otherwise, I would still be using it."
        },
        {
            "reviewerName": "Jeff L.",
            "rating": "4.0 out of 5 stars",
            "reviewTitle": "did what it needs to do",
            "reviewDate": "July 19, 2019",
            "reviewText": "product did what it advertised. I’d read reviews where people complained about not being about to grind beans, but I had no problem at all. Just need to keep beans within the metal area of grinder."
        },
        {
            "reviewerName": "Eddie A.",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Excellent products and last forever.",
            "reviewDate": "March 22, 2016",
            "reviewText": "I bought my first one 8 yrs ago and I'm still using it everyday. Decided to get another one just in case it'll give up on me one of this morning."
        },
        {
            "reviewerName": "Arizona girl",
            "rating": "3.0 out of 5 stars",
            "reviewTitle": "Not recommended",
            "reviewDate": "September 10, 2019",
            "reviewText": "The base makes marks on a laminate countertop and has been returned"
        },
        {
            "reviewerName": "Photocop2011",
            "rating": "4.0 out of 5 stars",
            "reviewTitle": "Deal of the day",
            "reviewDate": "September 28, 2012",
            "reviewText": "I got this because it was on the deal of the day. And sometimes I can find great deals on whole bean coffee and you need something to grind it up. The price was great! I have not used it as of this review, but when I do if it does not live up to what it says I will come back and adjust my review. But it came on time, was packed nice."
        },
        {
            "reviewerName": "Dave",
            "rating": "4.0 out of 5 stars",
            "reviewTitle": "Good quality product and value for money.",
            "reviewDate": "November 5, 2019",
            "reviewText": "I really like this grinder. Use mostly for grinding spices. Gave only 4 stars as ot is little harder to clean compared to my old Mr Coffee grinder. Overall great quality product."
        },
        {
            "reviewerName": "Shari",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Add some spice to your life.",
            "reviewDate": "December 18, 2017",
            "reviewText": "I use this to grind spices and it works wonderfully."
        },
        {
            "reviewerName": "Rattlehead",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Works great",
            "reviewDate": "July 18, 2019",
            "reviewText": "I mostly use it to grind spices."
        },
        {
            "reviewerName": "Ibrahim Nagi",
            "rating": "1.0 out of 5 stars",
            "reviewTitle": "Doesnt grind to espresso or fine levels",
            "reviewDate": "August 18, 2019",
            "reviewText": "the smallest grinding level for this machine is more coarse than anything else - it doesnt grind to espresso or fine levels.\ni used it once and never again."
        },
        {
            "reviewerName": "Seth",
            "rating": "4.0 out of 5 stars",
            "reviewTitle": "Grinds the Beans",
            "reviewDate": "March 14, 2019",
            "reviewText": "simple but effective grinder. no problem with it, but nothing special"
        },
        {
            "reviewerName": "Amazon Customer",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Five Stars",
            "reviewDate": "January 8, 2018",
            "reviewText": "Nice and quiet...and best for the money, in my opinion."
        },
        {
            "reviewerName": "Sandra Lopez",
            "rating": "4.0 out of 5 stars",
            "reviewTitle": "Fine",
            "reviewDate": "June 18, 2019",
            "reviewText": "It is small. I like it. Perfect coffee."
        },
        {
            "reviewerName": "katenyc",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Great Little Grinder - beats the Krups version",
            "reviewDate": "November 6, 2011",
            "reviewText": "Great little grinder. 3 weeks ago I bought the Krups model and instantly hated it b/c the grounds at the bottom get trapped and get ground down to fine dust while the beans at the top are ground course. No such problem with this little gem - because the well is round, not oval, the grinding results in a uniform grind. Great price, looks nice on the counter and not too noisy. I love it."
        },
        {
            "reviewerName": "E. Johnson",
            "rating": "4.0 out of 5 stars",
            "reviewTitle": "Does what it should",
            "reviewDate": "May 9, 2017",
            "reviewText": "Only complaint is that you have to be careful how much you fill the cup with beans or it gets overwhelmed. Otherwise works like a charm for a good price."
        },
        {
            "reviewerName": "ali",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "very good and inexpensive",
            "reviewDate": "December 11, 2018",
            "reviewText": "this one is 2nd one that I am use this model, it works for me single person"
        },
        {
            "reviewerName": "Stiffroot",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Five Stars",
            "reviewDate": "March 29, 2018",
            "reviewText": "Very nice, works great! Much better than my last one!"
        },
        {
            "reviewerName": "Amazon Customer",
            "rating": "4.0 out of 5 stars",
            "reviewTitle": "Four Stars",
            "reviewDate": "January 21, 2018",
            "reviewText": "Works extremely well; cord is a little difficult to push back in."
        },
        {
            "reviewerName": "jana fulton",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Grinder",
            "reviewDate": "July 22, 2019",
            "reviewText": "Love it"
        },
        {
            "reviewerName": "kidatheart",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Grinds coffee bean and other spices very fine the longer you pulse",
            "reviewDate": "March 22, 2016",
            "reviewText": "Grinds coffee bean and other spices very fine the longer you pulse. You can control the size of your grind! Great product!"
        },
        {
            "reviewerName": "Jeff Shapiro",
            "rating": "3.0 out of 5 stars",
            "reviewTitle": "Three Stars",
            "reviewDate": "March 25, 2016",
            "reviewText": "It's slow but does the job when grinding my flax seed."
        },
        {
            "reviewerName": "Micah Lay",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Great grinder.",
            "reviewDate": "January 22, 2018",
            "reviewText": "Great coffee grinder, wish the cord would retract into the housing like our old one did."
        },
        {
            "reviewerName": "jonny p",
            "rating": "1.0 out of 5 stars",
            "reviewTitle": "Not a 12 cup grinder",
            "reviewDate": "October 7, 2018",
            "reviewText": "This grinder will not grind 12 cups. The lid will not fit if you put 12 cups of beans in it. Cuisinart is not the brand for coffee. Cheap Mr. Coffee stuff is way better.."
        },
        {
            "reviewerName": "Sheila K",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Great simple coffee grinder",
            "reviewDate": "April 30, 2016",
            "reviewText": "Great simple coffee grinder! The blades are sharp and the motor is strong. I use it for grinding coffee beans, almonds and seeds."
        },
        {
            "reviewerName": "unclepacci",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Five Stars",
            "reviewDate": "February 14, 2018",
            "reviewText": "Its great for the price."
        },
        {
            "reviewerName": "Dawna Orchard",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Five Stars",
            "reviewDate": "June 1, 2017",
            "reviewText": "Sleek and easy to use! Grind my coffee beans extra fine just as I like it."
        },
        {
            "reviewerName": "Robert N. Daugherty",
            "rating": "4.0 out of 5 stars",
            "reviewTitle": "Four Stars",
            "reviewDate": "April 19, 2018",
            "reviewText": "Works like it is supposed to."
        },
        {
            "reviewerName": "Leslie Cloud",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Five Stars",
            "reviewDate": "June 20, 2018",
            "reviewText": "Works great."
        },
        {
            "reviewerName": "Ali",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Fast ginder",
            "reviewDate": "March 4, 2019",
            "reviewText": "Very quiet and efficient"
        },
        {
            "reviewerName": "Dang Tran",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Work for pepper",
            "reviewDate": "November 24, 2018",
            "reviewText": "I used for pepper. Its product is acceptable."
        },
        {
            "reviewerName": "hashstuff",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Five Stars",
            "reviewDate": "May 28, 2018",
            "reviewText": "works great, perfect replacement"
        },
        {
            "reviewerName": "T. G. Peranteau",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Five Stars",
            "reviewDate": "May 27, 2018",
            "reviewText": "Works perfectly."
        },
        {
            "reviewerName": "Jennie D",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Very efficient and nice looking on my counter",
            "reviewDate": "July 24, 2019",
            "reviewText": "I love the sleek design and black color. This works very well and it’s easy to clean."
        },
        {
            "reviewerName": "Leonardo Dussan",
            "rating": "1.0 out of 5 stars",
            "reviewTitle": "expensive",
            "reviewDate": "August 27, 2018",
            "reviewText": "expensive"
        },
        {
            "reviewerName": "Adam Weeks",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Excellent",
            "reviewDate": "October 3, 2018",
            "reviewText": "We use it every day and it gets the job done nicely"
        },
        {
            "reviewerName": "D. Bielecki",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Five Stars",
            "reviewDate": "August 7, 2017",
            "reviewText": "so far so good"
        },
        {
            "reviewerName": "J. Webb",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Happy family",
            "reviewDate": "August 24, 2011",
            "reviewText": "Not only do I have this grinder but I have bought it for my mom, my sister, and a friend. We drink a lot of coffee so in some households it gets used up to 3 or 4 times a day depending on what is going on. My mom's only complaint is that it is a little noisy. But she used her first one so much that 2 years later the blades wore off. I bought her another one of the same thing. She also bought one for use at work. I have had mine for at least 3 years and if it ever wears out I will buy another of the same. It is affordable and dependable."
        },
        {
            "reviewerName": "J",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "It ground the coffee very nicely, is very similar to my old black&decker that ...",
            "reviewDate": "November 29, 2015",
            "reviewText": "It ground the coffee very nicely, is very similar to my old black&decker that we've had for 15 years and has been used everyday. Looking forward to the same with this grinder"
        },
        {
            "reviewerName": "TRR",
            "rating": "1.0 out of 5 stars",
            "reviewTitle": "Do not buy",
            "reviewDate": "September 25, 2010",
            "reviewText": "Bought two - one for home and one for office. One died in 3 months and the other died in about 18 months.\n\nSuch a shame on cuisinart. I feel let down.\n\nEven when it works, not my favorite for coffee, as the capacity is very small, just good enough for running one round in an espresso machine."
        },
        {
            "reviewerName": "Amazon Customer",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Love it!",
            "reviewDate": "September 24, 2019",
            "reviewText": "Great product!!!!!!!!"
        },
        {
            "reviewerName": "anamaria",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "The price 😊",
            "reviewDate": "September 24, 2019",
            "reviewText": "The product"
        },
        {
            "reviewerName": "dnthv1",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Great product",
            "reviewDate": "September 3, 2018",
            "reviewText": "Grinds to perfection. Quiet and fast."
        },
        {
            "reviewerName": "Jacqueline",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "For coffee lovers",
            "reviewDate": "February 25, 2017",
            "reviewText": "Perfect"
        },
        {
            "reviewerName": "Customer 2000",
            "rating": "4.0 out of 5 stars",
            "reviewTitle": "It works.",
            "reviewDate": "January 1, 2019",
            "reviewText": "Great value. Wish they could design better way to remove ground coffee."
        },
        {
            "reviewerName": "Terry Sommerdyke",
            "rating": "1.0 out of 5 stars",
            "reviewTitle": "Doesn't hold enough beans for a full pot of coffe ...",
            "reviewDate": "May 25, 2017",
            "reviewText": "Doesn't hold enough beans for a full pot of coffe. Have to do 2 batches. If you fill it too full it doesn't grind the beans. It gets hot and starts smelling. Won't buy it again"
        },
        {
            "reviewerName": "Amazon Customer",
            "rating": "1.0 out of 5 stars",
            "reviewTitle": "Burned up on second use!",
            "reviewDate": "November 11, 2019",
            "reviewText": "Awful product, burned up on the second use."
        },
        {
            "reviewerName": "JJJ",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Good value",
            "reviewDate": "February 7, 2018",
            "reviewText": "Works very well."
        },
        {
            "reviewerName": "Paulette Chapin",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Quite love it.",
            "reviewDate": "October 4, 2019",
            "reviewText": "Love it grinds more than my old one."
        },
        {
            "reviewerName": "Mam",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "I recommend you. Simple good product",
            "reviewDate": "July 20, 2017",
            "reviewText": "If you need coffee girder, I recommend you. Simple good product!"
        },
        {
            "reviewerName": "Amazon Customer",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Coffee grinder",
            "reviewDate": "June 18, 2017",
            "reviewText": "Does a great job"
        },
        {
            "reviewerName": "Amazon Customer",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Five Stars",
            "reviewDate": "May 11, 2018",
            "reviewText": "ABSOLUTELY perfect for grinding coffee beans!"
        },
        {
            "reviewerName": "Nana2Syl",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "A Gem of a Little Grinder!",
            "reviewDate": "December 7, 2012",
            "reviewText": "Very happy with this little grinder! Performs just as good as I expected it to do and the price is super! This grinder does way better than a Krups and another brand I bought and returned! Not noisy, easy to operate and wipe clean! Thanks Cuisinart!"
        },
        {
            "reviewerName": "Evdog",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Five Stars",
            "reviewDate": "April 24, 2017",
            "reviewText": "Works like a champ! Nothing like fresh ground coffee every morning."
        },
        {
            "reviewerName": "Julie",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Grinder",
            "reviewDate": "June 19, 2017",
            "reviewText": "Great for grinding flax seed and oatmeal for smoothies."
        },
        {
            "reviewerName": "John VanHuysen",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Five Stars",
            "reviewDate": "June 23, 2017",
            "reviewText": "A gift for someone, but they are okay."
        },
        {
            "reviewerName": "Suzanne S.",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Great product, very reasonable priced",
            "reviewDate": "May 5, 2017",
            "reviewText": "Great product,very reasonable priced, and quick shipping!"
        },
        {
            "reviewerName": "IBart",
            "rating": "4.0 out of 5 stars",
            "reviewTitle": "Four Stars",
            "reviewDate": "December 30, 2016",
            "reviewText": "It does what it is supposed to do."
        },
        {
            "reviewerName": "Schwartzy",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Easy to use. Fresh ground coffee.",
            "reviewDate": "November 10, 2019",
            "reviewText": "Grinding coffee is super easy and now we can have freshly ground coffee every morning."
        },
        {
            "reviewerName": "James P. Meil",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Fine little machine, especially at the price",
            "reviewDate": "May 21, 2017",
            "reviewText": "Fine little machine, especially at the price - over 25 years I have used grinders from Mr. Coffee and Krups, and this is the best."
        },
        {
            "reviewerName": "Vladislav Loenko",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Don’t hesitate! It’ll do the job for a very long time!!",
            "reviewDate": "June 11, 2018",
            "reviewText": "Money well spent!"
        },
        {
            "reviewerName": "hayim ben namer",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Fast shipping",
            "reviewDate": "October 6, 2018",
            "reviewText": "Great item for about 3-5 people coffee in one grind. Small, well designed , great price and same day shipping:)"
        },
        {
            "reviewerName": "Ivy Crossland",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Five Stars",
            "reviewDate": "November 19, 2016",
            "reviewText": "Love this coffee grinder and loved the price too!"
        },
        {
            "reviewerName": "Susan",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Good Buy!",
            "reviewDate": "June 24, 2019",
            "reviewText": "Great product for grinding spices!"
        },
        {
            "reviewerName": "Cass",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "great for taking care of also herbs in the garden ...",
            "reviewDate": "September 18, 2015",
            "reviewText": "all i can say..is buy this..great for taking care of also herbs in the garden u might collect and save..many uses"
        },
        {
            "reviewerName": "IRL STRACHAN",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Good",
            "reviewDate": "October 13, 2019",
            "reviewText": "It gets the job done"
        },
        {
            "reviewerName": "BJ",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Great performance -easy to clean and maintain",
            "reviewDate": "February 5, 2015",
            "reviewText": "This is the second Cuisinard grinder I've purchased - no need to look elsewhere!\nGreat performance -easy to clean and maintain."
        },
        {
            "reviewerName": "Shannon C Laviguer",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "MY FAVORITE KITCHEN ACCESSORY",
            "reviewDate": "September 26, 2019",
            "reviewText": "LOVE THIS PRODUCT GREAT FOR EVERYTHING NOT JUST COFFEE"
        },
        {
            "reviewerName": "Frankie Vail",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Five Stars",
            "reviewDate": "July 14, 2016",
            "reviewText": "works great"
        },
        {
            "reviewerName": "David Shannon",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Great coffeee.",
            "reviewDate": "September 23, 2015",
            "reviewText": "This is second purchase for lake home. We like fresh ground coffee and this does the trick for a good price. Lasts forever."
        },
        {
            "reviewerName": "Akasha",
            "rating": "3.0 out of 5 stars",
            "reviewTitle": "Nice price",
            "reviewDate": "June 9, 2017",
            "reviewText": "The cord is a little shorter than I am used too."
        },
        {
            "reviewerName": "John Sutton",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Five Stars",
            "reviewDate": "April 11, 2018",
            "reviewText": "great"
        },
        {
            "reviewerName": "Tracey Lane",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Love coffee",
            "reviewDate": "October 1, 2018",
            "reviewText": "Great item"
        },
        {
            "reviewerName": "Grandma",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "so good. I dropped the top",
            "reviewDate": "October 22, 2014",
            "reviewText": "SUUUPER FAST! SUUUPER EFFECIENT! Last stop before one with a hopper on top, this is small, compact, so good. I dropped the top, little 'flipper' broke, I still used it holding it together. Good stuff."
        },
        {
            "reviewerName": "Amazon Customer",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Good",
            "reviewDate": "March 15, 2019",
            "reviewText": "Use only for flaxseeds and it works great."
        },
        {
            "reviewerName": "Ed Lake",
            "rating": "4.0 out of 5 stars",
            "reviewTitle": "Nice little grinder",
            "reviewDate": "March 9, 2017",
            "reviewText": "Very nice product for the price."
        },
        {
            "reviewerName": "J. Maxwell",
            "rating": "3.0 out of 5 stars",
            "reviewTitle": "Three Stars",
            "reviewDate": "March 16, 2017",
            "reviewText": "Doesn't grind as quickly as other grinders."
        },
        {
            "reviewerName": "jane arc",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Large capacity, rugged design",
            "reviewDate": "July 26, 2002",
            "reviewText": "This grinder lives in my kitchen right next to my sink. It is subjected to a continual flow of crud coming out of the sink and floods from coffee spills, and sink overflows, flying dough and vegetables, the works. It is extremely sturdy, and does tend to grind my coffee just as I like.\nMy only complaint is that it is a little hard to clean; but then I've never had a coffee grinder that was easy to clean."
        },
        {
            "reviewerName": "Amazon Customer",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "reliable and durable",
            "reviewDate": "June 19, 2019",
            "reviewText": "grinds quickly and relatively evenly"
        },
        {
            "reviewerName": "Peter Wardenaar",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "It just works.",
            "reviewDate": "September 10, 2019",
            "reviewText": "Works like a charm!"
        },
        {
            "reviewerName": "Pat Herlihy",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Solid",
            "reviewDate": "November 1, 2019",
            "reviewText": "Works just fine"
        },
        {
            "reviewerName": "Amazon Customer",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Five Stars",
            "reviewDate": "January 12, 2017",
            "reviewText": "Great herb grinder."
        },
        {
            "reviewerName": "Amazon Customer",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "I had one for over 10 years ran great until I drop it",
            "reviewDate": "April 30, 2018",
            "reviewText": "I had one for over 10 years ran great until I drop it. I have no doubt that this one will be just as great.."
        },
        {
            "reviewerName": "christopher",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Great",
            "reviewDate": "August 23, 2019",
            "reviewText": "Easy to use"
        },
        {
            "reviewerName": "Amazon Customer",
            "rating": "4.0 out of 5 stars",
            "reviewTitle": "Great value for the price.",
            "reviewDate": "May 29, 2018",
            "reviewText": "Loved the ease of use and grinding flow. Grinds smooth without sticking to side leading to uneven coarseness."
        },
        {
            "reviewerName": "Jane Austen",
            "rating": "1.0 out of 5 stars",
            "reviewTitle": "cheaply made. we fixed our old one and keep ...",
            "reviewDate": "June 17, 2018",
            "reviewText": "cheaply made. we fixed our old one and keep this as a backup. not up to the cuisinart name"
        },
        {
            "reviewerName": "RR",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Five Stars",
            "reviewDate": "November 17, 2015",
            "reviewText": "works as advertised had no problems"
        },
        {
            "reviewerName": "Savy Shopper",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Five Stars",
            "reviewDate": "October 8, 2015",
            "reviewText": "Works great and cuisinart last a long time."
        },
        {
            "reviewerName": "wordworker",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "sleek, simple and sharp",
            "reviewDate": "February 1, 2014",
            "reviewText": "Works perfectly, cleans up super easily, and looks lovely with any decor. It will hopefully last a long time; I keep it boxed for that reason."
        },
        {
            "reviewerName": "Zanzarista",
            "rating": "4.0 out of 5 stars",
            "reviewTitle": "Nice Grinder! Finely ground coffee fast.",
            "reviewDate": "August 22, 2016",
            "reviewText": "This is the first coffee grinder I've purchased. PRO: its fast, The coffee has consistent size of grounds when done. It was inexpensive compared with others. CON: I never seem to get all of the coffee out of the grinder, there is always a little bit that sticks in the metal bowl under the cutter and I have to use a finger to get it all out. It's a toss up if I've actually put enough coffee beans in the grinder. There are measuring \"dots\" on the side of the lid that can be used to measure the amount of beans you're adding to the grinder, but with irregular shaped beans, you never know if the measure is to the top or middle of the bean level. Cord storage is an issue, especially before you've had your first cup of coffee in the morning..."
        },
        {
            "reviewerName": "reviewernc",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "does the job",
            "reviewDate": "December 9, 2012",
            "reviewText": "We have tried other pricier grinders but always come back to this one. It's simple and just works so well. It's easy to wipe out with a dry towel. And the price can't be beat."
        },
        {
            "reviewerName": "mikel",
            "rating": "2.0 out of 5 stars",
            "reviewTitle": "Burned out quickly and had to replace.",
            "reviewDate": "February 15, 2016",
            "reviewText": "Burned out after one week of use. Returned."
        },
        {
            "reviewerName": "Philerup",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Great coffee grinder, excellent quality.",
            "reviewDate": "July 5, 2017",
            "reviewText": "Works perfectly. Cleanup is a breeze. I use it everyday and have no problems. It's quite sturdy and solid. Doesn't feel cheap like some other brands. Definitely recommend it."
        },
        {
            "reviewerName": "Brenda Anderson",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Grind Spices",
            "reviewDate": "October 20, 2018",
            "reviewText": "I use this grinder to grind peppercorns Works great"
        },
        {
            "reviewerName": "George Lindsay",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Five Stars",
            "reviewDate": "November 14, 2016",
            "reviewText": "Superb."
        },
        {
            "reviewerName": "Michael P. Mcintire",
            "rating": "4.0 out of 5 stars",
            "reviewTitle": "Works",
            "reviewDate": "March 25, 2014",
            "reviewText": "Not sure I can take up the required number of words to rate this it's a coffee grinder. Easy to use. Makes a mess, if your in a hurry"
        },
        {
            "reviewerName": "Andrew Nelson",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "and is easy to",
            "reviewDate": "July 24, 2018",
            "reviewText": "I have used this product for weeks, and it works very well, and is easy to clean"
        },
        {
            "reviewerName": "Amazon Customer",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Good grinder",
            "reviewDate": "July 1, 2019",
            "reviewText": "Delivered on time. Does exactly what it’s supposed to do."
        },
        {
            "reviewerName": "Michael",
            "rating": "4.0 out of 5 stars",
            "reviewTitle": "Great Little grinder",
            "reviewDate": "December 19, 2009",
            "reviewText": "I've went through several spice grinders nad this one holds to my many demands.\nIt does a nice job of grinding hard and soft spices to the desired grind.\nFor the price its a great tool."
        },
        {
            "reviewerName": "MiriamA_98",
            "rating": "1.0 out of 5 stars",
            "reviewTitle": "Extremely poor design",
            "reviewDate": "July 11, 2011",
            "reviewText": "I recently purchased a Cuisinart Cuisinart DCG-20N Coffee Bar Coffee Grinder, White. I bought it because my Cuisinart Grind and Brew coffee maker did not grind the coffee fine enough for my taste and there is no way to adjust it.\n\nThe DCG-20N coffee grinder is probably the poorest designed coffee grinder I have ever seen. The lid for the grinder fits INSIDE the bowl of the grinder. It is almost impossible to get the lid on once the bowl is filled with coffee beans. You can force the lid on, but then there are coffee beans that are trapped outside the lid between the lid and the casing. Then when you go to pour the ground coffee out, you get some beans that did not get ground at all. Why in the name of all that is sane did you have the lid go INSIDE the casing???\n\nIf I had not already thrown away the box it came in, I would CERTAINLY have returned it!\n\nI bought a Cuisinart grinder expecting a quality product. I certainly did NOT get one with this coffee grinder!"
        },
        {
            "reviewerName": "Carrie",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Great product!",
            "reviewDate": "July 30, 2019",
            "reviewText": "Exactly what I wanted. Easy to use."
        },
        {
            "reviewerName": "Lori Snider",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Five Stars",
            "reviewDate": "February 24, 2018",
            "reviewText": "Grinds my coffee to just the right consistency every time."
        },
        {
            "reviewerName": "Sherudada",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Five Stars",
            "reviewDate": "January 20, 2018",
            "reviewText": "Very handy for chopping up spices like cinnamon, cardamom. I love it ."
        },
        {
            "reviewerName": "Leslie Senter",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Great grindet",
            "reviewDate": "December 20, 2018",
            "reviewText": "Nice grinder! Grind beans evenly, easy to clean, good value."
        },
        {
            "reviewerName": "J. Day",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Five Stars",
            "reviewDate": "July 22, 2015",
            "reviewText": "I have this grinder myself and love it. This was purchased as a wedding girt."
        },
        {
            "reviewerName": "PDJ",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Coffee Grinder",
            "reviewDate": "December 23, 2013",
            "reviewText": "We bought it for a gift basket but have used one before and it is a great grinder I highly recommend it."
        },
        {
            "reviewerName": "Amazon Customer",
            "rating": "4.0 out of 5 stars",
            "reviewTitle": "Practically perfect in every way : )",
            "reviewDate": "February 26, 2017",
            "reviewText": "Good price and good performance. I use it quite often. I didn't rate it 5 stars just because 5 means perfection, and I decided to go conservative. Nevertheless, it is practically perfect in every way : )"
        },
        {
            "reviewerName": "Ethiopia Areda",
            "rating": "4.0 out of 5 stars",
            "reviewTitle": "None",
            "reviewDate": "December 8, 2018",
            "reviewText": "Good item"
        },
        {
            "reviewerName": "Robert Smolen",
            "rating": "4.0 out of 5 stars",
            "reviewTitle": "It is easy to coarsely grind or fine ground coffee",
            "reviewDate": "July 4, 2015",
            "reviewText": "The grinder works very well. It is easy to coarsely grind or fine ground coffee.\nOnly dislike is small capacity. My first grinder had a taller cap that allowed me to grind more beans at one time. Quality is excellent. I expect to be using this for a long time."
        },
        {
            "reviewerName": "mike",
            "rating": "4.0 out of 5 stars",
            "reviewTitle": "Four Stars",
            "reviewDate": "April 7, 2018",
            "reviewText": "Good product but lid came broken in shipping"
        },
        {
            "reviewerName": "ANGRY MAN",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Works well.",
            "reviewDate": "May 20, 2019",
            "reviewText": "Thumbs Up!👍🏾"
        },
        {
            "reviewerName": "MrGhostman",
            "rating": "4.0 out of 5 stars",
            "reviewTitle": "Very good grinder for the price.",
            "reviewDate": "August 8, 2008",
            "reviewText": "This little grinder gets the job done and gets it done well. The capacity may be a bit low, but it's perfect for my little 4 cup coffee maker. If only it was a bit bigger, and the grinder was shaped so that pouring the grinds was a bit easier and cleaner, it would get 5 stars."
        },
        {
            "reviewerName": "Mura Kievman",
            "rating": "4.0 out of 5 stars",
            "reviewTitle": "A nice inexpensive product",
            "reviewDate": "September 26, 2017",
            "reviewText": "Too bad it's been discontinued. I've been using this model for years for grinding coffee as well as spices."
        },
        {
            "reviewerName": "sophie antillon",
            "rating": "4.0 out of 5 stars",
            "reviewTitle": "Don't overfill",
            "reviewDate": "July 23, 2019",
            "reviewText": "Grinding coffee beans"
        },
        {
            "reviewerName": "Pedro",
            "rating": "4.0 out of 5 stars",
            "reviewTitle": "Decent coffee grinder",
            "reviewDate": "May 2, 2019",
            "reviewText": "Not too easy to clean"
        },
        {
            "reviewerName": "Alicia Miller",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Five Stars",
            "reviewDate": "April 3, 2015",
            "reviewText": "I had this model previously, it lasted 20 years."
        },
        {
            "reviewerName": "Eddiegirl",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Small & efficiant",
            "reviewDate": "February 1, 2010",
            "reviewText": "Great coffee grinder. I have had mine for 8 years (older version?) and it is still going strong. Can also be used for spices, but clean well before and after."
        },
        {
            "reviewerName": "Karen Dowd",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Five Stars",
            "reviewDate": "July 14, 2014",
            "reviewText": "Use it every day and it performs well."
        },
        {
            "reviewerName": "Michael A. Wessells",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Grinding 101",
            "reviewDate": "December 27, 2014",
            "reviewText": "Easy to use and clean...the \"go to\" grinder every morning."
        },
        {
            "reviewerName": "Michael Waring",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Grind away",
            "reviewDate": "September 18, 2015",
            "reviewText": "Good grinder works well"
        },
        {
            "reviewerName": "grammalynn",
            "rating": "4.0 out of 5 stars",
            "reviewTitle": "coffee grinder",
            "reviewDate": "September 20, 2013",
            "reviewText": "This was purchased as a birthday gift. Her old one quit working and she needed a new one. Great buy"
        },
        {
            "reviewerName": "Tracy Rose",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Five Stars",
            "reviewDate": "August 20, 2015",
            "reviewText": "A++++++"
        },
        {
            "reviewerName": "BG",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Five Stars",
            "reviewDate": "January 26, 2015",
            "reviewText": "great deal"
        },
        {
            "reviewerName": "Peter",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Five Stars",
            "reviewDate": "December 17, 2014",
            "reviewText": "GRIINDING FOOL"
        },
        {
            "reviewerName": "Strand 3D",
            "rating": "4.0 out of 5 stars",
            "reviewTitle": "Good value in a blade coffee grinder",
            "reviewDate": "December 7, 2015",
            "reviewText": "A little noisy, but gets the job done well. A good value. Compact enough to leave on the counter. For a blade grinder, the particle size was reasonably consistent from coarse to fine."
        },
        {
            "reviewerName": "Amazon Customer",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Perfect Grinder",
            "reviewDate": "June 2, 2017",
            "reviewText": "Works perfectly and completely affordable!"
        },
        {
            "reviewerName": "Amazon Customer",
            "rating": "1.0 out of 5 stars",
            "reviewTitle": "One Star",
            "reviewDate": "September 6, 2017",
            "reviewText": "One of them is broken couple days ago! Electrical motor is really low quality!"
        },
        {
            "reviewerName": "Daniel",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Five Stars",
            "reviewDate": "March 11, 2015",
            "reviewText": "Great Coffee Grinder"
        },
        {
            "reviewerName": "Ravi Vaghani",
            "rating": "2.0 out of 5 stars",
            "reviewTitle": "Two Stars",
            "reviewDate": "July 29, 2015",
            "reviewText": "not as powerful as thought."
        },
        {
            "reviewerName": "MARIA O.",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Five Stars",
            "reviewDate": "July 18, 2016",
            "reviewText": "Fresh ground coffee is the best!"
        },
        {
            "reviewerName": "Amazon Customer",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Five Stars",
            "reviewDate": "December 16, 2017",
            "reviewText": "It works well and easy to use."
        },
        {
            "reviewerName": "Susan Stewart",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Easy to use!",
            "reviewDate": "July 14, 2013",
            "reviewText": "My son ordered this on his own and he uses it all the time so it must be easy to use."
        },
        {
            "reviewerName": "vallito2000",
            "rating": "4.0 out of 5 stars",
            "reviewTitle": "Four Stars",
            "reviewDate": "April 28, 2015",
            "reviewText": "Great"
        },
        {
            "reviewerName": "Kimberly Chandler",
            "rating": "1.0 out of 5 stars",
            "reviewTitle": "Very bad purchase!",
            "reviewDate": "September 22, 2014",
            "reviewText": "This is the absolute worst coffee grinder ever. Seriously do not buy. I have owned several coffee grinders that work a million times better than this one. I love how it is advertised as having a large capacity for coffee beans but you can fit like 3tbs max before it starts steaming and becoming over heated. It's also extremely loud and horribly made. The lid doesn't lock in to place and it feels like its going to fall a part just from holding it let alone grinding coffee beans in it."
        },
        {
            "reviewerName": "F. James Dauphinais",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Five Stars",
            "reviewDate": "September 29, 2017",
            "reviewText": "outstanding"
        },
        {
            "reviewerName": "fulluey",
            "rating": "3.0 out of 5 stars",
            "reviewTitle": "can be made better.",
            "reviewDate": "December 18, 2014",
            "reviewText": "break down after a few years of use. really miss it. can be made better."
        },
        {
            "reviewerName": "porbi",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "size is fancy and I love color of this",
            "reviewDate": "October 3, 2017",
            "reviewText": "Work well, size is fancy and I love color of this items"
        },
        {
            "reviewerName": "Rubina",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Five Stars",
            "reviewDate": "June 28, 2017",
            "reviewText": "Good bye"
        },
        {
            "reviewerName": "Don B H8n",
            "rating": "4.0 out of 5 stars",
            "reviewTitle": "Four Stars",
            "reviewDate": "March 27, 2017",
            "reviewText": "works great, and the price is right."
        },
        {
            "reviewerName": "Tina",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Five Stars",
            "reviewDate": "November 14, 2016",
            "reviewText": "Very easy to install and use! Simple enough to anyone who don't have any grinder experience before!"
        },
        {
            "reviewerName": "Chesslover",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Fantastic product!!",
            "reviewDate": "December 23, 2010",
            "reviewText": "This is a truly FANTASTIC product. It looks exactly like it is in the picture and works as promised. My wife has been repenting as to why she did not discover this product a decade ago. She is now feeling sorry for all the lost time using other products. Superb investment!!!"
        },
        {
            "reviewerName": "Farhan",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "quite useful and inexpensive.",
            "reviewDate": "July 6, 2014",
            "reviewText": "My wife loves it. That's it."
        },
        {
            "reviewerName": "luis machado",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "gracias",
            "reviewDate": "July 14, 2015",
            "reviewText": "muy bien"
        },
        {
            "reviewerName": "AlpenGlow",
            "rating": "1.0 out of 5 stars",
            "reviewTitle": "It broke the second day - and it wasn't big enough",
            "reviewDate": "December 22, 2011",
            "reviewText": "Motor quit the second day! I am not kidding. And as others said, it really wasn't big enough. If you got your 12 cups worth you had to remove the lid over another container because the grounds will spill out. Finally, it is poorly designed with an extra wall in the lid - the only function of which is to capture grounds and beans so you can have trouble cleaning it.\n\nI'm a fool. After buying their combo grinder/maker for our new second home, I gave up cleaning that joke every day and got the seperate maker and grinder of the same brand.\n\nI'm a fool, don't be like me. Buy performance, not looks. Back to Krups."
        },
        {
            "reviewerName": "Amazon Customer",
            "rating": "1.0 out of 5 stars",
            "reviewTitle": "One Star",
            "reviewDate": "June 15, 2016",
            "reviewText": "Burned after 2 weeks"
        },
        {
            "reviewerName": "Melanie",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Coffee's Ready",
            "reviewDate": "September 22, 2012",
            "reviewText": "My husband loves this and uses it daily. We've had it for about 3 years now and it's still working great."
        },
        {
            "reviewerName": "AJ",
            "rating": "1.0 out of 5 stars",
            "reviewTitle": "Don't buy it",
            "reviewDate": "February 9, 2013",
            "reviewText": "It doesn't have enough power to give you a satisfactory grind on coffee beans. It was a waste of money as I had to purchase something else."
        },
        {
            "reviewerName": "diane",
            "rating": "1.0 out of 5 stars",
            "reviewTitle": "product has 1/3 the power of the previous model with the same #",
            "reviewDate": "June 19, 2012",
            "reviewText": "This product sucks, not the same as prevous model with the same #, does Amazon buy cheaper product matching the same product #\nand pass them as the same?. This product has 1/3 the power of the same model #."
        },
        {
            "reviewerName": "Wilbur D.",
            "rating": "1.0 out of 5 stars",
            "reviewTitle": "Stopped working after 6 months",
            "reviewDate": "October 19, 2015",
            "reviewText": "Stopped working inexplicably after only 6 or so months of very light use."
        },
        {
            "reviewerName": "Thomas Sanchez",
            "rating": "1.0 out of 5 stars",
            "reviewTitle": "no power, but I cannot return it because it ...",
            "reviewDate": "July 29, 2016",
            "reviewText": "no power, but I cannot return it because it cost too much, dso I decided to keep it in the trash"
        },
        {
            "reviewerName": "Robert",
            "rating": "1.0 out of 5 stars",
            "reviewTitle": "FAILED IN TWO MONTHS",
            "reviewDate": "March 15, 2002",
            "reviewText": "After two months of use, about twice a week, it stopped working. The warrantee is useless. It would cost about as much to ship it there and back as to replace it. Also, Cuisinart customer service is about as useful as the cable company's customer service."
        },
        {
            "reviewerName": "Amazon Customer",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Product worked as expected...",
            "reviewDate": "April 4, 2017",
            "reviewText": "It did the job."
        },
        {
            "reviewerName": "darjaz",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Cuisinart coffee grinder",
            "reviewDate": "October 17, 2012",
            "reviewText": "Best coffee grinder for the money. Do not buy the Mr. Coffee, it is not nearly as well made for the same money."
        },
        {
            "reviewerName": "Amazon Customer",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Wonderful for those small jobs",
            "reviewDate": "March 8, 2017",
            "reviewText": "Grind and Grind away with this little power packed unit. Wonderful for those small jobs."
        },
        {
            "reviewerName": "Amazon Customer",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Five Stars",
            "reviewDate": "October 21, 2016",
            "reviewText": "Just great--good to be rid of my old one."
        },
        {
            "reviewerName": "Donna",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "good product",
            "reviewDate": "April 2, 2014",
            "reviewText": "I had one of these for many years before it bit the dust. The new one works just as well but seems quieter."
        },
        {
            "reviewerName": "Amazon Customer",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Five Stars",
            "reviewDate": "May 14, 2017",
            "reviewText": "Nice item"
        },
        {
            "reviewerName": "MC",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Five Stars",
            "reviewDate": "October 21, 2014",
            "reviewText": "Awesone grinder.. i use it daily for grinding my spices"
        },
        {
            "reviewerName": "Robin Brawner",
            "rating": "4.0 out of 5 stars",
            "reviewTitle": "Four Stars",
            "reviewDate": "January 31, 2017",
            "reviewText": "Works perfect"
        },
        {
            "reviewerName": "jo ho",
            "rating": "1.0 out of 5 stars",
            "reviewTitle": "Not durable",
            "reviewDate": "April 15, 2015",
            "reviewText": "Machine worked well then the motor (apparently) burned & shorted out when slightly overloaded."
        },
        {
            "reviewerName": "Kindle Customer",
            "rating": "4.0 out of 5 stars",
            "reviewTitle": "Good looking and good value",
            "reviewDate": "March 17, 2015",
            "reviewText": "The grinder works as expected so good value for the money. The only flaw it seems to have is that it has to be carefully cleaned after each use if you don't want ground coffee on your kitchen counter. That's why it didn't get 5 stars. I'm a big Cuisinart fan and this looks great next to all my other Cusinart appliances so I recommend it."
        },
        {
            "reviewerName": "Kurt Osterbusch",
            "rating": "2.0 out of 5 stars",
            "reviewTitle": "Badly designed",
            "reviewDate": "November 26, 2013",
            "reviewText": "My wife recently broke ours, after about three months of use. It did not surprise me that she dropped it, considering how badly designed it is. Its diameter is too big to comfortably grip in one hand, especially with the portion sticking out along the right edge. The top does not fit very well, allowing it to easily fall off (and break) unless the grinder is held perfectly upright. The grinder bowl only holds about 8 scoops max of beans (8-10 cups of coffee), and when full, the blade struggles to work through the beans, leaving some unground near the top."
        },
        {
            "reviewerName": "Mary P. Deprez",
            "rating": "1.0 out of 5 stars",
            "reviewTitle": "Bad design/good looks",
            "reviewDate": "February 6, 2010",
            "reviewText": "great look but very bad design....just the tiniest \"thing\" that engages the motor when you push the button down.....worked 3 times then failed to connect. I have a 10 year old \"Mr. Coffee\" that does extremely well, although it has high EMF's and to keep my hand away from the strong EMF's I use the butt end of a wooden spoon to push down the button while grinding coffee....."
        },
        {
            "reviewerName": "Chris Brown",
            "rating": "3.0 out of 5 stars",
            "reviewTitle": "The basin for the beans needs to be bigger...",
            "reviewDate": "December 28, 2012",
            "reviewText": "This product is just OK - it works, but you can barely get the top back in when you put the beans in...."
        },
        {
            "reviewerName": "Susan Phillips",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "perfect little gadget",
            "reviewDate": "November 14, 2012",
            "reviewText": "This is a fine little grinder. What I like about it, is that it gets the job done and doesn't take up much counter space. It works perfectly."
        },
        {
            "reviewerName": "Alisha",
            "rating": "1.0 out of 5 stars",
            "reviewTitle": "Arrived completely broken",
            "reviewDate": "May 17, 2013",
            "reviewText": "The packaging did not appear to be damaged, but when I opened the actual product, it fell apart into at least 10 pieces! I figured okay, let me put it back together, but it was so irreparably damaged, that the pieces were not fitting together either. Not only that, the housing had also fallen apart, and the motor mechanism and wires were all totally visible and exposed. The product seems to have good reviews, so I'm going to call this a one-off, but still such a disappointment. Returning and ordering a similar one (the Krups one)."
        },
        {
            "reviewerName": "Jenny",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "great value",
            "reviewDate": "December 10, 2012",
            "reviewText": "This is a great product for the cost. It works very well and is easy to use. I'm loving my freshly ground coffee!!"
        },
        {
            "reviewerName": "Jeff",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Great Product!",
            "reviewDate": "September 7, 2013",
            "reviewText": "Excellent inexpensive and powerful grinder for coffee beans or grinding spices. I own two. One for spices and one for coffee."
        },
        {
            "reviewerName": "Mary",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "cuisinart coffee grinder",
            "reviewDate": "September 15, 2012",
            "reviewText": "This is a great coffee grinder. I use it all the time, especially for herbs. I don't know why I never purchased one before this."
        },
        {
            "reviewerName": "Allenbui",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Five Stars",
            "reviewDate": "December 29, 2014",
            "reviewText": "Like it"
        },
        {
            "reviewerName": "Philip M61",
            "rating": "1.0 out of 5 stars",
            "reviewTitle": "I am sorry to have purchased this on Cuisinants name ...",
            "reviewDate": "May 28, 2016",
            "reviewText": "I am sorry to have purchased this on Cuisinants name -poor brining ability and too small for. 12 cup pot. I am looking for another one and it will not be a Cuisinant."
        },
        {
            "reviewerName": "Sue Lamkin",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "works great!",
            "reviewDate": "January 5, 2015",
            "reviewText": "Would buy again, works great!"
        },
        {
            "reviewerName": "D. Maxwell",
            "rating": "1.0 out of 5 stars",
            "reviewTitle": "Disappointing purchase",
            "reviewDate": "December 26, 2016",
            "reviewText": "I had a Krups coffee grinder for 20 years so when it died I thought, \"Why not try Cuisinart?\" Well, unlike my food processor and coffeemaker, which serve me well, this Cuisinart product is a colossal disappointment! Unfortunately my window for return passed due to my busy life and I am stuck with the dang thing, but wow, what a weenie power level, what a small volume of beans it holds and Heaven forbid you overfill it, .....the beans on the top will not be ground and you end up dumping it into a bowl and re-grinding the bath a half at a time. A time burning, mess-making ineffective appliance! I gave it one star because it does, eventually, grind the coffee and its design is attractive but I DO NOT RECCOMMEND PURCHASING THIS MODEL,"
        },
        {
            "reviewerName": "36 Megapixels",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Grinder really works well",
            "reviewDate": "January 3, 2007",
            "reviewText": "I use this to grind nuts and seeds. Works really well. Nice design."
        },
        {
            "reviewerName": "customer",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Five Stars",
            "reviewDate": "September 28, 2016",
            "reviewText": "Perfect morning flax seed grinder!"
        },
        {
            "reviewerName": "doorduty",
            "rating": "1.0 out of 5 stars",
            "reviewTitle": "didn't work",
            "reviewDate": "June 10, 2017",
            "reviewText": "delivered on time. I said hey I'll wait to try it at my cottage. I took it out and presto, it didn't work. waited to long so now i have to contact cuisanart."
        },
        {
            "reviewerName": "Moff",
            "rating": "2.0 out of 5 stars",
            "reviewTitle": "110v Only",
            "reviewDate": "September 21, 2012",
            "reviewText": "If purchasing outside of the USA, be warned. This unit only runs on 110v.\nNowhere in the description does it mention the voltage requirements."
        },
        {
            "reviewerName": "Sara Perugini",
            "rating": "1.0 out of 5 stars",
            "reviewTitle": "Keep in mind based on my experience...",
            "reviewDate": "April 22, 2016",
            "reviewText": "Defective on delivery and buy the time I decided to finally use it, return window expired. Recommend buying appliances in person..."
        },
        {
            "reviewerName": "Duane E. Halpape",
            "rating": "1.0 out of 5 stars",
            "reviewTitle": "Poor reliability is probably the reason Cuisinart stopped making it",
            "reviewDate": "February 17, 2017",
            "reviewText": "Stopped working after two weeks of operation. Poor reliability is probably the reason Cuisinart stopped making it."
        },
        {
            "reviewerName": "Happy in Atlanta",
            "rating": "1.0 out of 5 stars",
            "reviewTitle": "Defective! SO disappointed...never buying Cuisinart AGAIN!",
            "reviewDate": "March 5, 2012",
            "reviewText": "I was so excited to get my Cuisinart grinder today so that I can grind the Turkish coffee I received from a friend. Upon taking the grinder out of the box, I heard a rattling noise. After plugging it in, it did not work! I'm never ever buying another Cuisinart product again!"
        },
        {
            "reviewerName": "steve erikson",
            "rating": "1.0 out of 5 stars",
            "reviewTitle": "One Star",
            "reviewDate": "August 16, 2017",
            "reviewText": "i returned it"
        },
        {
            "reviewerName": "Eddie F. Thomas",
            "rating": "4.0 out of 5 stars",
            "reviewTitle": "Four Stars",
            "reviewDate": "December 1, 2015",
            "reviewText": "Great buy"
        },
        {
            "reviewerName": "Lakshmi Sundarrajan",
            "rating": "1.0 out of 5 stars",
            "reviewTitle": "Dead after 3 uses",
            "reviewDate": "April 4, 2014",
            "reviewText": "Dead just after 3 uses in 45 days. Started smoking. Tried to return this item but Amazon web page showed this item cannot be returned after a month. Don't buy."
        },
        {
            "reviewerName": "Amazon Customer",
            "rating": "1.0 out of 5 stars",
            "reviewTitle": "Waste of money!",
            "reviewDate": "August 5, 2018",
            "reviewText": "The product was completely damaged. The blade was out the machine and it looked like someone put together a lego piece!"
        },
        {
            "reviewerName": "Berta and Brian McGann",
            "rating": "1.0 out of 5 stars",
            "reviewTitle": "One Star",
            "reviewDate": "April 29, 2016",
            "reviewText": "Smelled like wires were burning up the first time I used it"
        },
        {
            "reviewerName": "Jean C. Lachkar",
            "rating": "4.0 out of 5 stars",
            "reviewTitle": "Four Stars",
            "reviewDate": "March 7, 2015",
            "reviewText": "Nice and fast delivery"
        },
        {
            "reviewerName": "neli alishan",
            "rating": "1.0 out of 5 stars",
            "reviewTitle": "One Star",
            "reviewDate": "August 10, 2017",
            "reviewText": "It arrived with the top broken."
        },
        {
            "reviewerName": "HiMyNameisMikeHowareYou",
            "rating": "1.0 out of 5 stars",
            "reviewTitle": "Cool.",
            "reviewDate": "December 5, 2017",
            "reviewText": "Died after 3 months. Cool."
        },
        {
            "reviewerName": "Sandra A.",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Five Stars",
            "reviewDate": "July 19, 2015",
            "reviewText": "Great Delivery and product. Thanks"
        },
        {
            "reviewerName": "Sloppy Joe",
            "rating": "1.0 out of 5 stars",
            "reviewTitle": "Now this is bad.....",
            "reviewDate": "June 2, 2014",
            "reviewText": "I've used and owned a few coffee grinders over the years and I was given this one as a gift from my gf.How can I politely say horrible gift without being \"shut out\".Firstly and foremost of it's problems is it is not high capacity.It does not grind for 12 cups unless you prefer really weak coffee.The capacity is very small,maybe 7 cups and transporting the ground coffee and inserting it into your coffee filter takes dexterity and magic as when you lift the top to pour,coffee grinds spill all over your countertop,wasting most if not all of your precious ground coffee.Also,if the top is not securely placed,it will not grind and if you put too many beans,they will just spin around without being ground....which leads to the first problem of sweeping up your unground coffee.Funny that I purchased a $10 no-name grinder with a large capacity cup 12 years ago that never let me down.Ah,those were the days of quality and endurance.Anyway I shelved the cuisinart and bought the Mr.Coffee( -IDS55-4-Grinder-White) instead.....love it!"
        },
        {
            "reviewerName": "HalfGeek",
            "rating": "1.0 out of 5 stars",
            "reviewTitle": "I've owned a coffee grinder for decades, do NOT buy this piece of junk",
            "reviewDate": "December 31, 2013",
            "reviewText": "I cannot state strongly enough how quickly you should run from this piece of junk. I've owned coffee grinders for decades - mine is a German brand (update: just checked, mine is a Siemens, and I don't find them anymore on Amazon, which is too bad) - and we just got this model at my mom's house. It simply doesn't work. Isn't strong enough. Doesn't hold enough coffee. The blade isn't sharp enough. And then it started smoking from the \"overwork.\"\n\n1. This holds far fewer coffee beans than my German model. Which is a problem when you're using a cafetiere that requires a decent amount of ground coffee. Again, compared to my other model, this holds far less coffee.\n\n2. Either the blade isn't sharp enough, or fast enough, or the motor isn't strong enoug, but it simply wouldn't chop up the beans fully. I was going to attach a photo of what it did to my Jamaica Blue Mountain beans after about a minute of grinding (which entailed the machine constantly stopping and me constantly sticking my finger in there to unjam the blade), but I seem to have lost that option in these reviews. Suffice it to say I had chunks of coffee grounds throughout - this stuff didn't even look like Folgers, let alone halfway to espresso, which is how I like my coffee. There were huge chunks of beans in there, a lot of them. It's not that the device doesn't work well, it doesn't work - period.\n\n3. It start smoking after a few minutes of unjamming the thing and trying to continue grinding the beans.\n\nI have owned similar devices for decades. This thing is a piece of junk. It even feels like a piece of junk - very lightweight, in a bad way. At it most basic level, grinding coffee, this thing failed. It simply didn't grind the coffee at all. I'm really disappointed that Cuisinart would put its name on something like this. (I tried to find out where it's made, but it wasn't entirely clear from the box.)\n\nYou can check my other reviews, I don't pan everything. This, however, is a piece of garbage. Run, don't walk, to another brand as fast as you can. It's not worth twenty bucks. It's not worth two bucks. It simply doesn't work.\n\nUPDATE: It's dead. Mom just tried using it, and the thing is dead. Mind you, we used this thing once, followed the instructions about not putting in too much coffee (mind you, my german brand has no such rules), and it smoked and went to coffee grinder heaven."
        },
        {
            "reviewerName": "Shneemy",
            "rating": "1.0 out of 5 stars",
            "reviewTitle": "This product grinds my gears-- far better than its blade",
            "reviewDate": "December 22, 2018",
            "reviewText": "I had the Krupps grinder for literally fifteen years before the bottom came undone. I didn't feel like taping it for an item that only cost me $10 to begin with. I bought the Cuisinart because the Krupps is black, and I wanted a white grinder to match my kitchen. I do like the design of this product for some odd reason, it's a shape that it's a little more appealing to the eye than the Krupps. Yet I would soon discover how little that matters, and more to the point, how utterly inferior this product is. When I tried filling the already small cabin with beans, it wouldn't properly grind. I was forced to do it one half at a time. Then, this morning, only a week after arrival, it stopped working entirely. An odd smell emanated from it. I concluded that it was the motor slightly burning. I took out the beans, and lodged on each side of the inner cabin, between the blade and sides, was a half ground bean, preventing the blade from propelling. Not once in fifteen years did this happen with my Krupps. The motor is weak, or the blades are not sharp, or some combination thereof, and I have neither the time nor the caffeine-less inclination to investigate further. I am returning it, and getting a brand new Black Krupps that doesn't go in my kitchen. It's color to perfectly match my heart's sentiments about this deeply disappointing product."
        },
        {
            "reviewerName": "S. A. S.",
            "rating": "2.0 out of 5 stars",
            "reviewTitle": "Get something else",
            "reviewDate": "May 7, 2018",
            "reviewText": "While this coffee grinder technically works, it has a number of serious flaws. I have used a number of coffee grinders over the years, and I don't like this one at all. The resevoir is too small to make a pot of coffee so you have to grind two batches for a full pot. It is also way too time-consuming to get the grind fine enough even for a decent pot of drip coffee.\n\nIf you like it weak and make a very small pot, like 2-4 cups, this will work. Most people who use a coffee grinder for any reason will want something better."
        },
        {
            "reviewerName": "R. Harrison",
            "rating": "3.0 out of 5 stars",
            "reviewTitle": "Choose another grinder",
            "reviewDate": "November 29, 2012",
            "reviewText": "I live in Guatemala and don't have many choices and shipping is prohibitive so I bought this Cuisenart off the shelf of a depratment store with some sense of confidence in the Cuisenart label since I have their food processor and it's the best bang for the buck imaginable. I had been borrowing a friends ProtorSilex and for a blade grinder it let me make a decent cup of coffee. (It's hard not to get a good cup here in the western highlands of Guatemala .. eat your hearts out :-) Any way this things lid just sucks. I'm only grinding about 3/8 of a cup of beans at a time (for a 16oz cup.. if anyone has a recommendation for the amounts of beans to use per 8oz of water I'd appreciate it) The advert says grinds enough for 12 cups.. No freaking way unless you're serving in Demitasse cups.\nAs far as the lid, I have yet been able to pour my grounds into a 600ml french press without getting grounds on the counter. The ProcterSilex was no problem. The Cuisenart has some kind of chamber around the main chamber for the grounds and grinds get in there and then spill out. The PS I borrowed poured clean.\nAlso this thing has about 3 times the residue on it compared to the PS machine. That may be because it is grinding finer than the PS. I'm going to work on pulsing the machine to make a courser grind and this observation may change. The Cuisenart also advertised that it had storage for the cord. There some hollow space in the body of the machine which I can carefully slip about half the chord into but if this is what they meant, dream on. The PS you just twisted the base and the chord retracted into .. nice."
        },
        {
            "reviewerName": "D. Ross",
            "rating": "1.0 out of 5 stars",
            "reviewTitle": "Noisy, weak and ineffective",
            "reviewDate": "August 18, 2012",
            "reviewText": "I purchased this grinder to replace my 20+year old Braun whose cord had come apart (it still works). The smaller Braun can easily grind a 12 cup pot, fast and effectively. This machine on the other hand is quite a bit larger and when I attempted to grind enough beans for a strong 10 cup pot, the blade quit spinning several times and after enough fooling around it chopped them up, but one could hardly call it a ground bean, it looked more like grass clippings.\n\nI doubt this thing will last very long after watching it literally stop working with a full load of beans to grind. I now use it for a small afternoon pot of coffee, half full of beans it will eventually produce a \"ground\" bean product. Another annoyance is its shape, difficult to hold on to especially early in the morning if you happen to have a touch of arthritis.\n\nNOT worth even the $13 it is advertised for on here.\n\nUPDATE: If I could give it less than one star, I would. After putting up with this grinder for a brief period, I moved it to my RV to take on trips a couple of times a year, and moved my now 24 year old Krups grinder back to first string. This terrible product worked on the first trip, in its own feeble way, chopping up, shredding beans enough to make a couple of cups of strong coffee. Now, six months later, the beans jam the blades each time you attempt to fill it beyond the height of the shallow metal cup. I'm ordering another Krups this week before they change the style of that machine. Don't waste your cash on the Cuisinart."
        },
        {
            "reviewerName": "Lillian T.",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Never tried it for coffee, but it's great as a spice/nutmeat grinder...",
            "reviewDate": "October 14, 2011",
            "reviewText": "The mother of a good friend of mine included this grinder in a gift basket she gave me at my bridal shower. I don't really drink coffee and my husband isn't the type to grind his own beans, but I quickly found a good use for this little gadget in the form of grinding fresh spices and nuts, as well as making confectioner's sugar (\"why would you make your own powdered sugar?\" you ask. Because I don't eat refined sugar and, as far as I know, you can't buy raw/unrefined confectioner's sugar - but if anyone knows where you can, please tell me!). You can only grind about 1/2 a cup at a time, but that hasn't really been a big issue to me, although I can see where it would be if you're trying to grind coffee for several people in a timely manner. I've even found that although the bowl of the grinder isn't removable, I can rinse it off at my sink without adverse consequences. Now, I wouldn't try fully immersing the unit in water or anything like that, but rinsing the inside out isn't going to short the motor. It isn't terribly noisy, but it's not whisper quiet either...I mean, you're grinding solid objects into powder, some noise is to be expected. I've had this particular grinder for six years, and the motor is still in great working order, and the blades are still pretty sharp. When this one gives up the ghost, I'll definitely buy the same model again."
        },
        {
            "reviewerName": "Bennet Vis",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Very good for a blade grinder",
            "reviewDate": "February 24, 2014",
            "reviewText": "I had this coffee grinder for about 5 years before dropping it on the ground from about 6 feet up and breaking the lid. I looked around on amazon and ended up buying a Krups coffee grinder to replace it. After using the Krups for about 2 weeks, I miss my Cuisinart! A true (if somewhat trivial) case of not knowing what I had until it was gone. I may try to superglue my old one back together, or I may just break down and buy a new one of these, because I think it's clearly superior to the Krups.\n\nThis grinder doesn't grind as fast as the Krups, and it's probably a little bit louder, but the consistency of the grind is FAR superior to the Krups grinder, and that's really all that matters to me! I could grind for a short period of time to get perfect percolator coffee grounds for camping coffee, a little longer to get a good consistent grind for drip coffee, or a little longer yet to get a pretty good grind for espresso. The Krups I got to replace it will leave some beans in large chunks and some espresso-powder fine. The only time I can get grounds with even consistency is if I go for a long enough time to get them all at espresso level.\n\nIt's fairly small, and I would fill it a little more than what the directions said to do, but I could get grounds enough for a strong 12 cup pot of coffee, and there would be no large chunks that came to the surface of the grounds when I went to remove the filter. And like I said earlier - it lasted me 5 years and would have gone longer had I not been clumsy. Solid coffee grinder for the price - I highly recommend it."
        },
        {
            "reviewerName": "Michael T Psomas",
            "rating": "3.0 out of 5 stars",
            "reviewTitle": "I'm Not a Hater",
            "reviewDate": "October 11, 2012",
            "reviewText": "This is a basic coffee grinder for the non-enthusiast. It grinds the coffee; but like others in this class, the beans are not ground consistently. You end up with some fine ground and some course ground in the same batch. One cause for this is that the grinding cup is proportionally too deep as compared to the blade. So the beans don't circulate adequately to even-out the grind.\n\nSecondly, the claim of being large enough for 12 cups is simply false. I can only grind enough beans for 2 cups. Of course I use a French press, so I use more beans. But seriously, this only holds 5 scoops of beans. If you're making 12 cups of coffee with 5 scoops, that's some mighty watery coffee. Or maybe you're making demitasse cups. But even with 2-3 oz. cups, I don't think this has the capacity for 12. And let's face it, if we're buying a coffee grinder we probably like coffee and drink the standard size cup.\n\nRegarding the design, it's not round, but rather has a bulge on the right side which makes it awkward to hold. It's almost like it was designed for left handed people.\n\nI'm not a hater. It's functional, and I use it. But it has drawbacks that will make me look for a higher quality grinder next time through."
        },
        {
            "reviewerName": "BW",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Works excellent for me",
            "reviewDate": "March 4, 2018",
            "reviewText": "I just purchased another DCG-20N after I accidentally broke the plastic cover this morning on mine. I read all of the 1 star reviews just out of curiosity, of which there were many, as I've had mine at least 2 years and have had no problems with it. I brew with a french press and this grinder grinds enough for 2 large, strong cups of Peete's whole bean coffee. It grinds very evenly and even down to a powder form after about 15 seconds. I guess every product out there has some \"lemons\" so maybe I just got lucky. However, go with what works, which is why I ordered another one as it works great."
        },
        {
            "reviewerName": "Buzz",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Coffee grinder",
            "reviewDate": "August 12, 2017",
            "reviewText": "Bought it to grind whole flax seeds. Haven't used it yet myself but my friend bought it for the same purpose and recommended it to me. She says it works great. Don't know how it works for coffee beans though. Price was fantastic."
        },
        {
            "reviewerName": "L. VANDERZEE",
            "rating": "1.0 out of 5 stars",
            "reviewTitle": "I have a better grinder that cost $6 at our local cheapie market.",
            "reviewDate": "September 30, 2007",
            "reviewText": "Cuisinart. You think Cuisinart and you think \"quality product,\" right? Think again, at least on this count. I have a lovely Cuisinart coffee maker and pots-and-pans set, as well as their wonderful fodd processor that has been chugging along for years. But this grinder really surprised me. The grinds were really uneven, some chunks being nearly whole beans, others ground within an inch of their molecular structure. And when I used it the second day, a few stray grinds came spewing out the side of the thing -- the seal wasn't tight if there were any leftover grinds from the last time. It feels chintzy and cheap, and I am promptly returning it. Bummer -- I thought Cuisinart made quality a priority."
        },
        {
            "reviewerName": "Don W. Myers",
            "rating": "4.0 out of 5 stars",
            "reviewTitle": "Inexpensive way to grind your own beans",
            "reviewDate": "February 16, 2008",
            "reviewText": "Nice little inexpensive coffee mill. It allows you to grind coffee all the way down to a powder if you want to. It grinds fairly evenly, but not as well as a good burr mill. It cleans out easily and also works great for grinding other herbs and spices, and making for making meat rubs. It's fairly loud, so use it after everybody is awake (or as a morning wake up call). It is probably the best buy for under $20. If you have never ground your own coffee, this is a great way to get a good cup of coffee for little cost. It also takes up very little counter space and it's available in colors to match just about any kitchen."
        },
        {
            "reviewerName": "Pickled Beatnik",
            "rating": "1.0 out of 5 stars",
            "reviewTitle": "Big slice of NOPE. Double slice of NOPE.",
            "reviewDate": "August 4, 2013",
            "reviewText": "I just bought this thing today and used it. Less than two minutes. It lasted less than two minutes of being in use before none of the coffee was ground and smoke was pouring out of the motor. Do NOT buy this piece of crap. One star is too kind.\n\nEDIT:\nTried another of this same one, thinking the last one was defective. IT WAS NOT. The same thing happened, but spanned over only a couple of uses. There is a MAJOR DESIGN FLAW which causes coffee beans to become lodged between the blade and the body of the grinder and it just catches itself on fire. Really, Cuisinart? Biggest waste of time and money."
        },
        {
            "reviewerName": "lindykins",
            "rating": "1.0 out of 5 stars",
            "reviewTitle": "Cooked Goose",
            "reviewDate": "December 13, 2012",
            "reviewText": "I received this product through Cuisinart's rebate after purchasing their coffeemaker DCC 2650 at Bloomingdale's. The coffeemaker was mediocre and I actually purchased an Aerobie aeropress in the end. But going back to the grinder, I'm glad that I spent zero dollars on the product and it worked okay during the first 10 grinds. The cup is very small and I had a large can of beans to grind.\n\nAfterwards, it was dead. Didn't even sputter and die, just went dead after using the grinder as directed. I suggest you spend the money on something else rather than this product. I've never had any bad experiences with Cuisinart before and is disappointed that this grinder would go so quickly. I'll just stick to grinding my beans at the local supermarket before bringing it home."
        },
        {
            "reviewerName": "Frog",
            "rating": "1.0 out of 5 stars",
            "reviewTitle": "Weak Motor, Weak Design, Weak Coffee",
            "reviewDate": "January 20, 2013",
            "reviewText": "I have been pretty happy with Cuisinart products. Their waffle iron is the best, and the food processor is 20 years old, and works great. Is this another brand that got bought, and gets slapped on cheap Chinese products? Seems like at has happened a lot. This coffee grinder is toast after two grinds today. And of course, like an idiot, I tossed the \"instructions\" and \"warranty papers\". C'mon you really need instructions to use this? The claim of 12 cup capacity is bogus. The Keurig people \"could\" say it has a 1/2 gallon capacity and that is true..but one cup at a time. This thing makes an inconsistent grind, and produces weak coffee. It should be an embarrassment to the company..and our country for not being able to manufacture a stupidly simple product as this. Buh bye Cuisinart!"
        },
        {
            "reviewerName": "Beth",
            "rating": "1.0 out of 5 stars",
            "reviewTitle": "Do not recommend",
            "reviewDate": "June 4, 2013",
            "reviewText": "This product is pretty lame -- many design defaults. Although I like other Cuisinart products I would stay away from this one. It does a fine job of actually grinding the beans but there are too many drawbacks to keep it: the cord storage is a joke (it does not wind interally, you have to shove the cord into the space on the side, and the entire cord doesn't fit completely), the cord itself is short, because of the lid design grounds or beans get caught in, it making it hard to clean, and it is much larger than the Krups grinder I've had for 10+ years. There are much better products available. Even though it's not broken I am going to return it immediatley."
        },
        {
            "reviewerName": "L. L.",
            "rating": "3.0 out of 5 stars",
            "reviewTitle": "Cuisinart DCG-20N Coffee Bar Coffee Grinder It does the job ...",
            "reviewDate": "October 19, 2015",
            "reviewText": "Cuisinart DCG-20N Coffee Bar Coffee Grinder It does the job, but is limited at one speed and grind. It is the noisiest grinder I have ever owned. I'm talking \"wake the dead\".so unless you live alone, there are quieter brands, with more options. Mine has out lasted two others, that I preferreds."
        },
        {
            "reviewerName": "46&amp;lovinit",
            "rating": "1.0 out of 5 stars",
            "reviewTitle": "Pass on this one",
            "reviewDate": "April 23, 2017",
            "reviewText": "I bought this to grind coffee. It does not hold many beans and grinds terrible. I use it now to grind chick feed. I really thought with the Cuisinart name it would do a better job. For coffee get something else."
        },
        {
            "reviewerName": "Erik",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "I consider that to be amazing. How many items do you own that you ...",
            "reviewDate": "November 23, 2016",
            "reviewText": "My step-mom bought this grinder for me when I was a freshman in college in 1996. I have used it nearly every day since. I consider that to be amazing. How many items do you own that you have used every day for 20 years without one hiccup, still looks great, still does the job? I'd say I would buy one again in a heartbeat-but I don't have too! This one still works great."
        },
        {
            "reviewerName": "----tmu----",
            "rating": "2.0 out of 5 stars",
            "reviewTitle": "Nice grind- No capacity",
            "reviewDate": "July 6, 2008",
            "reviewText": "The positive: This grinder produces a uniform grind.\n\nThe negatives: I could only add half the capacity of beans.\n\nThe first time I filled the grinder and was grinding for the 30 seconds the manual instructs you to, something plastic inside got very hot and started smoking. So, I started doing two grinds to get the amount of coffee I like.\n\nA week ago,a friend of mine was making coffee, and not knowing the grinder's capacity limitation, filled it full with beans and burned out the motor.\n\nAnyways, if you like strong coffee don't buy this grinder. If you like lighter strength coffee this is a good grinder because of its consistent grinding of the beans.\n\nWe bought this to replace it! Breville BCG450XL Ikon Conical Burr Grinder"
        },
        {
            "reviewerName": "Hipmoma",
            "rating": "3.0 out of 5 stars",
            "reviewTitle": "Ok grinder. Sometimes the button to turn it on ...",
            "reviewDate": "June 30, 2014",
            "reviewText": "Ok grinder. Sometimes the button to turn it on just won't work. No real reason. I have to try multiple times before it starts... cable is so short that I can't stand it on the table and plug it it, thus have to STAND next to the electrical outlet while grinding (standing) with the grinder in my hand.\nIt does the job but meh quality."
        },
        {
            "reviewerName": "Amazon Customer",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "my toddlers love pushing the button to \"help\"",
            "reviewDate": "March 29, 2017",
            "reviewText": "I have had this grinder for at least seven years and just bought a replacement. It has been stood up to early morning coffee addictions seven days a week. Bonus: my toddlers love pushing the button to \"help\"."
        },
        {
            "reviewerName": "V. B.",
            "rating": "1.0 out of 5 stars",
            "reviewTitle": "Breaks - Spend Your Money Elsewhere!",
            "reviewDate": "January 2, 2008",
            "reviewText": "The Cuisinart coffee grinder model DCG-20N is a waste of good money. The plastic holding the blade starts breaking after little more than a week's use (low intensity use at that - just once a day), and if you don't want to / cannot afford to spend money on a new grinder, you have to check and clean the ground coffee / spices of the broken plastic pieces.\n\nWhat's more, in a matter of a week or two more, this plastic disc is so badly broken that the blades collapse and the grinder becomes unusable. I gave it the benefit of doubt (partly because it was the only brand that the local grocery store kept) the first time this happened and bought it a second time and in a different color, after a gap of over a year just in case it was something to do with the batch.....and it happened again, in exactly the same way! And this in spite of the fact that I took really really good care to always follow the instructions in the manual!\n\nThis is a very very very substandard product. I feel cheated of my hard-earned money, and am never going to buy a Cuisinart product ever again."
        },
        {
            "reviewerName": "Farida K",
            "rating": "1.0 out of 5 stars",
            "reviewTitle": "Defective",
            "reviewDate": "December 28, 2011",
            "reviewText": "I bought this coffee grinder from another store. Before I even used it, (but already bought it), I had reservations about this product because of all the bad reviews. 12 1star rating out of 25 4 star ratings is not a huge difference. I honestly thought that mine would come out fine because what are the chances of me getting something defective right and I also trusted the Cuisinart brand because most of my appliances are from Cuisinart and I love them. However, during the first use, it tripped off the electrical outlet!!! I tried it over and over again, and it really does do it most of the time. I think Cuisinart outsourced this product to a manufacturer in China with no quality control and the whole batch probably was defective or something, coz I saw a bunch of them at a discounted price. I'm returning this and looking for another brand this time."
        },
        {
            "reviewerName": "5280",
            "rating": "4.0 out of 5 stars",
            "reviewTitle": "Four Stars",
            "reviewDate": "January 7, 2017",
            "reviewText": "Great. Plenty of power, grinds to a near powder."
        },
        {
            "reviewerName": "V. B.",
            "rating": "1.0 out of 5 stars",
            "reviewTitle": "Breaks - Spend Your Money Elsewhere!",
            "reviewDate": "January 2, 2008",
            "reviewText": "The Cuisinart coffee grinder model DCG-20N is a waste of good money. The plastic holding the blade starts breaking after little more than a week's use (low intensity use at that - just once a day), and if you don't want to / cannot afford to spend money on a new grinder, you have to check and clean the ground coffee / spices of the broken plastic pieces.\n\nWhat's more, in a matter of a week or two more, this plastic disc is so badly broken that the blades collapse and the grinder becomes unusable. I gave it the benefit of doubt (partly because it was the only brand that the local grocery store kept) the first time this happened and bought it a second time and in a different color, after a gap of over a year just in case it was something to do with the batch.....and it happened again, in exactly the same way! And this in spite of the fact that I took really really good care to always follow the instructions in the manual!\n\nThis is a very very very substandard product. I feel cheated of my hard-earned money, and am never going to buy a Cuisinart product ever again."
        },
        {
            "reviewerName": "glenn wood",
            "rating": "1.0 out of 5 stars",
            "reviewTitle": "buyer beware of this worthless grinder",
            "reviewDate": "October 12, 2017",
            "reviewText": "This is the second unit I've had and both burn out after only a few minutes of grinding. Totally ruined. Now I have to go back and get another grinder---hopefully a Krups. Thank you, Kohls, for having a good exchange policy."
        },
        {
            "reviewerName": "Touey",
            "rating": "1.0 out of 5 stars",
            "reviewTitle": "Kitchen Clean UP Now Needed",
            "reviewDate": "February 17, 2013",
            "reviewText": "First use (purchased new) put some of my precious no longer available imported coffee beans in and started to put the lid on. Machine started grinding before lid ever set in place. Beans are now everywhere in my kithen. I wanted a cup of morning coffee; not a morning Kitchen Cleanup! We are madly loyal to Cuisinart brand; this is the first bad product of the many we have purchased from them. Makes us wonder if this isn't some cheap knock-off rebadged?\n\nAny way; back to Sears with this one."
        },
        {
            "reviewerName": "julesk49",
            "rating": "1.0 out of 5 stars",
            "reviewTitle": "Don't waste your money!",
            "reviewDate": "October 11, 2016",
            "reviewText": "Chamber is so small, you have to grind in two batches for a normal pot of coffee. Grinds beans unevenly. Latch is easily blocked by beans so it won't run. Motor burned out in six months."
        },
        {
            "reviewerName": "Loyal Amazon.com customer",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Great little gadget",
            "reviewDate": "January 28, 2006",
            "reviewText": "I received this grinder as a Christmas gift from my son-in-law after my cheapo, cheapo grinder went kaput! I am surprised at some of the not so happy reviews because we use this grinder every single day, sometimes twice in one day, and it works really well.\n\nIf the grinder is dedicated for coffee or spices, there's no need to clean it (like, with water and soap; just tap around the outside canister and all the excess residue falls off the edges into the cup/blade area.\n\nI really like the grinder, and knowing my luck, this Cuisinart will last a long time only because I've had my eye on a Kitchen Aid coffee grinder (to match the rest of my appliances) and just happened to get this one as a gift. Oh well! But, the grinder is worth the money, and it does what it's supposed to do. Unless you're the type of person who needs directions on how to breathe, this grinder is a no-brainer :-)"
        },
        {
            "reviewerName": "Olga Doherty",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Five Stars",
            "reviewDate": "June 5, 2017",
            "reviewText": "This item is bought as a replacement."
        },
        {
            "reviewerName": "GGW",
            "rating": "2.0 out of 5 stars",
            "reviewTitle": "Too small for coffee - Works OK for spices",
            "reviewDate": "December 14, 2012",
            "reviewText": "This grinder does not really handle 12 cups worth of beans - not even 12 6oz cups. I would put the limit at 8 cups. Additionally, there is no removable cup. While that it is not a big deal, it does make it harder to pour and clean. Since this grinder wouldn't work for our coffee needs, we started using it as a spice grinder. It works just fine for that purpose."
        },
        {
            "reviewerName": "Buck Rogers",
            "rating": "1.0 out of 5 stars",
            "reviewTitle": "gets hot and burns out",
            "reviewDate": "August 5, 2018",
            "reviewText": "so you have to be very gentle with it."
        },
        {
            "reviewerName": "TheyKeepOnRising",
            "rating": "1.0 out of 5 stars",
            "reviewTitle": "One Star",
            "reviewDate": "January 16, 2016",
            "reviewText": "Broke after less than 10 uses."
        },
        {
            "reviewerName": "AmazonFan",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Cuisinart DCG-20BKN Coffee Bar Coffee Grinder, Black",
            "reviewDate": "September 4, 2002",
            "reviewText": "This is a great little coffee grinder and does a good job for its size! I recommend it to any discriminating buyer who prefers the wonderful, rich flavor of coffee brewed from fresh ground coffee beans."
        },
        {
            "reviewerName": "Anonymous",
            "rating": "2.0 out of 5 stars",
            "reviewTitle": "Breaks while grinding",
            "reviewDate": "February 26, 2014",
            "reviewText": "I had two of these, and within 48 hours, both of them had to be thrown away. The plastic piece that holds the blade inside broke on both of them, and obviously after it breaks, everything inside had to be thrown away. I use these grinders all the time for spice grinding, so I would not recommend this product."
        },
        {
            "reviewerName": "A. E. Harrison",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Worked for 15 years",
            "reviewDate": "December 28, 2012",
            "reviewText": "I bought this product about 15 years ago, before I got married. I grind and drink coffee everyday, and it just died last week. So, I'm going to buy another one. Is it noisy? yes, but not much more than any grinder I've seen. The longevity outweighs whatever other drawbacks there might have been."
        },
        {
            "reviewerName": "Ron Johnson",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Five Stars",
            "reviewDate": "December 14, 2014",
            "reviewText": "It beats the other brands I've tried"
        },
        {
            "reviewerName": "San",
            "rating": "4.0 out of 5 stars",
            "reviewTitle": "works well",
            "reviewDate": "February 9, 2012",
            "reviewText": "easy to use and I love that the cord is retractable.It is sleek and compact, doesn't take up much space."
        },
        {
            "reviewerName": "MommyNeilson",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Great coffee!",
            "reviewDate": "August 16, 2005",
            "reviewText": "This is the first coffee grinder that I have ever purchased and I am extremely pleased. That being said I have to say that I find it a speedy little unit that is easy to clean and makes just the noise you would expect! I also have to say that I purchase high quality coffee and I make full pots of strong coffee without having to grind a second run of beans..."
        },
        {
            "reviewerName": "Alberto &#34;Al&#34; Bondiga",
            "rating": "1.0 out of 5 stars",
            "reviewTitle": "Crap",
            "reviewDate": "September 20, 2012",
            "reviewText": "Plastic depressor button thing on lid broke after very little use. Grinder still 'works' if you use a pointy object like a steak knife to gently press the button. No replacement lids available..."
        },
        {
            "reviewerName": "Jean",
            "rating": "1.0 out of 5 stars",
            "reviewTitle": "no good",
            "reviewDate": "August 29, 2014",
            "reviewText": "Stopped working after about 4 months."
        },
        {
            "reviewerName": "Cast iron tub",
            "rating": "3.0 out of 5 stars",
            "reviewTitle": "Grinds very unevenly so not ideal if you're using a ...",
            "reviewDate": "May 17, 2015",
            "reviewText": "Grinds very unevenly so not ideal if you're using a French press or if you otherwise need an even grind."
        },
        {
            "reviewerName": "Christy Campbell",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "BUY IT",
            "reviewDate": "February 15, 2002",
            "reviewText": "Let me say I abuse my coffee grinders. The ones I have had in the past have died young because I have dropped them in a dopey morning pre-coffee daze. I have dropped the Cuisinart numerous times and it is warped on one side from me leaving it on the gas stove with the oven on...IT STILL WORKS..just as well as the day it arrived. Best purchase I have made yet and I would buy another but I don't need to."
        },
        {
            "reviewerName": "Roanne",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Work's great, looks great.",
            "reviewDate": "June 19, 2013",
            "reviewText": "I drink French Press coffee and this grinder works great to grind the beans to a perfect coarseness. It's also looks nice and is small so it doesn't take up much room on my counter."
        },
        {
            "reviewerName": "Nancy LG",
            "rating": "2.0 out of 5 stars",
            "reviewTitle": "limited capacity",
            "reviewDate": "July 5, 2012",
            "reviewText": "It has very limited capacity, only one and a quarter ounces. You can grind only enough beans for a half pot at a time."
        },
        {
            "reviewerName": "Lorrie Greynald",
            "rating": "1.0 out of 5 stars",
            "reviewTitle": "Horrible Product!!",
            "reviewDate": "March 9, 2014",
            "reviewText": "If you want a coffee grinder that can only handle a very small volume and grinds very unevenly then this is the grinder for you.\nAwkward design. I would give it zero stars if possible."
        },
        {
            "reviewerName": "David H. Biggar",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Five Stars",
            "reviewDate": "March 2, 2017",
            "reviewText": "Best coffee grinder I have ever owned!"
        },
        {
            "reviewerName": "Dennis Fisher",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Complete grind with no residue",
            "reviewDate": "March 20, 2009",
            "reviewText": "Great coffee grinder! I have tried several coffee grinders. All but the Cuisinart leave some beans unground and/or leave an annoying amount of residue in the grinder. Aesthetically pleasing style. Cord storage inadequate and awkward to use."
        },
        {
            "reviewerName": "George wong",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Five Stars",
            "reviewDate": "January 4, 2015",
            "reviewText": "Fast at grinding, small (convenient to store), wished it had a retractable cable."
        },
        {
            "reviewerName": "TyTown",
            "rating": "1.0 out of 5 stars",
            "reviewTitle": "5 Years of Service",
            "reviewDate": "June 4, 2013",
            "reviewText": "Our Cusinart coffee grinder just broke after 5 years. The blade separated from the shaft and shaft just spins. Never ground anything but coffee beans. It was loud, inexpensive, yet it got the job done. I'm going to try another brand this time around."
        },
        {
            "reviewerName": "Keziah Scholten",
            "rating": "4.0 out of 5 stars",
            "reviewTitle": "Works great!",
            "reviewDate": "November 22, 2014",
            "reviewText": "Works great! Perfect addition to my Cuisinart coffeemaker"
        },
        {
            "reviewerName": "nitin",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Love it",
            "reviewDate": "February 16, 2013",
            "reviewText": "I thought I had ordered a used product but it turned out to be brand new and bang on time. Great stuff!"
        },
        {
            "reviewerName": "James N Favor",
            "rating": "1.0 out of 5 stars",
            "reviewTitle": "Disappointed!",
            "reviewDate": "April 25, 2003",
            "reviewText": "This grinder has a small capacity [not as advertised]. If you follow directions, it will only grind enough for 4 cups at a time. Also, for some reason it generates a static charge and there is coffee dust all over the counter after emptying it. The cord is stiff and the cord storage is inconvienient. Finally, it is much more noisy than my old one."
        },
        {
            "reviewerName": "Amazon Customer",
            "rating": "4.0 out of 5 stars",
            "reviewTitle": "Very Nice!",
            "reviewDate": "February 6, 2002",
            "reviewText": "I've owned several grinders and will say that this one is great. I'm suprised that it doesn't cost more! Plenty of power. Good looks. Easy operation. What more could you ask for???"
        },
        {
            "reviewerName": "Peter Mattix",
            "rating": "2.0 out of 5 stars",
            "reviewTitle": "SKIP THIS PRODUCT",
            "reviewDate": "August 31, 2006",
            "reviewText": "1 PIECE UNIT. AFER GRINDING MUST TIP WHOLE UNIT TO EMPTY. CHEAPER IS NEVER BETTER. LOOKING TO REPLACE AFTER FIRST USE."
        },
        {
            "reviewerName": "Sarah",
            "rating": "1.0 out of 5 stars",
            "reviewTitle": "MESSY POOR DESIGN",
            "reviewDate": "May 17, 2011",
            "reviewText": "This product is poorly designed and makes a huge mess every time you use it. It makes having your coffee a chore instead of a pleasure."
        },
        {
            "reviewerName": "E. Little",
            "rating": "3.0 out of 5 stars",
            "reviewTitle": "Good for the low cost.",
            "reviewDate": "January 5, 2008",
            "reviewText": "Cuisinart DCG-20BKN Coffee Bar Coffee Grinder, Black\nWe purchased this as a gift. We also have one and I really like it's simplicity."
        },
        {
            "reviewerName": "kitplanesue",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Like it better than Krups",
            "reviewDate": "December 12, 2016",
            "reviewText": "After using a previous one of these and wearing it out, the Krups competing grinder was tried out. Krups works very well and grinds even finer than this one, but leaves a small amount of coffee near the blades. So, this Cuisinart grinder was ordered to replace the first one. It works great, comes in black or white, and all the ground coffee can be tapped out easily."
        },
        {
            "reviewerName": "Big Dog",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "High Quality",
            "reviewDate": "March 12, 2017",
            "reviewText": "I use this for grinding flax seed. Works perfectly."
        },
        {
            "reviewerName": "Lisa",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Workhorse of our kitchen",
            "reviewDate": "February 6, 2019",
            "reviewText": "Purchased this Cuisinart coffee grinder to replace the very same one that I had for over 10 years that worked perfectly until just recently. No need to spend outrageous amount of money for what should be a simple straightforward product. When I needed to replace the coffee grinder I looked for the same one we had that was used every day without a glitch."
        },
        {
            "reviewerName": "Amazon Customer",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Grinds coffee and more!",
            "reviewDate": "February 10, 2018",
            "reviewText": "Works great. You can even grind spices with it. Took a bottle of crushed red pepper seeds and I wish I had thought of this idea twenty years ago! (Try this! The powder that you get can be sprinkled on pizza, salsa or anything else to add heat> I use it primarily for my pasta sauce. Don't you hate it when you get too many seeds in your mouth? This takes care of that!)\n\nMinor complaint: I like to take the top of the grinder housing and scoop beans out of the coffee bag but some get stuck in the edges of it. Now I just turn it upside down and pour into grinder. Problem solved."
        },
        {
            "reviewerName": "LadyBroadzilla",
            "rating": "4.0 out of 5 stars",
            "reviewTitle": "This Cuisinart Grinder is Awesome! Glad they haven’t!",
            "reviewDate": "February 1, 2019",
            "reviewText": "This one works great. Already ground some beans. I was so excited when I found on Amazon. I needed to replace the one I have had for 20 years almost. Think same series. Very little has changed old smoked plastic on lid where this on is clear. Otherwise same. The safety tab had worn down on old one. So been a trick. This morning I had it. Already have 7:24 pm! Yeah Amazon!"
        },
        {
            "reviewerName": "Luolan",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "good little bean grinder",
            "reviewDate": "March 8, 2019",
            "reviewText": "I got this for my husband after we couldn't find his favorite coffee brand already ground when we moved. He has said it's very easy to clean and use. He first time he used it, I was startled by the loud noise, but honestly it just sounds like a garbage disposal or food processor. It grinds the coffee beans very well and has been thoroughly enjoyed."
        },
        {
            "reviewerName": "Jay Johnson",
            "rating": "4.0 out of 5 stars",
            "reviewTitle": "Works Just Fine, Long Lasting, Good Value!",
            "reviewDate": "November 26, 2012",
            "reviewText": "This is my second coffee grinder by Cuisinart. I have a previous one that fell from the counter and cracked the lid. That model has lasted for at least three years without any problem. Since I am satisfied with this model I bought another replacement.\n\nThe space for the coffee beans is limited. If you are going to make a full pot of coffee you will have to grind 2 or 3 loads. For the 6 cups of coffee I brew in the morning I only need to grind two full loads of coffee beans. If you don't overload the coffee beans it works fine. I recommend finding measuring cup. Once you grind the beans it is good to shake the grinder to get all of the beans ground. If you do this you get perfectly ground coffee.\n\nThe cord of the grinder is about 18\". It's a little shorter than their previous model but manageable. Compared to a Mr. Coffee grinders whose motors kept burning out I would definitely recommend this model."
        },
        {
            "reviewerName": "Jay S. Z.",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Grinds to your desired want",
            "reviewDate": "October 10, 2019",
            "reviewText": "This far the only issue I have is that it's noisier then my previous grinder. Can grind my coffee beans to any desired consistency. No need for a toothbrush for cleaning as a couple of taps does it. In addition to the noise, the need to take a picture of it or the paper that comes with it in order to get the warranty. My bet that folks like me don't need a warranty for a $20 item😩"
        },
        {
            "reviewerName": "tberry",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Perfect for black peppercorns.",
            "reviewDate": "September 8, 2016",
            "reviewText": "I use this as a pepper grinder. My first one lasted many years. When it died I went straight to Amazon and ordered another. I keep my ground pepper in a tiny bowl on my stove so it is easy to add a pinch and see exactly how much you are using."
        },
        {
            "reviewerName": "Amazon Customer",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "AWESOME!",
            "reviewDate": "June 26, 2017",
            "reviewText": "Decided on this one because of some of the positive reviews. Glad I did. It IS very quiet compared to my Braun I had (that actually lasted for over 5 years). Love the smaller compact size. I use it to grind the egg shells (calcium) from boiled eggs for my Mynah bird. Grinds it to powder form and is perfect! Paid a great price too!"
        },
        {
            "reviewerName": "Rhapsody",
            "rating": "3.0 out of 5 stars",
            "reviewTitle": "The best feature is that it is more quiet than the ...",
            "reviewDate": "December 2, 2017",
            "reviewText": "Coffee grinder is adequate. The best feature is that it is more quiet than the one I owned before this purchase. The downside is it doesn't grind the bean and finely as I would like so will need to continue to use the old one for the time being."
        },
        {
            "reviewerName": "Diane K.",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Works great!",
            "reviewDate": "August 28, 2019",
            "reviewText": "I like the looks of the coffee grinder, as it matches our coffeemaker, so I keep both on the kitchen counter. We have a Cuisinart Grind & Brew 12-cup coffeemaker, and the \"grind\" part is SO LOUD that, after 4 years, I bought the grinder so the coffee could brew quietly. Therefore, I only have good things to say about the coffee grinder!"
        },
        {
            "reviewerName": "Amazon Customer",
            "rating": "2.0 out of 5 stars",
            "reviewTitle": "Useless for coffee beans",
            "reviewDate": "March 20, 2019",
            "reviewText": "Yes, it is inexpensive. Still, I expected it to grind beans. I just tried this for the first time. Most beans stayed on top while those on the bottom were ground into powder. I think the trouble lies in the blade design. One halp is turned down and the other half is turned up. I have asked for a refund and ordered a Krupps."
        },
        {
            "reviewerName": "Steve P",
            "rating": "4.0 out of 5 stars",
            "reviewTitle": "Good and quiet but not the most consistent",
            "reviewDate": "April 17, 2018",
            "reviewText": "This grinder is relatively quiet and compact. I also like the integrated cable storage (which I didn't even notice at first!); however the grinding isn't very consistent, and I haven't been able to get a consistent fine grind not matter how long I grind it for. The grounds at the top are fine but at the bottom are coarse. Overall, it's what I had expected, and it's good enough, especially for the price"
        },
        {
            "reviewerName": "Dr. Peeper",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Used once so far and it grinds better than my old Proctor Silex grinder with the retractable ...",
            "reviewDate": "April 19, 2018",
            "reviewText": "Used once so far and it grinds better than my old Proctor Silex grinder with the retractable cord. That is one thing I wish all grinder manufacturers did is to give us a retractable cord by turning the unit's head or base. I would not have replaced my Proctor if it had not started throwing pieces of plastic into my grounds after 13years of darn near daily use."
        },
        {
            "reviewerName": "Chik Shank",
            "rating": "4.0 out of 5 stars",
            "reviewTitle": "Just what I wanted",
            "reviewDate": "May 6, 2019",
            "reviewText": "I'm very happy with this small grinder. It works great and wipes clean easily. To store, I just wrap the cord around the unit and tuck the plug under one round of cord. It takes up very little shelf space. I don't bring coffee every day... I grind a full bowl each four or five days and keep the extra in the freezer for use on subsequent days."
        },
        {
            "reviewerName": "A.",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Love it. I've used it a few times now ...",
            "reviewDate": "August 31, 2017",
            "reviewText": "Love it. I've used it a few times now and it works great. It's easy to use and grinds the coffee beans really well. I wanted to get another one with a metal shell (different brand) but this signed out to be the one I liked best and easiest to use (based on the other product's reviews)."
        },
        {
            "reviewerName": "Photty",
            "rating": "3.0 out of 5 stars",
            "reviewTitle": "Ok for 1 or 2 cups of coffee",
            "reviewDate": "January 28, 2019",
            "reviewText": "This is nicely styled and looks very modern. It grinds a small quantity of beans very well.\nThe only problem is that it only does a very small quantity at a time. For a family of 4\nadults it takes 2 passes with half the number each. Irritating."
        },
        {
            "reviewerName": "R W Robertson",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Makes the counter look prettier",
            "reviewDate": "June 26, 2018",
            "reviewText": "Like a piece of art grinding away on my counter. Works well and simple...no unnecessary buttons and dials. Its design flaw is the same as most of them and would be hard to reasonably fix...You must flip the whole unit over to dump coffee into the cap. Would have to be bigger and a ton more pricey to fix."
        },
        {
            "reviewerName": "Bruiser",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Quisinart quality",
            "reviewDate": "November 25, 2018",
            "reviewText": "This is a direct replacement. It's predecessor performed without fail for about 18 years, and I think I just wore it out.\nExcellent design, and material/assembly quality."
        },
        {
            "reviewerName": "CKinMI",
            "rating": "3.0 out of 5 stars",
            "reviewTitle": "and better grind. This one leaves you with a super ...",
            "reviewDate": "May 14, 2018",
            "reviewText": "Rinky-dink grinder. The kitchenaid grinder I had-that lasted 15 years-geiund 3 times as much at 1 time... with less effort to operate it, a longer cord, and better grind. This one leaves you with a super fine powder of coffee while at the same time large bits. Would not recommend."
        },
        {
            "reviewerName": "Stacie St. Germaine",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Can't beat the price",
            "reviewDate": "March 22, 2017",
            "reviewText": "I saw this was discontinued and therefore at a very nice price. I basically wanted one to grind flaxseed since I can't use my wheat grinder because of the oil in flax. I have no complaints abou this product. Works as it should."
        },
        {
            "reviewerName": "Jared K",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Grinds fine",
            "reviewDate": "March 30, 2017",
            "reviewText": "Good coffee grinder; makes the fine grind I need for my Melitta funnel and filter."
        },
        {
            "reviewerName": "J. Beizaie",
            "rating": "4.0 out of 5 stars",
            "reviewTitle": "Good grinder.",
            "reviewDate": "March 28, 2016",
            "reviewText": "My other coffee grinder conked out on me, it was time for a new one. This grinder holds more beans than I thought it would and can grind the beans finer than my old grinder did. One negative is that the power cord is rather short, I would have liked a longer cord."
        },
        {
            "reviewerName": "Mesnaho",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "perfect for two or three cups of coffee",
            "reviewDate": "July 10, 2017",
            "reviewText": "Does the job...just beware that it's a small amount that you can grind at once... perfect for two or three cups of coffee!!"
        },
        {
            "reviewerName": "lundycanyon",
            "rating": "3.0 out of 5 stars",
            "reviewTitle": "nice qaulity, just too small for my needs",
            "reviewDate": "July 8, 2017",
            "reviewText": "other reviews of it not holding many beans were correct. went back to krups, but will keep this one for a spice grinder or emergency grinder. nice qaulity, just too small for my needs."
        },
        {
            "reviewerName": "W. TAYLOR",
            "rating": "2.0 out of 5 stars",
            "reviewTitle": "Weak coffee.",
            "reviewDate": "November 4, 2019",
            "reviewText": "Feels cheap. Grind is too coarse and has no adjustments and coffee comes out weak. Cuisinart label doesn't automatically make it quality and I have discovered."
        },
        {
            "reviewerName": "Tarik Ibrahim",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "works great, very compact and portable and easy to clean",
            "reviewDate": "January 20, 2018",
            "reviewText": "works great, very compact and portable and easy to clean, just wipe with a wet paper towel and your done. I grind one cup and then use my keurig, coffee has never tasted so good."
        },
        {
            "reviewerName": "ADM",
            "rating": "4.0 out of 5 stars",
            "reviewTitle": "This unit is well worth the money. It Is ...",
            "reviewDate": "January 26, 2018",
            "reviewText": "This unit is well worth the money.It Is fairly quiet. Grinds almost all types of coffee, spices, nuts.\nI did not give it five stars because the only shortcoming, I believe, is the fact that you cannot take the upper part of the grinder out for cleaning purposes"
        },
        {
            "reviewerName": "laura marie",
            "rating": "4.0 out of 5 stars",
            "reviewTitle": "Does it's job",
            "reviewDate": "November 3, 2019",
            "reviewText": "This Cuisinart coffee grinder is very easy to use. I especially like the switch, just put the top on and give a twist."
        },
        {
            "reviewerName": "ArthurB",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "An Efficient Grinder",
            "reviewDate": "July 11, 2019",
            "reviewText": "I checked a bunch of candidates. Settled on this to replace my old grinder that worked for a long time. Great replacement. Grinds down those beans to perfect espresso granules. Recommended."
        },
        {
            "reviewerName": "Marie E Santos",
            "rating": "3.0 out of 5 stars",
            "reviewTitle": "Makes six cups of coffee",
            "reviewDate": "April 1, 2018",
            "reviewText": "It says it makes like ten cups of coffee but if you do it is a mess and the lid won't go on easily. I can easily make 6 cups of coffee with this and if I want more I use the grinder twice. I find that to be inconvenient."
        },
        {
            "reviewerName": "Lisa A. Smith",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Easy to Use, Easy to Clean",
            "reviewDate": "September 10, 2018",
            "reviewText": "Very simple to use. Easy to clean. May need to take a break, if you're doing a large amount of coffee, as the motor heats up with prolonged use. Otherwise, a real workhorse and a great time-saver."
        },
        {
            "reviewerName": "Bruce Nelkin",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "solid grinder for very small jobs",
            "reviewDate": "September 27, 2019",
            "reviewText": "I use this grinder for Flax seeds before I blend them into smoothies. For this purpose, it works fine."
        },
        {
            "reviewerName": "Old Alice",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Great for seniors, very easy to push large button",
            "reviewDate": "February 23, 2018",
            "reviewText": "Got this for my mom, and what she liked best is that it does not automatically make a fine ground, but is a coarse ground. Also, she's elderly so has very little hand strength, and the button is huge and easy to push. Great for seniors!"
        },
        {
            "reviewerName": "Kat H",
            "rating": "4.0 out of 5 stars",
            "reviewTitle": "Nice grinder, but make sure of the capacity you need",
            "reviewDate": "June 16, 2018",
            "reviewText": "Not as large capacity as I had expected, but works well. Taking away a star due to small capacity."
        },
        {
            "reviewerName": "Leigh Karchner",
            "rating": "4.0 out of 5 stars",
            "reviewTitle": "The only complaint I have about this item is that it's not easy to clean",
            "reviewDate": "March 7, 2018",
            "reviewText": "Gets the job done quickly and to the desired consistency. The only complaint I have about this item is that it's not easy to clean. The cup and blades are fixed so you pretty much have to wipe it out to clean it. It's not submersible so residue is left inside from one product to the next. I use mine for grinding/chopping herbs as well as coffee."
        },
        {
            "reviewerName": "thesnelly",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Great bean grinder!",
            "reviewDate": "September 9, 2019",
            "reviewText": "I use this grinder only for coffee beans and it works wonderful! It grinds the beans in no time to the perfect fine grind for fresh coffee every cup!"
        },
        {
            "reviewerName": "HLAW",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Great product",
            "reviewDate": "November 21, 2018",
            "reviewText": "First one was purchased at a store. Lasted several years so decided to buy the same exact one. Use for coffee, salt, spices. Perfect for all, easy to clean and inexpensive!"
        },
        {
            "reviewerName": "Tracy Anderson",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "This works well and grinds coffee beans perfectly for a ...",
            "reviewDate": "March 16, 2018",
            "reviewText": "This works well and grinds coffee beans perfectly for a drip coffeemaker. It's a bit small, but that's not a problem. The amount of grounds I can get out of it per use equates to about half of a 12 cup coffee pot."
        },
        {
            "reviewerName": "Trieu Do",
            "rating": "1.0 out of 5 stars",
            "reviewTitle": "Save The Box!!!",
            "reviewDate": "June 14, 2017",
            "reviewText": "We were able to use the grinder about 3 times before it burned out. Unfortunately we threw away the box now we can't return it."
        },
        {
            "reviewerName": "eth",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Five Stars",
            "reviewDate": "October 12, 2017",
            "reviewText": "Just what I need. Just don't overfill it then you won't get uneven coffee grounds."
        },
        {
            "reviewerName": "C. G.",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Works great for espresso grind",
            "reviewDate": "September 19, 2014",
            "reviewText": "I bought this to grind coffee for espresso. I was worried that it wouldn't get the beans fine enough or they would be inconsistently ground. Nope. I hold the button down and gently shake the grinder just to move everything around and in 30 seconds I have perfectly ground espresso. Super-fine and even. Love this machine."
        },
        {
            "reviewerName": "NOEL",
            "rating": "1.0 out of 5 stars",
            "reviewTitle": "Quit grinding after less than 2 years.",
            "reviewDate": "February 11, 2018",
            "reviewText": "I always by cuisinart because of quality and reliability. This grinder just quit grinding beans after less than 2 years."
        },
        {
            "reviewerName": "C. mcguire",
            "rating": "1.0 out of 5 stars",
            "reviewTitle": "Very bad design. Don’t bother.",
            "reviewDate": "October 13, 2019",
            "reviewText": "Beans get caught and prevents the lid from closing. Very Bad design. Going back to krups."
        },
        {
            "reviewerName": "Jasmine",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Grinding",
            "reviewDate": "March 6, 2018",
            "reviewText": "Worked great! I only bought this to grind coffee beans for costarica and it worked great!"
        },
        {
            "reviewerName": "KuuipoLika",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Great buy",
            "reviewDate": "December 20, 2017",
            "reviewText": "Exactly what I needed to grind my daily coffee. This brand is reliable and never been disappointed with their products"
        },
        {
            "reviewerName": "katwomyn",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "perfect grind everytime",
            "reviewDate": "July 5, 2018",
            "reviewText": "I don't know how I lived this long without freshly ground coffee. I've used this grinder everyday and it still works well, perfect grind everytime."
        },
        {
            "reviewerName": "Michael Lopez",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Five Stars",
            "reviewDate": "June 18, 2017",
            "reviewText": "works great"
        },
        {
            "reviewerName": "Soupy",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "I enjoyed years of solid use from my first unit but ...",
            "reviewDate": "January 25, 2015",
            "reviewText": "The is an outstanding grinder. This is the second time I bought this exact model. I enjoyed years of solid use from my first unit but the electric cord became frayed and damaged where the bottom of the grinder body rubbed against the cord. Instead of fixing the first I bought a new second keeping in mind to regularly inspect the cord for damage. This grinder is very powerful."
        },
        {
            "reviewerName": "mcknzallen",
            "rating": "4.0 out of 5 stars",
            "reviewTitle": "Grinder that gets the job done.",
            "reviewDate": "May 3, 2019",
            "reviewText": "This is the a simple low-cost grinder that is perfect for grinding coffee beans on a daily basis. It holds up and had one for 10 years and then just bought a replacement. That said, it probably has a 10-year lifespan."
        },
        {
            "reviewerName": "Denise S. Trussell",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Great but not for Coffee",
            "reviewDate": "May 4, 2017",
            "reviewText": "This is the Best for grinding anything But coffee. Had one yrs ago that had 2 settings and blade removed for ez cleanup. This is a single speed unit that grinds anything in seconds. Still has pulse feature. Use mine to grind bird seed."
        },
        {
            "reviewerName": "EMV2010",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Perfect for me",
            "reviewDate": "August 12, 2013",
            "reviewText": "My friend bought me this model almost 10 years ago, and it just recently burnt out. It lasted almost 10 years!!!! Can you believe it? So I bought a new one and I'm hoping for the same results. I only drink one cup of coffee a day. I like to grind my own beans and keep them in a container fresh. I love this grinder. It does the job for me! Just take good care of it. Don't leave it getting wet in the sink. Clean it out with a damp rag after each use."
        },
        {
            "reviewerName": "Liz D",
            "rating": "4.0 out of 5 stars",
            "reviewTitle": "It doesn't grind it as finely as I would like it but it's",
            "reviewDate": "December 31, 2017",
            "reviewText": "It works well. It doesn't grind it as finely as I would like it but it's ok"
        },
        {
            "reviewerName": "GKMiyake",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Arrived quickly and works as advertised.",
            "reviewDate": "November 7, 2019",
            "reviewText": "Works as advertised and appears sturdy enough to last."
        },
        {
            "reviewerName": "Tempus",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Five Stars",
            "reviewDate": "July 28, 2017",
            "reviewText": "Just like my old one, works well. Let's hope it holds up just as long!"
        },
        {
            "reviewerName": "Karen Bell",
            "rating": "3.0 out of 5 stars",
            "reviewTitle": "... at grinding and makes a humming noise but I like the lid which you can remove and put back ...",
            "reviewDate": "December 4, 2017",
            "reviewText": "it is a little slow at grinding and makes a humming noise but I like the lid which you can remove and put back without coffee grinds getting in the way"
        },
        {
            "reviewerName": "DJ Jim",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Great grinder",
            "reviewDate": "February 7, 2019",
            "reviewText": "Dropped the old one too many times. Bought the same kind because it was great."
        },
        {
            "reviewerName": "Kindle Customer",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "A great little machine",
            "reviewDate": "January 9, 2012",
            "reviewText": "I used this machine for the first time today. 2 or 3 presses on the button and the coffee beans were ground to little coarse grounds. Not too fine and not too coarse. Just perfect. I don't understand why so many people complain about the noise. What do you expect? It's quieter than a vacuum cleaner. Or a garbage disposal. Do you complain about those too? I highly recommend it. There's no need to pay more than 20 bucks."
        },
        {
            "reviewerName": "Lisa C-Indy",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "*",
            "reviewDate": "August 23, 2019",
            "reviewText": "Read the stars"
        },
        {
            "reviewerName": "Vikki from Florida.",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Good",
            "reviewDate": "September 8, 2019",
            "reviewText": "Just as expected."
        },
        {
            "reviewerName": "AMTT1001",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Five Stars",
            "reviewDate": "July 21, 2017",
            "reviewText": "works great with a great pri$e"
        },
        {
            "reviewerName": "Bonnie H.",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "works great. Nice and simple for those who don't want ...",
            "reviewDate": "February 18, 2018",
            "reviewText": "Second one I've bought, works great. Nice and simple for those who don't want to fuss around with buttons and settings."
        },
        {
            "reviewerName": "Roger",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "good grinder",
            "reviewDate": "June 16, 2019",
            "reviewText": "It last for our home up to 5 years"
        },
        {
            "reviewerName": "PatrickN",
            "rating": "4.0 out of 5 stars",
            "reviewTitle": "Great little grinder",
            "reviewDate": "March 19, 2019",
            "reviewText": "Pretty powerful. Works for what I need it for. Noisy, though."
        },
        {
            "reviewerName": "Henrique Negrisoli",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Five Stars",
            "reviewDate": "October 20, 2017",
            "reviewText": "Simple, and it does the job."
        },
        {
            "reviewerName": "mhardison79",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Cuisinart, a brand you can trust.",
            "reviewDate": "January 28, 2018",
            "reviewText": "Quality product. I have 2, one for coffee and one fir spices. I bought this one as a gift and the receiver was ecstatic."
        },
        {
            "reviewerName": "M. Hulette",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Works well for making powdered dehydrated food.",
            "reviewDate": "October 30, 2018",
            "reviewText": "I don't drink coffee but I use this to grind up dehydrated food for backpacking. Makes measuring bark a breeze."
        },
        {
            "reviewerName": "Levent",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Excellent",
            "reviewDate": "April 20, 2019",
            "reviewText": "Excellent product and excellent service."
        },
        {
            "reviewerName": "Cheryl H",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "A very good buy",
            "reviewDate": "March 17, 2019",
            "reviewText": "Low noise, perfect size, extremely easy to use and clean. An excellent, cost effective grinder."
        },
        {
            "reviewerName": "Kristy Simmon",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Nice",
            "reviewDate": "May 2, 2019",
            "reviewText": "Nice, however I think its a little pricey."
        },
        {
            "reviewerName": "SRMike",
            "rating": "1.0 out of 5 stars",
            "reviewTitle": "Don't buy. Dead in less than a month.",
            "reviewDate": "May 5, 2019",
            "reviewText": "This product overheated and died in a few weeks. Worked fine and then died. piece of Sh*t. Don't buy!"
        },
        {
            "reviewerName": "Merci",
            "rating": "1.0 out of 5 stars",
            "reviewTitle": "Motor made a strange sound",
            "reviewDate": "April 4, 2019",
            "reviewText": "Loud and strange sounding, sent it back."
        },
        {
            "reviewerName": "michael",
            "rating": "3.0 out of 5 stars",
            "reviewTitle": "worth the price but bad design, the cup cannot be removed to wash",
            "reviewDate": "March 20, 2018",
            "reviewText": "worth the price but bad design , the cup cannot be removed to wash.."
        },
        {
            "reviewerName": "Beth T.",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Perfect small grinder",
            "reviewDate": "August 27, 2017",
            "reviewText": "This was exactly what we needed. No frills, get the job done, and economical"
        },
        {
            "reviewerName": "jacie",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Five Stars",
            "reviewDate": "August 18, 2018",
            "reviewText": "works well"
        },
        {
            "reviewerName": "nathan",
            "rating": "2.0 out of 5 stars",
            "reviewTitle": "We returned it",
            "reviewDate": "March 5, 2013",
            "reviewText": "We bought this to replace an older grinder. While it was quiet, it also smelled hot when used. We tried it for a couple of weeks to see if it would improve but the odor never went away. We also found the capacity to be a bit small."
        },
        {
            "reviewerName": "Vidi",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Small and compact",
            "reviewDate": "July 18, 2018",
            "reviewText": "This is an amazing appliance to have in the kitchen. It is small and compact and does the job. I use it to grind nuts for cooking purposes. Would recommend to a friend"
        },
        {
            "reviewerName": "lucidacat",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "The perfect bean grinder...",
            "reviewDate": "August 29, 2017",
            "reviewText": "No surprises...which is exactly what I want in a coffee grinder. It is sturdy and takes up little space in my very small kitchen. It grinds perfectly and very quickly."
        },
        {
            "reviewerName": "Will",
            "rating": "1.0 out of 5 stars",
            "reviewTitle": "Crapola",
            "reviewDate": "October 14, 2019",
            "reviewText": "Had for a week before it broke. Buying a Krups next hopefully it’ll hold up"
        },
        {
            "reviewerName": "Amazon Customer",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Love it",
            "reviewDate": "January 11, 2018",
            "reviewText": "Compact grinder. Does great job."
        },
        {
            "reviewerName": "TLW",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Good item",
            "reviewDate": "August 10, 2019",
            "reviewText": "Works great"
        },
        {
            "reviewerName": "Jorge Aragon",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "You cant miss it",
            "reviewDate": "August 10, 2019",
            "reviewText": "Excellent product, very well designed"
        },
        {
            "reviewerName": "Anna",
            "rating": "1.0 out of 5 stars",
            "reviewTitle": "Smaller portions, but compact and priced well!",
            "reviewDate": "November 8, 2015",
            "reviewText": "I really needed a coffee grinder, and wanted something small (I have a tiny apartment) and affordable (I'm poor!). This grinder does the job well, though I wish it was in another color (the white really shows the grounds and looks a little cheap, even though it's durable enough). Because it's so compact it doesn't grind very much at one time, but it's nice to have a compact and efficient way to make fresh coffee in the morning.\n\nUpdate: Motor died yesterday mid-grind. So, lasted less than two years."
        },
        {
            "reviewerName": "harvi",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Great product",
            "reviewDate": "February 19, 2019",
            "reviewText": "good quality and easy to clean ."
        },
        {
            "reviewerName": "Amazon Customer",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Really does the job/solid product",
            "reviewDate": "March 3, 2010",
            "reviewText": "This is a lovely, heavy unit that works beautifully. I bought it mainly for spices but did use it first for coffee beans when I was having trouble with my burr grinder. Since I'm used to turning a wheel on the burr grinder to get the level of grind I need, I had to experiment a couple of times to get it right with this grinder but the result was consistent and evenly ground coffee beans. I used them in my french press and it was perfect.\n\nI'll probably keep this exclusively for spices since I already have a burr grinder but it is a well made, attractive addition to my countertop and I found nothing awkward about using it. The top fits well and the pulsing was far more quiet than I'd expected. A good product in all I'd say."
        },
        {
            "reviewerName": "T",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "It grinds!",
            "reviewDate": "December 2, 2018",
            "reviewText": "It grinded my coffee. Good job"
        },
        {
            "reviewerName": "Donna Ho",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Kitchen tools",
            "reviewDate": "October 23, 2019",
            "reviewText": "Good product"
        },
        {
            "reviewerName": "Amazon Customer",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Five Stars",
            "reviewDate": "December 18, 2017",
            "reviewText": "Nice unit. Does the job!"
        },
        {
            "reviewerName": "Craig Hathaway",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Worth the money, does a great job",
            "reviewDate": "February 6, 2019",
            "reviewText": "Does a great job"
        },
        {
            "reviewerName": "Lawanda Corbin",
            "rating": "4.0 out of 5 stars",
            "reviewTitle": "Four Stars",
            "reviewDate": "May 21, 2018",
            "reviewText": "Happy with product, would purchase again."
        },
        {
            "reviewerName": "MJB",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Great value & easy to use",
            "reviewDate": "February 28, 2017",
            "reviewText": "Great quality, low price, very easy to use and clean.\nGrinding my own beans at home has taken my morning coffee to the next level.\nHighly recommend."
        },
        {
            "reviewerName": "Ashley Rushmore",
            "rating": "1.0 out of 5 stars",
            "reviewTitle": "One Star",
            "reviewDate": "February 22, 2018",
            "reviewText": "Not much control of grind. I never get an even grind."
        },
        {
            "reviewerName": "Eric",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": ".",
            "reviewDate": "December 29, 2018",
            "reviewText": "Thank you"
        },
        {
            "reviewerName": "Herbert Schneider",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "easy to use",
            "reviewDate": "May 1, 2019",
            "reviewText": "good on switch, not as loud as my old grinder, top of the line"
        },
        {
            "reviewerName": "Candace Wally",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Travels anywhere",
            "reviewDate": "August 31, 2019",
            "reviewText": "The coffee grinder is light weight, easy to use and the coffee tastes so much better when you grind the beans and make it fresh."
        },
        {
            "reviewerName": "Mary Lynn Hurst Riley",
            "rating": "4.0 out of 5 stars",
            "reviewTitle": "Good gift",
            "reviewDate": "October 23, 2016",
            "reviewText": "Purchased as a gift for my son. He is very pleased with this product and ease of use. This makes fresh ground coffee easily made and my son uses this daily."
        },
        {
            "reviewerName": "anonymous",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Good",
            "reviewDate": "February 8, 2019",
            "reviewText": "Good product, would buy again"
        },
        {
            "reviewerName": "DEREK",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Five Stars",
            "reviewDate": "June 20, 2018",
            "reviewText": "Great grinder, as long as you don't overfill it!"
        },
        {
            "reviewerName": "Sweetreads",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Fab coffee grinder",
            "reviewDate": "May 21, 2019",
            "reviewText": "Such a nice coffee grinder. It is easy to use and clean. A great grinder for a great price."
        },
        {
            "reviewerName": "Shine",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Five Stars",
            "reviewDate": "April 14, 2018",
            "reviewText": "Just perfect"
        },
        {
            "reviewerName": "Interstitialist",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Solid feel to it, seems well made.",
            "reviewDate": "July 31, 2018",
            "reviewText": "Solid feel to it, seems well made. Works great."
        },
        {
            "reviewerName": "Kelly A. Brown",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Great product and price",
            "reviewDate": "May 8, 2018",
            "reviewText": "The cord is a little short but it works great. Powerful and compact."
        },
        {
            "reviewerName": "The Tusk",
            "rating": "4.0 out of 5 stars",
            "reviewTitle": "Excellent product, reliable and very easy to use...",
            "reviewDate": "June 23, 2016",
            "reviewText": "I have been using a coffee bean grinder for years. I use this one at work each morning. It is easy to use, has a high capacity, tough and reliable. I would highly recommend this product to anyone as it is an excellent value for the money."
        },
        {
            "reviewerName": "🔮🦄 andi🦄🔮",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Just what I was looking for",
            "reviewDate": "July 9, 2018",
            "reviewText": "Exactly what we needed! Works great."
        },
        {
            "reviewerName": "G. Wilson",
            "rating": "3.0 out of 5 stars",
            "reviewTitle": "Not Up to Quisinart Name",
            "reviewDate": "June 20, 2013",
            "reviewText": "I bought this to replace 2 Mr. Coffee grinders that had failed when the plastic disintegrated. I bought this mostly because of the name thinking I would get a quality product. The grind is great but it doesn't hold very much coffee and it is difficult to empty. When emptied into the lid by turning it upside down according to the instructions, the ground coffee overflows the lid and spills. When I try to empty from the grinding container, it flows quickly and spills. I wind up emptying it with a spoon to avoid spills. It takes two grinds to make 12 cups of coffee. I have replaced mine and sent it to Goodwill. I replaced it with the larger Quisinart which I found on sale locally and love it. It has a removable grinding basket and holds enough coffee for 12 cups. I recommend that one."
        },
        {
            "reviewerName": "Van C Nguyen",
            "rating": "4.0 out of 5 stars",
            "reviewTitle": "I like it. For 18 usd I don't expect much",
            "reviewDate": "March 9, 2018",
            "reviewText": "I like it .For 18 usd I don't expect much.\nSo far it's doing the job.\nVanCNguyen"
        },
        {
            "reviewerName": "Shannan E. Fraser",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Five Stars",
            "reviewDate": "April 1, 2018",
            "reviewText": "Back up grinder. Comes in handy for a multitude of things"
        },
        {
            "reviewerName": "SS",
            "rating": "4.0 out of 5 stars",
            "reviewTitle": "Great for the Price",
            "reviewDate": "April 11, 2015",
            "reviewText": "This is a compact device that grinds coffee beans well. The sound it makes when it grinds is actually quite nice at least compared to the sound my blender makes."
        },
        {
            "reviewerName": "Toopie69",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Love my Cuisinart!",
            "reviewDate": "February 13, 2018",
            "reviewText": "Works wonderful after owning it a few month and daily use!"
        },
        {
            "reviewerName": "Mtemnorod",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Five Stars",
            "reviewDate": "March 4, 2018",
            "reviewText": "Nice"
        },
        {
            "reviewerName": "IrishDee",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Little Macine, Big Perfcormance.",
            "reviewDate": "May 5, 2015",
            "reviewText": "Very handy little grinder. Works well for coffee beans of course, but works equally well with oven roasted spices and nuts for that matter. Little machine, big performance. Gotta love it."
        },
        {
            "reviewerName": "ninemommer",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Great grinder",
            "reviewDate": "June 27, 2018",
            "reviewText": "Very happy with this grinder!"
        },
        {
            "reviewerName": "apryle",
            "rating": "4.0 out of 5 stars",
            "reviewTitle": "good for the money",
            "reviewDate": "April 2, 2018",
            "reviewText": "works ok will not get real fine"
        },
        {
            "reviewerName": "Midwest",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Great for home use and the price!",
            "reviewDate": "May 24, 2017",
            "reviewText": "I make 8 cups every day and this grinder is just the right size for home use. Simple, no frills, no brush. At this price a treasure."
        },
        {
            "reviewerName": "Amberzon",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Good",
            "reviewDate": "March 18, 2018",
            "reviewText": "Works as expected and was a great price"
        },
        {
            "reviewerName": "Sunni D.",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Works well",
            "reviewDate": "March 30, 2017",
            "reviewText": "Nice coffee grinder. Works well."
        },
        {
            "reviewerName": "Amazon Customer",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "My mom loved the coffee grinder",
            "reviewDate": "July 28, 2017",
            "reviewText": "Bought it for my mom and she liked how fine this coffee grinder grinds her coffee."
        },
        {
            "reviewerName": "Kenny D",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Five Stars",
            "reviewDate": "January 15, 2018",
            "reviewText": "great product, love that fresh ground coffee"
        },
        {
            "reviewerName": "Dan L Roper",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "great job",
            "reviewDate": "February 19, 2018",
            "reviewText": "using as a spice grinder....great job"
        },
        {
            "reviewerName": "Judith Yap",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Five Stars",
            "reviewDate": "May 25, 2017",
            "reviewText": "ample bowl for the coffee beans. works well"
        },
        {
            "reviewerName": "Marissa",
            "rating": "2.0 out of 5 stars",
            "reviewTitle": "but this thing sucks. The way the lid fits on the top ...",
            "reviewDate": "February 3, 2018",
            "reviewText": "So I never write reviews but this product is so frustrating I had to. I figured with a Cuisinart coffee grinder I couldn't go wrong, but this thing sucks. The way the lid fits on the top means you can't load that many beans, and have to move the beans out of the way for it to fully close. It's such a small amount I have to do it twice to make a small batch of French press coffee. I've used other grinders that work perfectly so I never even imagined that a design could be so flawed, especially for Cuisinart. Disappointing. Cheaper ones I've bought by \"no name\" brands are far better."
        },
        {
            "reviewerName": "Marley",
            "rating": "1.0 out of 5 stars",
            "reviewTitle": "Poor",
            "reviewDate": "September 21, 2017",
            "reviewText": "Terrible. Grind unevenly. Heats up. lasted 1 year then died."
        },
        {
            "reviewerName": "Tao Tang",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Five Stars",
            "reviewDate": "November 30, 2016",
            "reviewText": "Great product"
        },
        {
            "reviewerName": "Kate",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "I like it!",
            "reviewDate": "September 10, 2019",
            "reviewText": "Cute product, works well. Exact what I expected."
        },
        {
            "reviewerName": "CAB",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Five Stars",
            "reviewDate": "April 30, 2018",
            "reviewText": "useful"
        },
        {
            "reviewerName": "RODEO",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Five Stars",
            "reviewDate": "April 12, 2018",
            "reviewText": "Great"
        },
        {
            "reviewerName": "Bill",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Five Stars",
            "reviewDate": "May 1, 2018",
            "reviewText": "none"
        },
        {
            "reviewerName": "spoils mcgee",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Great",
            "reviewDate": "March 21, 2017",
            "reviewText": "Good product, as expected, fast shipping."
        },
        {
            "reviewerName": "BHC",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Five Stars",
            "reviewDate": "May 12, 2017",
            "reviewText": "Nice grinder, purchased to grind chia seeds."
        },
        {
            "reviewerName": "jason",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Five Stars",
            "reviewDate": "May 28, 2015",
            "reviewText": "A multi-function tool. I bought it to mulch flax and chia seeds for supreme nutrition."
        },
        {
            "reviewerName": "Melody",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Five Stars",
            "reviewDate": "April 29, 2018",
            "reviewText": "Love grinding my coffee beans."
        },
        {
            "reviewerName": "Vlamir",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Five Stars",
            "reviewDate": "August 25, 2017",
            "reviewText": "good product"
        },
        {
            "reviewerName": "hugo mejia",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Buena compra",
            "reviewDate": "September 22, 2018",
            "reviewText": "Excelente"
        },
        {
            "reviewerName": "CL",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Five Stars",
            "reviewDate": "May 1, 2018",
            "reviewText": "No Complaints."
        },
        {
            "reviewerName": "mb",
            "rating": "1.0 out of 5 stars",
            "reviewTitle": "One Star",
            "reviewDate": "February 28, 2018",
            "reviewText": "too small"
        },
        {
            "reviewerName": "John",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Five Stars",
            "reviewDate": "May 27, 2018",
            "reviewText": "AWESOME!"
        },
        {
            "reviewerName": "DaniLovestoShop",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Five Stars",
            "reviewDate": "February 23, 2017",
            "reviewText": "Used it a couple of times already and it seems to work perfectly!"
        },
        {
            "reviewerName": "Kim M",
            "rating": "1.0 out of 5 stars",
            "reviewTitle": "One Star",
            "reviewDate": "April 17, 2017",
            "reviewText": "It burned out in about a month...."
        },
        {
            "reviewerName": "Sally Seas",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Five Stars",
            "reviewDate": "March 24, 2017",
            "reviewText": "Use it every morning"
        },
        {
            "reviewerName": "Amazon Customer",
            "rating": "3.0 out of 5 stars",
            "reviewTitle": "Three Stars",
            "reviewDate": "May 18, 2017",
            "reviewText": "Wish it held more"
        },
        {
            "reviewerName": "larry parise",
            "rating": "2.0 out of 5 stars",
            "reviewTitle": "Two Stars",
            "reviewDate": "June 5, 2016",
            "reviewText": "ok"
        },
        {
            "reviewerName": "lynettieo",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "looks nice.",
            "reviewDate": "June 11, 2017",
            "reviewText": "Works very well, is quiet, looks nice."
        },
        {
            "reviewerName": "Debra Baumgartner",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "love it",
            "reviewDate": "November 17, 2017",
            "reviewText": "fantastic for the price"
        },
        {
            "reviewerName": "Goat Farmer",
            "rating": "1.0 out of 5 stars",
            "reviewTitle": "Stopped working in less than 60 days.",
            "reviewDate": "June 8, 2017",
            "reviewText": "Grinder has stopped working after less than 60 days of use."
        },
        {
            "reviewerName": "David",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Five Stars",
            "reviewDate": "March 16, 2017",
            "reviewText": "I am happy with the grinder. I have been using everyday since I received it."
        },
        {
            "reviewerName": "Anomaly",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Very nice buy it!!!!",
            "reviewDate": "November 25, 2016",
            "reviewText": "Perfect thank you"
        },
        {
            "reviewerName": "Richard B.",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "SWEET Grinder!",
            "reviewDate": "July 5, 2014",
            "reviewText": "I love this grinder. This is the second one I have purchased. The first just went belly up after 5 years of heavy use and I immediately went on Ammy and got the same one. I grind dried beans, lentils, dehy carrots, oats, basmati rice, bee pollen, chia seeds, flax seeds, etc. in this grinder for shakes. If you need quality carbs, grind them and put them in your protein shakes!! Right? Talk to me! Works like a dream!! You can grind fresh quinoa, spelt, oat or any kind of flour on the spot too. Toss the booklet that comes with it that says you can't/shouldn't grind all of this stuff.The grinder holds about a 1/4 - 1/3 of a cup and it takes just a minute or two for each batch. I couldn't live as healthily as I do without this little miracle, at least not without chewing my stinking jaw off!"
        },
        {
            "reviewerName": "Susan7254",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Coffee grinder",
            "reviewDate": "April 29, 2017",
            "reviewText": "works great - would recommend"
        },
        {
            "reviewerName": "Doretta",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Five Stars",
            "reviewDate": "February 9, 2017",
            "reviewText": "just the right size\n\ngave as a gift"
        },
        {
            "reviewerName": "Michael R. Hoffman",
            "rating": "1.0 out of 5 stars",
            "reviewTitle": "Crap broke on 3rd use",
            "reviewDate": "May 19, 2018",
            "reviewText": "Crap broke on 3rd use. Cup designed wrong so makes mess. Total said ripoff waste of time. I need coffee now!"
        },
        {
            "reviewerName": "Marg",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Great product.",
            "reviewDate": "January 21, 2018",
            "reviewText": "Replacement for one that lasted 15 years. Great product.."
        },
        {
            "reviewerName": "Margie Thomas",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "AWESOME!",
            "reviewDate": "December 9, 2013",
            "reviewText": "I use this daily and it is AWESOME! It will grind as fine as you like. Easy to use and sits next to my Cuisinart Coffee Maker. Great buy!"
        },
        {
            "reviewerName": "ds0ocx",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Small but good.",
            "reviewDate": "February 17, 2014",
            "reviewText": "I use this to grind the beans for my morning coffee. Two heaping tablespoons of Kona beans grind to perfection in less than 60 seconds. I can't ask for more."
        },
        {
            "reviewerName": "Penpat7",
            "rating": "4.0 out of 5 stars",
            "reviewTitle": "Four Stars",
            "reviewDate": "January 18, 2017",
            "reviewText": "nothing like fresh ground coffee"
        },
        {
            "reviewerName": "Amazon Customer",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Five Stars",
            "reviewDate": "May 23, 2017",
            "reviewText": "I would purchase this product again."
        },
        {
            "reviewerName": "Max Strange",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "It Grinds.",
            "reviewDate": "August 9, 2013",
            "reviewText": "A good coffee grinder. It grinds enough for about 3-4 cups of coffee. Grinds the beans into fine powder in about 10 seconds or so. The plastic top simply comes off and you pour the grounds. It isn't too loud. We have two little girls and they still nap while the beans grind.\nBought 1 year ago and still going strong."
        },
        {
            "reviewerName": "Jess",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Five Stars",
            "reviewDate": "March 21, 2018",
            "reviewText": "Very easy to use. Does a really good job chopping. Very well built."
        },
        {
            "reviewerName": "Jini",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Works great.",
            "reviewDate": "June 15, 2014",
            "reviewText": "This little grinder works great for the purpose I bought it. It came well packaged and on time. It is as described."
        },
        {
            "reviewerName": "MYS121564",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Best coffee grinder",
            "reviewDate": "June 16, 2015",
            "reviewText": "The best coffee grinder on the market. This is our second one, the first one lasted 20 years!"
        },
        {
            "reviewerName": "Tess",
            "rating": "4.0 out of 5 stars",
            "reviewTitle": "Four Stars",
            "reviewDate": "August 20, 2017",
            "reviewText": "Works very well. Would have it a five if the cord wasn't so short.."
        },
        {
            "reviewerName": "Amazon Customer",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Makes a good spice grinder too...",
            "reviewDate": "January 28, 2015",
            "reviewText": "I actually already own one of these but it's been used a lot for coffee, and when I realized I needed the ability to grind up a large quantity of spices, I decided to try this. Because of the cross-contamination issues of the flavors, that's why I purchased a second one; I've found it's especially hard to get coffee-taste or smell off of surfaces short of a dishwasher, and obviously this can't go in there. So, I recommend it for either coffee, or spice. It's a good buy (was $15 when I bought it)."
        },
        {
            "reviewerName": "Dino_G",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Works Great",
            "reviewDate": "December 24, 2016",
            "reviewText": "Use it daily, works great"
        },
        {
            "reviewerName": "D. K. Scalzo",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Five Stars",
            "reviewDate": "October 14, 2015",
            "reviewText": "Great."
        },
        {
            "reviewerName": "Eduard A.",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Excellent",
            "reviewDate": "February 5, 2017",
            "reviewText": "Excellent"
        },
        {
            "reviewerName": "Andrew",
            "rating": "4.0 out of 5 stars",
            "reviewTitle": "Very basic",
            "reviewDate": "September 23, 2011",
            "reviewText": "Very basic coffee grinder. Don't expect anything special from it. Big con is that the power cord is very short. Other than that it is good buy for the price."
        },
        {
            "reviewerName": "Amazon Customer",
            "rating": "4.0 out of 5 stars",
            "reviewTitle": "Four Stars",
            "reviewDate": "February 22, 2018",
            "reviewText": "Looks cool and so far works well."
        },
        {
            "reviewerName": "John Bitna",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Perfect spice grinder.",
            "reviewDate": "March 3, 2016",
            "reviewText": "I use this to grind dried chipotle peppers - it works great!"
        },
        {
            "reviewerName": "Ashanti",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Five Stars",
            "reviewDate": "July 2, 2016",
            "reviewText": "Perfect coffee grinder."
        },
        {
            "reviewerName": "KDinTexas",
            "rating": "4.0 out of 5 stars",
            "reviewTitle": "It works great and I've used it every day since I got ...",
            "reviewDate": "April 19, 2016",
            "reviewText": "My decades-old grinder died and I bought this as a replacement based on the reviews. I rarely use a grinder, but was given a bag of whole-bean coffee so I needed it. It works great and I've used it every day since I got it. It's quiet and fast. My only reason for 4 stars instead of 5 is what others mentioned - it's messy. There doesn't seem to be a way to get the top/cup off without a few grains of coffee spilling out. I'm learning to open it over the sink to avoid the mess."
        },
        {
            "reviewerName": "J. Rivas",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Excellent!",
            "reviewDate": "June 23, 2016",
            "reviewText": "Excellent!"
        },
        {
            "reviewerName": "Hank Lawler",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Five Stars",
            "reviewDate": "September 22, 2016",
            "reviewText": "excellent!"
        },
        {
            "reviewerName": "Amazon Customer",
            "rating": "3.0 out of 5 stars",
            "reviewTitle": "Three Stars",
            "reviewDate": "June 10, 2016",
            "reviewText": "small capacity, nowhere to put the cord"
        },
        {
            "reviewerName": "C. Brad Arnold",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Don't fill it above the top of metal bowl and pulse it several times for about 1-3 seconds so beans don't get hot and it works g",
            "reviewDate": "August 1, 2015",
            "reviewText": "Simple machine.\nDon't fill it above the top of metal bowl and pulse it several times for about 1-3 seconds so beans don't get hot and it works great."
        },
        {
            "reviewerName": "WhistlingDixie",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Size Doesn't Matter",
            "reviewDate": "December 10, 2013",
            "reviewText": "This is a compact coffee grinder that works really well. Takes up little space on our crowded counter top and looks quite nice."
        },
        {
            "reviewerName": "Eva Lingenfelter",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Five Stars",
            "reviewDate": "July 23, 2016",
            "reviewText": "for work"
        },
        {
            "reviewerName": "pam",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Five Stars",
            "reviewDate": "July 18, 2016",
            "reviewText": "good thank you"
        },
        {
            "reviewerName": "pkthoughts",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Great product!",
            "reviewDate": "October 9, 2014",
            "reviewText": "Loved it enough to buy another when the blades got dull after 5 years! Nice and compact and grinds just enough for a pot of coffee"
        },
        {
            "reviewerName": "Faye",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "cuisinart coffee grinder",
            "reviewDate": "May 24, 2014",
            "reviewText": "Great grinder / in seconds you have fresh coffee beans ground for a fresh flavor that you can not get in a store. Love it."
        },
        {
            "reviewerName": "Justa Sal",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "A good grinder",
            "reviewDate": "September 4, 2015",
            "reviewText": "Husband is the coffee drinker. He likes it."
        },
        {
            "reviewerName": "Amazon Customer",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Five Stars",
            "reviewDate": "December 8, 2016",
            "reviewText": "tried it works great"
        },
        {
            "reviewerName": "Judy K",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Coffee Grinder",
            "reviewDate": "July 6, 2013",
            "reviewText": "Actually I use mine for grinding spices to make spice mix blends. Love it and would buy another in the future."
        },
        {
            "reviewerName": "grackle",
            "rating": "4.0 out of 5 stars",
            "reviewTitle": "nice grinder",
            "reviewDate": "May 30, 2012",
            "reviewText": "I've used this grinder for a few days now and it grinds my beans great. And it is the quietest coffee grinder I've ever used - which is a nice feature I did not know that I would like until the first time I used it."
        },
        {
            "reviewerName": "Allan Harmeyer",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Five Stars",
            "reviewDate": "July 29, 2015",
            "reviewText": "Very nice grinder for the price."
        },
        {
            "reviewerName": "Will",
            "rating": "3.0 out of 5 stars",
            "reviewTitle": "I've never seen a design like this and it's just really stupid",
            "reviewDate": "May 14, 2017",
            "reviewText": "The lid fits on the grinder oddly. If you pour the beans into the grinding cup, then try to put the lid on, beans get trapped between the lid and the wall of the grinder. Sometimes I have to use quite a bit of force to make the lid attach properly so the machine can be operated. Then, after you've ground your beans, removing the lid also creates quite a bit of mess because the lid fits INSIDE the grinder cup instead of outside. Whyyy?? I've never seen a design like this and it's just really stupid."
        },
        {
            "reviewerName": "Greg A. Fenniman",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Five Stars",
            "reviewDate": "August 16, 2014",
            "reviewText": "Works like a charm"
        },
        {
            "reviewerName": "Nancy D.",
            "rating": "3.0 out of 5 stars",
            "reviewTitle": "Coarse grind.",
            "reviewDate": "February 17, 2015",
            "reviewText": "Does not grind very fine. Difficult to brew a good cup of coffee with a K-cup."
        },
        {
            "reviewerName": "Arod65",
            "rating": "4.0 out of 5 stars",
            "reviewTitle": "Four Stars",
            "reviewDate": "March 22, 2017",
            "reviewText": "Good item"
        },
        {
            "reviewerName": "little ruppy",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "it grinds!",
            "reviewDate": "December 25, 2012",
            "reviewText": "super affordable and grinds the beans in seconds. haven't had any problems yet. super easy to use. even if it breaks, i'd probably buy another one to replace it. quick and easy."
        },
        {
            "reviewerName": "D. Green",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Easy!",
            "reviewDate": "September 23, 2012",
            "reviewText": "This is absolutely the easiest coffee grinder to use! Quick, not super loud, cleans up\neasily as well. I recommend it!"
        },
        {
            "reviewerName": "Lambo",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Five Stars",
            "reviewDate": "March 8, 2016",
            "reviewText": "Quieter than others out there."
        },
        {
            "reviewerName": "Nan",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Five Stars",
            "reviewDate": "December 8, 2015",
            "reviewText": "best bean grinder ever!"
        },
        {
            "reviewerName": "Dale R. Hurd",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Five Stars",
            "reviewDate": "August 17, 2017",
            "reviewText": "Excellent grinder"
        },
        {
            "reviewerName": "Vid225",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Great buy at a great price",
            "reviewDate": "July 18, 2017",
            "reviewText": "Quieter than our Krups grinder and gives you a good, even grind."
        },
        {
            "reviewerName": "Charlie McLaughlin",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Five Stars",
            "reviewDate": "September 6, 2017",
            "reviewText": "it works"
        },
        {
            "reviewerName": "Julia Wang",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "and works great!",
            "reviewDate": "January 23, 2017",
            "reviewText": "Small, and works great !"
        },
        {
            "reviewerName": "Jeanine K",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Works fast!",
            "reviewDate": "December 28, 2012",
            "reviewText": "This is a replacement for a coffee grinder we've had for more than 2-years. The motor takes less time to grind beans to medium - fine."
        },
        {
            "reviewerName": "Lorey Bivins",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "I love it now can grind all that wonderful coffee that ...",
            "reviewDate": "November 28, 2014",
            "reviewText": "I love it now can grind all that wonderful coffee that was sent from Peru"
        },
        {
            "reviewerName": "Joellen Mcburney",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Cuisenart coffee grinder",
            "reviewDate": "September 13, 2009",
            "reviewText": "A very sturdy and simple to operate product. Cuisinart DCG-12BC Grind Central Coffee Grinder"
        },
        {
            "reviewerName": "Jerry S.",
            "rating": "4.0 out of 5 stars",
            "reviewTitle": "Four Stars",
            "reviewDate": "January 24, 2017",
            "reviewText": "good quality"
        },
        {
            "reviewerName": "Stan & Diana Jones",
            "rating": "1.0 out of 5 stars",
            "reviewTitle": "Maybe a lemon????",
            "reviewDate": "January 10, 2013",
            "reviewText": "Grinder barely worked out of the package. Blade seemed to either slip on the shaft, or the motor stalled. Not sure which. Amazon took it back no questions. Still using our old Krups, and it hasn't died yet. When it does I won't be bying this unit for a replacement. Probably just a bad unit, as we've had very good service from everything we've bought through Amazon. The next on they ship (to someone else) will probably work fine..."
        },
        {
            "reviewerName": "Julianne D.",
            "rating": "1.0 out of 5 stars",
            "reviewTitle": "One Star",
            "reviewDate": "May 27, 2017",
            "reviewText": "This product sucks. Barely grinds coarse salt."
        },
        {
            "reviewerName": "Dan Park",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Five Stars",
            "reviewDate": "March 20, 2016",
            "reviewText": "Awesome"
        },
        {
            "reviewerName": "rogeriolemos",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Five Stars",
            "reviewDate": "April 29, 2016",
            "reviewText": "the best coffe grinder. Them outher kitchenaid I dont like"
        },
        {
            "reviewerName": "Emily T.",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Five Stars",
            "reviewDate": "January 22, 2017",
            "reviewText": "I love it! A great product for the price."
        },
        {
            "reviewerName": "LeoLarry",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Good shipping.",
            "reviewDate": "June 16, 2016",
            "reviewText": "Just what I wanted. Good shipping."
        },
        {
            "reviewerName": "Rishi Singh",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "High Perfomer",
            "reviewDate": "September 14, 2015",
            "reviewText": "My wife loves it. She ordered it for grinding spices, she uses it everyday while cooking."
        },
        {
            "reviewerName": "Kathleen",
            "rating": "3.0 out of 5 stars",
            "reviewTitle": "Was pretty impressed on the difference in flavor",
            "reviewDate": "May 16, 2017",
            "reviewText": "Received my French press about a month ago. Was pretty impressed on the difference in flavor. Love it. Tried contacting someone tonight about getting a new glass container. Mine completely shattered on Mothers Day. Not really even sure what happened. Not trying to get anything for free. Just wanted to buy another glass container.\n\nFor some reason this posted on the wrong item. I love my coffee grinder. Works perfectly. Sorry for the mix up."
        },
        {
            "reviewerName": "MGar",
            "rating": "3.0 out of 5 stars",
            "reviewTitle": "Three Stars",
            "reviewDate": "April 6, 2016",
            "reviewText": "It grinds very well, wish it has a removable cup though."
        },
        {
            "reviewerName": "Allen Olson",
            "rating": "4.0 out of 5 stars",
            "reviewTitle": "Four Stars",
            "reviewDate": "January 4, 2015",
            "reviewText": "works well"
        },
        {
            "reviewerName": "E. Ril",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Five Stars",
            "reviewDate": "March 8, 2016",
            "reviewText": "Great little machine!"
        },
        {
            "reviewerName": "Selene Lee",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Powerful and easy to use",
            "reviewDate": "December 19, 2013",
            "reviewText": "It looks nice and handy, and powerful enough to grind seeds. The noise is acceptable in terms of its grinding power. I recommend it."
        },
        {
            "reviewerName": "Carmen Iriarte",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Five Stars",
            "reviewDate": "July 18, 2016",
            "reviewText": "very satisfied with the service and product"
        },
        {
            "reviewerName": "rafaem marmol",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "muy bueno",
            "reviewDate": "February 25, 2013",
            "reviewText": "muy bueno los felicito son verdaremente serios lo mas importante es que envian el producto deseado por el comprador exelente"
        },
        {
            "reviewerName": "GIENA D. FRIEND-KAUTZ &amp; STEVEN T. KAUTZ",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "GREAT GRINDER....",
            "reviewDate": "November 24, 2012",
            "reviewText": "I'VE GOT THE COFFEE MAKER BY CUISINART THAT GRINDS THE COFFEE BEFORE IT MAKES IT AND IT SOUNDS LIKE A JET LANDING IN MY KITCHEN SO MY PARENTS HAVE THIS ONE AND ITS MUCH BETTER AND I CAN GRIND THE COFFEE AS FINE AS I WANT IT, LOVE THE ITEMS FROM CUISINART...."
        },
        {
            "reviewerName": "Amazon Customer",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Great grinder",
            "reviewDate": "November 14, 2010",
            "reviewText": "I make a lot of health shakes and the grinder is great for grinding the seeds I use in my shakes."
        },
        {
            "reviewerName": "T. B. Campbell",
            "rating": "3.0 out of 5 stars",
            "reviewTitle": "MESSY",
            "reviewDate": "March 1, 2017",
            "reviewText": "It is small so it does not hold much. However, the major problem is it is that after the beans are ground it is very difficult to get it to all pour out and that usually causes a mess as the coffee ground fly all over the place.."
        },
        {
            "reviewerName": "M. Welch",
            "rating": "2.0 out of 5 stars",
            "reviewTitle": "Yes, another counter item",
            "reviewDate": "March 5, 2013",
            "reviewText": "I used it once or twice, never noticed the difference in the taste of the coffee.\nNow just taking up counter space, since I have Peet's grind my beans to what I want, and I don't miss the mess of grinding at home"
        },
        {
            "reviewerName": "Lyni",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Suit bags",
            "reviewDate": "October 17, 2012",
            "reviewText": "Works as needed to take care of my gowns. Good quality and construction. I am able to see through the gown bags to view my item."
        },
        {
            "reviewerName": "Caron DeMauro",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Cuisinart is the best!",
            "reviewDate": "October 24, 2013",
            "reviewText": "As always with Cuisinart, quality goods! Grinds the beans quickly and easy to clean. Solid construction, clean lines and I love white appliances!"
        },
        {
            "reviewerName": "Stacdg",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Wonderful little grinder",
            "reviewDate": "July 30, 2017",
            "reviewText": "Love this little grinder. It grinds the coffee super fine...just the way I like it. I will say cleaning is more difficult than I thought it would be. But I really do love it."
        },
        {
            "reviewerName": "chillsister",
            "rating": "4.0 out of 5 stars",
            "reviewTitle": "Good Choice",
            "reviewDate": "December 29, 2016",
            "reviewText": "Gets a lot of use at my house and is still working. Holds about 6 cups worth of beans."
        },
        {
            "reviewerName": "J. Grimes",
            "rating": "4.0 out of 5 stars",
            "reviewTitle": "get the 'other' one....",
            "reviewDate": "June 4, 2008",
            "reviewText": "this is a public service. You are wondering if you should get the Cusinart or the Braun coffee bean grinder? Trust me, I bought both and the 'other' one is the correct choice. This one has a short cord and a cap that is smaller than the bean reservoir. The 'other' one doesn't have these problems.\n\nYou are probably thinking what happened to the 'other' grinder. Well, I decided, after 2 years, to grind a blend of spices for the BBQ. I did this about 3 or 4 times, and the grinder stopped grinding. I wonder why they called it a 'coffee bean grinder'? Duhhh\n\nSincerely, JCG, tampa"
        },
        {
            "reviewerName": "sjbrn1",
            "rating": "2.0 out of 5 stars",
            "reviewTitle": "Not to great...",
            "reviewDate": "November 26, 2017",
            "reviewText": "Not a very good grinder..."
        },
        {
            "reviewerName": "Elana Rosen",
            "rating": "1.0 out of 5 stars",
            "reviewTitle": "Never worked",
            "reviewDate": "January 2, 2011",
            "reviewText": "The coffee bean grinder never worked. The start button was linked to a tab, made of cheap plastic, that was broken. Without the tab, the machine would not start."
        },
        {
            "reviewerName": "Carolyn R. Gourley",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Great product! Love the perfection of the grind",
            "reviewDate": "September 29, 2016",
            "reviewText": "Great product! Love the perfection of the grind. This is my second one. After about 6 years, I stripped the gears on my first one. Worth it to get another one."
        },
        {
            "reviewerName": "Anne",
            "rating": "1.0 out of 5 stars",
            "reviewTitle": "What a waste of money",
            "reviewDate": "February 20, 2017",
            "reviewText": "What a waste of money. I bought this in November and in February it stopped working!! This item had good reviews😕 Amazon told me to return it but I don't have the box and it is really a hassle to take it in and buy a box..."
        },
        {
            "reviewerName": "Charles Lamb",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Best Grinder Ever",
            "reviewDate": "March 31, 2011",
            "reviewText": "It's not just a better coffee grinder, it's a better life! My Cuisinart DCG-20BK Coffee Bar Coffee Grinder is a symbol for my kitchen counter that says, \"I'm better than you, and I know it!\" When the ladies come over, they see that sleek stylish appliance sitting on my counter. With a quick glance they know that I have the tools to fill them up with a hot cup of coffee. After the anticipation has grown to it's maximum, I'll show them how I work it."
        },
        {
            "reviewerName": "T. L. Sipes",
            "rating": "1.0 out of 5 stars",
            "reviewTitle": "One Star",
            "reviewDate": "February 23, 2015",
            "reviewText": "does not work very well"
        },
        {
            "reviewerName": "Tammara Jorgenson",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Coffee lover",
            "reviewDate": "March 2, 2016",
            "reviewText": "Haven't tried this yet but it is heavy so I'm assuming it will be wonderful"
        },
        {
            "reviewerName": "Salamanderman",
            "rating": "1.0 out of 5 stars",
            "reviewTitle": "Terrible design, makes a mess, and low capacity.",
            "reviewDate": "January 19, 2017",
            "reviewText": "I bought this grinder at a local department store to replace a mr. Coffee blade grinder that was wearing out (had it for years). I normally use a manual burr grinder for a single cup but use the whirly birds to grind beans for large batches of cold-brew. I am very disappointed With this grinder. Here is why.\n1. Lid design: it is designed to fit inside the device, effectively cutting down on capacity and making it hard to accurately gauge the correct amount. Also makes it hard to dump coffee out. Did I mention it is a flat top which makes scooping coffee out far more awkward that a rounded lid? No? Well there you go...\n2. Mess: this thing makes a mess every time. I have tried different capacities of coffee and always lose some of my grind to the countertop, despite being careful.\n3. Power: if you do manage to get coffee beans for the 12 cups advertised be ready to wait as this grinder is way underpowered. It really struggles to get a decent grind, and I'm not talking ultra-fine espresso stuff, just regular medium grind.\n4. Cord: it's advertised to be able to store the cord but go ahead and give it a try. It isn't worth the effort. I have no clue why they just didn't use a wrap-around-the-base design like most other grinders. I store my coffee gear on top of the fridge as decorations when not in use and my wife doesn't like a jumbled mess of wires up there so this sucker gets stuffed in a pantry. Well, it did for the few weeks I used it.....now it is stuffed In a landfill somewhere.\nPlease, avoid this grinder, don't be duped by the name brand and attractive design. You'll be better off with something else."
        },
        {
            "reviewerName": "Faithful Observer",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Functionally like my old trusty Waring Coffee Mill",
            "reviewDate": "October 23, 2013",
            "reviewText": "I was going to get the Krups, based on reviews, but came across this in my favorite hardware store, the price was right and I figured let's keep brick and mortar stores in business, too. This is functionally the same as the two ancient Waring coffee mills I've used for years -- one for coffee, one for spices (BTW, don't use it for nuts; the oily paste is hard to clean out). Why did I need a replacement? The plastic hub that holds the blade has chipped half-away in one of them, and I don't relish the thought of ingesting more plastic someday. (Have stopped using it.) Cuisinart's blade and hub look identical to the Waring, but considering my Waring's age, and not knowing what I may have ground to cause that, I wouldn't hold the Waring's broken plastic against the Cuisinart.)\n\nThis mill looks larger than the Waring, but it turns out it holds the same amount. In fact, the metal cup is actually shorter in the Cuisinart, holding just under a coffee measure less of the rice I used to gauge volume. But the sides above the cup rise higher in the Cuisinart, so it can process the same amount, maybe a bit more. An advantage to the Cuisinart (it seems) is that the lid is sort of double-walled. The inside wall serves as a container, kind of like a modern laundry detergent cap. To empty, hold the top, turn the mill upside down and the contents drop into the inner lid space. (Give the grinder a quick zap to blow all the coffee out.) The lid then makes it easy to pour it all into your filter or a jar. No mess, whereas the old Waring design always has a few grounds stuck to the lid's edge and falling onto the counter.\n\nSo it's not the capacity that accounts for the larger size of the mill, but rather the larger cap, and a hollow compartment for storing excess cord. (Seems senseless, the cord is only 2 ft long!) On the other hand, it's so easy to grind and transfer the results, that running two batches takes just a few seconds more.\n\nNow if only the darn thing were easier to clean, so I could use it for everything."
        },
        {
            "reviewerName": "Mustard Seed Mom",
            "rating": "2.0 out of 5 stars",
            "reviewTitle": "best thing about it is it's pretty on the shelf",
            "reviewDate": "January 27, 2011",
            "reviewText": "I received this as a gift for Christmas because a visitor did not like how my current coffee grinder closes (hamilton beach custom grind). Essentially, she bought herself a grinder to attempt to use at my house. Good luck with that.\n\nThings I dislike about it:\n1) no measurement guides that are worth anything... The one it has is supposedly for 2 cups. What about the other intervals when I have guests?\n2) When I tried to make 8 cups, the lid would not shut and the grinder would not start. I poured the beans into my other grinder and finished the job. How will it make 12 cups if I can't close the lid without beans spilling all over if I can't make 8 cups using the thing?\n3) Cord does not coil easily.\n4) You have to press the button down the whole time it's grinding, there is not selector based on # of cups or desired fineness.\n\nI am not a coffee snob. I am not a grinder snob. Krups burr grinder was equally useless.\n\nI suppose this might work for me if I took a permanent marker and marked the level at which I should pour the beans for my daily preference, and then held the button down the whole time.\n\nGive me my Hamilton Beach custom grind over this any day, even if the lid is a little ornery and the switch cover pops off. At least it gets the job done.\n\nI suppose this sounds unappreciative to the giver... I do appreciate the effort. I just wish it worked at least as well as my other grinder."
        },
        {
            "reviewerName": "Lorne",
            "rating": "1.0 out of 5 stars",
            "reviewTitle": "I had a basic $10 model from Walmart for years that worked better than this until the blades wore down",
            "reviewDate": "March 24, 2016",
            "reviewText": "I would highly suggest picking any other option for a coffee grinder. I had a basic $10 model from Walmart for years that worked better than this until the blades wore down. This unit is hard to hold (I feel clumsy every time I try to make coffee) and because of the poor design the lid doesn't feel like it seals and I always end up with coffee all over the counter. Does not hold very many beans either - definitely not a 12-cup capacity. The one time I tried to fit a few more beans in (not over the capacity, but definitely full) the thing made horrible noises and started smoking. Even after I removed half the beans, it took another minute or so until it started grinding properly again. Unfortunately this was a gift and I don't have the ability to return it, otherwise it would have gone back to the store months ago."
        },
        {
            "reviewerName": "brian3i",
            "rating": "4.0 out of 5 stars",
            "reviewTitle": "Good grinder for up to 4-6 cups",
            "reviewDate": "December 31, 2014",
            "reviewText": "I have had one of these for many years and it has ground a lot of coffee (usually very oily Kona beans). I have found it to give a good grind so long as you time it right. I get the impression from many of the negative reviews that people have been over filling the cup and then expecting a god grind - forget it. I have found that the best performance occurs when you fill the cup with beans just to the level of the stainless steel cup. If you grind for about 15 seconds, this will give you enough coffee for about 4 cups (drip coffee maker). I would still be using it, except I broke the removeable top."
        },
        {
            "reviewerName": "Amazon Customer",
            "rating": "4.0 out of 5 stars",
            "reviewTitle": "Purchasing my 5th grinder and happy about it",
            "reviewDate": "September 16, 2014",
            "reviewText": "Have purchased several of these over the last 15 years. I have one for spices and nuts and one for coffee beans - one black one white. They work for a couple of years until they break. The last one purchased lasted almost 4 years and still costs only about 20 bucks! I use one of the other several times a week. The secrete is not to over load the grinder only fill 1/2 way and do small amounts at a time. The grinder will last much longer. Still when working and for the price these grinders can't be beat! Purchasing my 5th grinder and happy about it."
        },
        {
            "reviewerName": "zuzyq",
            "rating": "3.0 out of 5 stars",
            "reviewTitle": "Does well with grinding, but I didn't ask about ...",
            "reviewDate": "November 17, 2017",
            "reviewText": "Does well with grinding, but I didn't ask about the stainless steel cup. I have a small 2 cup smoothie blender and the cup comes out so it can be cleaned. This grinder has to be turned upside down shaken out, and then wiped clean with a wet towel. Over all okay, but just a reminder to read everything you want and need."
        },
        {
            "reviewerName": "bmak",
            "rating": "2.0 out of 5 stars",
            "reviewTitle": "Very small capacity",
            "reviewDate": "September 2, 2013",
            "reviewText": "Just bought one of these at a department store and it is being returned. The packaging says it grinds enough for 12 cups, as does their youtube video. Blatant lie.... this grinder holds 3/8 of a cup of beans if slightly overfilled. When we make coffee we use 1/8 of a cup (2 tablespoons) of beans with 12 oz of water... which is 2 6 oz cups or one 12 oz mug. The only way you are going to get 12 cups of coffee out of this is if you drink 3 oz cups. For us to make 4 12 oz cups of coffee in the morning I have to grind 2 1/4 cup batches of beans separately. I plan to write Cuisinart about this and will post the response if I get one."
        },
        {
            "reviewerName": "D. Richard Lehman",
            "rating": "3.0 out of 5 stars",
            "reviewTitle": "Brittle",
            "reviewDate": "August 8, 2018",
            "reviewText": "Worked fine until I dropped the lid which shattered. This item is brittle."
        },
        {
            "reviewerName": "steinpfad",
            "rating": "2.0 out of 5 stars",
            "reviewTitle": "Small Capacity",
            "reviewDate": "June 28, 2013",
            "reviewText": "I bought this grinder after my nice automatic 18-cup grinder's motor went out. My husband and I like strong coffee which means we usually grind and brew a third more coffee than what is recommended per cup of water. This little coffee grinder does not have the capacity for 12 cups of coffee like it says... unless you like weak coffee. We have been making double batches to make up for the small capacity. Even if we fill the grinder up to the \"12 cup\" markings on the grinder, it's hard to believe that they actually meant it to fill up the coffee filter for 12 cups. I think we will invest in something larger."
        },
        {
            "reviewerName": "Weir-Traveling",
            "rating": "4.0 out of 5 stars",
            "reviewTitle": "11 years and running",
            "reviewDate": "April 1, 2018",
            "reviewText": "I've had this grinder for 11 years now. It still hasn't given me a reason to replace it.\nIt grinds fairly evenly. I shake it some to help get a more even grind, but like I said, 11 years and it is still going strong."
        },
        {
            "reviewerName": "Octavia",
            "rating": "4.0 out of 5 stars",
            "reviewTitle": "Noisy little gizmo that gets the job done!",
            "reviewDate": "January 20, 2001",
            "reviewText": "Just fill the bowl with beans, press the button and with a lot of noise, this coffee grinder whizzes into action! Nothing's nicer than fresh ground coffee and this Cuisinart lives up tho the \"Cuisinart\" name.\nAreas which I think need improvement are insulation of some sort, if loud, grinding noise for a few minutes bothers you. Also, this unit is not immersible, and you must clean it with a wet cloth rather than being able to dunk the unit in warm, soapy water. For this reason, I do not recommend using this for coffee and for spices, unless you are intentionally blending for flavor.\nThis grinds quite well, however the bowl isn't large and for large pots of coffee, I've found that I must grind the coffee in two loads.\nYou cannot see the consistency of your grind accurately, so you must open the unit and peek. It grinds so well and so quickly that it is easy to over-grind your beans.\nAll in all, it's a handy little gadget that grinds well and quickly. Its blades and motor have withstood regular usage. With little practice, you're able to grind uniformly. With routine use, I'm able to discern when the coffee is ground to my preferences by listening to the sound of the beans within the unit while grinding."
        },
        {
            "reviewerName": "Doug Layton",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Awesome Grinder",
            "reviewDate": "February 23, 2018",
            "reviewText": "I have been using this for years now and I thought I would buy a back up because it is discontinued and I lust love the grinder. I tried the more expensive ones and there not as good."
        },
        {
            "reviewerName": "Fergie",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Absolutely A++",
            "reviewDate": "December 11, 2017",
            "reviewText": "My Dad just loved this!!! It was also gift wrapped so beautifully, thank you for taking the time for putting a little extra love in your packaging!! A++"
        },
        {
            "reviewerName": "Whitney Jackson",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Great Product for a family of coffee lovers",
            "reviewDate": "May 30, 2016",
            "reviewText": "We were gifted this coffee grinder two years ago for our wedding. We have been very pleased with the durability, considering we have went through TWO french presses and just bought our third!\n\nIt is noisy, but it gets the job done well, which is what we needed. Great price for a great product. I strongly recommend this product."
        },
        {
            "reviewerName": "Warren Overpack",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Five Stars",
            "reviewDate": "November 12, 2017",
            "reviewText": "Arrived on-time in good condition. Does a very good job on small batches of coffee beans...just what I needed."
        },
        {
            "reviewerName": "Cody",
            "rating": "1.0 out of 5 stars",
            "reviewTitle": "Cheap, No Parts Available",
            "reviewDate": "January 9, 2013",
            "reviewText": "Bought this for our son going to college. Within a year the plastic tabs on the lid broke off. They are required to operate the grinder. So, we go to order a new lid...guess what....they don't sell ANY parts for this grinder.\nI have a different brand that doesn't use the plastic tabs and it has been working for 15 years. AVOID THIS ONE!\nCC"
        },
        {
            "reviewerName": "Tom Perigrin",
            "rating": "2.0 out of 5 stars",
            "reviewTitle": "Long on design, short on engineering goodness",
            "reviewDate": "July 21, 2008",
            "reviewText": "We take turns making coffee in the office. The first day I met this thing I opened it up and wondered \"Where are the beans supposed to go?\". It's small. We have to grind two batches of french roast beans to get a decent 12 pot cup brew from this thing. Having ground the first batch, I lifted the grinder and started to move it towards the filter... and it was YANKED out of my hands by the combination of the amazingly short cord and the awful exterior design. I'm sure there is a reason for the comma-shaped cross section - but my hands just do NOT fit nicely around it. I'm a big guy, but my hands just do NOT fit around this thing. Maybe it's designed for blacksmiths or Victorian Age pickpockets... but it doesn't fit in MY hands.\n\nSo, after I flung coffee grounds all over the coffee room I got to spend the next 5 minutes playing with Mr Broom and Miss Dust Buster. The next 10 minutes were spent carrying the thing to the electronics engineering department and getting the guy to extend the power cord by 2 feet.\n\nSo, what have we got ? We've got something that is hard to hold, has an abysmally short cord, and doesn't grind enough coffee for a 12 cup pot. I think it might be perfect for a trendy kitchen in a Noo Yawk flat with silver and black accessories, but it's not a robust tool for an office.\n\nPretty, but hard to use."
        },
        {
            "reviewerName": "J. Cornwell",
            "rating": "1.0 out of 5 stars",
            "reviewTitle": "Get a real grinder",
            "reviewDate": "February 5, 2003",
            "reviewText": "The blade broke after 14 months of use. And to take advantage of the warranty, I learned that I was required to send THEM a check for $4.00 for processing costs, not to mention the cost that I would incurr to ship it to them. It was an adequate grinder at best, so I'm definitely not going to bother returning it (I assume that this is Cuisinart's reason for having such a lame warranty in the first place). I wonder if the rest of their product line is like this. Until now, I thought Cuisinart was a name you could trust. I'm very disappointed."
        },
        {
            "reviewerName": "Ann Michels",
            "rating": "1.0 out of 5 stars",
            "reviewTitle": "bogs down almost daily",
            "reviewDate": "July 14, 2013",
            "reviewText": "This coffee grinder makes me furious on a daily basis. In order to grind enough beans to make a pot of coffee, I have to grind in two batches. IF I put enough beans in the grinder for a full pot, it INEVITABLY gets a bean stuck under the blade, then it just whirs and whirs, grinding NOTHING. This is a terrible grinder, unless you like your coffee weak. Very disappointing. A waste of money."
        },
        {
            "reviewerName": "C. Brian Towey",
            "rating": "2.0 out of 5 stars",
            "reviewTitle": "Bad Lid Design",
            "reviewDate": "December 25, 2004",
            "reviewText": "The lid for this grinder has a weird double wall, and coffee gets between the walls. It is very hard to clean. The only work-around we have found is to load and assemble it upside-down. Then, you can turn it over and grind without too much problem with the seal. Our old Krups never had any such problem. I also bought a Cusinart hand mixer recently, because it used to be a good brand. Both were fair to poor. Be warned."
        },
        {
            "reviewerName": "Amanda Huber",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Cheap and dependable",
            "reviewDate": "November 25, 2010",
            "reviewText": "I have an earlier model, DCG-20C, that I bought about 7 years ago in a Home Depot while it was on sale. It has served me faithfully ever since, except for 1.5 years when it was stuck in a hot attic while I was overseas - still worked well when I got home and pulled it back out! If I were a hardcore coffee gourmand, this might not be fancy enough for me, but it serves my preference for freshly-ground coffee perfectly."
        },
        {
            "reviewerName": "True2",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Cuisinart Coffee Grinder",
            "reviewDate": "February 16, 2017",
            "reviewText": "Great little grinder"
        },
        {
            "reviewerName": "A. Popkow",
            "rating": "4.0 out of 5 stars",
            "reviewTitle": "gets the job done",
            "reviewDate": "July 28, 2008",
            "reviewText": "I bought this coffee grinder when a friend bought me whole bean coffee after I got a coffee maker. I found that it works well and grinds the perfect amount for 4 coffee cups. about 30 seconds or 40 pulses provides consistent coffee, and it has been working well for the month I've had it with no deterioration, which seems like a good sign. I would recommend this, but seeing that it's my first coffee grinder I don't have much to compare it with."
        },
        {
            "reviewerName": "Betty",
            "rating": "1.0 out of 5 stars",
            "reviewTitle": "Brand killer",
            "reviewDate": "January 8, 2012",
            "reviewText": "Failed after one use. Put me right off the Cuisinart brand - if they make junk, they make junk. In my experience, Krups is a reliable product."
        },
        {
            "reviewerName": "LKSHarm",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Cuisinart Coffee Grinder",
            "reviewDate": "November 28, 2013",
            "reviewText": "I've used this every day for the past 14 years and it still works great. The cord twists, though. If you're brewing a whole pot of coffee you need to grind 2 batches. Highly recommend."
        },
        {
            "reviewerName": "Vito Giurlanda",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "GRIND IT BABY!",
            "reviewDate": "November 15, 2001",
            "reviewText": "A powerful little sucker! I grind coffee beans, mimosa hostilis, syrian rue seeds, and oatmeal with this bad boy. It kick's serious but!\nI clean it by using a damp paper towel and wipe out the inside chamber.\nI accidentally dropped the lid and made a crack on it. But, it's holding up fine."
        },
        {
            "reviewerName": "Kathleen Donnelly",
            "rating": "3.0 out of 5 stars",
            "reviewTitle": "Coffee grinder",
            "reviewDate": "September 16, 2008",
            "reviewText": "Grinder works well, but does too little at a time. Appears to be difficult to keep clean."
        },
        {
            "reviewerName": "K. Kuhn",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Love it...",
            "reviewDate": "April 10, 2008",
            "reviewText": "Had it for years and still works great. No, it doesn't grind massive quantities at a time. So what? It's efficient, powerful and easy to store due to it's small size."
        },
        {
            "reviewerName": "jf",
            "rating": "1.0 out of 5 stars",
            "reviewTitle": "Krupts is better. This grinder just doesn't have it",
            "reviewDate": "December 29, 2015",
            "reviewText": "Krupts is better. This grinder just doesn't have it. Grounds left in ledges and on top."
        },
        {
            "reviewerName": "The Thinker",
            "rating": "1.0 out of 5 stars",
            "reviewTitle": "Star Rating Adjustment",
            "reviewDate": "June 22, 2016",
            "reviewText": "Star rating average is over-stated at 4.2 stars. Calculated to be less stars at 3.85."
        },
        {
            "reviewerName": "nasaruddin momin",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "great for the price and work.",
            "reviewDate": "March 3, 2009",
            "reviewText": "I had bought for my wife for purpose of grind spices is works well and is fully stainless steel blade too so she like it."
        }
    ],
    "qAndA": [
        {
            "question": "Is it BPA free?",
            "answer": "BPA is used to make plastic Flexible.. Do you see any flexible plastic in it ? Do not suck on the cord Waldo !"
        },
        {
            "question": "How do you get 12 cups from this? I filled to the steel edge per their warning and only yielded 7 cups of grounds",
            "answer": "Not sure, I wonder if they mean for 12 cups of brewed coffee, which we have no problem getting enough beans to brew that much."
        },
        {
            "question": "Can the bowl be removed for cleaning?",
            "answer": "Bowl does not come out. I clean with a moist paper towel about once a month. I just keep the lid on so that foreign matter does not collect in the bowl."
        },
        {
            "question": "Can this run on 220V without any changes to the wiring mechanism?",
            "answer": "yes"
        },
        {
            "question": "Does the top bowl come off. i have this one now and it does. also does it have pulse? mine does have pulse? h-e-b $15 2yrs ago",
            "answer": "No,mine has been working fine.But it has no pulse. I have been using it for grinding coffee beans or black pepper beans\nVCN"
        },
        {
            "question": "How many watts?",
            "answer": "It has 130 watts,just enough for me to grind black pepper beans quickly.\nVanCNguyen"
        },
        {
            "question": "I'm doing the Budwig Protocol as a cancer therapy. Will this grind such a tiny bit as 2 tablespoons at a time?",
            "answer": "Yes this grinder is amazing. I have ground only 1 tsp. with this. Also it grinds my fresh/dried spices."
        },
        {
            "question": "Hi.supports 220v/110v? or only 110v?",
            "answer": "Only 110"
        },
        {
            "question": "How long does it last after using it?",
            "answer": "I have had mine for close to a year and it works well. No issues."
        },
        {
            "question": "What color is the cord?",
            "answer": "White"
        },
        {
            "question": "How many watts is the motor?",
            "answer": "Hi - I think it"
        },
        {
            "question": "Can grind for espresso machine?",
            "answer": "Yes it can."
        },
        {
            "question": "Can i grind spices with this?",
            "answer": "Yes."
        },
        {
            "question": "Is grind size adjustable?",
            "answer": "Unfortunately, no. But the longer you grind the finer it gets."
        },
        {
            "question": "can this product be used with a transformer in another country?",
            "answer": "Sorry M, I have only lived in usa, and never used this product anywhere else except my kitchen counter, and I love it and it works great right here at home"
        },
        {
            "question": "Can this grinder grind coffee beans fine enough for espresso? thank you for your knowledgeable reply.",
            "answer": "I have used it to grind beans for espresso. You just hold the button longer."
        },
        {
            "question": "Could this grind coconut into flour?",
            "answer": "I have never used it for that purpose, but I will say it does a great job on grinding whole beans into a fine constancy and it might just work if you were going to do small batches."
        },
        {
            "question": "can I use it to grind grains (for example quinoa)?",
            "answer": "Short answer: Yes! I have two of these, one for coffee, and the other one for walnuts. I love baking banana walnut muffins and drinking fresh ground coffee. I've never ground quinoa myself as I've only had it as a side dish but I've seen recipes that you can grind your own quinoa at home to make quinoa flour. Simply … see more"
        },
        {
            "question": "What current does the grinder use? 220 or 110?",
            "answer": "Just your regular outlet. 110."
        },
        {
            "question": "does the lid allow you to monitor how fine flax seeds are being ground? (can you see thru the lid)",
            "answer": "yes you can see thru the lid, but it is tinted so it's not like looking through a clear glass."
        },
        {
            "question": "It looks like the plastic lid is smokey, not clear. Can you see the grind clearly through the plastic to know if it is done to your preference.",
            "answer": "Yes you can see. Also you can hear the difference when grinding."
        },
        {
            "question": "Do you push down on it to start or is it operated by an on off switch?",
            "answer": "The white part of lid pushes down to turn on."
        },
        {
            "question": "Does the metal part pop out to wash and pour grinds out or do you have to turn the whole piece upside down to do so?",
            "answer": "No it does not. I was shocked by the lack of quality in this Cuisinart product. I accept that it is for small amounts. However if you fill the cup - do expect the beans to be ground up. If you put in a much smaller amount that the cup holds you might actually get all the beans ground if you press on it long enough."
        },
        {
            "question": "The lid does not seem to be tightly in place. Is it just me or is that how it is designed?",
            "answer": "That is how it is designed. I have had one for many years and recently bought another for work. You just hold down the lid while you pulse a few seconds at a time."
        },
        {
            "question": "Does the cord tuck away somewhere?",
            "answer": "The cord can be tucked into the body of grinder but the plug cannot."
        },
        {
            "question": "is the cord retractable? some say yes, some say no. thank you!",
            "answer": "Mine isn't. Wish it were. Love it anyway. Works great."
        },
        {
            "question": "Does this come also with EU plug?",
            "answer": "No"
        },
        {
            "question": "Why was this not shipped to a po box ?",
            "answer": "I don't have a PO box"
        },
        {
            "question": "Does this grinder come with settings? I want to use this grinder for a course grinder to use for my French Press?",
            "answer": "No it doesn't. The degree of douse grind is a function of how long the user grinds the beans."
        },
        {
            "question": "Is it automatic grinder?",
            "answer": "Yes it is electric. Just push down very easy."
        },
        {
            "question": "How many watts does this grinder use?",
            "answer": "Rated for 130W"
        },
        {
            "question": "can it be used to grind hazelnuts?",
            "answer": "Yes"
        },
        {
            "question": "Can you put the bowl in the dishwasher?",
            "answer": "I wouldn't. I just wipe out will a paper towel"
        },
        {
            "question": "What type of motor is it? How many watts?",
            "answer": "130w good for Coffee but no for spice"
        },
        {
            "question": "How long is the power cord?",
            "answer": "It is 2 feet (24 inches) long, Zachary."
        },
        {
            "question": "How long do you grind the beans to get like a medium grind designed for all coffee makers? Too fine and sediment gets in the brewed coffee.",
            "answer": "I love the grinderwe grind coffee every morning. You control how long you grind it, just don't grind as long. Worth the purchase"
        },
        {
            "question": "How do you retract the cord in the coffee grinder? Is there a button? Thanks",
            "answer": "There's no retractor. My grinder is always plugged in, no need for a retractor."
        },
        {
            "question": "Is this compatible with 220V? Auto voltage?",
            "answer": "I don't know for sure, but I would doubt that it's compatible ."
        },
        {
            "question": "Will this grind fine enough for espresso?",
            "answer": "I use it for herbs..and it does a amazing job..i have not tried coffee beans in it yet. It will grind herbs i grow and dry, down 2 almost dust if i choose. It is wonderful multi device. Anyone that grows herbs ..this is the thing 2 get. I would think it would do an amazing job with coffee beans also.hope this helps"
        },
        {
            "question": "Do you have to hold down the button to grind, or is it press 'n go?",
            "answer": "You have to hold it. I think they are all made this way purposely so you have control over how finely it grinds. It only takes a few seconds."
        },
        {
            "question": "If the black is discontinued, what color do you get?",
            "answer": "The black is still available for sale."
        },
        {
            "question": "is this grinder made in usa? thank you",
            "answer": "Nope made in China"
        },
        {
            "question": "Is there a comparable grinder made in USA?",
            "answer": "This is a really nice worth the money"
        },
        {
            "question": "110V only?",
            "answer": "Yes, 110V only."
        },
        {
            "question": "How long is the power cord",
            "answer": "Its pretty short - less than a metre even."
        },
        {
            "question": "just received the ginder, this may be an obvious question, but how to use the storage for the power cord? I cannot turn the base to wind it up...",
            "answer": "I have given up on trying to stuff the cord up into the storage area. the wire is way to stiff."
        },
        {
            "question": "Can I buy the lid by itself?",
            "answer": "This is sold as listed only."
        },
        {
            "question": "Is it automatic grinder?",
            "answer": "To my knowledge I don’t believe so. I got this as a gift for a relative in Minnesota. I do not own this product ."
        },
        {
            "question": "Is t his the same as the DCG-20N? If not, what is the difference?",
            "answer": "Check their website."
        },
        {
            "question": "I had a cuisinart where the grinds went everywhere. it leaked out of the bowl and cleanup was a mess. does that happen with this mode?",
            "answer": "No, very clean and easy to use. Just wipe out when done."
        },
        {
            "question": "Is the grinding bowl removable for easy cleaning?",
            "answer": "No it's not"
        },
        {
            "question": "how to replace blade??",
            "answer": "Peter C., Hello. I have not done that YET but, I hope I can sharpen the blades a couple times. Maybe 10. Good luck. Sorry my answer is Not good. Maybe next time,I can benefit.Pamela"
        },
        {
            "question": "Is this work in 220v? Or only for 110v?",
            "answer": "Only 110v. Perhaps you can search to see if one is available on Amazon? If not, search Google."
        },
        {
            "question": "How tall is it?",
            "answer": "Height 7 inches\nWidth 3.5 inches\nDepth 4.25 inches… see more"
        },
        {
            "question": "Hi, can I grind beans and nuts with it?",
            "answer": "I never try, I use it for only coffee ..."
        },
        {
            "question": "How many watt's/powerful is ths coffee grinder?",
            "answer": "Don't know. I only use it to grind spices."
        },
        {
            "question": "Why was this discontinued? Was there something dangerous/wrong with it?",
            "answer": "Most manufacturers produce new models every year. There is nothing wrong with grinder."
        },
        {
            "question": "Does it have multiple settings for coarseness of grind?",
            "answer": "It doesn’t. But you can see the grind through the glass, then you decide if you grind it for longer or not. Very easy to use. I recommend it."
        },
        {
            "question": "Received the Cuisinart DCG-12BC Grind Central Coffee Grinder as a gift. Says it does 18-cup capacity but marking on grinder cup only goes to 12-cups. What's up?",
            "answer": "The ones that broke on me couldn't even handle two cups. The design flaw makes the beans wedge between the blade and the bottom, making the motor work overtime and catch fire. So the answer is neither. Try and return it for a better one."
        },
        {
            "question": "Can it be used to grind nuts?",
            "answer": "The instruction booklet states to use this to only grind roasted coffee beans. It further states, \"Grinding other substances, such as nuts, spices or unroasted beans may dull the blade and cause poor grinding or injury.\""
        },
        {
            "question": "What is the warranty period on this grinder?",
            "answer": "You won’t need it"
        }
    ]
}