{
    "productInformation": [
        {
            "Product Dimensions": "7.1 x 4.1 x 3.7 inches"
        },
        {
            "Item Weight": "2.6 pounds"
        },
        {
            "Shipping Weight": "2.75 pounds (View shipping rates and policies)"
        },
        {
            "Department": "Appliances"
        },
        {
            "Manufacturer": "Kitchenaid Inc"
        },
        {
            "ASIN": "B003WIZ5PC"
        },
        {
            "California residents": "Click here for Proposition 65 warning"
        },
        {
            "Item model number": "BCG111OB"
        },
        {
            "Customer Reviews": "4.1 out of 5 stars\n    2,004 ratings\n4.1 out of 5 stars"
        },
        {
            "Best Sellers Rank": "#2,999 in Kitchen & Dining (See Top 100 in Kitchen & Dining)\n#16 in Coffee Grinders\n"
        },
        {
            "Date first listed on Amazon": "August 1, 2010"
        }
    ],
    "productDescription": [
        "The KitchenAid Blade Coffee Grinder makes quick and simple work of grinding beans for up to 12 cups of coffee.",
        "Markings on the inside of the stainless steel bowl indicate suitable bean levels for 4, 8, 10 or 12 cups of brewed coffee, and the clear top cover slides on for one-touch operation.",
        "Allows for operation at the touch of a buttonsimply push down on the cover to begin grinding and release to stop. The clear cover also allows you to easily see the consistency of grinds.",
        "Offers durability and powerful performance, quickly grinding enough whole coffee beans to make up to 12 cups of coffee.",
        "Features measurement markings on the inside, so you know at a glace the quantity of coffee beans needed to make 4, 8, 10 or 12 cups of coffee. The bowl lifts out, making it easy to transfer grinds to the coffee maker.",
        "Stainless steel spice grinding bowls with spice optimized blade design, for spices such as coriander and cumin. Included with Model BCG211 or can be purchased separately (Part: BCGSGA).",
        "Heavy duty motor housing, stainless steel 4-ounce capacity bowl with stainless steel coffee grinder blade, clear top cover.",
        "Heavy duty motor housing, stainless steel 4-ounce capacity bowl with stainless steel coffee grinder blade, clear top cover, spice grinder accessory kit.",
        "2 removable grinding bowls to eliminate cross contamination. These grinding bowls have measurement markings and are dishwasher safe. This kit also includes 2 storage lids and 1 shake and sprinkle lid.",
        "1 year hassle-free replacement warranty.",
        "\t\t\t\t\n\tBlade Coffee and Spice Grinder Combo Pack\tBlade Coffee Grinder\tSpice Grinder Accessory Kit\tBurr Coffee Grinder\nCapacity\t4-oz\t4-oz\t2-oz\t7-oz\nClear Cover\t?\t?\t-\t-\nOne-Touch Control\t?\t?\t-\t-\nStainless Steel Blade\t?\t?\t?\t-\nRemovable Bowl\t?\t?\t?\t?\nStainless Steel Bowl\t?\t?\t?\t-\nSpice Grinder\t?\t-\t?\t-\nSafety Switch\t?\t?\t-\t-\nAvailable Colors\tOnyx Black\tEmpire Red, Espresso, Onyx Black\tN/A\tContour Silver, Empire Red, Onyx Black"
    ],
    "reviews": [
        {
            "reviewerName": "James Quin",
            "rating": "4.0 out of 5 stars",
            "reviewTitle": "Very happy... wait a second... {sip} {sip} ahhh",
            "reviewDate": "December 16, 2016",
            "reviewText": "I waited a couple months to write this as there was so much conflicting information in the reviews that I wanted to have an experienced opinion.\n\nNone of the complaints were correct... it works perfectly, I gave it 4 stars as its a basic model and doesn't have advanced setting like grin level etc, but if you just want to grind your own beans for fresh coffee its great. Simple and easy.\n\nI actually just made myself a fresh cup of coffee before sitting down... hold on... {sip} ahhhh,,, that's the stuff.\n\nOne review complained about coffee getting stuck under the blade, and while coffee can get stuck if you over grind by grinding too long or put in too many beans (I usually grind about half a cup of beans at a time), I quickly found that I only had to grind for 10 seconds to get the grind I needed. I suspect the complainer was over-grinding or filling the grinder passed the recommended max bean level. And even when it sticks a little to the bottom (I over grinded the second time I used it and it stuck a little), I have a separate container I use to store a few days worth of ground beans and I turn the removable grind cup upside down and tap it into my container. Its not that hard, and you can easily spin the blade with a knife to loosen any stuck coffee if you overdid it. Hardly an issue, and I would expect all grinders have to be handled in the same manner."
        },
        {
            "reviewerName": "Amazon Customer",
            "rating": "4.0 out of 5 stars",
            "reviewTitle": "Fixing the seal",
            "reviewDate": "August 4, 2017",
            "reviewText": "We recently purchased this coffee grinder for grinding Not Coffee in our lab area. Obviously, this isn't the intended use case, but it seems to work quite well for this purpose. However, when you are grinding anything in the metal container, the plastic part doesn't really properly seal to the cup, and so coffee (or Not Coffee) tends to spill out the sides and into the crevices between the bottom mount and the metal cup, which can be quite a mess and hard to clean. Luckily, a simple fix that we implemented was to place a small O-ring around the top of the coffee grinder to kind of seal the cup, or at least minimize particulate flow out of the cup and into the surrounding area. The O-ring we purchased (it is very cheap on McMaster, though I'm sure there are even cheaper sources) was 3in ID and 3.125in OD (see picture for specific part number) and fits very snugly into the top of the grinder. Now it works quite well without spilling Not Coffee (or coffee) into the side. Hurray!"
        },
        {
            "reviewerName": "Lea",
            "rating": "3.0 out of 5 stars",
            "reviewTitle": "Ok if you're only using it for coffee, I guess",
            "reviewDate": "October 14, 2017",
            "reviewText": "If your intent is to grind your daily Joe this one will work just fine. It packs a punch, strong enough to grind dried cinnamon sticks to dust in almost no time. It has even tackled hard-as-a-rock dried ginseng root with determination. But I am using it to grind herbs, and there are drawbacks.\n\n1. The lid does not fit tightly against the canister. When doing long grinds for harder herbs a lot of dust accumulates between the lid and the canister, and even escapes. When small amounts of herbs are weighed before grinding this translates to an unacceptable loss, throwing off formulas.\n\n2. There are gaps in the construction which allow herb dust to lodge itself into cracks and crevices, making it difficult to get out. I usually have to hit it with a paint brush to sweep it out.\n\n3. I recently threw some sugar into the grinder to powder it. The white sugar \"liberated\" a large accumulation of darker herbs that had been lodged under the grinding blade. Not knowing what I had in there, I had to throw away 1/4 cup of sugar and start again.\n\nI suppose if I were only using it for coffee these drawbacks would be fine--coffee doesn't need a long grind time, and if you're not using it for anything else then perhaps it's ok to have debris left in the mechanism, assuming it would rotate through and be relatively fresh. But this is not a good choice for an herbalist or for a cook who wants to grind their kitchen herbs."
        },
        {
            "reviewerName": "Curtmoss",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "It creates a nice uniform grinds and I'm very happy with it",
            "reviewDate": "October 19, 2016",
            "reviewText": "I got this to replace a Cuisinart grinder that I had for years. At first I didn't care for the KitchenAid's round shape, but after using it for a month now, it's very well built and quieter than the Cuisinart.\n\nIt creates a nice uniform grinds and I'm very happy with it."
        },
        {
            "reviewerName": "Call of Kthalia",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Works perfectly! Also easy clean-up with a few tips!",
            "reviewDate": "July 27, 2016",
            "reviewText": "Despite my worry over the very polarized love/hate reviews... I am so glad I purchased this unit. It works perfectly for my needs and is a breeze to use and clean up.\n\nBackground: I just got a cold brew system (Love, love, love it, here it is if you think you might love smooth, lower-acid cold brew, too:OXO Good Grips Cold Brew Coffee Makerand I needed a grinder since none of my local shops - unless I went to Starbucks exclusively - had one in-store, I had to get one for myself. I looked around, read reviews and settled on this one. I love it and I am actually glad I didn't have the option to settle for grinding in the store! I can use this little guy to make it *just so* and that's awesome!\n\nMy thoughts after using it for awhile:\n\n- So easy to use! Drop your beans in the cup, replace lid and press down to grind! So simple!\n\n- You can also easily adjust according to your needs. But for my needs (of very coarse ground coffee for my cold brew system) I fill the cup to the 10-12 line (see images I attached) and I press 8 times, for a fraction of a second, counting 1, 2, 3, 4, 5, 6, 7, 8! I gently wiggle the unit in my hand, look at the beans and then do the process again, counting to about 5 or 8 depending on how the grind looks at the pause point. More additional grinds are needed for when the beans are less ground up, less when they are more ground up. This makes roughly a cup of coarse grind.\n\n- I have been playing around with different beans and I have found the bean can radically change how it grinds. Very oily beans tend to take a little more grinding and wiggling. They also get stuck in the bottom but I can dislodge them gently with a couple pokes of a spoon and then they fall right out. Oily beans tend not to be as messy outside the grinding cup. Drier beans grind faster and easier. They don't stick in the cup, but they can have little bits that fly into the top. If you remove the lid - with bean bits on it - to look at the beans in the cup (you don't need to to this btw - the lid is clear!) and then replace the lid you are very much more likely to get some bits in the bottom under the cup. I noticed this and I don't remove the lid and put it back on with bits on it anymore. As an aside - the pressure of putting the lid on after removing it could also cause bean bits to fly up and out of the cup. Just don't remove the lid until you are done grinding! EASY FIX to keep CLEAN UP EASY! :-)\n\n- When I am done grinding, I immediately rinse the cup and the lid, and set it out to dry. I feel like hand washing when you can - especially when things don't get really dirty - is the way to go to keep things nice longer. Especially plastic which could get brittle over time from Dishwasher heat settings. So far all I've had to do is blow out literally a couple flakes from the under the cup area. Then I've wiped out the interior (and the exterior of the main unit) with a hot, wet cloth, or a disinfecting wipe periodically. Easy peasy!\n\nBottom line: This thing is so easy to use, works great and is easy to clean. It's not too big and it was a decent price for how well it works, how sturdy it feels, how much I've used it so far and it's aforementioned attributes. Highly suggest you give this baby a try if you need your own grinder, and especially if you are looking into cold brewing! I am not a coffee snob by any means, but cold brew is so yummy you should give it a try! Particularly if you ever find regular coffee too acidic. :-)\n\nHope this review helps, but if you have comments, questions or suggestions - leave a comment! I try to reply as soon as possible. :-)\n\nUPDATE 02/05/2019: Still going strong about a year and a half later. Looks and works like new. No complaints. Would buy again or recommend to anyone who wants to grind their own beans. Thanks!"
        },
        {
            "reviewerName": "Capt. Tea",
            "rating": "1.0 out of 5 stars",
            "reviewTitle": "Shame on KitchenAid",
            "reviewDate": "August 25, 2017",
            "reviewText": "I purchased this grinder as a spice grinder. SO far I've used it twice: once to grind instant tapioca pearls, and once to grind caraway seeds. I both cases, I was grinding an amount less than 3 tablespoons. In both cases, an unacceptable amount of what powder there was flew out of the metal grinding container and into the plastic workings surrounding it. Unacceptable. In both cases, but especially with the caraway seeds, and despite grinding for several 25-second intervals, the result was nowhere near \"ground\" - finely chopped, maybe, but not ground. Unacceptable. Perhaps this thing works better with coffee beans, but I can't imagine it. Waste of money. For a few dollars more, I could have gotten something that actually works. I'd return it, but Amazon's shipping label policy makes this more trouble than it's worth for me."
        },
        {
            "reviewerName": "J. wilborn",
            "rating": "1.0 out of 5 stars",
            "reviewTitle": "Terrible! Broke after two weeks!",
            "reviewDate": "April 26, 2017",
            "reviewText": "Pretty, shiny, Kitchen-Aid. We were so hopeful! It was so terrible. It didn't work as well as the one we had for 10 years even right out of the package, but we were willing to give it a try just because it was pretty. But after two weeks, it has stopped working completely. We can't get it to turn on when we press down at all. We have cleaned it, adjusted every possible thing in it, taken the cup out (and it works with the cup removed), cleaned the cup and wiped the gears....and nothing. Don't waste your money."
        },
        {
            "reviewerName": "R. Shaw",
            "rating": "2.0 out of 5 stars",
            "reviewTitle": "Nice grinder, but will eventually break",
            "reviewDate": "October 3, 2015",
            "reviewText": "We bought this grinder from Amazon in March of 2014, so it just went out of warranty. It worked fine pretty much most of the time. We had a Krups before this, and would have kept using it but had water damage and had to be thrown away. It worked for years without incident, but was a hassle since its grinding cup couldn't be removed. The KitchenAid grinder was better in that you weren't dragging a power cord over your canister where the coffee would go. Even so, my wife wasn't as happy with the way this new grinder seemed to not grind the beans as evenly as the Krups once did. It was a small complaint, and we continued using it.\n\nToday I went to empty the stainless cup, and it wouldn't twist off as normal. I didn't force it, I tried wiggling it a little while trying to twist it. That didn't work, so I carefully laid the grinder on its side and the cup finally came off. I then realized the problem was that a large piece of plastic was preventing the cup from being removed. It was part of the bottom of the cup that interlocks into the motor unit, to hold it in place while grinding. It's just out of warranty, so I tried to simply buy a new cup for it. I figured that would be easy. Not the case. I've been all over the net and can't find the part. I've been on all the sites, so I don't believe they are selling it. This would mean having to buy a whole new unit for the sake of the one part that is most likely to break and takes all of the \"abuse.\"\n\nThe plastic at the bottom that interlocks to the motor shaft has a thin area, and that's where it broke. The plastic itself is quite brittle and reminds me of the older appliances that used Bakelite parts, although I'm sure that's not what it's made of. In short, I can't recommend this grinder since if you can't even buy the one most important and obvious part for it, then the whole thing is worthless. Everything else on it is like new. I've also noted others have had the same problem with this model. I've included a picture. You can see that this hasn't been abused, scraped, bent, mishandled or not used according to the manual. It just broke. I would venture to say that eventually it will happen to yours as well. KitchenAid could diffuse the whole problem by simply offering this part on their website for a reasonable price. The fact that it's not there is ridiculous. KitchenAid has been a trademark for tough reliable products for years, so we purchased the grinder with that in mind. We once owned a KitchenAid dishwasher which was built like a tank. Sadly, I believe they've resorted to making their products overseas like all the other U.S. companies have. Once that happens, then there is no way of knowing what the component parts are really made of."
        },
        {
            "reviewerName": "A. Wheeler",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "I like good coffee",
            "reviewDate": "May 30, 2016",
            "reviewText": "I grew up in San Francisco and lived in Seattle for a long time. In other words, I like good coffee! I know that there are coffee purists who will pooh pooh anything but a burr grinder, but frankly I can't tell the difference between a burr grinder and this one. I had a Cuisinart DCG-12BC that died after a year. Bought another one. Died. Enough of the Cuisinart brand. So I replaced it with this. And I'm super happy with it. It looks nice, but more importantly it does an excellent job of grinding coffee and doesn't spill everywhere when you dump out the grounds, which the Krups F203 does every single time. I've had mine a year, and it seems to be going strong. I'm buying another one for our other house."
        },
        {
            "reviewerName": "mallory",
            "rating": "1.0 out of 5 stars",
            "reviewTitle": "Horrible grinder",
            "reviewDate": "February 12, 2019",
            "reviewText": "This grinder received one star for the fact that it looks nice and seems pretty durable. However, when it comes to actually using the grinder, it is horrible!! Youre supposed to just secure the lid and press down however 9 times out of 10 when you press down nothing happens. I usually have to fight with the thing for 5 to 10 minutes to finally get it to grind. Its super frustrating and very inconvenient. I gave this to my husband for a Christmas present and almost two months later I am witting this review. I gave it some time to see if we just needed to get used to how it worked and we have both tried numerous ways to press down and there is no rhyme or reason on when we can finally get it to grind. We are highly disappointed. Dont waste your money!"
        },
        {
            "reviewerName": "FromTheSouth",
            "rating": "1.0 out of 5 stars",
            "reviewTitle": "WTH? Instructions claim not recommended for expresso machines ...",
            "reviewDate": "February 2, 2019",
            "reviewText": "I ordered this along with an expresso machine. Both items came today. No where in this product's item description does it list it shouldn't be purchased to grind beans for expresso machines. However, when I read this grinder's instructions it states on page 8: \"KitchenAid does not recommend using this grinder to grind beans for pump espresso-type machines.\"\nApparently it is only supposed to be used for automatic drip and French press (which uses a coarse grind). Likely because also on page 8, it also states...\"Longer grinding times result in finer grinds but can overheat the coffee grinds and valuable coffee flavors can be lost.\"\n\nThe product description should clearly state it is recommended for automatic drip and French press coffee machines only!"
        },
        {
            "reviewerName": "authorinak",
            "rating": "2.0 out of 5 stars",
            "reviewTitle": "Full-a-beans!!",
            "reviewDate": "August 10, 2017",
            "reviewText": "Very disappointing! Sure it is nice to look at but its grinding capability is very poor. I think this is due to the depth of the basket and the weaker motor or a combination thereof. I like to grind my coffee very fine - a near powder consistency. This grinder seems unable to do this even at half capacity. A portion of beans are ground finely then stick to the bottom, while most of the beans above it are ground coarsely. I've had to dump out the coarsely ground beans, then scrape out the powdery grounds off the bottom of the canister then put the coarser grind back in for round two. Most definitely NOT the grinder for morning coffeeholics (me) who are need of a quick fix as soon as they get up! I'll be getting another grinder."
        },
        {
            "reviewerName": "Kite Eight",
            "rating": "1.0 out of 5 stars",
            "reviewTitle": "I still dislike this very much",
            "reviewDate": "July 14, 2015",
            "reviewText": "Grind bits all over. This is very messy grinder, I tried to get used to it, but after nearly 1 year, I still dislike this very much.\nIt takes much longer to grind compare to my 10years old hamilton beach grinder. when you shake to get even inside, bits of coffee grind pour over and get underneath grinder and cover. Everymorning I use this, I have to clean the counter and takes more time for me to clean than actually grinding with this things. Kitchin Aid, I really doubt you did testing before this is delivered to customer. This is one of the WORST grinder."
        },
        {
            "reviewerName": "MCRC",
            "rating": "2.0 out of 5 stars",
            "reviewTitle": "Couldn't get consistent grind",
            "reviewDate": "December 11, 2018",
            "reviewText": "I followed the directions carefully and even did some experimenting, and just could not get a consistent grind...too much dust collects under the blade, and too many large particles above it, it's never consistent. I know many people may not care too much and just want their coffee ground for a coffee maker, but I'm using a pour over with a permanent filter, and the bottom of my cup is full of silt when I use this grinder, not to mention that silt causes a bitter flavor. I think the choice here is either to stick to consistent pre ground coffee, or buy a quality (expensive) burr grinder- by most accounts, the cheaper burr grinders won't be better than this one and may actually be worse."
        },
        {
            "reviewerName": "Sage Sorcerer",
            "rating": "1.0 out of 5 stars",
            "reviewTitle": "This grinder seems to have been designed by King Kong",
            "reviewDate": "March 11, 2018",
            "reviewText": "This grinder seems to have been designed by King Kong. I don't have particularly small hands, and find that I can't get my hand around this to pick it up. And speaking of picking up, this is one heavy coffee grinder. Also, I can grind a scoop of coffee beans for 1 minute and still not get a fine grind. I used this about 6 times, then put it into the garage sale box. Somebody else can wrestle with it. I bought a krups grinder. At least I know that I can pick it up with one hand and get a fine grind."
        },
        {
            "reviewerName": "WA8UOC",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "A solid product from KitchenAid with an excellent price ($20)",
            "reviewDate": "December 19, 2018",
            "reviewText": "I have only had this for a few weeks but I am very impressed with the quality. The product is very solid with a stainless steel bowl and blades. The top is made of heavy clear acrylic to view grind consistency. The stainless bowl locks in the base with a 1/4 turn. There are graduations on the bowl for 4,8,10 or 12 cups. The bowl and top are dishwasher safe. Dimensions are H: 8 3/4 W: 3 5/16, D; 4 1/4. With a 160 watt motor it has no problem grinding a full bowl of beans. As with my other KA products I expect to get years of service from this unit. For $20 this is a great buy. So far I have no complaints with this grinder."
        },
        {
            "reviewerName": "Emily H",
            "rating": "1.0 out of 5 stars",
            "reviewTitle": "Hard to use, makes a mess",
            "reviewDate": "November 21, 2017",
            "reviewText": "I hate this product for the following reasons:\n\n1) It doesn't grind my coffee finely at all. There are always big chunks left. This was not the case with the small cheap proctor silex grinder I used to own. It's also super difficult to judge when to stop holding down the lid to stop grinding.\n\n2) The grinds get everywhere. Including the space between the canister and motor, which makes it difficult to screw the canister in and out, which you need to do every time you use it! It's really hard to get the grinds out from the base, I've had to use a paintbrush for this purpose!\n\n3) You have to use a fair amount of force and leverage just to push down on the lid to make the grinder go. This isn't exactly a huge problem, but an annoyance for a device you use every day.\n\nThis is just such a poorly designed product, I don't comprehend why it has good reviews from others. When I reached out to KitchenAid about these issues a month after receiving the item, they basically just said that I could return it if it was within the return window (30 days), which it was not. Don't make the same mistake as me!"
        },
        {
            "reviewerName": "Michelleoch",
            "rating": "3.0 out of 5 stars",
            "reviewTitle": "Faulty design",
            "reviewDate": "January 27, 2019",
            "reviewText": "It appears to be a good design with the ability to remove the grinding cup however a significant amount of grounds is already collecting under the cup. Im assuming this will eventually make fitting the cup in place difficult. Ive hardly had it a few weeks and have already wrestled with a basting brush to get the area under the cup clean. Its also very loud and tinny sounding. Im sending it back. Its a shame they dont make things like they used to. Ill go back to using my ten year Old grinder with a broken cover.??"
        },
        {
            "reviewerName": "J. Johnson",
            "rating": "2.0 out of 5 stars",
            "reviewTitle": "Don't buy for grinding spices...",
            "reviewDate": "February 23, 2018",
            "reviewText": "It runs fine, but I bought it to grind spices and it doesn't work the greatest for it. First, the top of the cup doesn't touch the top of the plastic lid, so ground spice dust flies everywhere out of the cup making it a mess when you take the lid off. As someone else mentioned, it does show problems grinding up evenly. I tried to grind some dried mushrooms and the dust flew everywhere and there were plenty of chunks that I needed to pick out to regrind. I assume this would work best for coffee beans because of their weight as long as you fill the cup. I did cut a square out of a ziploc bag and place it over the top of the cup and then secure it with a rubber band; this helped significantly with the dust issue. I would not buy it again and would not recommend it."
        },
        {
            "reviewerName": "Amazon Customer",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Great for the price and did buy again after a year",
            "reviewDate": "December 16, 2018",
            "reviewText": "My husband bought me one of these last year as well as a French press and I really like it so I bought my mother one this year. It is easy to use and easy to get the desired fineness depending on if you are using a press or pot. My only minor issue is that the bowl or whatever it is called is easy to take off and clean but the machine itself is not really that easy to clean, but it is great for the price. Obviously I would buy again and for my mother."
        },
        {
            "reviewerName": "Tennessee Serenity",
            "rating": "3.0 out of 5 stars",
            "reviewTitle": "Hard to get anything but a very fine grind",
            "reviewDate": "December 12, 2017",
            "reviewText": "It's hard to get anything but a very fine grind - which is great, if that's what you want. But because we use a screen filter instead of paper in our coffee maker, we like a medium coarse grind that prevents a lot of sediment from coming through. Unfortunately, in this grinder the whole beans seem to float on top while the grounds at the bottom get finer and finer. By the time all the beans are ground, it's like cake flour. My cheap old Mr. Coffee grinder made it easier to control the grind. Just a quick shake during the grind would drop the whole beans to the bottom until I could get a nice medium grind throughout. Because of the way the clear dome fits over the grinding reservoir, I can't do that with this grinder."
        },
        {
            "reviewerName": "Homeowner",
            "rating": "4.0 out of 5 stars",
            "reviewTitle": "The inner bowl does snap in and twist out with no issues like some others on the market",
            "reviewDate": "November 30, 2016",
            "reviewText": "The KitchenAid BCG111OB does work well and does perform as advertised. The inner bowl does snap in and twist out with no issues like some others on the market. The bowl is thin and if you don't pay attention it can be sharp. It does grind coffee pretty evenly, unless you are only grinding about four (4) cups. Apparently it was not designed to grind only four cups worth of beans. Nonetheless, If we ever need to purchase another coffee bean grinder, for the price we paid, we would purchase this KitchenAid BCG111OB grinder again."
        },
        {
            "reviewerName": "ukiStudio",
            "rating": "1.0 out of 5 stars",
            "reviewTitle": "Very messy and does not grind evenly",
            "reviewDate": "February 8, 2018",
            "reviewText": "This is the messiest coffee grinder, I am very disappointed in it. As I grind the beans the grinds get between the metal container and the base (there seems to be a way for them to escape where the blades are). Also, the beans do not get ground thoroughly and evenly. Some are left in chunks. I am not happy with this coffee grinder."
        },
        {
            "reviewerName": "NCPharmacistMommy",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Another Awesome KitchenAid Product",
            "reviewDate": "November 15, 2015",
            "reviewText": "I purchased the onyx black grinder to use at work. It's so wonderful having a pot of freshly ground coffee everyday. The grinder itself it a breeze to use and even easier to clean. On the inside of the stainless steel cup (where the grinder blades are located), it has markings to indicate how much whole beans you need to make 4,6,8,10 and 12 cups of coffee. For the couple times I've used it, the markings have been pretty accurate for me (I use 1 tablespoon of finely ground coffee per two cups of water). When you're ready to clean your cup, all you do is twist it slightly and pull it out. Then I quickly rinse it out and place it in our drying rack, along with the rinsed out lid. Too easy! Overall, a really great product that I would recommend to others! I see myself getting many years use out of this product, but that is what you would expect from the Kitchen Aid brand!\n\nI store my whole coffee beans in anOXO Good Grips POP Big Square 2.4-Quart Storage Container; it does a great job of keeping my beans fresh!"
        },
        {
            "reviewerName": "RW",
            "rating": "3.0 out of 5 stars",
            "reviewTitle": "Lacks Uniform Grindings",
            "reviewDate": "April 1, 2019",
            "reviewText": "Came as advertised, on time, clean, noise as expected, easy to clean and with clear directions etc... no problems there. And it's compact which I wanted so to save counter space.\nIssue 1: Top of the SS bean cup is not sharp enough to cut your hand when cleaning etc... however its thin metal which makes you very aware you could as you'll need to press and turn it with a good amount of force. There should be some kind of cap such as silicon or rubber or the top rolled over on itself around the top. Issue 2: Most important I found that the grounds are not as uniform as I had hoped. For instance when fine grinding at the manufactures recommended times 10% (estimate) come out a little less than 1/8\" in size. Grinding longer and shaking to mix them up doesn't seem to make much difference. I used a \"BURR\" at my sons place, it's larger in size but grinds come out perfect with no shaking etc..."
        },
        {
            "reviewerName": "Amazon Customer",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Look no further, you have found your grinder!",
            "reviewDate": "January 24, 2017",
            "reviewText": "Love the grinder! My fiance and I are baristas so coffee is a BIG deal in this household. We love the grind and while loud(shocking a loud grinder?!) the sound does not travel. We can grind coffee in the kitchen of our apartment and barely hear it in the bedroom, our neighbors appreciate this feature at 3am. My only complaint is that the grounds get really packed into the bottom so sometimes you have to mix it up to grind everything evenly. The grinder can do up to 12 cups I believe, but I stay around 8 to get a good grind. Looks nice, so if it gets left out on the counter it is not an eye sore at all! But, do not worry about having to find space for it! Small and easy to put in any cabinet!"
        },
        {
            "reviewerName": "Marianne",
            "rating": "3.0 out of 5 stars",
            "reviewTitle": "Disappointed",
            "reviewDate": "December 15, 2015",
            "reviewText": "I bought this to replace an old Mr. Coffee grinder that I used for grinding peppercorns and making my own spice blends. I don't have a problem with the job it does grinding, but when you remove the top, there is finely ground spice all over the lip that the cap rests on, and when you remove the bowl, now there is ground spice under the bowl where the piece that makes the blade spin is, which is difficult to clean. I did not have this problem with my old grinder. I regret not returning it now. Edit: I returned it and ordered a Krups, which is almost identical in size and design as my old Mr. Coffee and does an excellent job, so I'm happy now."
        },
        {
            "reviewerName": "dah",
            "rating": "2.0 out of 5 stars",
            "reviewTitle": "Faulty design: Grind your beans and clean your kitchen!",
            "reviewDate": "July 9, 2019",
            "reviewText": "I know KitchenAid as one of the top brands on the market and expected a device with a clever design.\nThe grinder looks nice and appears very sturdy, but the beans don't stay in the metal pot. There is a gap of a few millimeters between the metal pot and the cap that cannot be closed by pressing on the lid. Once you grind the beans they will jump in the metal pot and of course through the gap. The finer you grind the more jumps out and collects on the outer rim. Once you remove the lid all this stuff falls on your kitchen table. I watched the video of this ad twice to check whether an o-ring or a gasket was missing, but no ... this is a flaw in the design that could have been fixed easily.\nThere are much better grinders for the same price available that don't mess up your kitchen.\nNow I have to buy a pack of 50-100 o-rings (as suggested by another reviewer) for approx. 50% of the price of the grinder. Notably, not each o-ring can be used for food purpose (CA proposition 65 - exposure to chemicals that can cause cancer)... But for this grinder, this probably doesn't matter a lot, since it comes with a CA proposition 65 anyway.\nI recommend not buying it! There are better grinders!\nPictures attached."
        },
        {
            "reviewerName": "Eric G.",
            "rating": "2.0 out of 5 stars",
            "reviewTitle": "good grind but not worth it",
            "reviewDate": "May 22, 2019",
            "reviewText": "I was surprised cuz this was one of the highest rated grinders. I wish I would have purchased a different one. The grinder is activate by pushing down on the cap. but its a bad design because you can feel sometimes when you push down it does not align properly and nothing happens so you have to pull it off and re-seat the lid. Also, you cannot shake this grinder as grounds will go up and over the inside causing a large mess on the counter when you remove the lid."
        },
        {
            "reviewerName": "Diana",
            "rating": "2.0 out of 5 stars",
            "reviewTitle": "Takes forever to grind coffee",
            "reviewDate": "May 24, 2019",
            "reviewText": "I bought this grinder because one of the blades broke off my old grinder ($10 Cuisinart from the grocery store), so it was running at half efficiency and it was pretty loud. Well, you'd think this more powerful Kitchen Aid grinder with two intact blades and great reviews would work better, but it doesn't.\n\nIt takes twice as long to grind my coffee to a medium size and there's still big chunks in it. There's also fine coffee grounds that get stuck underneath the blades, so you have to scrape them off. It also doesn't grind if you're holding it in your hands--grinding at an angle helps prevent some of that coffee that gets stuck at the bottom, but I can't even do that. I am disappointed."
        },
        {
            "reviewerName": "Enthusiast",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Perfect!",
            "reviewDate": "December 10, 2018",
            "reviewText": "This coffee grinder is a welcome addition to my KitchenAid appliance kitchen. It performs as good or better than other counterparts while maintaining the KitchenAid build quality and aesthetics. I use this coffee grinder almost daily to prepare my morning coffee. It requires minimal cleaning and always performs to the highest standard."
        },
        {
            "reviewerName": "Genuine",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "A quality grinder",
            "reviewDate": "February 5, 2018",
            "reviewText": "For kitchen items, there are only a handful brands I pick. KitchenAid is one of such brands. It represents quality.\nAnd their products are generally well-made.\nThis coffee grinder is substantial in weight, unlike those light-weighted units.\nA major feature that I like is the removal of the grinding bowl. The last unit that I had did not have this feature, which made cleaning a little awkward.\n\nOne feature (which I initially deemed was an issue) is the material of the removal bowl: its inside surface is not very smooth to touch. It appears and feels like it is made of aluminum, a metal I don't like. Just checked the product description on Amazon, the bowl is indeed stainless steel. Although the inside feels slightly rough to touch, the outside is smooth. I imagine this is a deliberate design to make the inside rough, thus creating some degree of resistance to stop the materials being grounded from just twirling around inside the bowl.\n\nAs usual, Im glad I picked this brand. Highly recommended!"
        },
        {
            "reviewerName": "Suzi",
            "rating": "4.0 out of 5 stars",
            "reviewTitle": "doesn't grind all beans if you're doing a lot at a time",
            "reviewDate": "July 17, 2019",
            "reviewText": "I had such high hopes for this grinder. Read quite a few reviews and it seemed like it would be grand. However, we grind a full measure of the beans (never exceeding what is indicated on the markings) and still need to grind more to make a single pot of really good coffee. That said, I've had to resort to doing multiple small batches as the beans don't all grind if you're trying to do a large quantity.\nAlso, there is an excess of coffee grinds jammed below the blade which must be knocked out, then the clumps broken up.\nAll in all, my old Cuisinart did a better job of grinding, though didn't have the removable bowl which is about the best feature on this unit."
        },
        {
            "reviewerName": "Film Enthusiast",
            "rating": "2.0 out of 5 stars",
            "reviewTitle": "Ridiculously Messy",
            "reviewDate": "January 23, 2019",
            "reviewText": "I wonder if the designers of this coffee grinder actually used it to grind beans, because the unholy mess this thing makes is RIDIC. The design is terrible. It's a three-piece machine:\n* Base/Engine\n* Cup/bean holder/blade\n* Cover/grinder-lever\n\nYou put the beans in the cup, fit the cup into the base, put the top on then push down to start grinding. Simple enough. The problem is that the top of the cup doesn't reach to the top of the cover. So when you grind your beans the grounds come over the top of the cup and spill everywhere. The second you take off the top your counter is covered in coffee, and what doesn't make it on to the counter falls into the base.\n\nOh, but now it's time to take the cup out of the base so you can pour the grounds into your French press! Go ahead. TRY and get the beans out. They're so tightly compacted into the bottom of the cup underneath the blade that you need a knife to get them out.\n\nDo you get an even grind? No.\n\nAm I satisfied? No.\n\nIt's a KITCHENAID! Come on, man. They can do so much better."
        },
        {
            "reviewerName": "Tzar Igor",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Very convenient!",
            "reviewDate": "March 27, 2019",
            "reviewText": "Great looking coffee grinder with a detachable grinder cup. After grinding the coffee I just lift the cup and pour the grounds into the coffee maker. With the old grinder, I had to unplug the unit and tip the whole thing to get grounds out and into the coffee maker.\nThe noise level is slightly less than the old traditional cylinder model.\nThe grinder delivers coarse grounds perfect for a drip coffee maker. If you want espresso grounds, look elsewhere."
        },
        {
            "reviewerName": "Alice Appel",
            "rating": "2.0 out of 5 stars",
            "reviewTitle": "Not worth it.",
            "reviewDate": "January 11, 2018",
            "reviewText": "I really wanted to like this, mostly because the cup comes off for cleaning. The problem is that if I put in more than tone-quarter cup of beans it will grind the ones at the bottom much more finely than the ones at the top, and then the bottom grounds get stuck under the blade so that the top ones don't get ground to the same fineness..\nI was also hoping that it would be able to grind hard cheese as all my previous grinders had, but no such luck. Not only didn't it do much grinding but little pieces of cheese flew out during the process.\nMy local thrift store had a Barista blade coffee grinder or $8.00. I'd never heard of them, but it works like a charm. Heavy duty, does a great job with Parmesan cheese too."
        },
        {
            "reviewerName": "MTV",
            "rating": "3.0 out of 5 stars",
            "reviewTitle": "Stellar looks, mediocre functionality.",
            "reviewDate": "January 21, 2016",
            "reviewText": "It is a beautiful appliance and built from high quality materials. The clear top is a great design function. My beef with this grinder, however, is that it grinds the beans unevenly by a fairly considerable margin. It is hard to describe, but at the bottom of the container, beneath the blade, will be a collection of superfine coffee grounds compacted and \"stuck\" to the bottom; you will have to bang the bottom to get them out (and even sometimes that is not enough). On top of those grounds will then be a blend of medium to course grounds, with the occasional whole bean still floating around. It is more a nuisance than a dealbreaker, but this sort of thing will bother you, consider a burr grinder."
        },
        {
            "reviewerName": "Ms. Holly",
            "rating": "3.0 out of 5 stars",
            "reviewTitle": "Meh",
            "reviewDate": "January 20, 2019",
            "reviewText": "I purchased this to upgrade our old grinder. Though it grinds well it is not easy to dump all the grinds out. Our old one came with a little brush, which was handy to get the corners. The removable cup is helpful to dump the grounds out. There is also a minimum amount of beans to pour in & unfortunately it will throw the grinds around the cap if not. Sometimes ya just dont need that much coffee...I thought because it was a Kitchen Aid, yah know it would be awesome."
        },
        {
            "reviewerName": "David L. Storm",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "A good grinder so far",
            "reviewDate": "June 23, 2017",
            "reviewText": "I ordered this coffee grinder to replace my 20 year old moulinex regal which finally croaked. I am so far very satisfied with the purchase. The Kitchen Aid has a larger capacity so you can grind enough coffee for several cups. It appears to be well built and grinds the beans finely as I like. My only two criticisms are it takes a little longer to grind, about 15-20 seconds vs. about 10 seconds for old moulinex regal. Secondly some of the grind ends up below the blades and it takes some effort to get it out. Also these bottom grinds are a little courser than the top. I just hope it is as durable as the moulinex regal."
        },
        {
            "reviewerName": "D. K. Boyd",
            "rating": "4.0 out of 5 stars",
            "reviewTitle": "Grinds very fine very fast.",
            "reviewDate": "June 20, 2017",
            "reviewText": "We bought this blade grinder because our old one, also a KitchenAid, died the good death after about 8 years. I figured anything that lasted that long with no issues would be worth replacing with the same brand. I like the design of this, how little room it takes up, but the grind is just a little finer than I am used to and there is a small amount of \"sludge\" at the bottom of our french press coffee that wasn't there before. Maybe we're still trying to get the timing right on the grind, but the old one didn't grind as fine as fast. Still happy with it, it's a great grinder for the price."
        },
        {
            "reviewerName": "Evelyn",
            "rating": "4.0 out of 5 stars",
            "reviewTitle": "Excited for deal, no small insert for spices",
            "reviewDate": "July 13, 2019",
            "reviewText": "I got this as a lightening deal and Im generally pleased with it. However, when I bought it, it was not clear it didnt come with the insert for grinding spices. That insert is almost as much as the grinder itself last I checked, and I had hoped it was included. As it is, you have to put in about a third of a cup of beans to get a good grind. It also does heat the beans a little as it goes but that is to be expected.\nHowever, for what it is it works great. I switched to whole bean coffee about two months ago and havent looked back."
        },
        {
            "reviewerName": "Telemachos Manos",
            "rating": "2.0 out of 5 stars",
            "reviewTitle": "mildly inconvenient to use",
            "reviewDate": "January 29, 2018",
            "reviewText": "coffee grounds get flung everywhere and make a huge mess. the lid doesn't do anything to keep the grinds in. Also the edges of the bowl are very rough which causes the grinds to stick to the bowl. I have to tap it against the counter pretty hard to get everything out. Also a pain in the butt to clean. I feel like they could have used a less rough-textured metal like smooth stainless steel."
        },
        {
            "reviewerName": "TC12",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "The \"NEW standard\" basic coffee grinder!",
            "reviewDate": "July 1, 2017",
            "reviewText": "Love it, so far. Coming from a Krups that got lost in a move. This is a big step up. The bottom basket can be removed for easy cleaning; a great feature! Compared to the Krups, it also oscillates and lifts the contents more, creating a more even grind, and allows me to get a nice course grind for the French Press. Also, noticeably more quiet than a couple other basic blade grinders I've used. Highly recommend! As always, I will update if anything changes."
        },
        {
            "reviewerName": "silvertips 1000",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "excellent coffee grinder",
            "reviewDate": "April 13, 2017",
            "reviewText": "Came across this particular coffee grinder when we rented a house on one our trips. Although we had a very good coffee grinder, this one was so superior, I went ahead and ordered one for home. It is slightly larger than most grinders, has a larger motor and grinds twice as much coffee at one time. You can obtain seperately a smaller grinding bowl that one might use for herbs and spices. We are very happy with the product,"
        },
        {
            "reviewerName": "Guy in Ohio",
            "rating": "2.0 out of 5 stars",
            "reviewTitle": "Messy and narrow.",
            "reviewDate": "July 27, 2017",
            "reviewText": "Does it work: Yes\nIs it loud: Nope\n\nSo why don't I like it?\nThe cup where your pore the beans is too narrow.\nThe ground beans stick to the tall, narrow cup.\nThe ground beans get all over the bottom rim of the black part after grinding (very messy).\nThere is no timed amount it grinds. It just keep going and going.\nIt has a very long cord.\n\nI don't like it. You might like it if you don't mind making a mess every time you grind coffee.\nI tossed this thing in the trash. What a waste of time."
        },
        {
            "reviewerName": "Menachem",
            "rating": "2.0 out of 5 stars",
            "reviewTitle": "KitchenAid BCG111B Coffee Grinder very bad Review",
            "reviewDate": "November 28, 2017",
            "reviewText": "The good...Very nice design & low decibel level operation, hence the 2 stars....the bad...it perfectly fine grinds 1/2 whole coffee beans other half barely grounded coffee beans...very disappointed with this products coffee grinding performance.... I cannot n good conscience recommend KitchenAid in the coffee grinding business... Sorry"
        },
        {
            "reviewerName": "Lag",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Great Bean Grinder!",
            "reviewDate": "April 3, 2016",
            "reviewText": "Bought this based on other Amazon reviews and love the way it works. Easy to clean (which I was dreading) and there is a manual inside that shows you how long to grind based on how fine or coarse you want your coffee. We bought this for our French Press and the chart was dead accurate which saved some wasted coffee beans. Bought the dark brown color because it was a few dollars cheaper than the other options and it has a rich, expensive appearance that my wife and I both love. Buy this product if you need a coffee bean grinder - I can't imagine how they could have made it any better."
        },
        {
            "reviewerName": "N. Smith",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Great for a basic grinder",
            "reviewDate": "November 10, 2019",
            "reviewText": "This grinder does what it says. No special settings for fine ground, or anything, just put in beans, press lid, watch/check until coarseness you prefer. Well worth the price\nBad if grinding other than coffee, for those 'green states' there is an 1/8th inch gap under blades, where you have to remove canister, knock that bit of coffee loose. But 5 ? basic, sturdy, easy to use grinder."
        },
        {
            "reviewerName": "DTB",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Quick and efficient for grinding dry dog food! No joke!",
            "reviewDate": "March 21, 2017",
            "reviewText": "We use our coffee grinder to grind individual batches of dry dog food. We have a Border Collie who eats too darn fast and we've been advised to blend her food into a fine powder and mix with warm water. This is our third KitchenAid grinder. Each previous grinder having lasted over a year apiece. By far, this latest model has been grinding her dry food into a powder in probably half of the time it took the older ones. Whatever they changed about their grinders -- WE LOVE IT! We also appreciate the stainless steel appearance and the overall ease of use!"
        },
        {
            "reviewerName": "Housewife",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Large Capacity Makes Quick Work",
            "reviewDate": "January 25, 2017",
            "reviewText": "I only purchased this grinder because my old, cheap brand one cracked in the dishwasher. After having that happen, I was delighted to see the stainless steel grinding cup on this one. Honestly, that's the only reason I bought it. I'm done with the plastic grinding cup.\n\nSo, I was pleasantly surprised by the size of this one. I grind coffee for the week all at once. With my old, average-sized grinder, it took close to 15 minutes to fill my canister. This one takes less than five. 4 grinds and I am set for the week. MAJOR plus!\n\nI'm giving it five stars, but if it dies on me anytime soon, I'll update. As of now, I love it!\n\nPS - It works best if you only fill it to the \"10 Cup\" mark. Beyond that, the grind isn't uniform. But that's no biggie."
        },
        {
            "reviewerName": "Shawn Herdman",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Outstanding coffee grinder.",
            "reviewDate": "April 9, 2018",
            "reviewText": "Outstanding coffee grinder. I purchased this from Amazon after price comparing with local retail stores. I saved right at $10 by purchasing here. As for the grinder, it grinds well. I specifically purchased this model because of the removable cup. I grind coffee beans and dried peppers, and the removable cup allows me to clean effectively after peppers. Additionally, the stainless steel cup doesn't absorb any of the pepper oils. Overall, this grinder looks great and works even better. If I had to gripe about anything, some of my pepper milling allowed small particles to bypass the lid and get on the outside of the cup. This was easily cleaned up and wasn't a big deal in the end. I would definitely recommend or purchase this product again."
        },
        {
            "reviewerName": "Emily Kendall",
            "rating": "3.0 out of 5 stars",
            "reviewTitle": "Doesn't grind evenly",
            "reviewDate": "June 13, 2019",
            "reviewText": "I bought this grinder after my old Hamilton Beach bit the dust. Surprisingly, my 10-year old grinder worked much better than this one. KitchenAid's grinder results in very uneven coffee grounds. If you don't want some chunks and some espresso grounds, you have to stop the grinder, \"unpack\" the coffee that's trapped underneath the blades and blend again. A lot of fine coffee grounds get compacted in the bottom of the grinder. There is usually residue in my brewed cup, even though there are also beans that are barely chopped. Very uneven."
        },
        {
            "reviewerName": "OurPaperMacheHouse",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Awesome Stainless Steel Grinder!!!",
            "reviewDate": "February 2, 2017",
            "reviewText": "My husband and I love fresh-ground coffee, but after going through 3 electric grinders we decided to do our research before purchasing this grinder. This is the only grinder we found that is completely stainless steel on the inside - NO PLASTIC comes in contact with our beans now! It took us a couple of times experimenting with this one to see how much/long to allow the beans to grind. We found we like to grind them in short bursts, say 7 seconds, 5 and 5. At that point the beans are ground to our specification and our coffee comes out perfectly. The grounds do get stuck in the bottom but that is nothing a little shaking of the removable stainless steel cup won't fix. All our grounds come out of the cup each time with nothing left but a little dust. Can't say enough good things about this grinder!!"
        },
        {
            "reviewerName": "Erica",
            "rating": "4.0 out of 5 stars",
            "reviewTitle": "Wish it was quieter",
            "reviewDate": "October 10, 2019",
            "reviewText": "The depth of the grinder part is really great and fits a lot of coffee however, The blades are higher than my old ones and I am constantly having to scrap coffee off the bottom of this one. I grind coffee at 330 am and this one is much louder and sounds a lot worse than my former grinder. Im surprised, it does a good job grinding but does sound on its last leg."
        },
        {
            "reviewerName": "M.",
            "rating": "2.0 out of 5 stars",
            "reviewTitle": "Don't recommend, look for something better",
            "reviewDate": "November 13, 2017",
            "reviewText": "Pretty terrible grinder, only good for a coarse grind (fine for french press) but definitely not good for AeroPress use. That's all fine, but the worst part is that the coffee grind easily escapes over the container and underneath the cover. Coffee grinds end up all over the edges, under the container, and of course all over your counter. Major design flaw."
        },
        {
            "reviewerName": "Shooshie",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "My favorite coffee grinder!",
            "reviewDate": "February 11, 2016",
            "reviewText": "I searched long and hard for an all-stainless-steel coffee grinder. Most grinders have seams that collect old coffee grinds and dust, always needing for you to dig it out with a sharp object. I wanted a smooth, steel grinder bowl with no seams. This is that coffee grinder! But it has an added bonus I never expected to find: the grinder bowl is removable! Take it out and load it up anywhere, leaving the motorized base where it sits, plugged into the electric socket. No longer do you have to move the grinder out from the wall, drag the cord across whatever is on your cabinet or stove, handle it and put it back when you are done. Instead, just remove the bowl with a simple twist, place it wherever is convenient to measure your coffee, then place it back in the base to grind the coffee. When done, you don't have to pick up the grinder to pour the coffee into the coffeepot. Just remove the bowl again. It empties so easily, and because it's a single piece of stainless steel without seams, the coffee all comes out easily. I use a barista brush to dust out under the blades, though a light whack on the side of the steel cup, like a cowbell, will usually do the trick with no need for further brushing.\n\nMy first one wore out after about 5 years. I'm on my 2nd one now, and I've bought one for each of my kids, as well as my grandmother, who still loves a cup of joe at her age of 100+. Highly recommended!"
        },
        {
            "reviewerName": "Clinton Lewis",
            "rating": "4.0 out of 5 stars",
            "reviewTitle": "For the price, it can't be beat.",
            "reviewDate": "December 24, 2017",
            "reviewText": "Does what it says. For the price, it can't be beat. Only complaint might be, that you really can't do a coarse grind with this. That doesn't bother me as I prefer finely ground coffee, but could be bothersome to some folks. I filled it to the max with bean and it did a good job at grinding them all. Not near as bad as other cheap grinders, but still requires a little tilting/tapping to get a complete grind."
        },
        {
            "reviewerName": "Amazon Customer",
            "rating": "4.0 out of 5 stars",
            "reviewTitle": "Design allows coffee grounds to escape grind cup.",
            "reviewDate": "August 13, 2019",
            "reviewText": "Well-built. Motor is very strong. Nice that the grinding cup is removable for cleaning and brushing out coffee grounds.\n\nMy only complaint is that there is enough of a gap between the outer cover and the grind cup that coffee ground gets out of the grind cup and gets into the space between the cup and the lower unit. Otherwise, no other complaints."
        },
        {
            "reviewerName": "BachMere",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "It's easy to clean (we hand wash this) and the unit ...",
            "reviewDate": "May 22, 2017",
            "reviewText": "Go figure - I sold my MagicBullet last month and then bough coffee thinking it was already ground, but it was the whole bean! So I needed to buy a grinder for the beans. Reviews for this product were solid, so I went for it. We've only used coffee beans in it a few times, but it grinds well and is surprisingly quiet (WAY quieter than the MagicBullet was!!). It's easy to clean (we hand wash this) and the unit is smaller than I anticipated, so it fits under the cabinet easily. Really happy with this purchase."
        },
        {
            "reviewerName": "A.H.",
            "rating": "4.0 out of 5 stars",
            "reviewTitle": "Good grinder to have",
            "reviewDate": "June 12, 2013",
            "reviewText": "This is a good quality, quiet grinder. I had a Braun before this one and the blade didn't last very long. This one has a good, hard stainless blade that chops the beans up pretty good plus the grinder looks good. I only gave it 4 stars though because I thougt it could use a little improvement on it's ability to move the beans around more whenever you really fill it. When you fill the grinding chamber close to the top, the beans do not move. This may be due to the weight of the beans and the blade being only a straight piece of metal instead of having a shape somewhat like an airplane propellor which would help move the beans around. I ended up tilting the grinder in order for the beans to move down to the blade. There is no problem when you fill the chamber only 3/4 full."
        },
        {
            "reviewerName": "Javier",
            "rating": "4.0 out of 5 stars",
            "reviewTitle": "Works well for a medium grind.",
            "reviewDate": "January 21, 2019",
            "reviewText": "This product I feel is easy to use and you can easily empty the grounds from this to another contain. I could not get to a fine of ground as I wanted even when griding for an extended period, but I like really finely ground coffee. While if you do fill the grinder to full some grinds become for ground then others in the same group. This can happen even if not using the maximum amount allowed."
        },
        {
            "reviewerName": "J. Madden",
            "rating": "3.0 out of 5 stars",
            "reviewTitle": "Strong motor so I gave it 3 stars.",
            "reviewDate": "April 2, 2016",
            "reviewText": "One major flaw with this grinder... The grinder blades are both turned up. So instead of one side grinding below and one side grinding anything above, both sides grind everything above the blades and anything that falls underneath just lays there. It takes much longer to grind with this one than it did with my Epica Electric Coffee Grinder. This grinder is like your standard blender, it'll get the job done with a little extra effort. The Epica is like using a Ninja. Go check that one out. The over under blades makes it the better buy."
        },
        {
            "reviewerName": "CoffeeHound",
            "rating": "3.0 out of 5 stars",
            "reviewTitle": "Not worthy of the brand name",
            "reviewDate": "October 12, 2019",
            "reviewText": "Grinding cup is not intuitive to install or remove. Users struggle getting it in the base and into proper alignment for grinding. After a bit of use, cup began to stick in lock position so that removal is now problematic. Users tend to leave cup installed rather than fight with it, which defeats easy cleaning potential. Noise level is average."
        },
        {
            "reviewerName": "Gale",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Tough grinder",
            "reviewDate": "January 22, 2019",
            "reviewText": "This is the 2nd one I've purchased-I've had one for some time and I also got one for my daughter. It stays sharp and does a good job of grinding. It is easy to use-much more so than other grinders I've owned in the past. Being stainless, it's easy to clean the outside. The grounds release pretty easily from the inside so it doesn't require much cleaning, basically wipe with a dry cloth if needed."
        },
        {
            "reviewerName": "Bob Maxland",
            "rating": "4.0 out of 5 stars",
            "reviewTitle": "Perhaps what's best about this grinder is it's ability to be washed ...",
            "reviewDate": "July 8, 2016",
            "reviewText": "Perhaps what's best about this grinder is it's ability to be washed after each use. This makes it a very useful tool in the kitchen as it doubles as a spice grinder without the need to \"clear\" the bowl by grinding rice or bread. I knocked off a star because the decorative front piece came off and serves no purpose other than decoration. Also, it is very loud and difficult to hear when the grind is finished.\n\nBy the way, I noticed the grinder in use on a Rick Bayless video for making mole."
        },
        {
            "reviewerName": "csmith",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Consistent product that works great",
            "reviewDate": "January 22, 2017",
            "reviewText": "Works excellently for the price and is able to grind the beans pretty perfectly. You do have to shake it up or stir once while using it or you will have unground beans (not many) towards the top. This product is working great for me though. I have a friend that I noticed had one of these and I asked him how he liked his. He's had his for over 5 years and has no plans on replacing it because it was super cheap and has worked consistently for years. Sounds like I made a great buy!"
        },
        {
            "reviewerName": "Andrew Walsh",
            "rating": "4.0 out of 5 stars",
            "reviewTitle": "Good economical grinder",
            "reviewDate": "July 31, 2019",
            "reviewText": "Works well. Some people have complained that the grind is somewhat uneven. I agree with that but I get really good coffee so I don't care if a few of the beans don't get ground. I like that the grinding bowl is removable for cleaning. It is quieter and easier to clean than the Mr. Coffee grinder it replaced. Takes longer to grind than the Mr. Coffee did. Like 20 seconds instead of 10. A lot of grounds remain in the grinding bowl that have to be brushed out instead of dumping out into the brewer basket. All in all, though, much happier with it than the Mr. Coffee grinder that was really loud and a pain to clean as the grinding bowl was not removable for cleaning on the Mr. Coffee grinder."
        },
        {
            "reviewerName": "Rachael",
            "rating": "2.0 out of 5 stars",
            "reviewTitle": "This machine doesn't exactly grind all of your beans evenly ...",
            "reviewDate": "May 23, 2017",
            "reviewText": "This machine doesn't exactly grind all of your beans evenly. Even when I do as little as 4 cups, I have to stop after a few seconds & scrape the finely ground coffee from under the blade & mix it with the rest of the beans which are still very coarse. I never have gotten all of the beans to grind uniformly. It gets the job done I suppose, hence the second star. I would not purchase again."
        },
        {
            "reviewerName": "Elizabeth Turner",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Great for grinding and powdering!",
            "reviewDate": "April 18, 2019",
            "reviewText": "I bought this because I grow pumpkins, roast them, dehydrate them, and powder them. Pumpkin powder is a great way to store pumpkin, and rehydrates very easily to the consistency of fresh baked pumpkin. This little gem will grind dried pumpkin like a dream. Nothing else I've tried will come close. I bought a second for my parents, it was so great."
        },
        {
            "reviewerName": "Bill Girolamo",
            "rating": "4.0 out of 5 stars",
            "reviewTitle": "Great Grinder but shipped with a defect in the cord",
            "reviewDate": "January 8, 2016",
            "reviewText": "I was excited to receive this grinder, a KitchenAid! Considering that this product came from and was Shipped from Amazon, I would have thought there would have been some Quality Control before shipping. I guess, the package is NOT opened prior to shipping for inspection. I did not notice at first that the cord has a double insulation but in one spot the insulation has a cut in it. The 2nd insulation layer is solid, and therefore I will continue using the grinder as it is, but was disappointed that it was shipped with a defect. As for the grinder itself, it does exactly what it is described to do on the KitchenAid website and is quiet and efficient.\n\nhttp://www.amazon.com/KitchenAid-BCG111ES-Blade-Coffee-Grinder/dp/B00AB6QT44/ref=sr_1_fkmr0_1?s=kitchen&ie=UTF8&qid=1452269808&sr=1-1-fkmr0&keywords=KitchenAid+BCG111ES+Blade+C"
        },
        {
            "reviewerName": "barry",
            "rating": "4.0 out of 5 stars",
            "reviewTitle": "Looks great, works fine.",
            "reviewDate": "January 16, 2019",
            "reviewText": "Overall I'm very happy with how well it grinds my coffee beans. My only knock (if any) would be noise level.\nProduct description led me to believe that this unit is significantly less noisy than other competitive grinders.\nHowever the sound level is pretty much the on the same level of all the other electric grinders that I have had."
        },
        {
            "reviewerName": "Catherine A. Griffith",
            "rating": "2.0 out of 5 stars",
            "reviewTitle": "Okay, but there are better grinders.",
            "reviewDate": "January 31, 2018",
            "reviewText": "It's not terrible, but there are better coffee grinders for the same price. The removable cup is a nice feature. The motor is weak, so it takes forever to grind and can't really grind coffee very finely. Also it's not great for grinding spices since it won't really grind things up unless you put a lot in there. The switch mechanism is also sort of wonky, since you push the whole clear plastic cap down, but sometimes it takes some jiggling to get it to go down."
        },
        {
            "reviewerName": "Randy",
            "rating": "2.0 out of 5 stars",
            "reviewTitle": "A little disappointed",
            "reviewDate": "September 24, 2019",
            "reviewText": "Quite loud. Does not grind evenly. Youll have powder in the bottom and large chunks mingled in. You can cut your hand trying to remove or install the metal cup that holds the grounds. Also can be a challenge to line up the tiny buttons which allow the machine to operate."
        },
        {
            "reviewerName": "Lori D",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "KitchenAid User Instructions - Grinding Chart",
            "reviewDate": "July 25, 2019",
            "reviewText": "This grinder is easy to use and can easily cleaned for sampling various coffees. I liked it so much I bought another as a gift and have recommended it to others as well. You can grind just what you intend to use right away, and so your coffee is always fresh. The bean bowl is washable too."
        },
        {
            "reviewerName": "Steeler62",
            "rating": "1.0 out of 5 stars",
            "reviewTitle": "Has to be Defective",
            "reviewDate": "March 31, 2015",
            "reviewText": "This thing is loud as heck and vibrates wildly. The removable bowl does not have any positive feedback that it is completely seated and comes unseated if only trying to grind beans for a few cups of coffee. I don't know how this thing is supposed to work, but if what I experienced is it then don't buy it. This is the first negative review I've ever written. I really can't believe how cheap and crappy this grinder felt. Returning mine immediately."
        },
        {
            "reviewerName": "Kindle Customer",
            "rating": "4.0 out of 5 stars",
            "reviewTitle": "I want to love it, but....",
            "reviewDate": "April 8, 2019",
            "reviewText": "I bought this to grind pepper. It does a decent job. Some is a bit fine and some a bit chunky but the biggest problem is that it throws pepper all over the inside of the grinder. I realize this is a coffee grinder but I dont drink coffee so I dont know whether that would be an issue with coffee or not."
        },
        {
            "reviewerName": "DasGrinch",
            "rating": "2.0 out of 5 stars",
            "reviewTitle": "Poor blade contact",
            "reviewDate": "June 5, 2017",
            "reviewText": "Noisy, wobbly, and the lid doesn't keep anything in. Ended up with bits of things I was grinding down in the base of the unit where the motor is, they would fly up to the top, go over the edge of the work bowl, and then fall down the sides. Poor blade contact, couldn't get a fine grind on anything I tried it with, even after purchasing the smaller 'spice grinder' bowls."
        },
        {
            "reviewerName": "Corey Smith",
            "rating": "3.0 out of 5 stars",
            "reviewTitle": "Messy",
            "reviewDate": "July 18, 2019",
            "reviewText": "I bought this to replace my trusty Braun. This is now on the shelf and the Braun is back in use. There are good things, like the removable grinding canister. But the problem is the stupid thing leaks. Here is the deal, the round grinding container does not force or circulate the coffee like the oblong Braun does. So, you have to shake this unit while it grinds. Fin. But, for some silly reason, there is a small gap between the top of the grinding canister and the lid and when you shake, to get a good grind, the already-ground coffe goes out through that gap and into the base of the grinder. Booooo. Bad design, KitchenAid, bad design."
        },
        {
            "reviewerName": "Amazed.bygrace",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Sharp looking. Works great. Easy to use and clean.",
            "reviewDate": "June 24, 2018",
            "reviewText": "Arrived on time and well packaged. Brand new condition. Works great. Easy to use and easy to clean. Looks sharp and doesnt take up inch space. Fully happy with this purchase. Would but again and would recommend."
        },
        {
            "reviewerName": "Rubytwoshoes",
            "rating": "3.0 out of 5 stars",
            "reviewTitle": "Coffee Yes, Spices No...",
            "reviewDate": "January 16, 2019",
            "reviewText": "I bought 2 of these, it worked well for coffee beans but was a disaster for spices. A thin dust went all over inside and out of the grinder, I did not finish grinding due to the mess."
        },
        {
            "reviewerName": "Kimberly A.",
            "rating": "3.0 out of 5 stars",
            "reviewTitle": "Eh . . . just okay",
            "reviewDate": "January 18, 2016",
            "reviewText": "My old Hamilton Beach Custom Grind finally bit the dust after years of use - loved this unit. With Kitchen Aid's reputation I thought what the heck, give it a try. It's not that the Kitchen Aid doesn't work, it does - but just 'eh' is my opinion. It clumps the coffee together and gathers at the bottom. It does not grind the coffee as fine as my old one no mater how long you hold the lid down. Not my favorite coffee grinder by a long shot & not near as nice as my old one. Took it out of the box, used it so I will keep it. I will say the color is very attractive but I cannot honestly say I recommend it."
        },
        {
            "reviewerName": "nvlystd",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Quiet Beauty",
            "reviewDate": "May 11, 2013",
            "reviewText": "Just purchased the KitchenAid factory refurbished on ebay for $20 including shipping. Besides a stylish stainless steel exterior it has 2 important advantages over my deceased Mr. Coffee and my now back up Capresso grinders.\n\n1. It has a twist out container with handy markings for measuring your coffee grinds without the annoying plastic cage you find inside the Mr. Coffee grinder. It's much easier to clean after each use using a recommended brush. It also looks great in my kitchen sitting on a grayish corian counter top next to my stainless steel toaster!\n\n2. It's quieter than either the Mr. Coffee and Capresso grinders and the instruction manual provides handy timing suggestions. For example it recommends holding down the grinder 17 seconds for an 8 cup or 13 seconds for a 4 cup grind."
        },
        {
            "reviewerName": "Shannon Sung",
            "rating": "2.0 out of 5 stars",
            "reviewTitle": "Product is easy to use",
            "reviewDate": "June 1, 2017",
            "reviewText": "Item as described by seller. Product is easy to use. However, coffee grains pop out all over the place and it gets very very messy. I had to keep this product inside the large sandwich bag each time of grinding to prevent from grains popping out from the grinder."
        },
        {
            "reviewerName": "MS",
            "rating": "4.0 out of 5 stars",
            "reviewTitle": "great grinder for all my needs",
            "reviewDate": "July 29, 2017",
            "reviewText": "I've only had it for a few months, but it seems to do a great job for the price. I sometimes grind my beans up fine for drip or french press and other times coarse for cold brew. You can control the duration and pulsing of the grind pretty easily. Easy to clean... I literally just rinse it and maybe use a little soap and can't see any residues collecting as far as I can tell (not too worried anyway cause it's just coffee...). Like others have said, don't fill up more than 1/2 or 3/4 full and you'll be fine - there is no reason to, you can grind in batches. unless you're making like 10 cups of coffee every morning this should not slow you down a bit."
        },
        {
            "reviewerName": "Los Angeles Mama",
            "rating": "2.0 out of 5 stars",
            "reviewTitle": "Bad design! Spend a little more if you want to use daily.",
            "reviewDate": "December 26, 2018",
            "reviewText": "Sadly, the notches on the lid did not fit well into the base. To turn on the grinder, they must lock in place- so heres my issue. I could hardly get this grinder to work! Not to mention the metal cup basically bent in my small hand when I tried to twist it into the base. My guess is just overall cheap manufacturing/material. Too bad! Had to return."
        },
        {
            "reviewerName": "Steve D",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Unit going strong! would recommend",
            "reviewDate": "January 7, 2018",
            "reviewText": "This unit is about 17 months old now and works like a champ. What I like about it is that the lid never gets dirty and the can is big enough for a stout 12 cups of coffee. I do have a small spoon use to loosen up the ground coffee in the very bottom of the grinder that seems to like to not come out when you pour the coffee into the maker basket. Here is hoping for another 10 years of use!"
        },
        {
            "reviewerName": "quadman",
            "rating": "3.0 out of 5 stars",
            "reviewTitle": "This thing is highly overrated. In order to get ...",
            "reviewDate": "August 17, 2017",
            "reviewText": "This thing is highly overrated. In order to get all the whole beans ground up (even coarsely) you need to run it until the bottom half of the coffee is packed into the bottom of the cup and difficult to remove. Thankfully the cup is removable, or this shortcoming would convince me to return it. I have owned several inexpensive KRUPS grinders that outperform this thing at a third of the price."
        },
        {
            "reviewerName": "Bryan Hauser",
            "rating": "3.0 out of 5 stars",
            "reviewTitle": "It does the job, but I bought this so ...",
            "reviewDate": "February 23, 2018",
            "reviewText": "It does the job, but I bought this so all the grounds would stay in the cup and not make a mess. I don't know why it was designed this way, but grounds come out over the top and drop down along the rim and under the cup getting grounds everywhere still. To me a simple fix would be a lid on top of the cup. I will say it is slightly less messy than the one I had before that ground everything in the top cap."
        },
        {
            "reviewerName": "Amazon Customer",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Awesome! First time I have ever ground my own beans",
            "reviewDate": "August 9, 2017",
            "reviewText": "It is of such fine quality and workmanship. I wish it had settings as to what grind it is doing, but I am sure I will get the hang of it.\nI bought it so I could brew my coffee in my Keurig Hot 2.0 with beans I grind myself.\nAs described, there are markings on the inside of the cup so you know how much to put in.\nI like the idea that if you don't press, it does not run. A good safety feature."
        },
        {
            "reviewerName": "Paris & Guero",
            "rating": "3.0 out of 5 stars",
            "reviewTitle": "Almost perfect",
            "reviewDate": "September 22, 2019",
            "reviewText": "Its difficult to clean and when Im using it I want all the coffee grinds or marijuana to pour out but the blades hold it down preventing any easy clean pour, it makes it very messy and I lose product everytime ."
        },
        {
            "reviewerName": "Waldo",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Works great",
            "reviewDate": "January 20, 2019",
            "reviewText": "I have owned this for a few years ago and have used it to grind some pretty solid material. The mechanism is still very stable and runs just like how it did when I bought it. I recommend adding the spice grinder attachment for fresh black pepper and herbs"
        },
        {
            "reviewerName": "Jeannie",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Great Product",
            "reviewDate": "January 13, 2019",
            "reviewText": "It does grind easy & its easy to clean its nice and big inside to grind your coffee grounds or herbs grind. I am hoping motor last. Its better than the Cruisinart we had before it died. Its not loud at all and Im so happy with this grinder. We been using this grinder since January and so far it is awesome & we love it. Craftsmanship and durability is 100 % Awesome. Thanks Will buy again from this company."
        },
        {
            "reviewerName": "john",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Decent deal works well but wont brew your coffee for you",
            "reviewDate": "February 28, 2019",
            "reviewText": "There isnt really much to say about KitchenAid that hasnt already been said. I gave it 5 stars because it does the job every time, push down and ground beans happen. Theres some oddball chunks here and there if you dont really give it enough time but it's quiet for a grinder and works every time I need it to so far."
        },
        {
            "reviewerName": "Carla K.",
            "rating": "2.0 out of 5 stars",
            "reviewTitle": "Disappointed",
            "reviewDate": "August 25, 2019",
            "reviewText": "This coffee grinder is not very good. Loud, hard to use - hard to get the cup back in place to grind for the next time. The grinds end up in the bottom section. Hard to get the cover back on & aligned correctly. Disappointed."
        },
        {
            "reviewerName": "J. Bledsoe",
            "rating": "1.0 out of 5 stars",
            "reviewTitle": "DANGEROUS MACHINE : NEEDS TO BE RECALLED",
            "reviewDate": "July 4, 2019",
            "reviewText": "When one removes the tub that the beans to go in you may cut your hands. The top edge is sharp. DONT buy this piece of crap. I have cut myself twice taking out this tub to clean it and I have rough tough Electrican hands."
        },
        {
            "reviewerName": "bbran",
            "rating": "4.0 out of 5 stars",
            "reviewTitle": "works well",
            "reviewDate": "December 6, 2017",
            "reviewText": "works well. Some have complained of the mass when grinding. I have found that only occurs when trying to do only enough beans for one cup of coffee. As long as one puts enough beans in up to the minimum line ( enough for 4 cups) , there's little if any mess."
        },
        {
            "reviewerName": "JME",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "The coffee grinder to beat all others.",
            "reviewDate": "May 13, 2013",
            "reviewText": "Over the years I have had many styles of coffee grinders. But the mess they make had me putting away my whole beans for pre-ground coffee. KitchenAid has solved the problem of static electricity that is a problem with other grinders. The grinder cup is metal. It nests on a grinder base that moves the blade located in the metal cup. Similar to a blender base. Than you give a little twist to the cup which releases it, and put the grounds in your coffee maker. There are graduated marks on the cup. I tried the 12 cup mark and it was stout coffee, even for me. So now I just use me coffee scoop and put six spoonfuls of beans in the cup. It is also quieter than any other grinders I have owned. You wont be disappointed if you purchase this. Happy grinding."
        },
        {
            "reviewerName": "john",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Five Stars",
            "reviewDate": "December 14, 2016",
            "reviewText": "My first coffee grinder. Does what it is designed to do. Its not that loud. It grinds coffee beans just like the description says.Maybe I am, to simple, as a person but it is a coffee grinder and it grinds coffee.Best coffee grinder ever. Unless it burns your house down or electrocutes you, why you would give a product that does what it is designed to do anything less than 5 stars."
        },
        {
            "reviewerName": "Neal P Murray Sr",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "VERY WELL BUILT.",
            "reviewDate": "May 25, 2018",
            "reviewText": "Bought this for my wife who is of Latin persuasion and very particular. It was everything I hoped it would be. Well built, dependable, versatile,\nin that she has no issues with out of the U.S. grown beans etc. I would definately recommend this item. Thanks Amazon"
        },
        {
            "reviewerName": "KP",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Great",
            "reviewDate": "August 8, 2018",
            "reviewText": "I've owned two of these over the last decade and only had to replace my last one because it was lost during moving. I've never had any trouble with the motor and the have used it to make course grinds for french press as well as more fine grinds for pour over. Nice, reliable, economical grinder for everyday use."
        },
        {
            "reviewerName": "Laura A.",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "A bit noisy, but........",
            "reviewDate": "August 20, 2019",
            "reviewText": "As all KitchenAid products do, this one works GREAT! Built sturdily, it does what it's supposed,\na tad noisy, but one can't avoid that with a coffee bean grinder. I LOVE ALL my KitchenAid\nproducts!"
        },
        {
            "reviewerName": "Club player",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Great blender",
            "reviewDate": "April 11, 2019",
            "reviewText": "I like the chop with this coffee grinder. Also, it is easy to clean since the section with the blade can be separated from the main unit. Have had one of these for many years and it's the best coffee grinder I've owned."
        },
        {
            "reviewerName": "Dan",
            "rating": "1.0 out of 5 stars",
            "reviewTitle": "Junk",
            "reviewDate": "September 16, 2015",
            "reviewText": "Worked really well for 4 months then suddenly would no longer turn on or do anything. We used it once a day to grind coffee for 2 people and left it sitting on the counter. That's all it had to do and it couldn't hold up. Thought we we were getting a good one. Very disappointed."
        },
        {
            "reviewerName": "ArcticDi",
            "rating": "2.0 out of 5 stars",
            "reviewTitle": "Not good to powder herbs or spices",
            "reviewDate": "June 2, 2019",
            "reviewText": "I like that I can take the stainless steel cup out of the grinder to clean. HOWEVER, most of the powder from grinding is everywhere EXCEPT the cup. Might work well with coffee beans but for other grinding use a different grinder."
        },
        {
            "reviewerName": "ZenRunner",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Great for Grinding Spices",
            "reviewDate": "March 24, 2017",
            "reviewText": "I use this to grind spices. It does an excellent job. Although, the grind is not overall even. I appreciate the turn and lift out cup. It's easy to wash. It's small and easy to store. It feels sturdy. I hope to have it for a long time."
        },
        {
            "reviewerName": "Mallory S.",
            "rating": "4.0 out of 5 stars",
            "reviewTitle": "I loved the grinder itself if you are looking for a ...",
            "reviewDate": "September 24, 2016",
            "reviewText": "I loved the grinder itself if you are looking for a no frills, simple coffee grinder. There are plenty more for very specific measuring and types of course-ness, but this is just a push it and done grinder. Works great. Had a bit of trouble getting the cup out of the main machine to be able to clean it, but after a few uses got a bit easier."
        },
        {
            "reviewerName": "FC",
            "rating": "1.0 out of 5 stars",
            "reviewTitle": "Total waste of money!",
            "reviewDate": "April 18, 2019",
            "reviewText": "First off - coffee grinder should be grinding coffee, but it does not! I bought this because I wanted a bowl separate which can be washed in dishwasher. But apparently the design does not work at all. While grinding coffee most of the coffee flies outside the lid. so when you open the lid everything is spilled and above all the coffee is not even fine ground! Not worth at all. I wanted to return it but I do not have original box anymore and so I am stuck it with now."
        },
        {
            "reviewerName": "InternetUser124901",
            "rating": "3.0 out of 5 stars",
            "reviewTitle": "Could be more consistent",
            "reviewDate": "July 21, 2018",
            "reviewText": "Works fine but the blade sits pretty high, so the grounds on the bottom end up with different consistency than the rest and get stuck down there. The better designed grinders seem to have a blade that sits lower, resulting in better consistency. Grounds in the bottom always get stuck."
        },
        {
            "reviewerName": "Amazon Customer",
            "rating": "1.0 out of 5 stars",
            "reviewTitle": "I do not recommend this product",
            "reviewDate": "July 23, 2018",
            "reviewText": "I do not recommend this product. I needed a spice grinder and thought this would be perfect. I loved the design and colors.\nwell, when you turn it on it shoots up your spices. up and out of the metal \"cup\" and gets on the plastic lid.\nIt's messy. inconvenient. And it seemed to me like the motor is not even that strong."
        },
        {
            "reviewerName": "nutty",
            "rating": "4.0 out of 5 stars",
            "reviewTitle": "Works well for French press coffee",
            "reviewDate": "March 19, 2014",
            "reviewText": "I think if you drink espresso, where it matters how uniform the grind is, you need a grinder that will uniformly grind the beans. We use French press, and I used to think it mattered whether the grounds were uniform or not, but the hot water sits in the carafe for 4 minutes, so if some of the grounds are slightly smaller or larger than others, the flavors will still get extracted. I've concluded uniformity is not necessary in this case. Why spend the money for a burr grinder if you don't need to?"
        },
        {
            "reviewerName": "ocshoppergirl",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "I love this grinder",
            "reviewDate": "January 11, 2016",
            "reviewText": "I love this grinder!! I have used the The Mr. Coffee, Krups, and Cuisinart coffee grinders and this hands down the best one. The KitchenAid grinder is well built, unlike Mr. Coffee, has measuring lines indicating for up to 12 cups of coffee, unlike Krups which has no lines and a smaller capacity.This grinder is also shaped well and easy to hold, unlike the square Cuisinart Grinder. This grinder is going to last a very long time because it is well constructed. The cord is also very sturdy."
        },
        {
            "reviewerName": "Johana Roberson",
            "rating": "3.0 out of 5 stars",
            "reviewTitle": "Look around and if you dont like it return it right away!",
            "reviewDate": "November 3, 2019",
            "reviewText": "Its okay, I really loved my old one but it finally stopped working so I bought this one. Its bulky I havent figured out how many beans to grind for the amount of coffee I want. Ill learn just sayin this is not bad but its not great either, maybe Ill get use to it.??"
        },
        {
            "reviewerName": "Ayala Zonnenschein",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Love this coffee grinder",
            "reviewDate": "July 2, 2018",
            "reviewText": "Love this coffee grinder. Does the job, easy to use and I especially appreciate that the cup can be removed! No messy coffee grinds all over the counter."
        },
        {
            "reviewerName": "Kindle Customer",
            "rating": "3.0 out of 5 stars",
            "reviewTitle": "Really like this grinder but worried about durability",
            "reviewDate": "March 11, 2015",
            "reviewText": "I wanted to wait to provide decent info on this product. Very happy with this grinder initially. There is a plastic insert which consists of a few blades which allows for the user to turn and scrape inside of grinder to loosen fresh grounds stuck to internal walls. Recently these blades broke free and the obvious noise, while in use, alerted me to stop using the grinder. I readjusted these blades and the noise went away. I am concerned how much longer these blades will remain in place. Owned this item for less than a year. So far so good after the readjustment."
        },
        {
            "reviewerName": "vanillasparrow",
            "rating": "2.0 out of 5 stars",
            "reviewTitle": "Uneven grind, makes a mess",
            "reviewDate": "October 30, 2017",
            "reviewText": "Despite having a fairly powerful motor, this grinder yields a very uneven grind of beans and is very unsuitable for French press. Grounds will scatter along the inner rim underneath the lid, causing a bit of a mess every use."
        },
        {
            "reviewerName": "Valerie Jurik-Henry",
            "rating": "1.0 out of 5 stars",
            "reviewTitle": "Stopped working by the 3rd week",
            "reviewDate": "September 29, 2019",
            "reviewText": "I had high hopes for this unit. One morning I go to use it and it does not work. I can hear the click when you push the lid, but nothing happens. I checked the cord, electric, and even removed the motor to see if grinds were stuck by the connector. Nothing. No wires were disconnected in the motor and a friend of mine who favors electronics said that the motor has an issue. I did not save the box so I have no idea how I would return it."
        },
        {
            "reviewerName": "Nicole S",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Works for me",
            "reviewDate": "September 9, 2019",
            "reviewText": "I am not a heavy coffee grinder, I dont need a fancy coffee grinder.So this works for me, there was a learning curve on how long to hold it down for, but it was easy to figure it out. Washing it was simple, it comes apart to wash. It is heavy and feels well built. I really like it and think it would work for anyone"
        },
        {
            "reviewerName": "G S",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Old Faithful",
            "reviewDate": "September 17, 2017",
            "reviewText": "I bought one of these coffee grinders a few years ago, (January 2011 according to Amazon) use it daily, love it and wanted to see if it was still available, just in case I need another. I don't need another as the one I have works as well as it did the day I got it. It is reliable, well worth the price and I recommend this coffee grinder without exception."
        },
        {
            "reviewerName": "Risenheart Consulting",
            "rating": "3.0 out of 5 stars",
            "reviewTitle": "Not...",
            "reviewDate": "April 2, 2017",
            "reviewText": "...ideal for coffee especially if you're using a Keurig, way to fine of a grind and no way to adjust it. Guess I've come to expect a lot from KitchenAid and this time they really didn't come through..."
        },
        {
            "reviewerName": "Kari",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Recommend this completely!",
            "reviewDate": "November 16, 2017",
            "reviewText": "Extremely helpful!\nI love to drink coffee every day, so having a machine like this to grind the beans whenever I am not in a rush is perfect!\n\nWhen used correctly, this coffee grinder works wonders! It is very easy to use and produces the expected results. It can even grind dried herbs, which is is especially useful when cooking meals that require a specific amount of herbs to not overpower with taste."
        },
        {
            "reviewerName": "C. H. Morrison",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "You Will Love It",
            "reviewDate": "September 2, 2017",
            "reviewText": "I bought this to go with the new coffeemaker I purchased for my husband's birthday. This seemed the best choice after reading quite a few reviews on many other products. Also, I had used this same grinder at my son's house, and they have never had a problem with it's operation. It grinds the coffee evenly and the grounds don't stick to the stainless steel mill or the top. What's not to like?!"
        },
        {
            "reviewerName": "Mike",
            "rating": "1.0 out of 5 stars",
            "reviewTitle": "Worst. Grinder. Ever.",
            "reviewDate": "April 24, 2019",
            "reviewText": "DO NOT BUY.\n\nThe blade design means heaver bits get caught underneath, so you can't easily grind cinnamon sticks, star anise, or any kind of dried chili into anything resembling a powder, nor is it powerful enough to do anything other then toss it around the cup.\n\nThe poor design means that if you're eventually grinding something to a powder, it will get everywhere, it will escape the main vessel and end up pooling underneath it near/on the drive wheel."
        },
        {
            "reviewerName": "Yury",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Best coffee grinder",
            "reviewDate": "July 14, 2018",
            "reviewText": "I'm a coffee lover and this grinders does it's job just right.\nIt turns the beans well around, the result is just fantastic and smells great as it was grinned on a stone mill.\nI've had so many grinders and now I finally discovered the right one."
        },
        {
            "reviewerName": "Sarah",
            "rating": "2.0 out of 5 stars",
            "reviewTitle": "Uneven grinding",
            "reviewDate": "September 17, 2018",
            "reviewText": "The grinder doesn't grind coffee in a uniform manner at all. If you shake it to get the beans to grind more evenly while grinding, the coffee gets between the cover and the metal vessel that holds the beans, and when you take the cover off it makes a huge mess. I have to grind the coffee, pause, stir it around in the grinder with a butter knife, then grind again, and still there is some coffee that is powdery with chunks mixed it. This might be good for spices because you can clean it, but don't expect an even grind. I wouldn't recommend buying this one."
        },
        {
            "reviewerName": "L.Kelly",
            "rating": "1.0 out of 5 stars",
            "reviewTitle": "KitchenAid Missed the Mark On This One",
            "reviewDate": "July 9, 2019",
            "reviewText": "Very unimpressed with KitchenAid this time! The coffee grounds become compacted underneath the blade. You have to use a small spoon to dig the coffee grounds out. I very unhappy with this purchase."
        },
        {
            "reviewerName": "Minerva",
            "rating": "4.0 out of 5 stars",
            "reviewTitle": "Great purchase",
            "reviewDate": "November 15, 2017",
            "reviewText": "This coffee grinder has three great things going for it: 1) the coffee compartment is huge so you can grind up lots of coffee; 2) the coffee compartment is removal so you can get the ground coffee out easily without turning the entire appliance upside down; and 3) the grinder is very quiet compared to other coffee grinders I have used in the past, so you can use it without waking everyone. Overall I am very satisfied.\n\nThe only down sides are that the cord does not retract or store out of sight, and there is only one setting for the grinder, so there is little control over how fine or course you grind the coffee."
        },
        {
            "reviewerName": "wolfimhemd",
            "rating": "1.0 out of 5 stars",
            "reviewTitle": "Very NICELY DESIGNED, but unfortunately the grindr is VERY WEAK ...",
            "reviewDate": "February 23, 2018",
            "reviewText": "Very NICELY DESIGNED, but unfortunately the grindr is VERY WEAK which turns grinding coffee into a hassle each time. The result is always a VERY COARSE POWER with some few entire or half coffee beans inbetween. The powder sits in the grinding container and you have to use a spoon to turn the powder to achieve a good result.\n\nI would like to return it, and would not recommend buying it."
        },
        {
            "reviewerName": "Garden Gal",
            "rating": "2.0 out of 5 stars",
            "reviewTitle": "Plastic on cup part damaged after 1 year",
            "reviewDate": "December 3, 2013",
            "reviewText": "I liked this grinder a lot because of the stainless steel cup. It worked great for a year, then the bottom of the cup, which is plastic, became damaged. It now has a couple of 1\" wide holes in the plastic at the base. Perhaps due to the constant reverberation of the motor? It still works, sort of. I'm giving this 2 *s because the part I thought I could rely on, the stainless steel cup, has a bottom plastic issue. I tried to get the part on the Kitchenaid site and listed the model #, but apparently they don't carry it."
        },
        {
            "reviewerName": "Jojo R",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Great grinder without too much noise",
            "reviewDate": "October 30, 2017",
            "reviewText": "This sucker really grinds. Does a great job. Can grind enough for a full 12 cup pot and grinds evenly and thoroughly while being fairly quiet. It does not wake the house up when I grind. I got this because the burr grinder is SO LOUD IT IS @)#(#*&#. I will say the burr makes coffee taste better, but this grinder does a fine job."
        },
        {
            "reviewerName": "Rebecca Kubaska",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Amazing little grinder",
            "reviewDate": "June 4, 2018",
            "reviewText": "Amazing little grinder. Quality material and easy to use and clean. I only use it about once a week but it could definitely withstand more frequent use. The slim design makes storage a breeze. Very happy with this purchase."
        },
        {
            "reviewerName": "Pamzy",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "So I hear KitchenAid makes great products...",
            "reviewDate": "December 29, 2017",
            "reviewText": "...and they do! This product is Exactly what I wanted. It's big and powerful and a huge upgrade over the old hamilton beach that died after 8 years of faithful service. The biggest plus is being able to remove and wash the stainless cup and blades. I love this coffee grinder so much I'll shop the brand much more often."
        },
        {
            "reviewerName": "nubiannurse",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Works for the use of grinding coffee beans",
            "reviewDate": "July 22, 2019",
            "reviewText": "This simple yet efficient machine is great for a small amount of coffee beans. Its sleek design can be left on counter net to my Kitchen aide coffee maker, without being obtrusive."
        },
        {
            "reviewerName": "Lori Steinhilber",
            "rating": "4.0 out of 5 stars",
            "reviewTitle": "Good and fast",
            "reviewDate": "April 6, 2018",
            "reviewText": "This grinder is faster than others I've had in the past. I just wish I could have found one with grind settings. It definitely grinds quite fine.\nI love the removal and washable stainless steel cup. My old grinder didn't have a removable cup, making cleaning difficult."
        },
        {
            "reviewerName": "Rhonda W.",
            "rating": "3.0 out of 5 stars",
            "reviewTitle": "Cup difficult to unscrew",
            "reviewDate": "February 17, 2018",
            "reviewText": "When I grind the coffee, some of the grounds overflows into the track that holds the cup in place. The grounds in the track makes it difficult to unscrew the cup. It grinds coffee to my satisfaction."
        },
        {
            "reviewerName": "Edi B",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "efficient and easy to clean",
            "reviewDate": "August 10, 2019",
            "reviewText": "larger capacity than the cuisinart blade grinder, easy to lift off grounds unit makes transfer into coffee maker or storage bin easier and cleaner."
        },
        {
            "reviewerName": "jrwelker",
            "rating": "1.0 out of 5 stars",
            "reviewTitle": "Messiest Coffee Grinder ever",
            "reviewDate": "February 26, 2019",
            "reviewText": "The coffee escapes over the grinder bin while you're grinding and makes a horrible mess *ever* time. I've never seen any other grinder with this problem.\n\nJudging from some of the reviews this isn't a problem for all units thus it's clear the quality control is crap. I recommend steering clear.\n\nAnd judging from other reviews, they do a terrible job handling returns so I'd suggest steering clear, unless you're feeling lucky."
        },
        {
            "reviewerName": "Hari",
            "rating": "1.0 out of 5 stars",
            "reviewTitle": "Overspill ground coffee",
            "reviewDate": "December 8, 2018",
            "reviewText": "The grinding quality is average - there is some inconsistency in grind but that's true for most blade grinders.\nThe main gripe with this grinder is the large amount of spill - even a quick few second grind and removing the lid will result in a large amount of overspill of ground coffee. There is a large gap between the lid and the walls resulting in fine coffee falling all over, making it a pain to clean after every grind. Very disappointing."
        },
        {
            "reviewerName": "Dr. Zoidberg",
            "rating": "1.0 out of 5 stars",
            "reviewTitle": "Very poor design",
            "reviewDate": "August 28, 2018",
            "reviewText": "Doesnt grind very well, fine particles fall to bottom while larger ones stay on top. Grinds also work their way under the canister preventing you from grinding. Stopped using it and went back to my hand burl grinder because it works so much better. Just go buy a conical burr or a hand burr grinder for way better results."
        },
        {
            "reviewerName": "Toni L Day",
            "rating": "3.0 out of 5 stars",
            "reviewTitle": "Good but messy",
            "reviewDate": "September 15, 2019",
            "reviewText": "Only gripe is when shaking the grinder to get an even grind all over, some of the product that is being ground comes out and makes a mess on the counter. Otherwise its a really good grinder"
        },
        {
            "reviewerName": "Abhi",
            "rating": "2.0 out of 5 stars",
            "reviewTitle": "There is a fundamental flaw in the design. When ...",
            "reviewDate": "March 15, 2017",
            "reviewText": "There is a fundamental flaw in the design. When you press down for grinding the beans/spices, the spices spill out from the metal container and land on the black rim between the metal cup and the cover When you unlock and release the metal cup from the motor, you will find the mess everywhere.\nI tried grinding cinnamon too; the blades are NOT sharp at all. Left tossing half-inch pieces without grinding them. Not worth it; go for the KRUPS grinder."
        },
        {
            "reviewerName": "Mother of dragons",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Love it",
            "reviewDate": "November 7, 2018",
            "reviewText": "My husband makes our coffee and he grinds are beans. I bought this for him and he loves it. I love the color because it matches my kitchen decor and I also love the KitchenAid brand. Solid Buy"
        },
        {
            "reviewerName": "K M",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Love this Grinder",
            "reviewDate": "November 6, 2017",
            "reviewText": "I love this grinder! It does everything the description said it would do. I like that I can remove the container and wash it. I can put nearly a cup of beans into it and they grind beautifully. If you want a quality grinder, buy this one, in fact I am buying one for my daughter."
        },
        {
            "reviewerName": "Scott",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Works great for ground coffee",
            "reviewDate": "September 10, 2017",
            "reviewText": "Works great for ground coffee. If you are looking to do espresso, get a burr grinder. This will not grind your beans fine enough for espresso. I give it 5 stars because it is easy to use, works fast (about 12 seconds) and it is a breeze to clean. I haven't had any issues with the blades getting stuck so far (3 weeks) and I've ground several different roasts of coffee including a couple where I threw in a few chopped pecans and hazelnuts and no issues. If you are looking for a coffee grinder, this a great grinder that's easy to use and clean. It also looks nice on my counter, which doesn't factor in to my rating, just a bonus."
        },
        {
            "reviewerName": "Amazon Customer",
            "rating": "4.0 out of 5 stars",
            "reviewTitle": "Very efficient but hard to get all of the grinds out",
            "reviewDate": "March 18, 2019",
            "reviewText": "I bought this as a christmas gift for friends since they drink a lot of coffee but didn't have a grinder. I use it when I make coffee at their house. It is very easy to use, can be a little loud, but it grinds the beans very quickly. The only issue for me is that it is hard to get all of the grinds out and you have to use an utensil to get everything. Other than that, it is a very good coffee grinder."
        },
        {
            "reviewerName": "Donovan Halstead",
            "rating": "2.0 out of 5 stars",
            "reviewTitle": "Old grinder is gone.",
            "reviewDate": "January 13, 2014",
            "reviewText": "Update 2018: The place plastic has shattered and crumbled around the lid so this is no longer useful. I thought it was OK at first, but in reality, if you're going to be grinding coffee, get a real burr grinder. I've replaced this and am much happier with the real coffee grinder and the flavor is improved as well.\n\nThis is a much better design than the older grinders that you have to tip over and spill all over the kitchen then somehow clean up without water.... This one you just grind the beans and take off the cup to dump into the coffee maker. No mess."
        },
        {
            "reviewerName": "Panda",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Really Good...",
            "reviewDate": "March 21, 2017",
            "reviewText": "I really like how this is set up. It's kind of like a blender (but smaller) and the whole metal cup (with its blades) is removable and easily washable. The whole set up is very well thought out. I also got the smaller spice grinder attachments?, which simply replace the metal cup to the smaller spice grinding cup."
        },
        {
            "reviewerName": "Barnie",
            "rating": "3.0 out of 5 stars",
            "reviewTitle": "Not completely satisfied",
            "reviewDate": "February 25, 2018",
            "reviewText": "I found this ground coffee either too course or too fine. I followed the instructions and was not happy with the way and was not happy with the way it worked. I did keep it however because it grinds my herbs and spices into a powder that I can measure more easily."
        },
        {
            "reviewerName": "AZ microbiologist",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Exceeded all expectations",
            "reviewDate": "June 4, 2012",
            "reviewText": "I did quite a bit of research before purchasing this coffee mill. Even the expensive brands seemed to have poor reviews and the two main complaints in those reviews (not grinding all the beans and leaving chunks, and being too messy because there was not a removable cup) are NOT an issue with this model as far as I can tell. I've owned this about three weeks and couldn't be more pleased, in fact it exceeded every expectation. When I saw the blades for the first time, I assumed it was going to also leave some chucks of unground beans in the receptacle. Never has it done that. The grind is perfectly even and fine. I was also surprised that it is relatively quiet when grinding. This unit is VERY easy to clean and not messy because the receptacle lifts out and you empty that into the coffee filter rather than turning over the whole unit. Plus, both the grinding receptacle and the lid can be washed so you could easily switch from grinding coffee beans one day to grinding some peppercorns the next. You could never do that with a coffee grinder that didn't have a lift-out receptacle that you could throw in the dishwasher because there would be residual flavor in the receptacle. I have not tried grinding spices with it, but judging on how well it works with whole coffee beans I think it would do fine. I expected to like this unit, but thought I would have some of the same issues that other folks had experienced like the receptacle being somewhat difficult to lift out, or the lid getting covered with grounds. Honestly, each time I have used it the receptacle has been a piece of cake to lift out, I've had zero trouble with that. And even when I fill the receptacle full to grind a lot of beans I have yet to get the clear lid dirty with grinds. I realize I'm praising this thing to the point where it sounds perfect, but since I love it so far I really can't think of a negative. It's attractive on the counter too.\n\nUpdate June 16, 2012 : Still 100% happy with this purchase. Even when I fill the reservoir full with beans and grind a lot at once, it never leaves any unground beans. Not even a small chunk remains, there is just a perfectly smooth, fine grind. And it grinds a full reservoir extremely fast (in mere SECONDS). I've put the removable reservoir in the dishwasher several times so far, no problem. I don't wash it every day. I wash it about once a week. I've never had loose grounds on the countertop and it's never made a mess, so I'm unsure why some reviews seem to say it made a mess. I'm being fully honest that I cannot think of a single thing that I dislike about this appliance. P.S. I don't put the clear acrylic top in the dishwasher. It's never dirty so I've never washed the lid, just the stainless steel bean reservoir."
        },
        {
            "reviewerName": "readerx",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Nice overall",
            "reviewDate": "December 1, 2015",
            "reviewText": "So far so good. Feels sturdy, I like the stainless cup, no more problem with static plastic cups and the coffee grinds clinging to it. I need to grind the beans 25-30 seconds twice (stirring in between) even though that is not recommended in the instructions because of temperatures affecting the flavor. But that is what it needs to get a fine, even grind for espresso. If it won't last at least 10 years, I will update the review. My mom's lasted more than twenty years!"
        },
        {
            "reviewerName": "Ross Brannigan",
            "rating": "4.0 out of 5 stars",
            "reviewTitle": "Caution Cleaning the Base Unit Required",
            "reviewDate": "December 19, 2016",
            "reviewText": "Needs much clearer instructions regarding cleaning the base unit. I cleaned entire unit after first grind with wet cloth. Upon second grind the unit caught fire and white smoke appeared. I was quick to stop and unplug unit however it was heating up quickly and I had to place outside to cool down. If my reaction was slower, the unit would have caught fire. I'm quite certain that some dampness from the cloth caused this therefore would highly encourage the manufacturer to explicitly outline the risks in the product manual and packaging. Otherwise, I was quite satisfied but learned from the experience."
        },
        {
            "reviewerName": "Amazon Customer",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Thank u",
            "reviewDate": "July 5, 2019",
            "reviewText": "Great product"
        },
        {
            "reviewerName": "Manoj R Rao",
            "rating": "4.0 out of 5 stars",
            "reviewTitle": "Decent Buy, Good price, nitpick.",
            "reviewDate": "May 19, 2019",
            "reviewText": "Happy I bought this. Decent buy at a good price point. This is my first coffee grinder.\n\nPros: Stupid simple to use, put beans inside and press the top.\nCons: sometimes the powered coffee tends to sprinkle outside container while removing the top to stop. Solution, to stop keep the top pressed but disconnect the power."
        },
        {
            "reviewerName": "Jennifer Rose",
            "rating": "4.0 out of 5 stars",
            "reviewTitle": "Solid purchase",
            "reviewDate": "March 18, 2019",
            "reviewText": "The coffee grounds get stuck to the bottom and it's kinda loud. I have to wait til my kids wake up to use it. Overall good for the price, no doubt"
        },
        {
            "reviewerName": "myree williams",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Easy to use..",
            "reviewDate": "October 11, 2019",
            "reviewText": "Excellent Coffee Grinder and I like that this Coffee Grinder has additional parts for grinding other things too."
        },
        {
            "reviewerName": "shortcake",
            "rating": "4.0 out of 5 stars",
            "reviewTitle": "Works great but coffee seeps under the bowl which is frustrating because it is difficult to clean plus that is wasted coffee",
            "reviewDate": "June 30, 2018",
            "reviewText": "Over a year now and still works great. The only thing I don't like is that coffee seeps under the bowl which is frustrating because it is very difficult to clean plus that is wasted coffee."
        },
        {
            "reviewerName": "Amazon Customer",
            "rating": "2.0 out of 5 stars",
            "reviewTitle": "What a JOKE !",
            "reviewDate": "May 7, 2019",
            "reviewText": "If you are serious coffee drinker and prefer to grind your own, choose a different product. Very messy machine. gets grinds all over the counter and the lid is difficult to get positioned and the grinder canister has a dangerously sharp edge. cut my finger twice."
        },
        {
            "reviewerName": "OkieGirl",
            "rating": "4.0 out of 5 stars",
            "reviewTitle": "It really doesn't do that great a job on small quantities",
            "reviewDate": "September 12, 2017",
            "reviewText": "This is a larger grinder than I expected it to be. My husband chose this for grinding spices. It really doesn't do that great a job on small quantities, and some of the ground contents ended up underneath the bowl. I love kitchenaid stuff, but for our purposes, this isn't a winner."
        },
        {
            "reviewerName": "K. Mahmood",
            "rating": "1.0 out of 5 stars",
            "reviewTitle": "MESSY",
            "reviewDate": "August 24, 2017",
            "reviewText": "Whatever I grind collects into the sides, this grinder is not well sealed. Not satisfied at all, waste of money."
        },
        {
            "reviewerName": "Irish heart",
            "rating": "1.0 out of 5 stars",
            "reviewTitle": "Messy and course grind",
            "reviewDate": "January 12, 2019",
            "reviewText": "On most grinders that I own the top part fits into the grinder cup, keeping everything neatly cobtained. With the grinder the cup goes over the outside and everything fly outside the cup and then into the base makeing it hard to clean.\nI tried to ground peppercorns and it did a horrible job. At least half the peppercorns did not grind. The ones that did had an extremely course grind, not acceptable for cooking. Very disappointed in this product."
        },
        {
            "reviewerName": "Ken S. Sato",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Best Grinder",
            "reviewDate": "May 24, 2014",
            "reviewText": "Great engineering. Much better than the Krups style and worth a few more $. Suspect that most of the Krups (and similar non-removable grinder) reviews haven't compared to this. The removable grinding bin makes it far more user friendly. Much easier to get the grinds out and clean. Also quiet and powerful. When the blades get dull can be replaced without throwing out the whole thing. As the Brit's' say- brilliant.\n\nDidn't know what I was missing until I stumbled upon it by accident at my parents house."
        },
        {
            "reviewerName": "Careful Consumer",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "As easy to use and clean as they claim.",
            "reviewDate": "March 27, 2018",
            "reviewText": "Read the description and you'll see how specific KitchenAid is about how easy it is to use and clean. Two easy-to-remove parts that wash and rinse in just moments. Just press from 12 to 24 seconds for the precise grind your coffee maker needs."
        },
        {
            "reviewerName": "Emily Kate",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Solid Coffee Grinder",
            "reviewDate": "March 2, 2019",
            "reviewText": "I love KitchenAid products (who doesnt) and was excited to see this at a great price for Prime members. Works great and I expect it to last a long time."
        },
        {
            "reviewerName": "Stirling",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Favorite grinder ever",
            "reviewDate": "March 22, 2019",
            "reviewText": "I love this grinder. It's heavy duty, reliable and easy to clean. The capacity is great for doing large amounts but also handles smaller amounts great and I get a consistent grind every time. Highly recommend this grinder above any other at this price point."
        },
        {
            "reviewerName": "ImprovErgoSum",
            "rating": "4.0 out of 5 stars",
            "reviewTitle": "So far I am pleased with this product",
            "reviewDate": "November 6, 2015",
            "reviewText": "So far I am pleased with this product. It worked right out of the box. You just add coffee and press on top to grind. The drawbacks are, you have to learn to measure and you have to time it yourself. I am not picky or obsessed with coffee flavor, so to me it is always an adventure. Besides I always buy different kinds of coffee and make different amounts; so to me ii is not a big deal. This a well constructed grinder."
        },
        {
            "reviewerName": "Amazon Customer",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Nice!!",
            "reviewDate": "May 23, 2019",
            "reviewText": "This coffee grinder works great. It looks nice too. It is a bit loud but not too bad. Definitely satisfied with product."
        },
        {
            "reviewerName": "Sandy Path",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Very pleased!",
            "reviewDate": "November 19, 2015",
            "reviewText": "We've been using coffee grinders for years and I think this is our favorite so far! I really love the way it works and I can add more beans than the ones we've had in the past. I do want to see if there is a way to keep the ground coffee from falling under the removable container but it may be the way I'm using it."
        },
        {
            "reviewerName": "Ryan Manning",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "If you don't want to wake your spouse in the morning",
            "reviewDate": "November 19, 2013",
            "reviewText": "Bought this as a gift for my wife for use on a daily basis. Here's the short and sweet of it:\n\nPros: quiet, fast, takes up minimal counter space, and is decorative.\n\nCons: none so far!\n\nI was surprised at how fast the grinder works, and how relatively quiet it is. Dollar for dollar I'm glad I purchase this one over other, more pricey options. All in all you can't go wrong with this grinder."
        },
        {
            "reviewerName": "Amazon Customer",
            "rating": "1.0 out of 5 stars",
            "reviewTitle": "you must hold it down while it grinds/blades wear out",
            "reviewDate": "February 14, 2019",
            "reviewText": "I thought this would be a powerful grinder which ground fast. You have to hold it down to make it fine for 45 seconds or more. You must also be careful not to overload it but use half the coffee it will hold. My old wimpy grinder is doing a better job in less time. Just trying to save time in the kitchen ..... As this grinder gets used it is not grinding as fine. I will buy a new grinder"
        },
        {
            "reviewerName": "Laura",
            "rating": "1.0 out of 5 stars",
            "reviewTitle": "Messy",
            "reviewDate": "October 9, 2019",
            "reviewText": "Messy, the cup/lid does not seal properly and grinds fly all over the inside of the machine."
        },
        {
            "reviewerName": "Matthew Helsley",
            "rating": "4.0 out of 5 stars",
            "reviewTitle": "Very easy to clean",
            "reviewDate": "January 9, 2016",
            "reviewText": "Very easy to clean. I've owned a couple cheaper grinders where the grinding chamber and blade were not separable from the drive electronics. This made it very difficult to fully clean them since preventing water from getting inside the electronics was crucial.\n\nMy only complaint is the top does not actually seal the grinding chamber so there's a small chance that some of the contents may escape the easily cleaned parts."
        },
        {
            "reviewerName": "Fashionista",
            "rating": "4.0 out of 5 stars",
            "reviewTitle": "it's good quality product",
            "reviewDate": "December 28, 2015",
            "reviewText": "I bought this grinder to replace my old one, it's good quality product. I use it for drip and a percolator, I don't think it will make good espresso. The removable bowl is very convenient, I don't know why they did not come up with this design sooner! One flaw is that the blades sit too high from the bottom, thus ground coffee gets stuck between the bottom and the blades, so, you have to scoop it out. Not perfect, but functional"
        },
        {
            "reviewerName": "Stuckshutter",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Simple enought for a guy to use, robust, quiet and a perfect grind every time...",
            "reviewDate": "April 12, 2015",
            "reviewText": "After a couple of decades of use, my old Chemex grinder finally wore holes in the collection shoot. It worked great but with holes in the basket, well, a replacement for an old standby had to be found. There are so many of these that seem to cost a lot and the reviews suggest they were designed by people who drank water, not coffee...\nI took a chance on this one since it had a lot of good reviews. Now I know why, this works like a charm. It absolutely exceeded any expectation in terms of easy of use, quietness and so far, reliability.\nGetting it dialed in to my taste took a couple of tries and now, it delivers exactly the grind I want.\nWhat you'll like:\n\nRobust and solid, heavy base doesn't move about\nClean, no spilling of anything\nQuiet\nEasy to use and clean\nConsistent grind\nSimple as it can be to use, even a guy like me can do it, boiling water is advanced cooking for me... Simply remove the lid, rotate the stainless basket to unlock and remove, fill with beans, lock basket in place, add cover and grind.\n\nThe minuses?\n\nNot very significant but here is what I found could be improved on:\n\n1. Graduated Markings on the inside of the cup for the beans were virtually useless, you can't see them. Buy a press that puts big marks inside the basket guys. I used a center punch to create a series of bumps I could actually see.\n2. Would be nice to have a way to set a time to grind but counting one Mississippi, two Mississipi works so it's a minor point."
        },
        {
            "reviewerName": "Avid Reader",
            "rating": "3.0 out of 5 stars",
            "reviewTitle": "Worth the money",
            "reviewDate": "August 13, 2019",
            "reviewText": "It is worth the money it is relatively quiet. The only complaint I have is that it can be hard to get all of the ground coffee out of the bottom"
        },
        {
            "reviewerName": "The Iman",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "A very good grinder.",
            "reviewDate": "July 1, 2019",
            "reviewText": "We use for the drip coffee maker. Nice even grinds, easy to keep clean. Very durable, it should last a long time."
        },
        {
            "reviewerName": "Nick Garcia",
            "rating": "2.0 out of 5 stars",
            "reviewTitle": "Going Back to My Cheap Model",
            "reviewDate": "September 26, 2017",
            "reviewText": "Good blades and beautiful design, but really faulty. The gap between the cup and the lid allows the coffee to escape. It makes a mess every time you use it. I'm really disappointed, after 5 years using a cheap Cadence model, never thought that a KitchenAid product could be \"inferior\". To be fair, it is way better build, but appears that the people who built it never use it."
        },
        {
            "reviewerName": "marcelmib",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Try it - You'll like it!",
            "reviewDate": "January 13, 2015",
            "reviewText": "A couple years ago, when we lost power for a week in the late fall, we started using an old campfire type coffee percolator. We found the flavor to be so much better than run-of-the-mill drip type coffee makers. Well, we recently tried fresh ground coffee by trying to use a blender. Needless to say, that didn't work out so well. We decided to purchase a REAL coffee grinder and are glad we did. MUCH smoother flavor than using pre-ground coffee."
        },
        {
            "reviewerName": "JMS",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Works great overall.",
            "reviewDate": "January 11, 2019",
            "reviewText": "A little finicky on the grinding; takes some user practice. But, works great overall for a basic grinder without any bells and whistles. Would recommend."
        },
        {
            "reviewerName": "Cyndi McM",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Fine Grind in seconds!",
            "reviewDate": "November 12, 2016",
            "reviewText": "A very sturdy grinder, I have been using it everyday for a month, super quite and fast. I like super fine coffee for a drip pot and this does the job and the grinder lifts off the motor so you can dump it out with worry of the blade turning on ! Great Price, First Quality."
        },
        {
            "reviewerName": "Rhonda J. Howard",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Great!",
            "reviewDate": "February 10, 2019",
            "reviewText": "Great product. It grinds coffee beans in just a couple presses on the lid. This is my first one so I cant compare it to others but I am loving the ease of it plus it looks nice on the counter."
        },
        {
            "reviewerName": "Janice M.",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "We love it!!",
            "reviewDate": "January 17, 2011",
            "reviewText": "I got this grinder for my hubby for x-mas and we love it!! It is quick, reasonably quiet and easy to use. We use it for grinding beans for our French press so we are not looking for super fine but I'm sure it could do it. It grinds really quickly, it is easy to remove the cup with the ground coffee in it and pour it out with out a mess. It is easy to clean up and doesn't have tons of parts to mess around with. We use it every day and have had no problems so far in the month we have used it. I would recommend it to a friend for sure :)"
        },
        {
            "reviewerName": "Trish",
            "rating": "1.0 out of 5 stars",
            "reviewTitle": "It looks good  but looks are deceiving!",
            "reviewDate": "October 25, 2017",
            "reviewText": "I am very unhappy with this coffee grinder. Time got away for me, but I shouldve returned it! To begin with, its not easy to line up the cup holding the beans with the grinder so that it will engage. In use, the grinder is designed so that coffee grounds fly up against the cover and fall back down into the gear mechanism. Also, after use, the coffee is ground fine on the bottom and coarse on top. I do not recommend!"
        },
        {
            "reviewerName": "Sonoma Dan",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Well worth the price over the Competition",
            "reviewDate": "December 28, 2015",
            "reviewText": "Everyone who uses it here comments on how quiet and efficient it is. Washing is a breeze, the grinder comes out for the dishwasher. Really well designed and built product, well worth the very few dollars more than the cheaper competition. It's also quite attractive. Highly recommended."
        },
        {
            "reviewerName": "Andy F.",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Great little grinder!",
            "reviewDate": "April 2, 2017",
            "reviewText": "I absolutely love my new coffee grinder, and it's a first for me, too! It's super simple to use, too! Just add your coffee beans of your choice, secure all the parts beforehand, put the cover on, and press and hold down for less than 25 seconds and grind away!"
        },
        {
            "reviewerName": "Ms Bita",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "I like this grinder.",
            "reviewDate": "May 16, 2016",
            "reviewText": "Love this new coffee bean grinder! I was a little nervous the first time using it b/c I didn't know how long to grind the beans for my stove top percolator but the instructions were good and I like holding the grinder top down for 8 seconds for larger grounds and 10 seconds for a little finer grind. I think I'm going to be very happy with this beauty!"
        },
        {
            "reviewerName": "Addison S.",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Great quality and large capacity!",
            "reviewDate": "May 28, 2019",
            "reviewText": "This grinder works great. It has a large stainless steel container with measurements on the side so you know how much you have ground. The overall quality and ease of use is great."
        },
        {
            "reviewerName": "Trent",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "A useful product for the coffee bean users.",
            "reviewDate": "December 30, 2018",
            "reviewText": "Bought the product a while ago since my brother kept giving the wife and I coffee beans as presents. Normally, we get ground coffee, but this product grinds the beans completely and in less than five minutes. Easy to use and easy to clean. A must have if you prefer grinding your own coffee beans."
        },
        {
            "reviewerName": "PATRICK MULLIN",
            "rating": "4.0 out of 5 stars",
            "reviewTitle": "I am well satisfied with this appliance",
            "reviewDate": "August 22, 2016",
            "reviewText": "I am well satisfied with this appliance....I had the previous version of it and still use it and this new one meets my expectations also. It is easy to use, has a larger capacity than other kinds I have used and is powerful enough for grains as well as coffee."
        },
        {
            "reviewerName": "xojulesox",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Looks great on my counter!",
            "reviewDate": "January 11, 2018",
            "reviewText": "I just started drinking coffee again, and I must say fresh ground coffee makes a HUGE difference!! I bought this grinder in particular because it was stainless steel, which I'm a fan of. Highly recommend."
        },
        {
            "reviewerName": "Lee Conradi",
            "rating": "1.0 out of 5 stars",
            "reviewTitle": "when brewing in my Keurig it the coffee comes out horrible. Tried various times and consistencies of the ground ...",
            "reviewDate": "May 5, 2018",
            "reviewText": "My former coffee grinder blade broke after at least 15 years of use.\nPurchased this one, after reading reviews of all. Does not grind coffee\nwell at all, when brewing in my Keurig it the coffee comes out horrible.\nTried various times and consistencies of the ground coffee, didn't\nmatter. Never got a good cup of coffee using this Coffee grinder.\nVery disappointed."
        },
        {
            "reviewerName": "Tess Starecheski",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Best ever!",
            "reviewDate": "April 8, 2014",
            "reviewText": "This is the best coffee grinder I have ever owned, by far. The design is outstanding - quiet, efficient, lovely to look at, and without the flaws of my previous ones. The container for the beans comes out easily, and the ground coffee pours out without sticking or flying everywhere. My husband and I use different coffemakers - french press for me, Mr. Coffee drip for him - and we are both satisfied with the grinds. I hope it lasts a very long time."
        },
        {
            "reviewerName": "Amazon Customer",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Love this grinder!",
            "reviewDate": "September 6, 2017",
            "reviewText": "I use this grinder for my coffee every day. It doesn't allow you to control how fine the coffee beans are ground but I still find my coffee comes out perfectly and it saves me spending ages using the hand grinder I have."
        },
        {
            "reviewerName": "Francis",
            "rating": "2.0 out of 5 stars",
            "reviewTitle": "MUST PAY ATTN WHEN GRINDING",
            "reviewDate": "July 25, 2017",
            "reviewText": "Did not like how product worked so I returned it. Wouldn't purchase again. Grinding was not easy with this product. Have to really pay attn."
        },
        {
            "reviewerName": "Caitlin",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Works great and I love that I can remove the cup ...",
            "reviewDate": "January 16, 2018",
            "reviewText": "Works great and I love that I can remove the cup from the grinder! It makes it easier to pour the grounds out and clean it as well. That feature alone makes it worth more to me than other grinders. Would definitely recommend."
        },
        {
            "reviewerName": "vegan_mah",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Awesome deal",
            "reviewDate": "April 27, 2019",
            "reviewText": "How was this such a great deal?!? It grinds my coffee- all stainless steel! Hefty and feels long lasting."
        },
        {
            "reviewerName": "Jacqueline R Konopa",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Highly recommend",
            "reviewDate": "July 28, 2019",
            "reviewText": "Works perfectly. Super convenient and easy to use. Noise level is about what you would expect from a coffee grinder..."
        },
        {
            "reviewerName": "Mtwnman30308",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "GREAT GRINDER",
            "reviewDate": "October 24, 2015",
            "reviewText": "I shopped for weeks looking for the perfect grinder that wasn't ridiculously expensive. For once I made the right choice the first time. It ill grind your coffee beans as coarse or as fine as you want them to be. It is also VERY quiet. You won't waked up everyone grinding coffee beans in the morning. The only con is that you will almost always spill coffee on your counter."
        },
        {
            "reviewerName": "Katalin Volgyi",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Great grinder",
            "reviewDate": "December 2, 2017",
            "reviewText": "The longevity of the safety actuator pins is a question but the grinding power, construction makes this device a great choice at the ~$20 price range.\nWe are using this to grind mixed nuts and coffee."
        },
        {
            "reviewerName": "Jennifer Martin",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Wonderful grinder!",
            "reviewDate": "June 14, 2017",
            "reviewText": "So convenient and such a time saver!!! The large capacity makes it simple and quick to grind as many coffee beans as necessary. The straight, flat top design keeps the mess to a minimum, unlike the rounded designs of so many other products. Wonderful grinder!"
        },
        {
            "reviewerName": "Frank Candlish",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Excellent for grinding spices",
            "reviewDate": "June 27, 2018",
            "reviewText": "bought to grind spices for my sausage/meat creations. Works great in blending the spices, making them easier to disburse in my meat products. Real happy with it."
        },
        {
            "reviewerName": "Sean",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Affordable, Functional, and Looks Great",
            "reviewDate": "January 3, 2017",
            "reviewText": "What a great purchase. Made my coffee taste so much better, and the removable stainless steel bowl is the best part. A lot of similar products are all one piece. The ability to remove the bowl to pour the ground coffee into the coffee machine, and wash separately from the grinder (and motor) is absolutely necessary. Kitchenaid thought this one through and executed well."
        },
        {
            "reviewerName": "N B",
            "rating": "4.0 out of 5 stars",
            "reviewTitle": "A lot simpler than most coffee grinders. A little ...",
            "reviewDate": "September 8, 2017",
            "reviewText": "A lot simpler than most coffee grinders. A little bit escapes over the top ledge inside though. And it can't handle anything wet very well at all, in case you were hoping (I found it disappointing). It's decent though."
        },
        {
            "reviewerName": "Scott B",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Grinds down to 'turkish' size",
            "reviewDate": "April 7, 2019",
            "reviewText": "The longer you grind, the finer the grain. Grinding takes very little effort."
        },
        {
            "reviewerName": "Martin",
            "rating": "4.0 out of 5 stars",
            "reviewTitle": "Great Grinder - Grounds get stuck.",
            "reviewDate": "June 25, 2013",
            "reviewText": "This grinder does a good job of grinding up my beans. The only issue I have with it is that the grounds on the bottom get stuck and have to be \"swept\" out of the device. It is easiest to do with your finger rotating the blades, but is obviously not very safe. This means you have to either unplug the device to properly dump your grinds, or keep something handy around. It should be part of the design that you can simply dump out the grounds. Still gave 4 starts"
        },
        {
            "reviewerName": "Donny",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Does the job",
            "reviewDate": "July 18, 2019",
            "reviewText": "Takes awhile to process a lb. Of coffee but it works good so far."
        },
        {
            "reviewerName": "Ralph",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Easy to use-easy to clean",
            "reviewDate": "April 30, 2018",
            "reviewText": "Heavy duty-well built. Easy to use-easy to clean."
        },
        {
            "reviewerName": "wombat224",
            "rating": "1.0 out of 5 stars",
            "reviewTitle": "... use this as a spice grinder and it is horribly ineffective. It leaks spices everywhere and takes forever ...",
            "reviewDate": "April 16, 2018",
            "reviewText": "I tried to use this as a spice grinder and it is horribly ineffective. It leaks spices everywhere and takes forever to grind them. I grind all of my spices from seeds or whole dried peppers (i.e cumin, allspice, clove, guajillo peppers, chile de arbol, etc). Do not buy this if you are intending to use it as a spice grinder!!"
        },
        {
            "reviewerName": "Nancy R.",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Great product",
            "reviewDate": "February 11, 2019",
            "reviewText": "Works better than most others I have purchased over the years. Grinds quickly and very well."
        },
        {
            "reviewerName": "Brillianteblonde",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Great little grinder!",
            "reviewDate": "January 7, 2013",
            "reviewText": "My main objective in finding a new coffee grinder was that it had its own removable cup that holds the coffee. Nothing more annoying than having to turn your grinder upside down to pour all the beans out once their ground!! So messy!!! But not this little charmer... It's clean stainless steel cup releases with just a twist, making it easy to then pour the beans in the coffee pot for brewing. Not to mention easier cleaning!!! On top of its neatness, it's also a provides a great grind for the beans, and is moderately quiet. My last grinder was a Cuisinart, and this little KitchenAid beauty is certainly quieter than that one!"
        },
        {
            "reviewerName": "Rexford",
            "rating": "4.0 out of 5 stars",
            "reviewTitle": "Fine grinder but a step down from the model it replaces",
            "reviewDate": "January 1, 2018",
            "reviewText": "Sleek design, sturdily constructed but grinds slower than my 10 year old KitchenAid grinder and the plastic top is shaped so it cannot be set down without it falling over (due to the protruding lower lip)."
        },
        {
            "reviewerName": "Author-poet",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Sturdy",
            "reviewDate": "August 1, 2019",
            "reviewText": "Good value for a simple to use grinder. Does what we expect it to do."
        },
        {
            "reviewerName": "mitzgoof",
            "rating": "4.0 out of 5 stars",
            "reviewTitle": "Good product!",
            "reviewDate": "February 15, 2019",
            "reviewText": "This is an awesome product. I bought because I dropped my previous coffee grinder. Grinds great so far."
        },
        {
            "reviewerName": "Hector",
            "rating": "3.0 out of 5 stars",
            "reviewTitle": "Pretty good grinder with an few caveats",
            "reviewDate": "May 27, 2019",
            "reviewText": "I like the solid build of the grinder and the detachable chamber. Only complaint is that when you grind the beans, the grinds fly up and get in between the chamber and the cover wall. Because of this its really easy to get coffee grinds underneath the chamber so I have to end up cleaning it out constantly. I think this is just due to poor design."
        },
        {
            "reviewerName": "Mellissa Hodgson",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Gift",
            "reviewDate": "August 4, 2019",
            "reviewText": "This is a super nice grinder. MIgt buy one for myself!"
        },
        {
            "reviewerName": "E. Ballen",
            "rating": "1.0 out of 5 stars",
            "reviewTitle": "Makes a Mess",
            "reviewDate": "April 2, 2017",
            "reviewText": "It's just okay. Makes a mess. The grounds leak and get all over the counter because they get caked up on the lip of the grinder. Grinds unevenly, too. I do not drink coffee, but I use coffee beans and other plant matter that I need to have ground into powders. It is cheaper in most cases to buy the whole dried plant material and grind it yourself, and I read in one review that this was good enough for espresso grade grounds. Not the case. My picture was take after I received the grinder, washed it and then tried to use it. I was grinding dandelion roots. A lot of powder gets into the air and caked onto the top, as well. Should probably wear a mask when using this to avoid breathing in anything.\n\nUpdate (4/8/2016): HATE IT!!! Huge mess under the grinding cup. This thing sucks. Even more mess to clean up. Going back to hand-grinding all my beans and herbs."
        },
        {
            "reviewerName": "KGnyc",
            "rating": "4.0 out of 5 stars",
            "reviewTitle": "I like this coffee grinder and will keep it but am ...",
            "reviewDate": "February 23, 2018",
            "reviewText": "I like this coffee grinder and will keep it but am giving 4 stars because even after much longer than the suggested time the manual suggests to grind coffee beans, there are still some large pieces of coffee bean left amongst the finer grounds. This doesn't really bother me enough to return it but I feel it should be mentioned as I wouldn't expect this to happen with a KitchenAid product."
        },
        {
            "reviewerName": "Ami S.",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Snobby Coffee Connoisseur",
            "reviewDate": "December 14, 2018",
            "reviewText": "Arrived well packaged and timely too. Tried it immediately so very quiet grinding the beans. Thank you\nMama Coffee Connoisseur Snob"
        },
        {
            "reviewerName": "Manuel Mendez",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Extracts full flavor for maximum taste.",
            "reviewDate": "September 23, 2016",
            "reviewText": "This was an excellent grinder. I recently was using a simple Krups grinder and could not get my coffee to taste good at all. I decided to look into something with better reviews and I found this KitchenAid grinder and I have to say that it extracts the flavor from the coffee beans as it should. Finally some delicious coffee after soo many fails. I would highly recommend this product. It's affordable too."
        },
        {
            "reviewerName": "SPM88",
            "rating": "4.0 out of 5 stars",
            "reviewTitle": "Solid Coffee Grinder",
            "reviewDate": "August 31, 2016",
            "reviewText": "I really like this grinder. It is simply designed and easy to use and clean. The only potential issue that I could see it is that it typically allows the fine grounds to settle to the bottom leaving more coarse grounds towards the top, but it doesn't bother me at all. My coffee tastes good either way. I would definitely recommend this to a friend."
        },
        {
            "reviewerName": "Christina Rich",
            "rating": "4.0 out of 5 stars",
            "reviewTitle": "Good grinder but a little messy",
            "reviewDate": "September 11, 2019",
            "reviewText": "Doesnt make a tight seal with there being a small but significant gap between the clear top but works perfectly. Except the coffee grounds all over my counter when I take the lid off."
        },
        {
            "reviewerName": "kathy",
            "rating": "4.0 out of 5 stars",
            "reviewTitle": "Much better than the Hamilton Beach ones",
            "reviewDate": "April 10, 2014",
            "reviewText": "This has a nice design, with a removable grinding chamber. The design avoids the cover breakage problem that plagues the HB ones. You have to hold down the top to grind, but this turns out not to be a big inconvenience. The oilier beans that I use (dark roasts) sometimes get clumped in the bottom of the grinding chamber, and have to be dislodged (firm taps with the palm of the hand usually do the job)."
        }
    ],
    "title": "KitchenAid BCG111OB Blade Coffee Grinder - Onyx Black",
    "manufacturer": "KitchenAid",
    "currentPrice": false,
    "rating": "4.1 out of 5 stars",
    "totalRatings": "2,004 ratings",
    "features": [
        "\n         Make sure this fits\n                by entering your model number.\n        \n",
        "160W motor grinds with minimal noise",
        "Stainless steel blade to grind whole beans for a rich, aromatic blend",
        "Heavy-duty motor housing",
        "The whole grinder is remarkably easy to clean",
        "The bowl, blade and top cover can go straight to the dishwasher for easy cleanup"
    ],
    "reviewsAspects": [
        "kitchenaid",
        "stainless steel",
        "easy to clean",
        "easy to use",
        "french press",
        "removable cup",
        "much better",
        "looks nice",
        "coffee maker",
        "get stuck",
        "job of grinding",
        "every day",
        "highly recommend",
        "cold brew",
        "every time",
        "grinds coffee",
        "great job",
        "big deal",
        "stopped working",
        "grinder ever"
    ],
    "qAndA": [
        {
            "question": "Will this grinder grind flax seed?",
            "answer": "Yes we grind flax seed and chia in it for our smoothies. The little metal cup is easy to clean so you can grind coffee one day and flax the next and not get any flavor cross over."
        },
        {
            "question": "how much coffee will it grind at one time? (i.e. what's the maximum capacity?)",
            "answer": "The metal grinding bowl is lined with measurement in which 12 0z is the max or 1 1/2 cups."
        },
        {
            "question": "is the inside of the grinder metal or plastic?",
            "answer": "Stainless steel. It's the best grinder I've had. I highly recommend it!"
        },
        {
            "question": "How long should you grind for a espresso (fine) grind? At the min 4 cup line?",
            "answer": "Hi Amanda, Well I've had more time with my KA grinder since I wrote that review. I'm still pleased with the way it operates but have come to realize that grinding times need to be longer than the directions call for. I, too favor a fine grind so have been holding the grinding to a count of twenty (one one thousand, see more"
        },
        {
            "question": "Can you use this to grind ginger or garlic?",
            "answer": "Because of the type of blade, and the design of the grinder, it's not meant to grind spices. Only coffee. That said, I have only used mine for coffee, and have not tried anything else. You'll find that most of the negative reviews are from users who had difficulty with grinding spices. I would recommend shopping sp see more"
        },
        {
            "question": "Is there room for power cord storage in the unit? If not, is it a removable cord?",
            "answer": "No and no. The cord is permanent and approx. 18 inches."
        },
        {
            "question": "Is this 110-220v, or only for use in the US / Canada?",
            "answer": "It is a 120 volt appliance, for use in the US."
        },
        {
            "question": "Is this grinder works on 220v",
            "answer": "very goob"
        },
        {
            "question": "Will this grind coarse beans for French press?",
            "answer": "It will grind coarse if you don't grind too long.. Not sure why the other reviewer said no. It even says so in the instructions."
        },
        {
            "question": "What is the wattage? Normally it's 150 or 200 watts.",
            "answer": "170w and the best coffee grinder I have ever used!"
        },
        {
            "question": "can you pre-set grind size to fine, medium, etc...?",
            "answer": "M. Brice"
        },
        {
            "question": "Can you grind less than the minimum recommended amount? Sometimes I only want to grind 2 tablespoons of beans.",
            "answer": "while I have not ground that amount it seems like it would be no problem. the blades are close to the bottom, they move fast and I think it would grind as little as a single bean I really like this grinder."
        },
        {
            "question": "What grade is the stainless steel?",
            "answer": "Very high grade I like it very well one one best grinders I have ever had!"
        },
        {
            "question": "Do you sell this product in 220 volts in amazon us?",
            "answer": "Answer not available"
        },
        {
            "question": "retractable",
            "answer": "If \"retractable\" refers to the power cord retracting within the unit, the answer is no. Our stainless steel finish grinder has a thick black power cord of 2 1/2 feet long."
        },
        {
            "question": "Krups is good but wears out with daily use? Is this brand better?",
            "answer": "We use ours about once a week to grind all the coffee needed for the week. It seems to be working just fine and not slowing down."
        },
        {
            "question": "For 4 to 8 cups of coffee, do we fill ground beans to that line then use it all? It looked like too much? I usually use 1 tbls per 2 cups.",
            "answer": "Personal preference for how strong you like it plus what type of coffee you're using ... probably take some trial & error"
        },
        {
            "question": "I want to grind enough coffee to make just ONE cup. I don't want to grind enough coffee for FOUR cups to get my one cup. Why not have a smaller bowl for this?",
            "answer": "So, why not grind enough beans for one cup? Bowl size shouldn't matter. People use varying amounts of beans for coffee strength and that works. I would guess a little less than 1 tablespoon of beans should work. Just experiment. Had another thought, why not grind enough for more than one cup at a time and store gr see more"
        },
        {
            "question": "Can it grind sea moss into a fine powder?",
            "answer": "O believed so"
        },
        {
            "question": "Brand new and I can't remove the bowl. I twisted it counter-clockwise per the instructions and it won't budge. Is there a trick to it?",
            "answer": "No it's very simple, grab the bottom with right hand and use the left to hold onto metal cylinder and twist counterclockwise. It is not screwed into threads so it should turn about an inch. If it's stuck see if you can press downward while turning."
        },
        {
            "question": "Use 220v?",
            "answer": "No mine is 110"
        },
        {
            "question": "Can you do a course grind?",
            "answer": "The less time you engage the grinder the more course. I count about 15 seconds and use in a press."
        },
        {
            "question": "In the pictures there are beans everywhere, Why is this machine so messy?",
            "answer": "I don't know about the picture but I have not had any spillage to date. The grounds do have to be coaxed out of the cup with a small silicon scraper. The only negative is that the grinder switch is temperamental at times."
        },
        {
            "question": "Can I make ginger garlic paste with this?",
            "answer": "What about this KRUPS F203 Electric Spice and Coffee Grinder with Stainless Steel Blades, 3-Ounce, Black"
        },
        {
            "question": "why the instruction manual says, \"not recommended using this grinder to grind beans for for pump expresso-type machines\"?",
            "answer": "Answer not available"
        },
        {
            "question": "What is the input voltage on the grinder?",
            "answer": "110v"
        },
        {
            "question": "Is this able to grind beans fine enough for espresso?",
            "answer": "Yes. Mine works just fine for espresso."
        },
        {
            "question": "I just got this grinder and used it for the first time this morning. Coffee grinds went all over the place. Did I just get a lemon?",
            "answer": "as long as the metal cup that holds the coffee is snapped correctly in place and you hold the top down when grinding it should stay in the metal container. I never have had a problem like that. Mine works great"
        },
        {
            "question": "Can be used for other seeds",
            "answer": "Probably but don't think I'd try it. Difficulty grinding coffee beans."
        },
        {
            "question": "HI everyone, the product description isn't very good on this one. Can someone tell me whether the cord is stowed within the grinder?",
            "answer": "No. It is a rather thick cord, but only 2 feet or so long."
        },
        {
            "question": "What is the current type? 100/240? 110v only? 220?",
            "answer": "110v"
        },
        {
            "question": "What is the replacement blade part number?",
            "answer": "Sorry, I do not know the answer. Try the manufacturer's web site maybe?"
        },
        {
            "question": "Is this grinder easy to clean? Does it leave a mess on the counter after grinding?",
            "answer": "No mess and seldom needs cleaning."
        },
        {
            "question": "how power for it work it use batery,batery recharge or electric power plugin 110v",
            "answer": "Only uses 110volt AC plug in"
        },
        {
            "question": "How does the metal container seal to the plastic top?",
            "answer": "It lines up and you push down on it to grind the coffee. It's the best grinder I've found. I actually bought this one for my daughter. I've had mine for several years."
        },
        {
            "question": "Is it hands free",
            "answer": "You just have to push down on top to activate as was stated before, I have found it easy to use and works great"
        },
        {
            "question": "Has Kitchen Aid improved this so the plastic gears don't wear out quickly? I loved this machine for flaxseed but disappointed in the gear quality.",
            "answer": "Still the same as far as I know but certainly had not negatively impacted the results. Consumers Report listed them as top machine and I have found it so, Honestly, having to replace at high quality machine as this is I am reminded that it was also the cheapest - under $20."
        },
        {
            "question": "hi! is this 220v , to use in Argentina? thanks!",
            "answer": "No. You'll have to use a voltage converter."
        },
        {
            "question": "Will this model grind for espresso?",
            "answer": "I love my grinder! I use it daily. You just leave it in longer to get a fine grind. I really love my coffee grinder!!!!!"
        },
        {
            "question": "Is the plastic lid BPA free ?",
            "answer": "I am not sure, but it is the type of hard, clear plastic that usually does not contain BPA. It is not a worry for me since there is no chance of any BPA leeching out. It rarely comes in contact with the coffee and there is no liquid involved. In fact, the lid usually remains completely clean after grinding. This is see more"
        },
        {
            "question": "Is this good for wet grinding? Like cashew paste or baby foods.",
            "answer": "I have not tried wet grinding but is wonderful for coffee. I would think it would work for wet also."
        },
        {
            "question": "Hilo I want 220v",
            "answer": "Answer not available"
        },
        {
            "question": "How long does it take to grind?",
            "answer": "You should vary the grind time based on the amount of beans. For beans at the 8 mark I grind 22 seconds, pulsing it for the last four."
        },
        {
            "question": "Is this grinder 110/220? Or just 110.",
            "answer": "110v only"
        },
        {
            "question": "Does it grind coarsely for a French Press or only the fine grind for a drip",
            "answer": "I've never used a French press, but I if you just grind 5 seconds instead of the ten or so for extra fine grind it would be coarser. Hope this helps. My grandmother used an old antique hand grinder which was perfect for coarse. A 1938 model probably, the year she got married. Good luck."
        },
        {
            "question": "how power for it work it use batery ,batery recharge, or electric power plugin",
            "answer": "Electric plug"
        },
        {
            "question": "Has Kitchen Aid improved this so the plastic gears don't wear out quickly? I loved this machine for flaxseed but disappointed in the gear quality.",
            "answer": "I can only answer your question if this wears out. It has not done so and, consequently, I am more than pleased with its performance Plus it's cost."
        },
        {
            "question": "does it have a retractable cord?",
            "answer": "No"
        },
        {
            "question": "Can this grinder process raw fruits and vegetables? Looking to use this to make baby food.",
            "answer": "I don't know but suggest you to contact the seller. Sorry I can't help."
        },
        {
            "question": "Can this be used to grind ice ?",
            "answer": "I did not use it for ice, just coffee, some spices and it is excellent.\nI am afraid the blade will be damaged when crushing ice."
        },
        {
            "question": "Is this grinder quiet?",
            "answer": "As quiet as a whisper"
        },
        {
            "question": "May i know kitchenaid bcg111ob power rating is 110v or 230v ? thanks",
            "answer": "The one I bought is 115V"
        },
        {
            "question": "Do the blades spin in the same direction as the unlock direction for the bowl? I've had problems with bowls unlocking during grinding.",
            "answer": "No. The bowl unlocks by twisting left and the blades spin to the right. I've been using it daily for a couple of weeks now with no problem."
        },
        {
            "question": "Is it bivolt?",
            "answer": "Not sure what \"bivolt\" means but I assume you're asking if it can operate on current other than standard US current. It comes with a standard US cord with no transformer, so I would not use it in any other situation. By the way, it is a great coffee grinder."
        },
        {
            "question": "Does it work well for a pour over?",
            "answer": "It just grinds up the beans. If you use grounds for a pour over, this magically creates grounds from whole beans"
        },
        {
            "question": "Will this work with 240 V supply?",
            "answer": "NO ! However, if you first plug the coffee grinder into a power transformer Frist, it will work."
        },
        {
            "question": "Is it normal to have to slam down the top for the grinder to operate?",
            "answer": "Not for me. I just press and hold till its ground"
        },
        {
            "question": "does this have a removeable cup for easy cleaning?",
            "answer": "Yes! Very easy to clean"
        },
        {
            "question": "Can I use the grinder for either coffee, nuts or spices with the same blade? Or does it have a blade for each purpose?",
            "answer": "Don't know. Didn't research that on the web since I only bought it for coffee."
        },
        {
            "question": "Has anyone used this grinder for their Toddy system and did it produce too much fine dust?",
            "answer": "I don't know what a Toddy system is, but I use 6 scoops of coffee and run for 21 seconds. There is some finely ground coffee that accumulates under the blades."
        },
        {
            "question": "Can this be used to make almond flour as well?",
            "answer": "I make cashew 'flour' with it or cashew meal would be more accurate, using raw cashew pieces. If I grind it longer it almost turns to 'cashew butter' but sticks to the sides so doesn't complete the process. I have not tried almonds in it but it will not grind walnuts unless they are already in small pieces. I use this  see more"
        },
        {
            "question": "Does the cup come off",
            "answer": "Yes. The cup comes out. It's a twist/lock stainless steel cup. Super easy and convenient for cleaning. Love this grinder!"
        },
        {
            "question": "Is this unit as quiet as the kitchenaid bcg111 coffee grinder?",
            "answer": "It is quiet for the size and power"
        },
        {
            "question": "Is this also compatible for my book wd 6tb external disk?",
            "answer": "I don't understand what that means"
        },
        {
            "question": "It is work with 220v?",
            "answer": "Not without a small 220 volt to 110 volt transformer. They should be easy to find in mega-stores or electronic shops."
        },
        {
            "question": "Will this grind nuts, especially walnuts and almonds ?",
            "answer": "it will do it perfectly"
        },
        {
            "question": "Can you grind rice to make rice flour?",
            "answer": "No. I have grind rice for other purpose (for a Chinese dish ???). It cannot grind rice to fine powder like flour. You might looking into Vitamix for grinding rice for rice flour."
        },
        {
            "question": "Does this work both 110v and 220v?",
            "answer": "Only 110v."
        },
        {
            "question": "Is this product available in malaysia? malaysia voltage is 240 v.asap",
            "answer": "Answer not available"
        },
        {
            "question": "Is a replacement grinder cup available separately? ..possible on amazon?",
            "answer": "I don't know but since it comes out completely I would suspect a replacement is available, either at Amazon or on eBay"
        },
        {
            "question": "Does it grid dried herds",
            "answer": "I have not tried it but other reviews said yes"
        },
        {
            "question": "Does it work on 220v or it's just 110v?",
            "answer": "110"
        },
        {
            "question": "Will it grind quinoa into flour?",
            "answer": "I was able to grind cassava meal into cassava flour, so I believe it should work for quinoa."
        },
        {
            "question": "Is the grinder 110 volts",
            "answer": "YES"
        },
        {
            "question": "is this onyx black actually stainless as pictured",
            "answer": "It is as it appears. Mostly stainless with onyx highlights."
        },
        {
            "question": "what power is batery when it work",
            "answer": "No battery, it plugs in."
        },
        {
            "question": "How easy is it to operate? Will it work with arthritic hands?",
            "answer": "I find it easy to operate and I 'think' you could work it with arthritic hands. You don't have to press the button at the top to operate as you can use your whole hand to press down the top. It might be hard for you to twist the 'bowl' off of its bass in order to wash it, but you could simply wipe out the inside of t see more"
        },
        {
            "question": "Can this be used to grind spices?",
            "answer": "Yes it can. The blades are strong enough to grind with no issue. The container also makes clean up fairly easy."
        },
        {
            "question": "I'm confused - are the stainless steel black and the red the same item - when I click on the red, the price is different",
            "answer": "I saw that difference in price also so I just ordered the stainless one. I'm very pleased with it. Works great, easy to clean--everything I wanted it to be."
        },
        {
            "question": "So many asking if it grinds spices, i assume the kitchenaid stainless steel bcgsga spice grinder accessory kit would work well for this unit?",
            "answer": "Yes it does."
        },
        {
            "question": "Does it automatically shut off?",
            "answer": "No, you have to hold it down."
        },
        {
            "question": "can i regrind coffee",
            "answer": "If you mean coffee that is already ground, yes, you can."
        },
        {
            "question": "How does the stainless steel cup attach to the motor unit? Is there a black rubber coupler between the top and bottom parts of the unit?",
            "answer": "Its a locking mechanism. Similar to what is seen on a blender and motor base. Mine attaches with a twist and lock method."
        },
        {
            "question": "Can it grind the beans to a \"dust\"? I use an ibrik sometimes and it requires dust consistency.",
            "answer": "Tough question to answer because of what someone might describe as dust. You can grind the beans where there are no grains but I would not call it as smooth as say flour closer to stone ground corn flour."
        },
        {
            "question": "Has anyone experienced any spill, I had stuff spill out into the bottom of the grinder under the cup and also outside (very little).",
            "answer": "No, I have not had this problem. However I've been careful not to over-fill the container, giving ample room for the grinds. I would imagine if you over-filled the cup with beans, it would overfill, since there is nothing really to prevent this."
        },
        {
            "question": "I would like to purchase an extra 4-oz. capacity stainless steel coffee grinder bowl for bcg 111ob, how much is it?",
            "answer": "Answer not available"
        },
        {
            "question": "what it use for run the batery , baterry recharge , or electric plugin",
            "answer": "Electric plug-in."
        },
        {
            "question": "Can i buy replacement blades for the coffee grinder",
            "answer": "Yes you can"
        },
        {
            "question": "Can it grind just enough for one cup?",
            "answer": "It does for me. Works quite well."
        },
        {
            "question": "Is the lid glass or plastic?",
            "answer": "The lid is made of plastic. Haven't had a nt issues with it, and looks good if you care about aesthetics ."
        },
        {
            "question": "Is it multivoltage: 120-240 v?",
            "answer": "Hi! It says Volts: 120 Volts AC only\nHertz: 60 Hz\nHope this helps."
        },
        {
            "question": "Has anyone used this to grind coffee for Espresso? Fine enough grind?",
            "answer": "I haven't used it for espresso, but it will grind the beans to almost a paste-like consistency."
        },
        {
            "question": "I just plugged mine in, added beans, closed the lids, evrything seems fine but nothing happens. Why wont it grind? I hear the click sound. Wont grind.",
            "answer": "Difficult to say what it is for sure. I havent had this trouble with my grinder. But make sure that tha part where you put the beans ( how would I call it, cup for beans?) is well set. Sometimes I dont set it correctly turning clockwise , and the grinder doesnt work. This is the only thing I can help with now."
        },
        {
            "question": "Does this grind spices also?? Like coriander n cumin seeds??",
            "answer": "I don't use it for that purpose, but it should work fine. Coffee Beans are very finely ground. You basically look through the lid to determine when you no longer see the large beans, and that you have a finely ground powder. Afterwards, I just put a little bit of Melaleuca lemon drops in the container, and then let  see more"
        },
        {
            "question": "Does this work with 220/240 V power supply?",
            "answer": "yes"
        },
        {
            "question": "Is it on the quiet side ? My mister makes me rather scratch a chalkboard. Thanks !",
            "answer": "I have never thought about it.\nI enjoy crushing the beans and it does a great job.\nA bit noisy but not annoying by any means."
        },
        {
            "question": "Is it works with 110v or 220v?",
            "answer": "US voltage (110 - 115)"
        },
        {
            "question": "I've ordered the onyx black model. In the image it appears mostly silver in color. Can anyone explain this? What color should I expect it to be?",
            "answer": "It's mostly silver with a few black outlining spots it looks good. I've had mine for almost a year now and I use it everyday"
        },
        {
            "question": "Is this product made to european standards",
            "answer": "I do not know what is meant by European standards."
        },
        {
            "question": "Has anyone used this to grind almonds? If so, what resultts are you having?",
            "answer": "no almonds, coffee only,"
        },
        {
            "question": "I bought my grinder in 2013 and then it stopped working in 2017. I know the warranty has expired. Has anyone else had this problem?",
            "answer": "I had the same thing happen. Pressing down on the lid would no longer start the motor. I gave up and bought a new one. I hate it! The blade does a terrible job of grinding the beans. On my old grinder the blade had one end that was bent upwards and the opposite end was bent downward. This help the beans to circula see more"
        },
        {
            "question": "use the battery?",
            "answer": "My uses a plug."
        },
        {
            "question": "From all Italian espresso lovers, does this grinder grind the beans to a coffee powder, fine enough to use in the Bialetti espresso manual maker?",
            "answer": "I would say \"yes.\" The longer your grind the more powder the beans become. It should work fine."
        },
        {
            "question": "Does it go with a 220w plug?",
            "answer": "No. It utilizes a standard North American 120 volt plug."
        },
        {
            "question": "Can I grind pepper corns in it? I like to use different grinds for different recipes.",
            "answer": "I don't know for sure but it does a great job on coffee beans it should do well with pepper corns just do smaller amts at a time"
        },
        {
            "question": "Can I grind almonds with this grinder?",
            "answer": "Yes"
        },
        {
            "question": "Can anyone tell me how many oz. of water the cup holds when filled to the top? The description says 4oz, but that would be tiny.",
            "answer": "approximately 1 1/2 cups of water...more than enough room to grind coffee for the 10 to 12 cup coffee maker"
        },
        {
            "question": "Can this be used with 220v?",
            "answer": "It's wired for a 110 outlet, so I'm guessing not"
        },
        {
            "question": "is this shipped via ups or usps?",
            "answer": "I think ups"
        },
        {
            "question": "If filled to capacity, how many seconds do you grind for a coarse grind (for French Press)? Thank You",
            "answer": "45 seconds sounds about right, but, as I stated in the original review, the blade configuration allows ground coffee to be packed under it...very annoying. I returned this grinder and got a Melitta which I like."
        },
        {
            "question": "Hi! Is this grinder wireless? Thanks!",
            "answer": "no it's not. I plugs into a standard plug. but no not wireless."
        },
        {
            "question": "Does it grind coffee for Keurig maker",
            "answer": "Answer not available"
        },
        {
            "question": "Does it work on 220v (not usa)? thank you!!",
            "answer": "110v for USA\nYou'd need a converter and possibly adapter"
        },
        {
            "question": "Has anyone used it to grind coffee for expresso?",
            "answer": "No"
        },
        {
            "question": "what's the grade number on the clear plastic top??",
            "answer": "The only number I can see is under the black and silver PART AND IT READS: 522264 A-and the 6 may be an 8. Under the number is >PC<. Hopefully this will help!"
        },
        {
            "question": "Is it quiet?",
            "answer": "No, but it is not abusive either. I have been using an older model at work for the last 8 years, several times a day and it is still going strong. my new one is more quiet than the old one and is fantastic! i will never use another grinder ever! i have used the cuisinart grind and brew coffee makers for the last 10 see more"
        },
        {
            "question": "Does the cover get scratched up when grinding cloves?",
            "answer": "Weve not yet ground any spices. However, we have ground peanuts and nothing was scratched."
        },
        {
            "question": "Has anyone used this to cut up or grind fresh herbs ?",
            "answer": "Seven people took the time to type \"no\". If you cannot answer the question or give helpful information you're not expected to reply. Amazon sends out thousands of these questions to everyone who purchased and you are NOT expected to reply just because you got the question emailed to you! This person is asking if anyone see more"
        },
        {
            "question": "will this grind for Moka Express machines?",
            "answer": "Will it grind coffee beans? Yes. Will it grind it to your liking? Not sure. It will grind it up, but I find it to be a bit more coarse than probably necessary for a traditional espresso...however it should be fine in your Moka Express machine. I use a similar coffee maker (different brand) and my grinder works jus see more"
        },
        {
            "question": "Can it be used to grind cloves without discoloring the plastic cap?",
            "answer": "Yes...the items that you grind are in a separate stainless steel cup below the clear plastic cap. The grinding cup is removable for ease of cleaning."
        },
        {
            "question": "Can you grind coarse for a cold brew?",
            "answer": "I don't think so, haven't tried it but there are not different settings, just how long you grind the beans."
        },
        {
            "question": "Is this unit cordless?",
            "answer": "No it isnt cordless."
        },
        {
            "question": "Can it be used for 220v",
            "answer": "I dont know"
        },
        {
            "question": "Had mine for 5 minutes and it stopped working. Any idea's other than returning?",
            "answer": "No"
        },
        {
            "question": "Spice",
            "answer": "I would be happy to try to answer this \"Spice\" question if I knew what the question is. Are you asking if you can grind spices? Just a guess, but I would say \"Yes.\" I've read that you can clean the \"cup\" by grinding 1/4 to 1/2 piece of bread and then discarding the bread. Since I bought this coffee grinder to grind see more"
        },
        {
            "question": "Says \"Onyx Black\" but looks stainless steel?",
            "answer": "Who cares...order it..or dont.. we ordered the red one..which is Red..."
        },
        {
            "question": "Recently purchased a Bunn MCU single cup maker, was wondering if this coffee grinder will work well with the loose ground drawer?",
            "answer": "I haven't seen the Bunn, so I can't answer it. Using this grinder, you'll end up with coarse to fine grounds, if that helps. You can control how coarse or fine to grind the beans."
        },
        {
            "question": "Does this kitchenaid bcg111ob blade coffee grinder suitable for 220 voltage?",
            "answer": "no"
        },
        {
            "question": "From all Italian espresso lovers, does this grinder grind the beans to a coffee powder, fine enough to use in the Bialetti espresso manual maker?",
            "answer": "Yes, will do job nicely"
        },
        {
            "question": "Does this grinder support 220V (Im gonna use it in Argentina)?",
            "answer": "Absolutely no idea. Better to ask Kitchen Aid customer service."
        },
        {
            "question": "Why does the description say Black Onyx, but the photo is silver?",
            "answer": "Mine said black onyx as well, but it is a beautiful brushed chrome with black trim. HANDS DOWN BEST COFFEE GRINDER I HAVE EVER OWNED OR USED!!!"
        },
        {
            "question": "Would you recommend for a coarse or extra coarse grind? I want to use it for cold brew.",
            "answer": "Our grinder creates a medium fine loose coffee. Works well for us."
        },
        {
            "question": "Can we grind wet ingredients? Dosa batter?",
            "answer": "Not recommended; dry beans only."
        },
        {
            "question": "where is it made",
            "answer": "China"
        },
        {
            "question": "Whether this grinder is supplied with 230 Volts rating ? I want to use this grinder in India .",
            "answer": "It is only 120 Volt. You would have to have an adapter to plug into the 240 that converts to 120 Volt. You can find them in travel accessories."
        },
        {
            "question": "How loud is it?",
            "answer": "Just like all the other coffee grinders. After all you are trying to grind something hard, the motor needs to be powerful. This is by far the best grinder I have ever bought!!!!"
        },
        {
            "question": "Looking for battery-operated at least an option",
            "answer": "This is not battery operated"
        },
        {
            "question": "How is the cord stored?",
            "answer": "It's Not Stored."
        },
        {
            "question": "Used it few times, but its too coarse for us. Can this item be returned used? Since it has warranty?",
            "answer": "if it is too coarse you are not grinding long enough"
        },
        {
            "question": "does it work with 220v?",
            "answer": "I don't know, but more importantly, it wasn't a very good grinder. Weak motor and very uneven grinding as a result. Expected so much more from a kitchen aid!"
        },
        {
            "question": "Can I adjust the grind size?",
            "answer": "No you can not but works great"
        },
        {
            "question": "Will this grinder used for make sugar powder?",
            "answer": "Most likely not, but it has many uses, so give it a try. If it doesn't work, not a big loss and you can still use it to grind coffee or nuts."
        },
        {
            "question": "I live in a country that has 220 voltage. What type of voltage transformer can I use with this cofee grinder?",
            "answer": "Answer not available"
        },
        {
            "question": "What is the quietest coffee grinder on the market? Need it for use during \"quiet hours\" when people in neighboring units are sleeping :)",
            "answer": "I don't think you will find a coffee grinder worth it's salt that isn't noisy. Try placing a kitchen dish towel over it while grinding."
        },
        {
            "question": "The instruction manual says it contains a carcinogenic ingedient in it(Cal Proposition 65). What is it and how dangerous is it?",
            "answer": "Cal Prop 65 isn't the carcinogenic ingredient. That initiative became the Safe Drinking Water and Toxic Enforcement Act of 1986, better known by its original name of Proposition 65. Proposition 65 requires the State to publish a list of chemicals known to cause cancer or birth defects or other reproductive harm. As for see more"
        },
        {
            "question": "Is this electric or battery powered? I see no mention of a cord and can see no cord in any of the photos.",
            "answer": "Electric. There's a cord on the back"
        },
        {
            "question": "Coffee grinder that handle both 110 and 220 volts on Amazon?",
            "answer": "This is only rated for 110v."
        },
        {
            "question": "Can this grinder be used to grind both coarse, medium, coarse, and fine coffee grounds?",
            "answer": "You have to manually look into the clear lid to determine how fine it gets. The longer you have it on, the finer it gets."
        },
        {
            "question": "how noisy is it?",
            "answer": "Don't know, it wouldn't work. Had to send it back."
        },
        {
            "question": "Can the grinds from this be used with a My K cup for a Keurig?",
            "answer": "Yes.\n\nSince it is not a burr grinder you can really only achieve a pretty fine grind to make sure you don't have any large chunks leftover. However I've had no problems using this grinder to fill my reusable k-cups."
        },
        {
            "question": "is this battery operated?",
            "answer": "No..it is electric."
        },
        {
            "question": "I want to grind fresh beans everyday, should i wash it with water and soap after every use? How do you clean yours?",
            "answer": "Soap & water"
        },
        {
            "question": "Can you adjust the grind, fine, medium, coarse?",
            "answer": "yes"
        },
        {
            "question": "Can this grind spices like cinnamon, cardamom, clove, etc?",
            "answer": "I would imagine so. It grinds coffee beans to a fine consistency, so it would probably do the same to our things."
        },
        {
            "question": "Is this item electric? I don't see a cord in the photos or video.",
            "answer": "Yes its electric no one makes a battery operated grinder"
        },
        {
            "question": "dimensions of grinder",
            "answer": "It is 8 and 3/4 inches tall at its highest point and almost 4 inches wide near the base."
        },
        {
            "question": "how many watts does the motor have?",
            "answer": "Answer not available"
        },
        {
            "question": "This is billed as an espresso grinder. True? Or is it the same as the other Kitchen Aid blade grinders, only with different branding?",
            "answer": "It is not billed as an espresso grinder. The color is Espresso (brown)"
        },
        {
            "question": "Can you buy just the 4oz removable bowl.",
            "answer": "Ask KitchenAid."
        },
        {
            "question": "How many ounces of beans is equivalent to the \"4-cup minimum\"? (We usually grind about 1.25 oz beans for 2 large travel mugs of coffee.)",
            "answer": "Well I've never gauged it by oz. I can tell you I use 3 heaping Tablespoons of GROUND coffee beans to make a 12 cup pot. There for if you use 1.25 oz of WHOLE beans for 2 lg mugs which I would think hold 12-16 oz in each mug which is 4 cups....maybe 1.25oz is enough for 4 cup minimum."
        },
        {
            "question": "Because of the different electricities, will it work in a South America? Thanks!",
            "answer": "Yes, I use it in Brazil"
        },
        {
            "question": "Will this grinder grind oatmeal into a flour consistancy?",
            "answer": "i dont know. the grinder i received was not the one advertised. it was a shipping error. i have not reordered."
        },
        {
            "question": "how often does this need to be cleaned if just grinding coffee beans?",
            "answer": "Hi - I usually spend about 12 seconds every time I use it. I am not kidding."
        },
        {
            "question": "Does it support 220-240 Volts?",
            "answer": "Does not accommodate European or Asian Voltage. 110-120"
        },
        {
            "question": "One cup grinding?",
            "answer": "I coul not find my review and don't remember exactly what was said in it ij reference to your questioj regarding \"one cup\". Could you be more specific?"
        },
        {
            "question": "Can I switch the setting from fine to coarse?",
            "answer": "No it is a one speed grinder. If you want it fine you just grind it longer."
        },
        {
            "question": "Where is this made?",
            "answer": "Answer not available"
        },
        {
            "question": "is it 220v?",
            "answer": "No."
        },
        {
            "question": "Does this grinder have a retractable cord?",
            "answer": "No, it wraps and is fairly hidden to be put away."
        },
        {
            "question": "Works 220?",
            "answer": "No ,United States 110"
        },
        {
            "question": "Is the kitchen aid coffee grinder electric",
            "answer": "yes, requires electric. It is not battery operated."
        },
        {
            "question": "Is there anything that can disintegrate - I've been through 3 coffee grinders and they all break apart putting plastic or rubber into my ground coffee",
            "answer": "A burr mill coffee grinder is superior in all ways, however will cost more. If you have already been through 3, you drink enough coffee to make a burr grinder worth it."
        },
        {
            "question": "can I use this to grind coffee for french press, drip and espresso settings?",
            "answer": "It all depends on how long you Hold it down to grind, no specific setting for grind type, it's all down to timing. Shorter grind for French press, longer grind for espresso."
        },
        {
            "question": "Could be possible to have tos item to use with 220 Volt 50 HZ",
            "answer": "I don't know. I recommend contacting the manufacturer could possibly have an adaptor or could recommend one."
        },
        {
            "question": "how to clean the grinder?",
            "answer": "I just wipe it out with a dry paper towel. I dont get it wet and its only used for coffee."
        },
        {
            "question": "Can I crush ice with this?",
            "answer": "You could, I don't see why not. It's not going to be a very even \"crush\" though as the blade spins so fast."
        },
        {
            "question": "Can this be used in Singapore? (Voltage problem) or does it need a power adaptor?",
            "answer": "Answer not available"
        },
        {
            "question": "Can I not buy the Spice kit, just the coffee grinder and use it to grind spices? or is the spice kit needed?",
            "answer": "I do not know. I just have the coffee grinder and just use for coffee beans."
        },
        {
            "question": "what kind of battary does it take?",
            "answer": "This is electric."
        },
        {
            "question": "can I grind indian whole spices like cinnamon, cardamom, corriender seeds and also can I make a paste or chutneys?",
            "answer": "While I only use mine for coffee beans, I see no reason why you wouldn't be able to grind spices as well. As far as making paste or chutneys, I think if you were to use a coffee grinder instead of a food processor, this would be the perfect model because the stainless steel grinding cup is totally removable and not in see more"
        },
        {
            "question": "How loud is the grinder?",
            "answer": "It is fairly loud. If your looking for a basic grinder this does the trick. If you want something super quiet this might not be for you."
        },
        {
            "question": "Is the grinder housing itself stainless steel or stainless look plastic?",
            "answer": "The outside is plastic. The inside is actually stainless steel.."
        },
        {
            "question": "Does it have any plastic parts that touch the coffee/spices?",
            "answer": "No."
        },
        {
            "question": "What is the exact model number of this grinder?",
            "answer": "Mod BCG1110B0"
        },
        {
            "question": "Does this device work well for grinding boiled egg shells? Is it easy or difficult to clean afterwards?",
            "answer": "I only use this to grind coffee which has an altogether different consistency from eggs. It is easy to clean but I don't know about using it on something that soft."
        },
        {
            "question": "Can I use this grinder to grind things like beet powder ? The powder tends to clump and I'd like to be able to have a fine powder.",
            "answer": "I have no idea. Im sorry I just use it for coffee beans"
        },
        {
            "question": "Can I use this to gride spices without having to purchase the spice grinder attachment?",
            "answer": "Yes you can"
        },
        {
            "question": "Where is this product manufactured?",
            "answer": "Like most stuff you buy \"china\". Very hard to find stuff MADE IN THE USA, and I do look. My SHARP 60\" tv made in the USA. Semper Fi"
        },
        {
            "question": "can this be used for dried herbs and spices?",
            "answer": "Yes. And a plus with this model is that the cup which houses the blade is removable and dishwasher safe."
        },
        {
            "question": "What is the housing casing made of? Plastic or metal?",
            "answer": "The lid is plastic and the grinder cup is metal."
        },
        {
            "question": "Where is the KitchenAid coffee grinder made?",
            "answer": "Dont know? I wouldnt buy it again knowing what I know now. The tub for the beans and grind has cut my hand twice. Dangerous!!!"
        },
        {
            "question": "Can you use this to grind spices?, or do you need the specific attachment for that",
            "answer": "Yes, it can without any attachment"
        },
        {
            "question": "Is it easy to clean?",
            "answer": "It is very easy to clean. and the ground coffee doesn't stick to the stainless steel anyway."
        },
        {
            "question": "How noisy is this? I don't want to wake up kids and ruin my quiet time in the morning",
            "answer": "Well it is a grinder! But I think it is a reasonable noise level. It grinds quickly and for comparison, it is not as loud as my blender."
        },
        {
            "question": "Is the power cord only. 2 1/2\"?",
            "answer": "Its 2 1/2 feet, not inches."
        },
        {
            "question": "How noisy is this? I don't want to wake up kids and ruin my quiet time in the morning",
            "answer": "It's noisy. Noisy enough to blot out the TV sound when it's being used, but you only use it for 30 seconds."
        },
        {
            "question": "Can it grind nuts?",
            "answer": "It's pretty mediocre at it. If I were you, I'd get an immersion blender with a chopper attachment."
        },
        {
            "question": "Anyone try making oat flower with this?",
            "answer": "Considering it burned out when I was grinding sun dried tomatoes I would say no. I would recommend the vitamix dry blade if your looking to grind flour out of grains or nuts. It is a bit expensive but honestly I've been through a number grinders because I grind some unusual things. The vitamix dry blade model is the be see more"
        },
        {
            "question": "How can i get a coarse grind? I lost manual.",
            "answer": "My user manual says shorter grinding time results in coarser grinds, and it gives some suggested times based on how many cups you want in a drip coffee maker. I took a picture of the chart and uploaded it to the reviews but it may take a bit of time for the Amazon editors to approve it."
        },
        {
            "question": "can you use this machine to grind walnuts",
            "answer": "I would say yes you can."
        },
        {
            "question": "is it loud?",
            "answer": "S T"
        },
        {
            "question": "Is this coffee grinder relatively quiet?",
            "answer": "That's kind of a subjective question. Depends on what you consider quiet. It's about the same as any other coffee grinder I've owned, if that helps. If there's a sleeping baby in the room, yeah, you'll probably wake the baby. If you want to have a conversation while you grind, yeah, you're going to have to speak up."
        }
    ]
}