{
    "productInformation": [
        {
            "Product Dimensions": "7.9 x 3.9 x 3.9 inches"
        },
        {
            "Item Weight": "1.5 pounds"
        },
        {
            "Shipping Weight": "1.8 pounds (View shipping rates and policies)"
        },
        {
            "Manufacturer": "Vremi"
        },
        {
            "ASIN": "B071FM24ZC"
        },
        {
            "Item model number": "VRM010080N"
        },
        {
            "Customer Reviews": "3.9 out of 5 stars\n    405 ratings\n3.9 out of 5 stars"
        },
        {
            "Best Sellers Rank": "#1,747 in Kitchen & Dining (See Top 100 in Kitchen & Dining)\n#5 in Electric Coffee Blade Grinders\n"
        },
        {
            "Date first listed on Amazon": "May 29, 2017"
        }
    ],
    "productDescription": [
        "As you can see from my sleek exterior and anti-slip feet, Im one mean bean grinding machine. From coarse to fiiiine, my sharp stainless steel blades have the moves to get your beans in the groove. So prepare to get your perk on.",
        "Doctors say coffee is the most important meal of the day. Ok, we know they mean 'breakfast' but lets be real, if youre reading this, coffee is an essential and possibly life-saving part of your daily routine. But there is no need to fear, as this grinder is built to not let you down.",
        "This grinder sports a 100g (3.5 ounce) capacity with stainless steel blades that feeds on coffee beans. With silicone feet at its base for grip and stabilityplus a sturdy, strong, and stylish rubber coatingit's built to handle the daily grind.",
        "A good coffee rub can really take your grilling to the next level. It has a dark, earthy flavor with a nice balance of garlic and onion. Without being overly salty or sweet, its the perfect seasoning and also super easy to make! All you gotta do is combine the ingredients below in a large bowl and mix em up. Then, store your rub in a seal container and use it on ribs, burgers, chicken, or any meat you want to take up a notch. (Note: Grinder should be used for beans Only - use pre-ground spices for recipe.) Heres what you need:",
        "2 tablespoons ground coffee",
        "2 tablespoons garlic powder",
        "2 tablespoons paprika",
        "2 tablespoons onion powder",
        "1 tablespoon ground cumin",
        "1 tablespoon salt",
        "1 tablespoon sugar",
        "\n",
        "\n",
        "\n",
        "This grinder is designed to make sure your coffee is what wakes you up - not excess noise. This grinder runs quietly and features a pulse mode for a more consistent grind. It's not only easy on your ears, it's easy cleaning too. Packaged with the grinder is an easy to use, effective, cleaning brush. Just place the grinder under running water and scrub with the brush to get a clean machine in seconds!",
        "A good grinder and fresh beans are your tag-team for optimal coffee flavor. Here are some tips to ensure your beans are as fresh as possible before they get their grind on. Unlike your greatest enemies (Monday, and that one coworker) your beans greatest foes are air, moisture, heat, and light. So its important to store them in an opaque, airtight container to keep air and light out. Store the beans in a dark and chilled location and they'll stay cool, calm, and collected.",
        "Coffee grounds are only as good as the way they're brewed. Not only is this grinder powerful, sturdy, and efficient, but its also very popular. Its electric personality gets along very well with our The Pick-Up Artist Single Cup Coffee Maker, Carafe Commander Coffee Carafe, and the But First, Espresso Maker. They make a great squad to keep you caffeinated. Think the A-Team, but for coffee consumption."
    ],
    "reviews": [
        {
            "reviewerName": "John Cutcliff",
            "rating": "1.0 out of 5 stars",
            "reviewTitle": "Poor Design",
            "reviewDate": "February 2, 2018",
            "reviewText": "The diameter of the grinding cup is quite a bit larger than the blade, which results in some of the beans \"flying in formation\" around the outside and not getting ground properly. Even with stopping, shaking, and restarting, and grinding for 30 seconds, some beans are powdered and some merely cut in half. Previous Krups grinder took 1/3 the time and gave far more even results. Difference? Oval-shaped, smaller grind cup mixes beans better, forcing different beans past the blade each revolution. Buy the Krups F203 instead."
        },
        {
            "reviewerName": "TheBlueAnura",
            "rating": "4.0 out of 5 stars",
            "reviewTitle": "Quick and easy fix to my coffee bean conundrum",
            "reviewDate": "September 27, 2017",
            "reviewText": "What do you do when you buy whole beans at the warehouse store and forget to grind them before you go? You buy Amazon in a coffee grinder! This gadget is small enough to stow easily in a cabinet without being a big deal. It gets the job done quickly and easily (just ask my 8 year old who decided to experiment with grinding a bunch of beans while I was trying to brew a cup of coffee). Clean up is straightforward with a moist cloth. The only thing about cleanup is that the center white piece holds bits of coffee on the wings."
        },
        {
            "reviewerName": "Shonna Williams",
            "rating": "1.0 out of 5 stars",
            "reviewTitle": "Not Impressed",
            "reviewDate": "November 11, 2018",
            "reviewText": "Very large for a coffee grinder. Takes up a lot of counter space.\nCumbersome to hold. (I have average sized, female hands) I can barely get a grip on it with one hand. Which, makes it difficult to hold with 1 hand & tip to scoop out & measure the ground coffee.\nFlimsy construction. The base, red portion is nicely made but the top is very fragile. Upon taking it out of the box, the push button & spring fell right off. I can't imagine that it will hold up to daily use for very long.\nIt grinds the coffee but I don't feel that it is very powerful for it's size & it seems to take a longer time to get a medium grind. There is a warning label on the lid stating not to run it for more than 50 seconds at a time & to let the motor rest between uses. Not Impressed with that. Also, I don't feel this grinder would be able to handle grinding any spices, etc. I don't want to have to buy a 2nd grinder/appliance to do a job that the 1st one should already do.\nPositives-\nThe grinder is quiet.\nThe cord winds up nicely in the base.\nOverall, I'm returning it for another option."
        },
        {
            "reviewerName": "Amber",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Makes a MEAN Cup of Joe",
            "reviewDate": "September 18, 2017",
            "reviewText": "Oh man, I have wanted a decent coffee grinder forever because I am a coffee fanatic and LOVE fresh coffee! I prefer buying the beans and grinding them myself but my grinder broke and I've been on the hunt for a new one ever since. Good thing I ran across this on Amazon and decided to give it a try because it is PERFECT for me! It makes my coffee so much more flavorful and aromatic when the beans are ground fresh and then used for coffee. This is a daily staple in my household because I drink coffee every day, Luckily this will grind enough for either just me, or a full pot of coffee! If you love a good cup of joe as much as I do, this is a great product to own!"
        },
        {
            "reviewerName": "Russell A.",
            "rating": "2.0 out of 5 stars",
            "reviewTitle": "Amazon was great! It was here in one day",
            "reviewDate": "June 27, 2018",
            "reviewText": "Amazon was great! It was here in one day. Down side is one of the rubber nubs on the bottom is missing so it titters on the counter, it is really big compared to my Mr Coffee grinder. Does not seem to grind as fine as the other one did for espresso. Would send it back but to much hassle living in the country. Stuck with it!\nThis is an update after a week of using, I grind coffee for espresso in the morning, this grinder will not grind the bean fine enough so that it stays in the holder. It sticks to the bottom of the screen even after compressing the grounds into the holder, this may work for herbs or spices but do not buy it if you plan on a good cup of espresso."
        },
        {
            "reviewerName": "Amanda",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "This one is great. Easy to use",
            "reviewDate": "September 25, 2017",
            "reviewText": "I accidently dropped my older coffee grinder and it broke so I was quickly looking for a replacement. This one is great. Easy to use, no confusion on how to operate it. My husband uses a french press which requires fine ground beans, and this does it easily. And it comes with a small cleaning brush so it makes it really easy to clean out between uses and coffee bean types. It's not a big grinder so it fits right in the cupboard along side the french press. Really happy with this grinder :)"
        },
        {
            "reviewerName": "kc",
            "rating": "3.0 out of 5 stars",
            "reviewTitle": "Nice grinder, not great.",
            "reviewDate": "July 27, 2018",
            "reviewText": "This is a lovely little grinder, very easy to operate and hold. Minus stars for two reasons, one, it takes forever to grind. I had an old grinder maybe 15-20 years old and it was so fast and made a very fine grind (if thats what you wanted) very quickly, this one goes on quite a while I have to stop the pulse button which says not to hold it down for more then a minute or it will overheat. It takes more then a minute to get a nice grind. Its much quieter then my old one which is nice, but takes a lot more time. The 2nd problem is if you want to make espresso, you can not get a fine enough grind on this no matter how long you grind. It will grind beans, and for the cost, its nice."
        },
        {
            "reviewerName": "Frogger",
            "rating": "1.0 out of 5 stars",
            "reviewTitle": "Missing a fine grind",
            "reviewDate": "November 13, 2017",
            "reviewText": "Bought this based on positive reviews. No matter how long I grind/pulse/shake and how much or little coffee beans I use, I can't get the level of fineness that I could with my deceased Mr. Coffee grinder. Will likely toss it."
        },
        {
            "reviewerName": "Alimarie9090",
            "rating": "1.0 out of 5 stars",
            "reviewTitle": "Unsafe",
            "reviewDate": "April 9, 2018",
            "reviewText": "I know this is a relatively inexpensive product, but DO NOT waste your money and find an alternative instead. I would honestly give this a zero star review if I could - very frustrating and unsafe experience.\n\nThe seller claims this product is \"large capacity\", \"safe\", and \"hassle free\". It is none of these things. In particular, it is unsafe.\n\nFirst off, the product broke after actually a week of use as instructed (7 days). Now, the only way to turn the grinder on is to plug it in, however, the blades immediately start to run upon plugging in and sound like a forge or a dental drill - not what your coffee grinder should sound like - something has broken. Now there is no safe way to insert the beans without risk of a finger wound.\n\nI would love my money back. While this product didn't \"break the bank\", the principle that the seller could sell consumers something that breaks in a week and presents a serious danger (in other words, engaging in a scheme) is enough to make me not want to support the product. I would not recommend this to anyone."
        },
        {
            "reviewerName": "Christina Gardiner",
            "rating": "4.0 out of 5 stars",
            "reviewTitle": "Can grind though stuff",
            "reviewDate": "March 9, 2018",
            "reviewText": "I grind dried rosehips in this. If you have dealt with rosehips, especially dried, then you know they are as hard as rocks. So far the week I have used it it hasn't given out yet. It grinds the rosehips to a nice dust I use for a tincture for my horses. The only reason it got 4 stars instead of five was because the button has to be held down. I wish I could just press it and walk away since rosehips can take a while. Also the wording on the side of the box was very suggestive. I'm sure the makers thought it was clever but not acceptable in a Christian home with little kids, so I quickly threw away the box. But for the price it is a handy grinder. Not many coffee grinders can handle rosehips so I was impressed with this one"
        },
        {
            "reviewerName": "catfisherica",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "quiet and fast",
            "reviewDate": "September 20, 2017",
            "reviewText": "This is one powerful grinder! Both my husband and I were impressed by how easily and Quietly this ground coffee beans. No joke, whole beans and no crunchy grinding sound. Just a soft whirr for a couple seconds was enough to get the beans fine enough for coffee. The Vremi Blade Coffee Grinder ground the beans evenly too which is very important. It is so irrigating when grinders I have owned in the past have ground some beans too fine and some too chunky in the same batch. Not the Vremi Coffee grinder. Consistent grind, quiet, quick and easy to clean. I am happy to say I love it."
        },
        {
            "reviewerName": "Rachel Rocks",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "My new best friend in all cooking prep...not just for coffee beans",
            "reviewDate": "July 11, 2018",
            "reviewText": "I have a tiny kitchen but I love gadgets and coffee (not necessarily in that order. So I splurged for this sucker. I use it to chop my carrots and celery but NOT onions or garlic. Learned that one on it's predecessor. It makes a pretty good juicer too for the lime juice in the guacamole. Oh, and yes, it will medium, moderately and finely grind your coffee beans. Not an adjustment it offers, you just have to remember to stop depending on your brewer. I have an off brand (tiny) k-cup brewer so the finer the better for me. This thing is spoiling me for pre-filled k-cups."
        },
        {
            "reviewerName": "Devon P.",
            "rating": "1.0 out of 5 stars",
            "reviewTitle": "The worst grinder on the planet.",
            "reviewDate": "October 17, 2019",
            "reviewText": "You have got to be kidding with this piece of garbage. It's as big as a pumpkin so good luck holding it, and I have big man hands. It won't grind anything over a tablespoon at a time and even as it does, it doesn't have the ability to actually grind the beans, it mashes them, leaving a thick silt on the insides of the grinder while the remainder stays too course to brew. This has to be either a joke or a bell pepper dicer, but this is not a coffee grinder. This is a waste if time, money and resources. I may as well have put my beans in a bag and smashed them with a hammer... Thanks"
        },
        {
            "reviewerName": "ARivera",
            "rating": "2.0 out of 5 stars",
            "reviewTitle": "Sexy box - cheap grinder",
            "reviewDate": "February 22, 2018",
            "reviewText": "Grinder is as cheaply made as the sexy box. Spring on lid was detached when opened. Cord does not fit anywhere so the item awkwardly tips over and the General construction is cheap. Color is nice. The box! What the heck is this monstrousity. Each side has a sexy slogan - twerk and perk, shake your beans- get your beans in the groove, its fiiiiine, bump and grind, grind with care - lets get it on. So gross. Sending it back - mostly annoyed that this company thinks I need sexy to sell me a coffee grinder."
        },
        {
            "reviewerName": "Kindle Customer",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Amazing for Price BUT...",
            "reviewDate": "October 26, 2019",
            "reviewText": "Great little grinder for the money BUT does not grind coffee beans to fine grind or thoroughly . Always has large chunks that just dont totally grind So if you need fine grounds maybe not quite strong enough."
        },
        {
            "reviewerName": "AeKeenan",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Great grinder! We love whole beans but have never ...",
            "reviewDate": "September 20, 2017",
            "reviewText": "Great grinder! We love whole beans but have never been thrilled with our old grinder. It ground things uneven and left bean chunks but not this beauty. It gives you nice smooth grinds. It's so much more quite than our other one too and has a nice grip. I don't leave things out on my counter because I hate clutter but one could very easy leave this out and it wouldn't be an eye sore. For 14.99 you can't beat it!"
        },
        {
            "reviewerName": "Dora's Daughter",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Love it!",
            "reviewDate": "October 17, 2017",
            "reviewText": "I bought this because I had a hard time finding coarse ground coffee for my cold brewer. This works great. I like that you can grind the beans as fine or as coarse as you want. It takes a couple of times to get the timing right, but it is pretty easy. It is also easy to clean and doesn't take up much space in the cabinet - although it is nice enough looking to put out on the counter."
        },
        {
            "reviewerName": "Jason Luse",
            "rating": "1.0 out of 5 stars",
            "reviewTitle": "Doesn't have enough power",
            "reviewDate": "January 7, 2019",
            "reviewText": "Underpowered it sits on the shelf I'll never use it again should have sent it back"
        },
        {
            "reviewerName": "kuan lun pang",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Great product. The rubber helps with slipping and grip",
            "reviewDate": "October 17, 2017",
            "reviewText": "Great product. The rubber helps with slipping and grip. There are options to now grind my one bag of beans however I like. We brew espresso, french press, drip and cold brew in the house and are always keeping different size grinds everywhere. Now we can grind them fresh without worry! Grinder is quick and easy to use, easy to clean, two thumbs up in my book!"
        },
        {
            "reviewerName": "Jaime and Chad",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Great coffee grinder",
            "reviewDate": "November 17, 2017",
            "reviewText": "Perfect grinder for my needs! This is my first grinder, I typically buy pre-ground beans. I am very happy with this purchase because 1) its the perfect size.. I am limited on cupboard space and this isn't much larger than a big glass 2) it is easy to use.. not complicated at all 3) the beans I ground tasted wonderful in my coffee. Great purchase!"
        },
        {
            "reviewerName": "Yuta Da Cray",
            "rating": "3.0 out of 5 stars",
            "reviewTitle": "Cool design. Very simple. But not for espresso lovers.",
            "reviewDate": "March 10, 2018",
            "reviewText": "Although this grinder is not designed to make espresso grinds, it's possible to make it after you filter out the coarse grinds and re grinding the beans. Although this takes 5 minutes you will still get roughl espresso like fine grinds. But the coffee grinder is easy to clean and easy to use. There is no speed set up for the blades but with the price this is an average product for drip coffee and morning coffee enthusiast."
        },
        {
            "reviewerName": "jerrod s.",
            "rating": "3.0 out of 5 stars",
            "reviewTitle": "this grinder has a great look and feel to it",
            "reviewDate": "March 12, 2018",
            "reviewText": "this grinder has a great look and feel to it. I also like how the bottom is raised enough for the cord to fit underneath around the entire base of the grinder. much more convenient than a common design of one slot in the side of the base. the main draw back to this grinder is that it doesn't grind the coffee as well as other grinders I've had. there is always seems to be a fair amount of large pieces of coffee beans that don't get ground when the rest of the coffee is all finely ground. its an ok grinder it just doesn't grind coffee as well as other inexpensive grinders I've used."
        },
        {
            "reviewerName": "majormom7",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "We used this and our experience was wonderful! It was very easy to use and super ...",
            "reviewDate": "April 9, 2018",
            "reviewText": "We are new to the coffee bean world! we were given a bag of full coffee beans for a birthday present and needed a grinder. We used this and our experience was wonderful! It was very easy to use and super quiet! Clean up was even easy believe it or not. It came with a little brush to help with this. Our coffee tasted great so with how easy this was to use we may become coffee bean people!"
        },
        {
            "reviewerName": "ds62",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Multipurpose dry grinder",
            "reviewDate": "October 20, 2017",
            "reviewText": "My long time black and decker coffee grinder finally gave up on me. While searching on amazon I came across the Vremi coffee blender. I have used other Vremi products before so thought Id give this one a shot. I am very happy with my decision. I use the blender less for coffee and more to grind other spices. If you like using fresh grinded spices for cooking I would definitely recommend this product!"
        },
        {
            "reviewerName": "Amazon Customer",
            "rating": "3.0 out of 5 stars",
            "reviewTitle": "The grind is pretty rough unless you run it for a while as ...",
            "reviewDate": "April 4, 2018",
            "reviewText": "Larger around than I expected and feels too big/cumbersome in my hand when I am pouring the grinds out . The grind is pretty rough unless you run it for a while as well. The color is bright and cheery and the texture helps keep your grip. I wouldn't be able to hold it in one hand without the texture. I am 5'7\", not a petite woman so this feeling so big was disappointing."
        },
        {
            "reviewerName": "L. Kennedy",
            "rating": "4.0 out of 5 stars",
            "reviewTitle": "\"Bump 'N Grind Coffee Grinder\"",
            "reviewDate": "August 6, 2018",
            "reviewText": "Cautionary packaging review (I have no idea if the product actually works): I gave this to my dad for Father's Day this year because a friend of his roasts coffee beans for fun. The package went straight to my parents' house so I didn't see it until afterwards, but the box reads \"Bump 'N Grind Coffee Grinder\". I find it kinda funny... but maybe not as a gift for my dad. Buyer beware."
        },
        {
            "reviewerName": "Dawn M",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Sturdy products, fair prices Taj Mahal Customer Service Great Brand Great Product!",
            "reviewDate": "August 22, 2018",
            "reviewText": "Didn't know product & Customer Service has ever surpassed Vremi company that even offered 50%\noff any other product from their\nline with the very 1st sale of this\nlittle coffee bean grinder. Absolute\ntop of the line in service & product performance. Ty Vremi for commitment to being a dynamic product line & customer service.\nThe 2nd product just as sturdy, & sound performance as the 1st. My family will be receiving your products\nFor Birthdays & Christmas for some time. Ty Vremi."
        },
        {
            "reviewerName": "S. Marx",
            "rating": "1.0 out of 5 stars",
            "reviewTitle": "Apparently dead on arrival",
            "reviewDate": "April 10, 2018",
            "reviewText": "I purchased this on 2/22/2018. Today is 4/10/18 and the first time I tried to use it. It does not work at all. No Power. Tried different outlets etc...does not work. I can't find that I can return it to Amazon. Must be past the return date. I guess I can try to contact manufacturer. But what a hassle."
        },
        {
            "reviewerName": "Karen B",
            "rating": "2.0 out of 5 stars",
            "reviewTitle": "Very coarse grind",
            "reviewDate": "May 20, 2018",
            "reviewText": "I was gifted some lovely whole bean coffees by a friend and purchased this grinder since I didn't have one. No matter how long I press and hold, I can't get all of the beans ground down. It's extremely coarse with some near-whole beans left over. If you like very coarse coffee, this is an okay product, but I'll be switching back to pre-ground coffee or upgrading to a better product in the future."
        },
        {
            "reviewerName": "Steve Hansen",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Works well!",
            "reviewDate": "August 29, 2019",
            "reviewText": "This is a really great little coffee grinder at a fantastic price point. I've got a lot of good use out of it and it continues to do exactly what it's meant to do. Attractive design and good performance."
        },
        {
            "reviewerName": "Amazon Customer",
            "rating": "1.0 out of 5 stars",
            "reviewTitle": "Doesnt work",
            "reviewDate": "November 7, 2017",
            "reviewText": "Very disappointed on this grinder. Doesnt grind very well and seems to leave a couple beans whole everytime."
        },
        {
            "reviewerName": "Moonbeam",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Portable Grinder",
            "reviewDate": "July 10, 2018",
            "reviewText": "The perfect little grinder! We use these little grinders for everything from coffee to flaxseed! It's small and portable to take along with you on a trip (if you are like me and want freshly ground coffee beans). I have even used it for nuts, and other seeds. These grinders are just nice to have around."
        },
        {
            "reviewerName": "D.V.",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "This coffee grinder is great. I am retiring my old electric grinder to ...",
            "reviewDate": "October 5, 2017",
            "reviewText": "This coffee grinder is great. I am retiring my old electric grinder to use just for spices. I have a manual grinder that I like but this makes it so much faster and easier when you want your coffee now! It has a large capacity and is easy to clean with the cleaning brush that is included."
        },
        {
            "reviewerName": "TheFrugalistaMom",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Great tool for any coffee drinker.",
            "reviewDate": "April 3, 2018",
            "reviewText": "Easy to use and clean, I can't believe I waited this long to get a coffee grinder. Within seconds, I can grind coffee beans evenly. The see through lid makes it easy to check the size of the coffee grounds. In a few pulses I can have coffee for french press. A little longer, I'll have finer grounds perfect for espresso."
        },
        {
            "reviewerName": "Knowrisk",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Get familiar...",
            "reviewDate": "January 17, 2018",
            "reviewText": "I purchased this for grinding spices as I have seen this done on cooking shows. It works very well for this and for the coffee also. Now my only problem is that all my neighbors are wanting to use it for themselves to grind. Lol They would make a great gift idea for anyone that cooks. Highly recommended!"
        },
        {
            "reviewerName": "Mugwump",
            "rating": "3.0 out of 5 stars",
            "reviewTitle": "OK in a pinch",
            "reviewDate": "October 14, 2017",
            "reviewText": "Bought this as a short-term solution while traveling. Obviously a proper coffee grinder is better. It takes quite a while to get beans chopped small enough, probably about 30-40 seconds. The grinder is fairly loud. Getting the ground (better: chopped) coffee out of the machine is quite a chore, I am grateful for the little brush that came in the box.\n\nI give it 3 stars because the performance is OK for the price (about $15)."
        },
        {
            "reviewerName": "Roxanne",
            "rating": "1.0 out of 5 stars",
            "reviewTitle": "One Star",
            "reviewDate": "March 10, 2018",
            "reviewText": "Got it and it will not work. Doesnt even turn on."
        },
        {
            "reviewerName": "Honest Abe",
            "rating": "2.0 out of 5 stars",
            "reviewTitle": "Does not grind finely, as stated.",
            "reviewDate": "November 9, 2017",
            "reviewText": "This item, contrary to its description, does not grind coffee beans to the powdery size required to make espresso. I ground up to 4+ minutes (in 20 second bursts), even though the motor heated up enough to flavor the grounds, but never could reach a fine enough particle size. The espresso tasted watery and terrible. This unit sounds tinny. The blade is flimsy. The unit is top-heavy and wants to tip over, esp. since the cord will not stay in the cut-out on the bottom of the unit when grinding. I was disappointed enough to return it and order the Krups unit instead, though it was an extra $12 or so. I had an older Krups for years and it really worked well. I'm sorry I ever gave it away! Grind is nearly everything when making espresso. I had ordered this unit to allow me to make espresso while my expensive espresso machine ( w/ grinder) was being serviced. The new Krups ground my beans to powdery in 30 seconds!"
        },
        {
            "reviewerName": "Kat Menendez",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Perfect",
            "reviewDate": "October 11, 2019",
            "reviewText": "Its perfect. Small in size and simple to use. Great little grinder."
        },
        {
            "reviewerName": "D.Pit",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "This coffee grinder is really great! I can put enough beans in there to ...",
            "reviewDate": "September 29, 2017",
            "reviewText": "This coffee grinder is really great! I can put enough beans in there to make a full pot of coffee and it easily grinds them to the consistency i need. It is super easy to clean and it fits well into my cupboard. I really like having fresh beans for my coffee and this makes it easy to do so."
        },
        {
            "reviewerName": "Amy",
            "rating": "1.0 out of 5 stars",
            "reviewTitle": "Does not grind well",
            "reviewDate": "February 8, 2019",
            "reviewText": "This coffee grinder is a huge disappointment. The blade is so low in the cup that the coffee does not get ground up properly. There are many large chunks and I can't find a way to get it to grind it better. I would not recommend buying this product."
        },
        {
            "reviewerName": "Lisa A. Williams",
            "rating": "2.0 out of 5 stars",
            "reviewTitle": "this grinder does not grind them into a fine grind. It only grinds it to a medium/coarse ...",
            "reviewDate": "October 14, 2017",
            "reviewText": "We ordered this to replace our Epica grinder we had used for a few years before breaking. Unfortunately, no matter how many times you grind the beans, this grinder does not grind them into a fine grind. It only grinds it to a medium/coarse grind. Sending this back right away!"
        },
        {
            "reviewerName": "Hyeong Wook (Alex) Kim",
            "rating": "4.0 out of 5 stars",
            "reviewTitle": "Small and works.",
            "reviewDate": "December 25, 2017",
            "reviewText": "I like this, takes a while (1 to 2 monutes) to grind coffee beans for 1. But compare to hand grinders this is quicker and easier.\nCoffes do get stick to blades and stuff but if you know coffee, they are sticky so I don't complain.\nIt comes with a small brush that you can use to clean the grinder."
        },
        {
            "reviewerName": "Nathan W Twitchell",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "GREAT HERB GRINDER",
            "reviewDate": "December 13, 2018",
            "reviewText": "I USE THIS TO GRING MY MEDICAL HERBS AND IT WORKS GREAT FOR THIS. IT IS A LITTLE HARD TO CLEAN BUT IT DOES COME WITH A BRUSH TO HELP WITH THIS TASK. ALL IN ALL THIS IS A WONDERFUL PRODUCT! THANK YOU AND MERRY CHRISTMAS!"
        },
        {
            "reviewerName": "Dee",
            "rating": "1.0 out of 5 stars",
            "reviewTitle": "COARSE GROUND",
            "reviewDate": "November 8, 2018",
            "reviewText": "Sure wish I would have read the description saying that it is a coarse grind machine, before purchasing.\nIt DOES state that it's a coarse grind.\nToo coarse for me."
        },
        {
            "reviewerName": "peter lener",
            "rating": "1.0 out of 5 stars",
            "reviewTitle": "Crapped out on me within 10 minutes",
            "reviewDate": "June 29, 2018",
            "reviewText": "I used this thing for 10 minutes and it crapped out on me already. Stuff got stuck underneath the blades every so often and would jam the motor, and the 4th time this happened, I cleaned it out and tried to start it again and it wouldn't start. Motor died I assume."
        },
        {
            "reviewerName": "Ieremias",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Great color and functionality",
            "reviewDate": "October 10, 2019",
            "reviewText": "This was an excellent buy at $9.99. This coffee grinder works will to grind cinnamon sticks, which is the primary reason I purchased it. I love the size, hand grips and the color too! Thus, I highly recommend you get you one too."
        },
        {
            "reviewerName": "Brad Sinclair",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "It is easy to clean up and even comes with a brush",
            "reviewDate": "October 1, 2017",
            "reviewText": "This is more than a coffee grinder, I have used it for nuts, herbs, and coffee. It is easy to clean up and even comes with a brush. The Vremi grinder looks good sitting on my counter. It is easy to use and stable while in use. It is quiet compared to my old coffee grinder. I like that it is small in size."
        },
        {
            "reviewerName": "Kaylenriz11",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Quiet",
            "reviewDate": "September 25, 2017",
            "reviewText": "I purchased this coffee grinder for my parents and I just might have to take it back from them. Compared to my other coffee grinder it is super quiet. Yay for not waking those sleeping babies up in the morning. It also came with a small little brush to help clean it! So far I really love this coffee grinder !"
        },
        {
            "reviewerName": "C. A. Crossman",
            "rating": "1.0 out of 5 stars",
            "reviewTitle": "One Star",
            "reviewDate": "March 11, 2018",
            "reviewText": "uneven grind, lid slips out of hands cord doesn't wind well and come out of bottom opening properly"
        },
        {
            "reviewerName": "Susan",
            "rating": "2.0 out of 5 stars",
            "reviewTitle": "Won't grind for espresso",
            "reviewDate": "September 2, 2018",
            "reviewText": "It's a bit awkward to hold but I do have small hands. My biggest complaint is no settings for the type of grind you prefer. It definitely does not do a consistent job as you go to the finer grinds and forget about espresso. Kind of a disappointment."
        },
        {
            "reviewerName": "JGor",
            "rating": "2.0 out of 5 stars",
            "reviewTitle": "I purchased this due to the great reviews. I wanted to replace a Krups I ...",
            "reviewDate": "December 2, 2017",
            "reviewText": "I purchased this due to the great reviews. I wanted to replace a Krups I had that was okay but thought I could do better. This was a very disappointing product. It doesn't grind very well or quickly (unless you want it for a French Press) and it is extremely messy. Going back to my other grinder. For me a waste of money."
        },
        {
            "reviewerName": "Shana",
            "rating": "3.0 out of 5 stars",
            "reviewTitle": "It's still good",
            "reviewDate": "November 2, 2019",
            "reviewText": "It's really convenient and easy to use, but I can't install a lot at a time. It's a little troublesome. Maybe I bought it too small"
        },
        {
            "reviewerName": "Nicole D",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Perfect grinder",
            "reviewDate": "October 4, 2017",
            "reviewText": "Another perfect product by Vremi. This grinder is very effective and grinds every last bean. Also, it almost seems to mix the grounds as it grinds the beans so you dont have any big chunks. It is super easy to clean and store. I love this product."
        },
        {
            "reviewerName": "Emily B.",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Quick and Simple",
            "reviewDate": "October 20, 2017",
            "reviewText": "Perfect gift for those coffee lovers in your life. I got this for my aunt who loves fresh grounds. She loves how quiet it is when it's grinding. With the clear lid you can easily see how the grinding is doing. She likes the size of it and that it is super easy to use and clean."
        },
        {
            "reviewerName": "ac6413",
            "rating": "2.0 out of 5 stars",
            "reviewTitle": "uneven grind, lid hard to close",
            "reviewDate": "November 27, 2018",
            "reviewText": "unless you fill it up all the way, it will not grind evenly at all. if you do fill it up all the way, it will spill out. grounds cling to the bottom. often the lid gets stuck and won't close because grinds get stuck in the crevices. poor design all around."
        },
        {
            "reviewerName": "Theycallmemom",
            "rating": "4.0 out of 5 stars",
            "reviewTitle": "Works",
            "reviewDate": "November 15, 2017",
            "reviewText": "Its pretty and will grind the coffee but it takes some time to get it as fine as we want it. That or smaller batches. Ive had the grinder quite some time but we finally pulled it out of the box to try it out about a month ago. If you like fine ground coffee consider grinding small batches at a time."
        },
        {
            "reviewerName": "amazonamy",
            "rating": "1.0 out of 5 stars",
            "reviewTitle": "fine concept not realized at all :(",
            "reviewDate": "October 23, 2018",
            "reviewText": "returned. too big to comfortably hold, top falls off easily, cord has a small notch that if you don't put it in every single time it's wobbly... shall i go on?"
        },
        {
            "reviewerName": "cstephens",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Adorable!!",
            "reviewDate": "July 21, 2019",
            "reviewText": "Cutest little coffee grinder Ive ever seen! This little guy packs a punch too! I would definitely recommend this product for anyone looking for the perfect coffee grinder!"
        },
        {
            "reviewerName": "Lisa Raymond",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Easy to use",
            "reviewDate": "July 29, 2019",
            "reviewText": "The coffee grinder is great - it is easy to use, easy to clean and does what it is suppose to do. Thanks!"
        },
        {
            "reviewerName": "Kittysdad",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "If you gotta grind",
            "reviewDate": "March 5, 2019",
            "reviewText": "Work very good and was very affordable, always a good grind for a good cup of coffee"
        },
        {
            "reviewerName": "Amazon Customer",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Great Grinder!",
            "reviewDate": "July 10, 2019",
            "reviewText": "Great price for the machine. Works well and is easy to clean and nbn use. I bought it for grinding my herbs. Makes them nice and fine."
        },
        {
            "reviewerName": "madre",
            "rating": "2.0 out of 5 stars",
            "reviewTitle": "Not happy with purchase unfortunately",
            "reviewDate": "March 28, 2018",
            "reviewText": "Takes twice as long to grind as other grinders of equal price and quality. Not happy with purchase unfortunately."
        },
        {
            "reviewerName": "Nicol Dahlstedt",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Hands down this is amazing",
            "reviewDate": "July 27, 2019",
            "reviewText": "I'm so glad for this grinder! Takes a little bit longer because I grind my coffee very fine but this makes it worth it"
        },
        {
            "reviewerName": "Sat",
            "rating": "2.0 out of 5 stars",
            "reviewTitle": "Not for nuts or grains",
            "reviewDate": "June 6, 2018",
            "reviewText": "Supposedly it this must have been good for nuts and greens, but it doesnt work properly with neither. More like a blender or designed for bigger products.\nI am so disappointed with this item!"
        },
        {
            "reviewerName": "Kelly",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Coffee Grinder",
            "reviewDate": "October 9, 2017",
            "reviewText": "Works great for grinding up dried peppers and other spices from our garden. We didn't want to use our regular coffee grinder so we needed an additional one. This does a nice job! Would recommend to others."
        },
        {
            "reviewerName": "Megan",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Perfect!",
            "reviewDate": "October 11, 2018",
            "reviewText": "I grind coffee in this every other day. It's small enough to store in tight spaces and makes fresh coffee! The only downside is that coffee grounds stick to the side and makes it hard to clean, but it makes a good brew! It's somewhat fast, but sometimes I have to regrind the beans to make my coffee stronger."
        },
        {
            "reviewerName": "John F. Brooks",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Great Item",
            "reviewDate": "November 6, 2019",
            "reviewText": "I never owned this item until now and man I love the way it works"
        },
        {
            "reviewerName": "Elizabeth",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Five Stars",
            "reviewDate": "February 21, 2018",
            "reviewText": "Works great!"
        },
        {
            "reviewerName": "Donnaleeperez",
            "rating": "3.0 out of 5 stars",
            "reviewTitle": "Alright",
            "reviewDate": "October 23, 2019",
            "reviewText": "Not great if you prefer your coffee grounds fine. Coffee is only ground corse"
        },
        {
            "reviewerName": "Kim",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Works amazing. Very quiet for what it is",
            "reviewDate": "December 10, 2017",
            "reviewText": "Works amazing. Very quiet for what it is. Very compact and easy to use and clean. Great job with a consistent grind depending on how coarse or fine you want it. The cable wrap underneath is great as well."
        },
        {
            "reviewerName": "Emily davis",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Its a nice grinder",
            "reviewDate": "October 15, 2018",
            "reviewText": "Nice but dont srop the top!!!!!! Mine broke apart but i was able to find the pieces to put back together."
        },
        {
            "reviewerName": "Scott Martin",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "WORKS GREAT",
            "reviewDate": "December 5, 2018",
            "reviewText": "Cool grinder"
        },
        {
            "reviewerName": "Phillip C.",
            "rating": "4.0 out of 5 stars",
            "reviewTitle": "This coffee grinder is great. The rubber grip gives me a nice hold ...",
            "reviewDate": "October 9, 2017",
            "reviewText": "This coffee grinder is great. The rubber grip gives me a nice hold on the grinder. It grinds my coffee bean in seconds and can hold a decent amount of beans to grind."
        },
        {
            "reviewerName": "Mike",
            "rating": "1.0 out of 5 stars",
            "reviewTitle": "Wouldn't recommend to a friend",
            "reviewDate": "August 26, 2018",
            "reviewText": "Of the three or four grinders I've owned, this is the worst. The grounds are uneven, and the more you grind the more you grind 1/4 of the contents that you are trying to grind. I've tried putting less coffee in but still uneven grounds."
        },
        {
            "reviewerName": "sunny",
            "rating": "3.0 out of 5 stars",
            "reviewTitle": "Basic grinder for your coffee beans",
            "reviewDate": "May 19, 2019",
            "reviewText": "Takes a while to get fine grind that I like for my coffee."
        },
        {
            "reviewerName": "Melanie B.",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Trendy",
            "reviewDate": "June 30, 2018",
            "reviewText": "I received this just a day ago and its super cute. I love the packaging and tried it out today and worked great."
        },
        {
            "reviewerName": "Mallory Jones",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Great",
            "reviewDate": "November 25, 2018",
            "reviewText": "Works great, looks super cool. Nice price for the quality. Does a good grind. I'm happy."
        },
        {
            "reviewerName": "Margaret",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Great for coffee on the go",
            "reviewDate": "October 18, 2017",
            "reviewText": "If you don't have much time and you like coffee on the go this is for you. The instructions are clear and easy to understand.\n\nIt's easy and quick to use on the go! Easy to clean."
        },
        {
            "reviewerName": "DragonMaddie08",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "This is a very nice coffee grinder",
            "reviewDate": "September 19, 2017",
            "reviewText": "This is a very nice coffee grinder. I love how it is very easy to hold & has the non slip grip on it. It did a nice job at grinding the beans. I love the color too! It was very easy to clean"
        },
        {
            "reviewerName": "Susan m.",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Perfect",
            "reviewDate": "October 30, 2019",
            "reviewText": "Nothing not to like!"
        },
        {
            "reviewerName": "Cerda6",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Perfect for Coffee",
            "reviewDate": "October 23, 2017",
            "reviewText": "perfect for on the go coffee travel. I use this while I'm at work and its amazing. Easy to clean, small enough to store away and has a lot of power."
        },
        {
            "reviewerName": "Ponder This",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Love it",
            "reviewDate": "March 19, 2019",
            "reviewText": "Looks and works great. I use it for spices as well as coffee beans!"
        },
        {
            "reviewerName": "Lisa C. Green",
            "rating": "2.0 out of 5 stars",
            "reviewTitle": "Doesn't grind very fine.",
            "reviewDate": "August 11, 2018",
            "reviewText": "Well! I liked the shape but as a coffee grinder found it soso. Doesn't grind very fine no matter how long I've run it."
        },
        {
            "reviewerName": "Tahoe Bliss",
            "rating": "3.0 out of 5 stars",
            "reviewTitle": "Three Stars",
            "reviewDate": "May 23, 2018",
            "reviewText": "Doesnt grind fine enough for my espresso... ??"
        },
        {
            "reviewerName": "Stacey Arriola",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Great Coffee Grinder!",
            "reviewDate": "September 3, 2018",
            "reviewText": "Great ginder for a great price. Easy to use, easy to clean. Not too loud when grinding. Perfect for a pot of morning coffee!"
        },
        {
            "reviewerName": "TiRo",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "As described",
            "reviewDate": "October 13, 2019",
            "reviewText": "As described"
        },
        {
            "reviewerName": "Allyn L. W. Peterson",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Great Value",
            "reviewDate": "September 29, 2019",
            "reviewText": "Great Product"
        },
        {
            "reviewerName": "bradley pocock",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Happy customer",
            "reviewDate": "September 9, 2019",
            "reviewText": "works great"
        },
        {
            "reviewerName": "Erin",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Great for course coffee!",
            "reviewDate": "April 8, 2018",
            "reviewText": "No problems after about two months. It's true that the coffee is more course than fine, but I like that.\nLove that it comes with a little brush to get all the coffee out after grinding."
        },
        {
            "reviewerName": "John Blackburn",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Great product",
            "reviewDate": "April 1, 2019",
            "reviewText": "Great product"
        },
        {
            "reviewerName": "Amazon Customer",
            "rating": "3.0 out of 5 stars",
            "reviewTitle": "Whole beans were left with finer grind.",
            "reviewDate": "June 11, 2018",
            "reviewText": "This one did not grind the beans evenly. Whole beans were left with finer grind."
        },
        {
            "reviewerName": "Logan bane",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Simple and easy to use",
            "reviewDate": "July 12, 2018",
            "reviewText": "I love how simple and efficient it really is! And the textured grip around the grinder is nice and comfortable."
        },
        {
            "reviewerName": "Mesha",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Great little grinder",
            "reviewDate": "September 20, 2018",
            "reviewText": "Great for coffee and I also use it to grind up nuts to add to smoothies or for keto pie crust!"
        },
        {
            "reviewerName": "Tarik A.",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Silent, efficient, overall a great coffee grinder",
            "reviewDate": "June 27, 2018",
            "reviewText": "Great grinder: silent and does its job very well. Easy to cleanit even comes with a tiny little cleaning brush. I really like the matte and grippy texture of it as well."
        },
        {
            "reviewerName": "Brad & Sha",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Cute and working great!",
            "reviewDate": "May 27, 2019",
            "reviewText": "Love it ! Great modern design."
        },
        {
            "reviewerName": "Robyn N.",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Grinds Great!",
            "reviewDate": "June 15, 2018",
            "reviewText": "Great little coffee grinder for the price. No problem cleaning it with the brush."
        },
        {
            "reviewerName": "wojciech Stobinski",
            "rating": "3.0 out of 5 stars",
            "reviewTitle": "ok",
            "reviewDate": "August 9, 2019",
            "reviewText": "It does get hot if you use it for more than few minutes."
        },
        {
            "reviewerName": "Khaki",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "... coffee grinder looks well made and will be a great addition to my kitchen supplies",
            "reviewDate": "September 21, 2017",
            "reviewText": "This coffee grinder looks well made and will be a great addition to my kitchen supplies. I have not yet been disappointed with any of my Vremi products."
        },
        {
            "reviewerName": "leeann higa",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "love",
            "reviewDate": "November 9, 2019",
            "reviewText": "great grinder super easy to use"
        },
        {
            "reviewerName": "Robin Harris",
            "rating": "1.0 out of 5 stars",
            "reviewTitle": "Not worth it only used once",
            "reviewDate": "September 20, 2018",
            "reviewText": "Lid stuck will not come off"
        },
        {
            "reviewerName": "Irene",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "I have purchased other products from this company and I like their products",
            "reviewDate": "September 19, 2017",
            "reviewText": "I just received my new coffee grinder and I put it to use right away. It ground perfectly. I have purchased other products from this company and I like their products."
        },
        {
            "reviewerName": "Mallorie",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Works great",
            "reviewDate": "September 22, 2017",
            "reviewText": "Works great! Compact and works well. Got it for my mom, who loves coffee, and she keeps raving about it!"
        },
        {
            "reviewerName": "Betsy Rice Davis",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Quick and Easy to Use",
            "reviewDate": "October 9, 2017",
            "reviewText": "This works so well as does every Vremi product I have ever owned. I love coffee and this is quick and easy to use."
        },
        {
            "reviewerName": "dd",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Great price",
            "reviewDate": "July 1, 2019",
            "reviewText": "I love this companys product boxes. Funny stuff."
        },
        {
            "reviewerName": "Jennifer M",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Love this product and love the compact size",
            "reviewDate": "September 20, 2017",
            "reviewText": "Does everything my previous, much more expensive grinder did. Love this product and love the compact size!"
        },
        {
            "reviewerName": "Nathan A Rouse",
            "rating": "2.0 out of 5 stars",
            "reviewTitle": "Cheap Stuff.",
            "reviewDate": "September 25, 2018",
            "reviewText": "Looking at the picture of this I was afraid it was too \"cheap\".\nWhen it arrived already broken, my thoughts were confirmed. Just spend the money & get something that will last."
        },
        {
            "reviewerName": "Savannah",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Powerful",
            "reviewDate": "June 30, 2018",
            "reviewText": "Small so save counter space and worked great for hubbys coffee and some of my spices"
        },
        {
            "reviewerName": "Andrea J.",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Five Stars",
            "reviewDate": "September 25, 2017",
            "reviewText": "I'm so happy I can grind my favorite coffee beans! This product is excellent!"
        },
        {
            "reviewerName": "Amazon Customer",
            "rating": "1.0 out of 5 stars",
            "reviewTitle": "Motor started smoking - not recommended",
            "reviewDate": "October 11, 2019",
            "reviewText": "After less than a year of use, motor started smoking. Only used product for grinding coffee beans. Huge disappointment, would not recommend."
        },
        {
            "reviewerName": "Andrea Severino",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "I love this coffee grinder!!",
            "reviewDate": "November 10, 2017",
            "reviewText": "I love this coffee grinder. We use a french press and finding course ground coffee is difficult. This absolutely solves the problem. Efficient and easy to use. Definitely 5 stars!!!"
        },
        {
            "reviewerName": "Maria Lewis",
            "rating": "2.0 out of 5 stars",
            "reviewTitle": "It stopped working",
            "reviewDate": "January 6, 2019",
            "reviewText": "The color was nice. It is easy to use. But it stopped working after two use's"
        },
        {
            "reviewerName": "Kendra",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "but the espresso setting really doesn't grind it as fine as I want",
            "reviewDate": "January 8, 2018",
            "reviewText": "works well... but the espresso setting really doesn't grind it as fine as I want."
        },
        {
            "reviewerName": "NAME_NOT_RETURNED",
            "rating": "1.0 out of 5 stars",
            "reviewTitle": "Do not recommend",
            "reviewDate": "May 5, 2018",
            "reviewText": "1. Capacity is limited. 2. Takes a long time to get a fine grind (and it requires a lot of shaking around). 3. Grains stick to the side which requires you to clean edges every time. 4. Started making weird noises after a months use.\n\nI wish I would have returned..."
        },
        {
            "reviewerName": "AnaMac",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "The cord storage is handy and I love having the bright red color to match my red ...",
            "reviewDate": "September 17, 2017",
            "reviewText": "Got this for my husband, who loves to have fresh ground coffee beans. This works really well! The cord storage is handy and I love having the bright red color to match my red and teal kitchen! Definitely recommend!"
        },
        {
            "reviewerName": "GREAT DANE MOM",
            "rating": "4.0 out of 5 stars",
            "reviewTitle": "Worth it!",
            "reviewDate": "August 16, 2018",
            "reviewText": "Gave as a gift. Great product. Worth buying. Good value."
        },
        {
            "reviewerName": "Barbi",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Grinder",
            "reviewDate": "January 13, 2019",
            "reviewText": "Works great"
        },
        {
            "reviewerName": "Pat",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Great small grinder!",
            "reviewDate": "November 13, 2018",
            "reviewText": "Sharp blades, easy to use."
        },
        {
            "reviewerName": "Randy Nevins",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "I am happy with it.",
            "reviewDate": "October 9, 2017",
            "reviewText": "Used it once so far. Ground hemp seed into a sort of paste. It did it well and pretty quick too."
        },
        {
            "reviewerName": "Amazon Customer",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Beautiful design. Does it's job.",
            "reviewDate": "April 16, 2018",
            "reviewText": "Love it. I use it mostly for grinding spices.it does it's job perfectly. not noisy at all and looks nice!"
        },
        {
            "reviewerName": "Raven",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "2/2 Would purchase again",
            "reviewDate": "January 16, 2018",
            "reviewText": "Boyfriend: It grinds. Check\nMe: The packaging was insinuating and playful, but not too much. The product is a good quality and produces a generally even grind. Its big enough to make grounds for one pot of coffee. I am glad I purchased it. It will serve well. Check"
        },
        {
            "reviewerName": "N. Yang",
            "rating": "3.0 out of 5 stars",
            "reviewTitle": "Three Stars",
            "reviewDate": "August 15, 2018",
            "reviewText": "Nice style but the container is not removable."
        },
        {
            "reviewerName": "Mauricio Ruiz A",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Excellent product",
            "reviewDate": "March 28, 2019",
            "reviewText": "Excellent product"
        },
        {
            "reviewerName": "EdgeyPoptart",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Five Stars",
            "reviewDate": "July 9, 2018",
            "reviewText": "Great grinder! Works quickly with minimal noise."
        },
        {
            "reviewerName": "Amazon Customer",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Five Stars",
            "reviewDate": "March 10, 2018",
            "reviewText": "all was good"
        },
        {
            "reviewerName": "P Long",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Five Stars",
            "reviewDate": "June 26, 2018",
            "reviewText": "Nice simple grinder, looks good in the kitchen"
        },
        {
            "reviewerName": "Amazon Customer",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Five Stars",
            "reviewDate": "April 2, 2018",
            "reviewText": "Just what I needed, don't use it often but it's there when I need it!!"
        },
        {
            "reviewerName": "y",
            "rating": "2.0 out of 5 stars",
            "reviewTitle": "Coffee grinder will do a much better job for $13",
            "reviewDate": "December 5, 2017",
            "reviewText": "Cannot grind finely enough for espresso. A cheapo Mr. Coffee grinder will do a much better job for $13."
        },
        {
            "reviewerName": "Ruben Alanis",
            "rating": "4.0 out of 5 stars",
            "reviewTitle": "Very nice!",
            "reviewDate": "March 29, 2019",
            "reviewText": "It gets the job done. Im happy with it! Nice design too."
        },
        {
            "reviewerName": "Desiree Duran",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "I love this coffee grinder",
            "reviewDate": "October 5, 2017",
            "reviewText": "I love this coffee grinder. I purchase whole beans and grind them to my liking depending on if i'm brewing espresso or a regular cup of coffee. Very quite and very effective."
        },
        {
            "reviewerName": "Leilani Brunt",
            "rating": "4.0 out of 5 stars",
            "reviewTitle": "Four Stars",
            "reviewDate": "June 4, 2018",
            "reviewText": "Easy to use, easy to clean and grinds very well."
        },
        {
            "reviewerName": "paula haby",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "My Red Coffee Grinder",
            "reviewDate": "September 20, 2018",
            "reviewText": "Great ! Really like it Fast"
        },
        {
            "reviewerName": "lulu",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Great brand, always solid products",
            "reviewDate": "August 3, 2018",
            "reviewText": "Great brand, always solid products"
        },
        {
            "reviewerName": "Kindle Customer",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Five Stars",
            "reviewDate": "March 16, 2018",
            "reviewText": "Perfect for my needs. And, blissfully quiet."
        },
        {
            "reviewerName": "Mar",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Great grinder",
            "reviewDate": "October 21, 2017",
            "reviewText": "Now I can buy whole beans and has freshly ground coffee in an instant"
        },
        {
            "reviewerName": "Tammy P",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "takes a little while to get a fine grind.",
            "reviewDate": "October 31, 2017",
            "reviewText": "Works well, takes a little while to get a fine grind."
        },
        {
            "reviewerName": "Konrad Hunter",
            "rating": "4.0 out of 5 stars",
            "reviewTitle": "ok grinder for the price.",
            "reviewDate": "December 19, 2017",
            "reviewText": "It is overall ok. I find I have to shake it around in between pulses to grind everything. produces a course to medium grind suitable for french presses or drip machines."
        },
        {
            "reviewerName": "Roxalou",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Easy!",
            "reviewDate": "July 1, 2018",
            "reviewText": "Easy to clean and grinds really well!"
        },
        {
            "reviewerName": "Mark",
            "rating": "4.0 out of 5 stars",
            "reviewTitle": "Four Stars",
            "reviewDate": "December 18, 2017",
            "reviewText": "This unit is good but it can be better by adding light indicator."
        },
        {
            "reviewerName": "Bill Pettinelli",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Five Stars",
            "reviewDate": "April 26, 2018",
            "reviewText": "Does the job and is nice and petite. Love the red finish."
        },
        {
            "reviewerName": "Michelle N.",
            "rating": "2.0 out of 5 stars",
            "reviewTitle": "It works well just doesnt ait on the counter well",
            "reviewDate": "July 14, 2019",
            "reviewText": "It isnt sturdy falls over easily."
        },
        {
            "reviewerName": "Dany Stasolla",
            "rating": "3.0 out of 5 stars",
            "reviewTitle": "Good function, mediocre design",
            "reviewDate": "May 30, 2018",
            "reviewText": "Small capsule for how large the unit is. Consistent grind, but slow. Also isn't ergonomic for pouring into your coffee machine due to how flat the edge is."
        },
        {
            "reviewerName": "Jen1975",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Nice grinder",
            "reviewDate": "September 5, 2018",
            "reviewText": "Works well, great value"
        },
        {
            "reviewerName": "Ben",
            "rating": "4.0 out of 5 stars",
            "reviewTitle": "Four Stars",
            "reviewDate": "July 10, 2018",
            "reviewText": "Worked great."
        },
        {
            "reviewerName": "Nita jade Steel",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Five Stars",
            "reviewDate": "February 14, 2018",
            "reviewText": "Loved this grinder.. easy to used and clean"
        },
        {
            "reviewerName": "Shirley McDaniel",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Nice grinder",
            "reviewDate": "May 2, 2018",
            "reviewText": "I love it. Easy and quick. Love the red color."
        },
        {
            "reviewerName": "Coffee",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Nice to use for a first timer",
            "reviewDate": "December 18, 2018",
            "reviewText": "Never had a grinder before, this is great for fresh grind. ????"
        },
        {
            "reviewerName": "joe",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Five Stars",
            "reviewDate": "November 30, 2017",
            "reviewText": "quite, grinds well"
        },
        {
            "reviewerName": "Valerie",
            "rating": "4.0 out of 5 stars",
            "reviewTitle": "Affordable",
            "reviewDate": "October 13, 2019",
            "reviewText": "It did what I needed it to do.. grind apricots seeds."
        },
        {
            "reviewerName": "Amazon Customer",
            "rating": "2.0 out of 5 stars",
            "reviewTitle": "Poor Design and Functionality",
            "reviewDate": "November 3, 2017",
            "reviewText": "I'm surprised this product received such high reviews - perhaps my grinder is defective...\n\nFirst, the top does not fit snugly on the base, so it slides off very easily. Second, the cord is cumbersome and could have easily been built in body of the grinder. Third, it's much larger than a typical grinder and is clunky/awkward to handle, Finally, the blades don't grind well. It takes me about 30-40 second to grind coffee for a drip machine when the instructions say it should take 15-20 seconds. My old, basic grinder does a better job in 25 seconds.\n\nUnfortunately, the product doesn't feel well designed and ends up making the bean grinding process much more frustrating."
        },
        {
            "reviewerName": "RRogers",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Good, Compact",
            "reviewDate": "October 28, 2019",
            "reviewText": "Works like a charm for me!"
        },
        {
            "reviewerName": "Bohemka",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Five Stars",
            "reviewDate": "November 16, 2017",
            "reviewText": "Excellent. Not much to it. Great product."
        },
        {
            "reviewerName": "Amazon Customer",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Five Stars",
            "reviewDate": "November 5, 2017",
            "reviewText": "Great"
        },
        {
            "reviewerName": "C.A.M.",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Five Stars",
            "reviewDate": "January 17, 2018",
            "reviewText": "GAVE AS A CHRISTMAS GIFT"
        },
        {
            "reviewerName": "Billy S.",
            "rating": "1.0 out of 5 stars",
            "reviewTitle": "Complete garbage",
            "reviewDate": "December 11, 2018",
            "reviewText": "Cheaply made, broke the first use"
        },
        {
            "reviewerName": "Amazon Customer",
            "rating": "1.0 out of 5 stars",
            "reviewTitle": "Does not work well- broke less than 1 year after purchased.",
            "reviewDate": "August 29, 2019",
            "reviewText": "Terrible quality. The plastic blades broke off within six months, and the entire thing stopped working quickly thereafter."
        },
        {
            "reviewerName": "Christi C.",
            "rating": "1.0 out of 5 stars",
            "reviewTitle": "Didn't last more than 2 weeks",
            "reviewDate": "May 2, 2019",
            "reviewText": "I was hoping to use this grinder to ground up Black Cumin Seeds but it left most seeds whole."
        },
        {
            "reviewerName": "Amazon Customer",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Five Stars",
            "reviewDate": "October 30, 2017",
            "reviewText": "Works Great! And looks nice as well."
        },
        {
            "reviewerName": "mike pope",
            "rating": "1.0 out of 5 stars",
            "reviewTitle": "NO NO NO DONT BUY!!!!",
            "reviewDate": "July 1, 2019",
            "reviewText": "Horrible only $10 but definitely not worth it."
        },
        {
            "reviewerName": "pam",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Great deal",
            "reviewDate": "November 5, 2018",
            "reviewText": "Great deal"
        },
        {
            "reviewerName": "Traveling Turner Finds",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Five Stars",
            "reviewDate": "October 17, 2017",
            "reviewText": "So easy to use!"
        },
        {
            "reviewerName": "Amazon Customer",
            "rating": "2.0 out of 5 stars",
            "reviewTitle": "Inconsistent grind",
            "reviewDate": "August 30, 2018",
            "reviewText": "I never get the same consistency in coffee grounds. The coffee at the top is usually more finely ground than that at the bottom."
        },
        {
            "reviewerName": "Igor",
            "rating": "4.0 out of 5 stars",
            "reviewTitle": "Cheap looks well and it does its job",
            "reviewDate": "June 26, 2018",
            "reviewText": "Cheap looks well and it does its job"
        },
        {
            "reviewerName": "Virginia May",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Love it!",
            "reviewDate": "November 16, 2017",
            "reviewText": "Does a great job. Im very pleased with this bargain."
        },
        {
            "reviewerName": "J. A. Myers",
            "rating": "2.0 out of 5 stars",
            "reviewTitle": "Good product, awful packaging",
            "reviewDate": "October 15, 2017",
            "reviewText": "Does this coffee grinder grind? Absolutely. Are the beans the right size? Absolutely. Then why the 2 stars? Had I seen this box in a store I would not have purchased it, and I will not purchase another product from this company. The box doesn't say \"Vremi Blade Coffee Grinder Electric - For Coffee Beans,\" nor does it say \"Instant Travel Grinder with Brush Cleaner.\" Nope. It says \"Bump 'N Grind Coffee Grinder\" on the front, \"I can grind with ease, so let's get it on!\" on one side, \"Shake your beans... prepare to get your perk on, it's time to bump 'n grind\" on the other side and \"Perk 'N Twerk\" on the inner flap.\n\nI get it - sex sells. But I don't have to buy sex when all I want is a good coffee grinder."
        },
        {
            "reviewerName": "Mollie",
            "rating": "1.0 out of 5 stars",
            "reviewTitle": "Didn't work. Very cheap",
            "reviewDate": "May 3, 2019",
            "reviewText": "It just didn't work. It's really cheaply made. No uniformity in the grind."
        },
        {
            "reviewerName": "Dawn",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Do not over fill.",
            "reviewDate": "June 11, 2019",
            "reviewText": "Works great!"
        },
        {
            "reviewerName": "Mo Zhang",
            "rating": "1.0 out of 5 stars",
            "reviewTitle": "So disappointed. Only used it 3 times",
            "reviewDate": "June 16, 2018",
            "reviewText": "So disappointed. Only used it 3 times, and it doesn't work anymore. Save your money, stay away from this product!"
        },
        {
            "reviewerName": "Amazon Customer",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Nice appliance",
            "reviewDate": "August 13, 2019",
            "reviewText": "Does the job\nDurable\nGood quality for the price."
        },
        {
            "reviewerName": "Charles Johnson",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Five Stars",
            "reviewDate": "February 8, 2018",
            "reviewText": "Very nice"
        },
        {
            "reviewerName": "Sierra",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Does the job!",
            "reviewDate": "June 28, 2018",
            "reviewText": "Working great!"
        },
        {
            "reviewerName": "Carol L",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Five Stars",
            "reviewDate": "October 25, 2017",
            "reviewText": "Really like this grinder. It's easy, quick and works great."
        },
        {
            "reviewerName": "Marshall",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Five Stars",
            "reviewDate": "April 27, 2018",
            "reviewText": "Top of the line!"
        },
        {
            "reviewerName": "Deanna Fagan",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Five Stars",
            "reviewDate": "November 6, 2017",
            "reviewText": "We like it. It works great and makes the grounds just the way we like it."
        },
        {
            "reviewerName": "master",
            "rating": "1.0 out of 5 stars",
            "reviewTitle": "Dont buy",
            "reviewDate": "January 17, 2019",
            "reviewText": "Doesnt grind evenly. Takes a long time to grind. Wouldnt buy again"
        },
        {
            "reviewerName": "gisele de oliveira esdras",
            "rating": "2.0 out of 5 stars",
            "reviewTitle": "Product broke in 5 months of use",
            "reviewDate": "April 23, 2019",
            "reviewText": "The product blades are loose and the product does not work anymore with only 5 months of use."
        },
        {
            "reviewerName": "bethzaida badillo",
            "rating": "3.0 out of 5 stars",
            "reviewTitle": "Economic",
            "reviewDate": "September 6, 2018",
            "reviewText": "Hice, Easy to clean and powerful."
        },
        {
            "reviewerName": "Amazon Customer",
            "rating": "3.0 out of 5 stars",
            "reviewTitle": "Not good for espresso",
            "reviewDate": "January 7, 2018",
            "reviewText": "Fine for drip coffee but not suitable for espresso, despite it being advertised as able to create a fine grind."
        },
        {
            "reviewerName": "Jerry G",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Good $ Value",
            "reviewDate": "October 10, 2019",
            "reviewText": "Had product for only 3 weeks. So far so good."
        },
        {
            "reviewerName": "Teresa",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Coffee Grinder",
            "reviewDate": "October 22, 2019",
            "reviewText": "We love this~! It's nice to have fresh ground coffee."
        },
        {
            "reviewerName": "WildinOut29",
            "rating": "1.0 out of 5 stars",
            "reviewTitle": "Horrible after the 3rd use",
            "reviewDate": "April 19, 2018",
            "reviewText": "After the 3rd use, the blades are now dull from grinding coffee and the motor rattles like a ping pong ball in a can. It also gets extremely hot and unbearable to hold."
        },
        {
            "reviewerName": "Amazon Customer",
            "rating": "4.0 out of 5 stars",
            "reviewTitle": "Simple, basic grinder works well for the price.",
            "reviewDate": "April 23, 2018",
            "reviewText": "Sometimes difficult to get the top on before grinding. Grinds well, though. Large switch cover gives you full control over grind time."
        },
        {
            "reviewerName": "Lisa Franco",
            "rating": "2.0 out of 5 stars",
            "reviewTitle": "Slow / Weak Motor",
            "reviewDate": "February 28, 2018",
            "reviewText": "Good capacity; works as intended; Con: seems to have a slow / weak motor (not as quick as most other grinders you may be used to; takes longer for finer grinds)"
        },
        {
            "reviewerName": "M R",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Doesn't tell you how to start grinding, push the top down to start",
            "reviewDate": "August 26, 2019",
            "reviewText": "Does the job, is small, simple and easy to use. Cleaning is a hassle"
        },
        {
            "reviewerName": "Amazon Customer",
            "rating": "4.0 out of 5 stars",
            "reviewTitle": "Works pretty good",
            "reviewDate": "December 7, 2018",
            "reviewText": "Works pretty good but hard to get the grounds very fine"
        },
        {
            "reviewerName": "A. C.",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Excellent grinder",
            "reviewDate": "September 27, 2017",
            "reviewText": "Excellent grinder for the price. Works perfectly and is easy to use."
        },
        {
            "reviewerName": "Bradley A. Gee",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Five Stars",
            "reviewDate": "April 15, 2018",
            "reviewText": "Great item, does as described."
        },
        {
            "reviewerName": "Edward Basurto",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Its cool",
            "reviewDate": "December 9, 2018",
            "reviewText": "Does what I need it to do"
        },
        {
            "reviewerName": "pat ross",
            "rating": "3.0 out of 5 stars",
            "reviewTitle": "Good coffee maker for the money",
            "reviewDate": "August 21, 2019",
            "reviewText": "It was fine. Didnt want to pay a lot."
        },
        {
            "reviewerName": "nakiyah",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Great product! Cute name",
            "reviewDate": "October 1, 2019",
            "reviewText": "Love it!"
        },
        {
            "reviewerName": "Denise ippolito",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Five Stars",
            "reviewDate": "May 21, 2018",
            "reviewText": "Easy to use. Purchased it to grind dry dog food."
        },
        {
            "reviewerName": "Pomranky",
            "rating": "3.0 out of 5 stars",
            "reviewTitle": "Doesn't pour out well.",
            "reviewDate": "December 6, 2017",
            "reviewText": "Grinds coffee but pouring the grinds out is not easy unless your pouring it into a much larger container."
        },
        {
            "reviewerName": "Andrea Velez",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Love it",
            "reviewDate": "September 28, 2018",
            "reviewText": "Lovebit"
        },
        {
            "reviewerName": "Stacy D.",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Nice looking",
            "reviewDate": "September 19, 2017",
            "reviewText": "Heavy duty! Exactly what we were looking for"
        },
        {
            "reviewerName": "Travis Huff",
            "rating": "2.0 out of 5 stars",
            "reviewTitle": "Good Coffee grinder but...",
            "reviewDate": "November 15, 2017",
            "reviewText": "It's a good coffee grinder but it was cracked on the top when I got it, it's holding up but amazon could've done a better job handling the product."
        },
        {
            "reviewerName": "Amazon Customer",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Works grear",
            "reviewDate": "August 25, 2019",
            "reviewText": "Works great for price"
        },
        {
            "reviewerName": "Kim B.",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Perfect Electric Grinder!",
            "reviewDate": "October 7, 2017",
            "reviewText": "Love this electric grinder as it's easy to use and clean, too! I'll use it mostly for French Press coffee since I'm a coffee lover, but it's good to know it can also be used for grinding other things such as nuts, herbs, grains, etc. I also appreciate that \"its double stainless steel blades allow to you to decide how coarse or fine you want your coffee to be - 8 seconds for french press coffee, 10 seconds for mocha, 20 seconds for finely powdered espresso\", as it takes the guessing out of how long to grind the coffee beans for. It also has a decent length cord which so many small appliances don't come with now days. The red color is a lot of fun and will brighten up any kitchen!"
        },
        {
            "reviewerName": "Amazon Customer",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "It has many uses",
            "reviewDate": "November 9, 2019",
            "reviewText": "Grinding was easy"
        },
        {
            "reviewerName": "Amazon Customer",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Five Stars",
            "reviewDate": "November 26, 2017",
            "reviewText": "Very satisfied with the coffee grinder."
        },
        {
            "reviewerName": "Steven M.",
            "rating": "1.0 out of 5 stars",
            "reviewTitle": "Not worth buying",
            "reviewDate": "September 13, 2019",
            "reviewText": "Does a lousy job"
        },
        {
            "reviewerName": "lauren.m",
            "rating": "1.0 out of 5 stars",
            "reviewTitle": "Doesnt grind well.",
            "reviewDate": "September 28, 2018",
            "reviewText": "Very disappointed."
        },
        {
            "reviewerName": "Derek Barclay",
            "rating": "3.0 out of 5 stars",
            "reviewTitle": "Different color",
            "reviewDate": "July 4, 2018",
            "reviewText": "Works fine. Ordered black came in red."
        },
        {
            "reviewerName": "Mikaela Barnett",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Great!! Easy to use",
            "reviewDate": "November 9, 2017",
            "reviewText": "Great!! Easy to use, easy to clean, with fairly quiet grinding."
        },
        {
            "reviewerName": "Adam Jasinski",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Got",
            "reviewDate": "November 9, 2018",
            "reviewText": "Super"
        },
        {
            "reviewerName": "Nancy Baldwin",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "It works fine",
            "reviewDate": "November 2, 2019",
            "reviewText": "Easy to use"
        },
        {
            "reviewerName": "Katherine Stujenske",
            "rating": "4.0 out of 5 stars",
            "reviewTitle": "Four Stars",
            "reviewDate": "April 23, 2018",
            "reviewText": "Gives a very fine grind, though it can be difficult to clean."
        },
        {
            "reviewerName": "scotcanter",
            "rating": "1.0 out of 5 stars",
            "reviewTitle": "easy use and speed",
            "reviewDate": "March 16, 2019",
            "reviewText": "easy use"
        },
        {
            "reviewerName": "Rick Shaffer",
            "rating": "1.0 out of 5 stars",
            "reviewTitle": "What a waste of money",
            "reviewDate": "May 25, 2018",
            "reviewText": "3rd day in use and it breaks. What a waste of money."
        },
        {
            "reviewerName": "Glenna Pinter",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Great",
            "reviewDate": "November 4, 2019",
            "reviewText": "Coffee"
        },
        {
            "reviewerName": "A. Valdez",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Five Stars",
            "reviewDate": "March 22, 2018",
            "reviewText": "Works as advertised have had no problems so far"
        },
        {
            "reviewerName": "Kitty T",
            "rating": "3.0 out of 5 stars",
            "reviewTitle": "It's ok",
            "reviewDate": "January 16, 2018",
            "reviewText": "It's ok if you are making coffee in french press, not fine enough to do espresso.\n\nIt's annoying to clean after every use, I do a thorough wipe/clean once every 5 uses, but after every use, there are always a bunch of the coffee around the rim and on the lid that's annoying to brush off."
        },
        {
            "reviewerName": "david thigpen",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Five Stars",
            "reviewDate": "November 24, 2017",
            "reviewText": "I enjoy using this grinder and got a chuckle out if its packaging."
        },
        {
            "reviewerName": "Amazon Customer",
            "rating": "1.0 out of 5 stars",
            "reviewTitle": "One Star",
            "reviewDate": "May 4, 2018",
            "reviewText": "Very slow"
        },
        {
            "reviewerName": "Henrique Vicente",
            "rating": "1.0 out of 5 stars",
            "reviewTitle": "Product has stopped working in 4 months",
            "reviewDate": "April 19, 2018",
            "reviewText": "Good but fragile"
        },
        {
            "reviewerName": "Anna",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Five Stars",
            "reviewDate": "November 2, 2017",
            "reviewText": "Very aesthetic product and the knives are very sharp."
        },
        {
            "reviewerName": "Myron",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Five Stars",
            "reviewDate": "November 7, 2017",
            "reviewText": "excellant product"
        },
        {
            "reviewerName": "Anonymous",
            "rating": "1.0 out of 5 stars",
            "reviewTitle": "Product would not start.",
            "reviewDate": "September 24, 2017",
            "reviewText": "Package arrived this morning. I opened it, followed the instructions in the crumpled up manual, and the stupid thing won't turn on. I push down on the button and it just sits there. This is honestly the first time in my entire 10 years of experience with shopping on Amazon that I have received a product that does not work. Truly, this product is low quality. Don't make my mistake, just buy a nice coffee grinder."
        },
        {
            "reviewerName": "S. Knorr",
            "rating": "1.0 out of 5 stars",
            "reviewTitle": "The red color is not a typical kitchen red, ...",
            "reviewDate": "March 6, 2018",
            "reviewText": "The red color is not a typical kitchen red, this is a fluorescent red. I returned it and bought the same grinder in black. P"
        },
        {
            "reviewerName": "Patricia Cargill",
            "rating": "4.0 out of 5 stars",
            "reviewTitle": "Using for spices",
            "reviewDate": "October 2, 2017",
            "reviewText": "Using this for spices so I can experiment with new recipes!"
        },
        {
            "reviewerName": "Matthew Stewart",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Excellent grinder!!",
            "reviewDate": "February 26, 2018",
            "reviewText": "Works amazing isnt too loud, has awesome packagaing!! 10 out of 10 would buy again!"
        },
        {
            "reviewerName": "WS",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Uncomplicated",
            "reviewDate": "January 29, 2019",
            "reviewText": "So Im probably not a verified purchase because this was a gift, but leaving a review regardless. I usually buy already-ground coffee but was gifted specialty coffee beans along with this grinder. Im new to coffee grinding so I dont have anything to compare to other than the time I accidentally bought beans and threw them in my big blender (would not recommend). Anyway I drink several cups of coffee a day and this grinder gets me through the day and then some. I leave the grounds in the grinder to scoop into my reusable k-cup filter throughout the day. When Im nearing the bottom I just pick it up and carefully dump remaining grounds into the filter directly. Its not hard. Not complicated."
        },
        {
            "reviewerName": "SandC Taylor",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Attractive enough to leave next to your coffeemaker; portable for travel",
            "reviewDate": "June 10, 2018",
            "reviewText": "Using the grinder is easy. Just add fresh coffee beans, replace the cover (which locks on for safety) and press the pulse-operation button. The durable, double stainless-steel blade grind the beans to the right consistency for you based on how long you let it run.\nThe blade revolves to about 1/8th of an inch from the side wall, so grind for about 5 to 10 seconds, stop and remove the cover, check the consistency and push any partly-ground beans back toward the center with the included brush, replace the cover, grind for a few more seconds, check again. After a few uses, youll know how much grinding time is right for the amount of beans you added to produce your brew. DO NOT PUT YOUR FINGERS INSIDE THE GRINDING CUP AS THE BLADE IS VERY SHARP!\nThere is a rubber grip exterior and non-slip feet along with cord storage for safety and neatness on your countertop.\nHand wash only! There is no disassembly; use the mini cleaning brush to get in and around the very sharp grinding blade.\nThe Vremi Blade Coffee Grinder produces an even grind for the smooth brewing strength you want every time. Even better, this is small enough that I tuck it into my suitcase and take it with me along with my preferred coffee beans when Im on a business or vacation trip."
        },
        {
            "reviewerName": "Nicole P",
            "rating": "4.0 out of 5 stars",
            "reviewTitle": "Nice grinder!",
            "reviewDate": "September 7, 2018",
            "reviewText": "First, what I like:\n\nIT'S QUIET. In comparison to another coffee grinder I have used, this is much quieter. It's more of a gentle \"burr\" noise than like a grinding screech like my last one (my last sounded like I was actually listening to the wailing cry of a coffee bean being ground).\n\nDURABLE: Why do I know this? Because I dropped the lid once! Nothing broke really except the button you use to press down broke off but it was easily fixable. Unfortunately I had to clean up coffee grounds I dropped to the floor, but oh well.\n\nStraight forward: No fancy buttons, nothing. I like that. I just want the beans ground, it's a pretty basic simple experience.\n\nThe downside?\n\nIt's ever so mildly awkward getting the grounds out because that little cup, if you tip in just the right way, will split out the ground coffee. So that's an art I need to master. The other down side is if coffee gets stuck I actually have to use my finger to kind unlodge the coffee grounds from around the edge. Painless bad thing though I guess."
        },
        {
            "reviewerName": "Anna A",
            "rating": "3.0 out of 5 stars",
            "reviewTitle": "Great Coffee Grinder with the Exception of Consistency",
            "reviewDate": "May 28, 2018",
            "reviewText": "This grinder is small enough it can easily sit on the counter next to the coffee maker but it will still grind enough beans for a whole pot of coffee. There really isn't anything difficult to use this product. It's efficient and does exactly what it was made for. It is significantly less noisy than any grinder I've used. The instructions say the coffee grounds will be ready in 15 seconds. I've found I needed to go about twice the amount of time to actually get the right consistency. However, I noticed the grounds weren't even. Some parts were extremely fine and others were really coarse. There were a couple full beans left as well. For the price, size and ease I would definitely recommend the Vremi Coffee Grinder. I am worried about the consistency problem but I think from now on I will just grind the beans for longer and hope that fixes the issue. If you like your coffee weak and you're worried about it being too strong, then I would suggest looking for a coffee grinder that will be more consistent.\n\nI received this product from Vremi via Review Directory in exchange for an honest review. This in no way, influenced my opinion."
        },
        {
            "reviewerName": "Superbizmom",
            "rating": "2.0 out of 5 stars",
            "reviewTitle": "Do not recommend",
            "reviewDate": "November 21, 2018",
            "reviewText": "This was a disappointment. There is no way to clean the chamber without wetting the whole grinder. The only part that comes off is the clean lid. This will be good for grinding herbs but for coffee, no way."
        },
        {
            "reviewerName": "Monica Najera",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Good for 1 maybe 2 cups",
            "reviewDate": "June 26, 2018",
            "reviewText": "It is small, compact, easy to store, easy to use & it's for someone who does not drink as much coffee since you can only fit a certain amount of beans. You cannot hold a lot so it can grinded for 1 maybe 2 cups of coffee."
        },
        {
            "reviewerName": "Amazon Customer",
            "rating": "1.0 out of 5 stars",
            "reviewTitle": "Does not work",
            "reviewDate": "March 22, 2019",
            "reviewText": "This does not grind the coffee beyond a very course grind, no matter how long you grind it. I've had other coffee grinders, so I was surprised to use this for the same amount of time as my older Mr. Coffee grinder and find the coffee beans were still in big chunks. I am returning it. Also, I thought the advertising on the box was tasteless--like the coffee the grinder makes!"
        },
        {
            "reviewerName": "YBello",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Super Easy and Sooo Good-looking!",
            "reviewDate": "February 15, 2018",
            "reviewText": "Valentines present for my husband. Red color is bright and cheery. Love the texture and bumps on the red part. Very easy - almost too easy - to use and it gave us a perfect grind.\nHow did we live without this?! Totally worth it. DO IT!"
        },
        {
            "reviewerName": "Jennifer K",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Works Great",
            "reviewDate": "March 19, 2019",
            "reviewText": "Fast Shipping !! Works Amazing!!"
        },
        {
            "reviewerName": "Nina Wills",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Great size.",
            "reviewDate": "May 17, 2018",
            "reviewText": "I bought this to grind my favorite coffee beans and i'm completely impressed it works so well and fast."
        },
        {
            "reviewerName": "Archana",
            "rating": "2.0 out of 5 stars",
            "reviewTitle": "Poor durability",
            "reviewDate": "January 4, 2019",
            "reviewText": "It was working ok for a month. But later it stopped working. I wont recommend this grinder.!!!"
        },
        {
            "reviewerName": "Heba",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Amazing",
            "reviewDate": "October 20, 2019",
            "reviewText": "So good"
        },
        {
            "reviewerName": "Tiffany Adair",
            "rating": "4.0 out of 5 stars",
            "reviewTitle": "Grinds so easily! Perfect",
            "reviewDate": "July 1, 2018",
            "reviewText": "Great grinder!"
        },
        {
            "reviewerName": "Santina Icestorm",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Great for powdering dehydrated food stuff too!",
            "reviewDate": "November 17, 2017",
            "reviewText": "Okay I admit it Im not a coffee person, so why a coffee grinder? Well. I am a Dehydrator and I needed something to turn my purees and left over junk from canning into powders. So I got this cute little red Grinder. The red outside in a nice grippy, slightly padded cover. The lid is a nice see through plastic with a removable activation button, I was able to pop it out and clean underneath it. It also comes with a little brush but Im not sure Im going to use it. From my FB group the recommendations are bread or rice (rice last as it can dull the blades). The video I am powdering Junk from a batch of tomato soup, Tomato peels and seeds. When running this is surprisingly quiet. It turned the junk into a very aromatic powder in no time."
        },
        {
            "reviewerName": "S",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "-Chamber is pretty large. You can fit a good amount of ...",
            "reviewDate": "November 2, 2017",
            "reviewText": "Grinds beans really well for a $15 coffee grinder. I've used friends' machines in the past and they weren't as effective as this device.\n\nPROS:\n-Chamber is pretty large. You can fit a good amount of beans and you can fill it up pretty high and still get a great grind.\n-Chamber is designed with no nooks or crannies to allow grounds to fall down and not get stuck. I've used grinders in the past that overlooked this obvious fact and this one has a clean, intelligent design on the chamber itself.\n-Operation is easy, device is stable and button is large and \"depressable\" with one finger; whole operation takes 30-90 seconds for complete grind, and one hand.\n\nNEUTRAL (I don't mind these things, but some might):\n-No timer or automation, so if you want espresso, it'll take a good 60 seconds to powder the coffee, and you'll have to hold the button down the whole time.\n-For a better quality grind, I'd recommend shaking the grinder from side to side and rotating it to add some mixing action in the chamber. This cuts down on grind time and reduces the big \"chips\" and chunks of bean that blade grinders can create. So if you don't mind a little martini shake action with your grinder for 10-15 seconds, then great!\n\nCONS:\n-For $15, very few come to mind, unless you're making espresso or drip that requires a super fine grind."
        },
        {
            "reviewerName": "LD",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "I put coffee grounds into it and get whole beans ...",
            "reviewDate": "November 8, 2017",
            "reviewText": "I put coffee grounds into it and get whole beans. Wait, the opposite of that.\n\nI have to grind it longer than I thought I would for my French Press. I had read 8 seconds for a FP but in reality I need to grind it for 10-12 seconds. That is an extra 2-4 seconds of my life every day that I'll never get back, but, we will let it slide this time.\n\nIf you want to grind coffee beans into ground coffee beans, this is the product for you."
        },
        {
            "reviewerName": "Jane C. Nowlin",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Dumb place to ask questions but",
            "reviewDate": "September 27, 2017",
            "reviewText": "I have a question. Why does the Amazon page advertising say it's ok to grind beans and spices and other stuff when the literature that came with the grinder says to use for coffee only? I've only used it once and I thought it did fine. Is the use to grind other stuff going to make the beans taste contaminated so to speak? Has anyone who owns one used it for nuts and seeds and spices and then coffee found that it tastes \"off\"?"
        },
        {
            "reviewerName": "A.McClintock",
            "rating": "4.0 out of 5 stars",
            "reviewTitle": "Great capacity!",
            "reviewDate": "October 11, 2017",
            "reviewText": "I love that this grinder is on the larger size so that I have option with how much I grind at one time. That is really the selling feature for me with this item. It would be nice to have settings or guidelines so I can more precisely grind the coffee for what I want (french press vs. cold brew vs. espresso vs. drip, etc.) but I think the capacity makes up for me having to just get better at figuring out how long to grind for."
        },
        {
            "reviewerName": "Wsadap",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "No worries if eyes aren't fully open yet",
            "reviewDate": "July 15, 2018",
            "reviewText": "I love fresh ground coffee. It can be a hassle to have to remember to grind your beans in the store' which then are no longer fresh ground by the time you get to the bottom of the bag. I have had a hand grinder for quite some time which was very serviceable and got the job done,but grinds very coursely and required running through several cycles of grinding. As long as i remembered to grind my beans the night before, all was great. If I have to try to put all the coodination together in the morning tho? This little friend has simplified my life. I can put my beans in and push the button. A few seconds later I am ready to brew. It is much easier to decide what grind I want also as I have more control, a couple seconds more or less adjusts the grind. Now I can get my coffee first thing in the morning without worry of if I can get both eyes open AND make my body function. Coffee has health benefits that have been determined to extend your life, these are greater if the coffee is freshly ground! Yay! longer life means more coffee drank."
        },
        {
            "reviewerName": "Krithy14",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Bam! Seriously awesome!",
            "reviewDate": "September 26, 2017",
            "reviewText": "I admit that I am not a coffee drinker, but I have a coworker who lives off of it and she really likes to try all different kinds. This littleVremi Blade Coffee Grinder Electric - For Coffee Bean or Spices with Stainless Steel Blade - Makes 12 to 14 Cups of Pour Over Espresso or Drip Coffee - Instant Travel Grinder with Brush Cleaner - Redis pretty freaking awesome. She showed me how it works, and now I want one, and I don't even drink coffee. This one simple tool is electric, easy to use and makes up to 12-14 cups of coffee. BAM! That is seriously awesome!"
        },
        {
            "reviewerName": "S. Leone",
            "rating": "1.0 out of 5 stars",
            "reviewTitle": "DO NOT BUY! The plastic configuration of this grinder ...",
            "reviewDate": "February 10, 2018",
            "reviewText": "DO NOT BUY! The plastic configuration of this grinder promotes inefficient coffee grinding. My Vremi is now in the trash after it would no longer stop grinding (unless I pulled the plug), and I have only had it for three weeks now, using it every other day. The coffee grinds get into the tiny area, a 1/16\" plastic dot, that the lid and plastic button on the top presses down into when you power on the grind, and even with multiple cleanings, I was not able to prevent the apparatus from getting stuck. In short, I could not stop it from grinding. This unit is cheaply made, does not hold more than six TBs of coffee grind, and the plastic top is now broken from my attempts to press down on it repeatedly to stop the grinding. DO NOT BUY!"
        },
        {
            "reviewerName": "Mom2Seven",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Quiet, easy to use, great for herbs, spices, and seeds!",
            "reviewDate": "October 1, 2017",
            "reviewText": "This is a great little electric grinder. I was pleasantly surprised at how quiet it is! I have used this to grind herbs and seeds. Just a few quick pulses and the rosemary from my herb garden is perfect for cooking. You can definitely pulse more if you like them completely ground. I have also ground chia and flax seeds for cooking as well. The included brush is great for getting everything out of the little nooks by the blade. Vremi always has some witty packaging but you may need to exercise some caution with this one. ;)"
        },
        {
            "reviewerName": "Maria Pranom Elizalde",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Perfect gift for coffee lover",
            "reviewDate": "September 27, 2017",
            "reviewText": "I have to admit that I am not a coffee drinker. There are many times that I wish I drank coffee. My mother in law, however, is a big coffee drinker. We purchased this Electric Coffee Grinder to use as a travel grinder to bring back and forth to her house to ours. She comes to our house typically for 1 week a month. This has been an amazing tool for her to have to grind her coffee grounds and get the same coffee she has at home.\nThis would be amazing to take with you anywhere you travel.\nMy mother in law raves about this grinder and it even comes with a cleaning brush!\nShe said it was one of the best gifts she has ever received!"
        },
        {
            "reviewerName": "Johanna Ruiz",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Great for daily coffee grinding",
            "reviewDate": "September 20, 2017",
            "reviewText": "This is a great grinder for daily coffee grinding. It has the capacity for about 1-2 pots of coffee depending on how strong you brew your coffee and the capacity of the maker. The blades guide the coffee corse to espresso fine. There aren't alot of buttons which makes it easy to operate. It easily cleans up and is fairly compact to store. I would recommend this for daily family use to have fresh ground coffee."
        },
        {
            "reviewerName": "Lemonade Thompson",
            "rating": "2.0 out of 5 stars",
            "reviewTitle": "Poor design leads to poor grind",
            "reviewDate": "October 2, 2019",
            "reviewText": "It's impossible to get an even grind with this grinder.\n\nEvery use of this grinder leads to quarter, half, and untouched beans mixed with inconsistent grounds.\nThe blade of the grinder is too small which makes some of the beans fly around the edges of the container untouched. Because of this, you have to do multiple runs to grind all the beans and eventually you end up with an uneven mixture of fine, semi-fine, and coarse grounds.\n\nThis is a very cheap grinder, but I would spend a little more money for something better unless you like muddy coffee"
        },
        {
            "reviewerName": "Nicholas Hunter",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Easy to use and works great!",
            "reviewDate": "September 22, 2017",
            "reviewText": "This is a great little coffee grinder. My old one just stopped working and I was looking for a new one. It works quickly, is quieter than most coffee grinders, and is easy to use. I like the rubber material on the outside it makes it easy to grip/hold and helps it stay put on the counter. The coffee grinds evenly and my coffee turned out great. For cleaning it was super easy, the directions say to use a damp cloth to clean the inside. I quickly used a little soap and rinsed quickly and it was fine. I highly recommend this coffee grinder."
        },
        {
            "reviewerName": "S. Bullard",
            "rating": "4.0 out of 5 stars",
            "reviewTitle": "I bit larger around than expected.",
            "reviewDate": "February 15, 2018",
            "reviewText": "Love the color and the texture makes it better to grip and hold. It is a bit bulky around for those with smaller hands so having the texture is important. It seems to grind beans well enough I do have to give it a shake to redistribute, but that is not such a big deal. It isn't overly noisy, my dog didn't flinch when I turned it on. So other than it's larger circumference I like it very much. I've been using another brand for about 6 months and HATED it. Noisy, messy, impossible to clean properly or pour the ground coffee into my basket for brewing. I had a Braun grinder for get this,18 years. It worked every day sometimes two or three times a day and other than a couple of blade replacements in all those years, never let me down. Until last year when it began to sound like a 747 at take off. RIP"
        },
        {
            "reviewerName": "LuvMyFamily",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Freshly ground coffee smells amazing!",
            "reviewDate": "October 27, 2017",
            "reviewText": "This is a wonderful coffee grinder. I like the textured coral/red silicone grips and chrome-like accents. You simply add your beans, put the lid on, and press down. You control how fine or coarse you desire the beans to be. The coarser grind is definitely better for cold brew. This has a small footprint and is easy to store or display if you prefer. You'll love the aroma of your freshly ground coffee! I highly recommend this coffee grinder."
        },
        {
            "reviewerName": "Yesuaini99",
            "rating": "1.0 out of 5 stars",
            "reviewTitle": "design all are very nice, but the only purpose it's designed to do--blending and it cant do a good job",
            "reviewDate": "March 2, 2018",
            "reviewText": "The color, design all are very nice, but the only purpose it's designed to do--blending, it doesn't do that well. The blended ground coffee is coarse and not to the fine ground level. No matter how long I press the button, that's about the degree of grinding it can do. I end up needing to take the entire bag into the store to grind it to finer ground. It gets hot when you try to grind to finer level, as a result it burns the coffee ground and destroys the taste."
        },
        {
            "reviewerName": "Howard Fam",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Nice coffee grinder",
            "reviewDate": "October 15, 2017",
            "reviewText": "I wanted a simple to use, inexpensive coffee bean grinder and this one has fit the bill. I like that it holds a good amount of beans and I just need to press the one button to get started. I prefer a medium grind and I've been able to achieve that with this easily. I haven't used it for anything but I could see myself using it to grind up nuts and spices for baking."
        },
        {
            "reviewerName": "Asousa",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Vremi makes great products we have several other products of theirs in ...",
            "reviewDate": "October 5, 2017",
            "reviewText": "I was never a coffee drinker and then I had my second daughter, I started with ground coffee after borrowing my mother in laws coffee grinder I decided to purchase my own. Vremi makes great products we have several other products of theirs in our household so ordering this coffee grinder was a no brainer, and just like all the other products this one is awesome."
        },
        {
            "reviewerName": "sheep",
            "rating": "1.0 out of 5 stars",
            "reviewTitle": "Motor burning",
            "reviewDate": "June 24, 2018",
            "reviewText": "I want to follow up on my review below. I contacted the company and within two hours they refunded cost of the grinder.\n\nI liked the design of the product. It grinds the coffee ok. I only use a couple of times a week. Today I started to grind the beans. I could smell something burning and suddenly smoke was coming out of the grinder bottom. I will try to return but it has been 6 months. I would not buy again."
        },
        {
            "reviewerName": "Sarah L. Coulsey",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "This is a great coffee grinder",
            "reviewDate": "November 15, 2017",
            "reviewText": "This is a great coffee grinder. Really easy to use. Just poor the beans in, plug in, and push down the silver button. Grinds coffee quickly and evenly. What I like the most is that it's really easy to clean. The blade unscrews and just wipe clean. This way you can use the grinder for other things like spices!!"
        },
        {
            "reviewerName": "Michelle and Richard Rupanovic",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "I in love with this red Vremi coffee grinder and had to ...",
            "reviewDate": "September 28, 2017",
            "reviewText": "We recently lost our coffee grinder in our move. I in love with this red Vremi coffee grinder and had to have it. I was so happy to get it. It isn't nearly as loud as my lost grinder. I like my grounds fine and this has zero issue getting my coffee beans where I like them. So happy with this purchase!"
        },
        {
            "reviewerName": "bonni",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Best little Workhorse and nice looking too!",
            "reviewDate": "September 20, 2017",
            "reviewText": "I was at Trader Joes and found coffee beans from Ecuador! Score! Best coffee ever. I didn't want to grind the bag there since I wanted it fresh everyday. I got on Amazon to find the best easy to use grinder that wasn't going to cost a bundle. I found this little gem and was thrilled to find out that I can use it for spices and nuts. This does a great job and is easy peasy to clean. I think that this will be my new best friend in the kitchen!"
        },
        {
            "reviewerName": "Meredith",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Wish I Had Bought This Years Ago!",
            "reviewDate": "September 28, 2017",
            "reviewText": "I absolutely love having coffee every morning, I REQUIRE it. Having fresh coffee is even better! I never bought a grinder because I thought it would take too long, that's not the case! I wish I would have bought this years ago! Just takes a second and it's totally worth it for fresher tasting coffee! So much more flavor!"
        },
        {
            "reviewerName": "Stephanie",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "This is the most quiet coffee grinder I've had",
            "reviewDate": "September 26, 2017",
            "reviewText": "This grinder is large and quiet, which I love. This also holds a fair amount of coffee beans, which is good, since I prefer to make my coffee rather strong. Per usual, it came in a Vremi package with hilarious sayings. My only issue is that the top is not large enough to tip the grounds into. Otherwise, I love it."
        },
        {
            "reviewerName": "Melerofamily",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Great compact grinder",
            "reviewDate": "July 18, 2018",
            "reviewText": "Pick up this coffee grinder for my husband who is a got to have my cup of coffee everyday kind of person. He wanted to start grinding his own coffee figured he would give it a try but didn't want something to over-complicated. This thing is great for that person easy to use not too big doesn't take up a lot of counter space great for those reason and more"
        },
        {
            "reviewerName": "lmc",
            "rating": "2.0 out of 5 stars",
            "reviewTitle": "Not the machine for a fine grind",
            "reviewDate": "June 22, 2018",
            "reviewText": "It works, but not what I'm looking for. I was looking to get a fine, espresso type grind and this one does not. The grounds were always uneven and I could never get the fine grind. I ended up throwing it away as I got more irritated with grinds all over my country without the payout of the ground I was looking to get."
        },
        {
            "reviewerName": "ZAC",
            "rating": "3.0 out of 5 stars",
            "reviewTitle": "Overall an ok grinder",
            "reviewDate": "October 27, 2018",
            "reviewText": "It grinds very well, the button and spring may come flying apart at the slightest drop of the lid. Can be put back together but is super annoying. The cord also kinda gets caught underneath so its harder than it should be to stand it flush. For those who think it's hard to clean...use a damp paper towel folks."
        },
        {
            "reviewerName": "Amazon Customer",
            "rating": "1.0 out of 5 stars",
            "reviewTitle": "I was really disappointed in this product",
            "reviewDate": "May 7, 2018",
            "reviewText": "I was really disappointed in this product! I had high hopes, but it does not preform well and does not grind coffee as finely as I needed. I would not recommend this grinder if you want a good quality coffee grinder. Unfortunately I didn't use it right away and now I am stuck with it, I will probably just put it in a yard sale or donate."
        },
        {
            "reviewerName": "JTL95",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Over 6 months and still grinding",
            "reviewDate": "May 14, 2018",
            "reviewText": "I've had several grinders over the years and this is one of the best. I've had it now for a little over 6 months and use it almost every day. I haven't had any trouble with it and it is easy to clean. Most grinders I've owned were dead of dying at this point so Vremi Blade Coffee Grinder you get 5 stars."
        },
        {
            "reviewerName": "tmj",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Tiny but Mighty!",
            "reviewDate": "October 24, 2017",
            "reviewText": "I am in love with this little coffee grinder! What is better than fresh ground coffee beans for your coffee every single morning? NOTHING! Plus it's cheaper than stopping at the corner coffee shop. It's the perfect match for my small coffee pot besides the fact it's quick and easy to use, easy to clean and beats the heck out of using a hand grinder."
        },
        {
            "reviewerName": "kb",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Works like a dream!",
            "reviewDate": "March 10, 2018",
            "reviewText": "This coffee grinder does a great job every time. Easy to use and looks great on my counter top. I originally purchased this just to grind beans for cold brew but once my husband smelled the aroma we are grinding beans for all our coffee indulgences. Takes 2 mimutes and the flavor of fresh ground coffee can not be duplicated!"
        },
        {
            "reviewerName": "Kristie Rider",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Grinds Beans with ease!",
            "reviewDate": "November 17, 2017",
            "reviewText": "This grinder is fantastic! Its easy to clean and works well. I'm especially happy with the rubber outer of the container. It makes it easy to hold while adjusting the lid. I grind my beans every morning and am so pleased with the functionality! Its so easy to use and my kids even enjoy grinding the beans for me."
        },
        {
            "reviewerName": "saginaw slim",
            "rating": "3.0 out of 5 stars",
            "reviewTitle": "like it was designed for a different grinder",
            "reviewDate": "August 26, 2018",
            "reviewText": "It does grind well. But the top is difficult to fit at times, like it was designed for a different grinder. Also, the cord storing thing on the bottom is poorly designed. It doesn't fit the whole cord. I gave up, and I just let the cord hang out."
        },
        {
            "reviewerName": "Sara Monacelli",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Grind away",
            "reviewDate": "October 6, 2017",
            "reviewText": "This is a very easy to use good quality grinder. Not only can it grind up coffee beans but you can also use it for seeds and spices. Comes with a Manuel and little brush to helps you clean the inside. Very satisfied. Might get a few more to give as gifts this holiday season. Usually grinders are pretty loud but this one not so much. The packaging is just so cute as usual. Vremi products have cute little sayings on the box. I just love it."
        },
        {
            "reviewerName": "N. Karpen",
            "rating": "2.0 out of 5 stars",
            "reviewTitle": "Inconsistent grind",
            "reviewDate": "December 23, 2018",
            "reviewText": "Slow and inconsistent grind. I wasnt expecting a burr style grind but you can barely put enough in for one serving at a time. By the time you get rid of all the big chunks most of it is just powder."
        },
        {
            "reviewerName": "Erika Bastings",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Amazing electric grinder!",
            "reviewDate": "September 23, 2017",
            "reviewText": "Fun, bright color as well a functional. Great for grinding up some fresh coffee! You can adjust how course or fine you grind it. I love using mine for\nmaking iced coffee as well. Also works great as a spice grinder! Cute, secure packaging."
        },
        {
            "reviewerName": "Unknown",
            "rating": "4.0 out of 5 stars",
            "reviewTitle": "Love this coffee grinder my last coffee grinder was much ...",
            "reviewDate": "May 28, 2018",
            "reviewText": "Love this coffee grinder my last coffee grinder was much noisier, love the little brush that came with it, would have given it a five star but would have like to have the ability to grind more beanbag once."
        },
        {
            "reviewerName": "Stephanie Means",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Love at 1st COFFEE BEAN!",
            "reviewDate": "September 18, 2017",
            "reviewText": "Easy to grip, non skid bright red. Pour in the beans, push the button, grinds & done. Easy as that.\nExtremely quiet coffee bean grinder!"
        },
        {
            "reviewerName": "Sev",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Not a 1 use machine.",
            "reviewDate": "July 1, 2018",
            "reviewText": "Not much of a coffee drinker but I had other plans in mind for this.\nI use it to make bread crumbs instead of buying them.\nEasily grinds up my herbs and stale bread so I don't have to buy the \"Italian bread crumbs\"."
        },
        {
            "reviewerName": "A. Stoner",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Perfect for grinding spices or coffee",
            "reviewDate": "October 22, 2017",
            "reviewText": "I needed a separate grinder for spices and this product fits the bill. I like to use fresh spices when cooking and I can make my own spice blends easily with this grinder. It is easy to use and easy to clean. It comes with its own brush. I am happy with this grinder."
        },
        {
            "reviewerName": "Christian",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Is not that bulky in the inside it works great for because I'm the only one at home who ...",
            "reviewDate": "December 24, 2017",
            "reviewText": "Is not that bulky in the inside it works great for because I'm the only one at home who drinks coffee if you are planning to use it for more than 3 people better look for a different one who could hold more at once!"
        },
        {
            "reviewerName": "Roie",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Great Product",
            "reviewDate": "November 1, 2018",
            "reviewText": "I use this product twice daily for grind whole fresh flax seeds for my Budwig therapy. Does the job and is a good size to leave out on the counter top without compromising prep space"
        },
        {
            "reviewerName": "KA Mpls",
            "rating": "4.0 out of 5 stars",
            "reviewTitle": "Good coffee grinder",
            "reviewDate": "June 2, 2018",
            "reviewText": "My old coffee grinder finally gave out. This one seems to work adequately. Need to really grind the beans a long time to get them consistent. Doesn't work as well as the old one, but the price was reasonable."
        },
        {
            "reviewerName": "Kimber L. Jungwirth",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Quiet and great quality",
            "reviewDate": "October 6, 2017",
            "reviewText": "I was so pleasantly surprised at how quiet the grinder was and how evenly it ground my coffee. The base is easy to grip and has a good solid feel to it. I would recommend to my family and friends. Definitely a good purchase."
        },
        {
            "reviewerName": "Susan",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "GREAT PRODUCT COMPLETELY SATISFIED!",
            "reviewDate": "September 7, 2019",
            "reviewText": "Love this sturdy product, very easy and fast to make many different grinds of whole bean coffee."
        },
        {
            "reviewerName": "Ken",
            "rating": "3.0 out of 5 stars",
            "reviewTitle": "You have to hold down the button for 30 to 45 seconds in order to have a chance at getting fine powder from coffee beans",
            "reviewDate": "January 11, 2018",
            "reviewText": "Gets the job done but not very powerful. You have to hold down the button for 30 to 45 seconds in order to have a chance at getting fine powder from coffee beans.\n\nI always worry that it may overheat. Aesthetically it could look more upscale."
        },
        {
            "reviewerName": "Adrianne Rose",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Great coffee grinder",
            "reviewDate": "December 1, 2017",
            "reviewText": "This is a great coffee grinder. It works very well, is very easy and comfortable to hold due to the silicon outer layer. It's easy to clean since it comes with a little brush to get the coffee grounds out. It is also very quiet as far as coffee grinders go."
        },
        {
            "reviewerName": "Ronald L Remke",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "spice grinder",
            "reviewDate": "March 3, 2019",
            "reviewText": "I like the rubber coating as it makes it easier to shake the grinder while blending. I use it for flax and spices and it cleans up easily."
        },
        {
            "reviewerName": "Allysha and Spencer",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "We have been using many of their products and again are impressed with not only awesome, friendly packaging but GREAT QUALITY PRODUCTS",
            "reviewDate": "September 22, 2017",
            "reviewText": "Once again Vremi for the win! We have been using many of their products and again are impressed with not only awesome, friendly packaging but GREAT QUALITY PRODUCTS. It also came with a complimentary brush for cleaning. Loving this!"
        },
        {
            "reviewerName": "Amy Koster",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Designed to Make My Husband Happy",
            "reviewDate": "September 30, 2017",
            "reviewText": "We had a Krups brand grinder before I ordered this and my husband finds the Vremi far superier. Its wide, easy to hold base makes it stable. Its shockingly quiet. My husband has sensitive hearing so its wonderful not to see my husband hold his ears while he's making coffee. The deep and wide grinding compartment makes it easy to get the coffee in and out of the appliance without spillage. I was so used to finding a few whole coffee beans on the floor, I didn't realize I should even look for that. A well designed appliance!"
        },
        {
            "reviewerName": "Clara",
            "rating": "3.0 out of 5 stars",
            "reviewTitle": "I love the color",
            "reviewDate": "March 28, 2018",
            "reviewText": "I love the color, the design, and the fact that it's the perfect size for my kitchen counter. It does take more than 15 seconds to grind the coffee and the grind is not as fine as I would have hoped."
        },
        {
            "reviewerName": "MWL",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "every day - I like to buy the whole beans from SB and then ...",
            "reviewDate": "October 16, 2017",
            "reviewText": "I drink coffee all day, every day - I like to buy the whole beans from SB and then take them home so it always tastes more fresh (to me). This grinder is so easy to use and small enough to keep on the counter beside my coffee pot."
        },
        {
            "reviewerName": "KR Ranch",
            "rating": "3.0 out of 5 stars",
            "reviewTitle": "Fell apart on the first use",
            "reviewDate": "November 4, 2017",
            "reviewText": "The button fell apart on the first use. The motor isn't very strong, doesn't do a fantastic job but does get the job done. I would not buy this again and I'm currently looking for a better quality want. I may have just got a bad one but I am not impressed."
        },
        {
            "reviewerName": "TYronio6",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Excellent",
            "reviewDate": "October 13, 2018",
            "reviewText": "We're use this nearly daily. Grinds very well for our coffee. I do find the width of the cup a little large. Not enough to decrease my rating of the product."
        },
        {
            "reviewerName": "PGW",
            "rating": "3.0 out of 5 stars",
            "reviewTitle": "Coarse grind only",
            "reviewDate": "November 30, 2017",
            "reviewText": "Grinder does not grind coffee well. Not fine enough. Lots of larger pieces. Disappointed. I use a French Press so perhaps the coarser grind is for some other method of making coffee."
        },
        {
            "reviewerName": "Richard Father",
            "rating": "1.0 out of 5 stars",
            "reviewTitle": "Unstable and the cord doesn't winds up in the base.",
            "reviewDate": "March 29, 2019",
            "reviewText": "Poor design workmanship. It doesn't grind well and it is unstable. Biggest complain - the cord doesn't winds up in the base."
        },
        {
            "reviewerName": "Marissa",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Started making cold brew",
            "reviewDate": "August 11, 2019",
            "reviewText": "I've been making a few batches of cold brew and this coffee grinder works really well"
        },
        {
            "reviewerName": "Chiara Mingarelli",
            "rating": "4.0 out of 5 stars",
            "reviewTitle": "This coffee bean grinder is great for modem coffee",
            "reviewDate": "October 17, 2017",
            "reviewText": "This coffee bean grinder is great for modem coffee, but terrible for espresso. The grinds will not get fine enough, even if you grind for 20s as recommended. But otherwise, it's good."
        },
        {
            "reviewerName": "Mrs R",
            "rating": "3.0 out of 5 stars",
            "reviewTitle": "Not getting its grind on",
            "reviewDate": "April 27, 2019",
            "reviewText": "It is easy to use and empties well. It leaves too many beans partially ground. At least it is red..."
        },
        {
            "reviewerName": "Michelle Henry",
            "rating": "3.0 out of 5 stars",
            "reviewTitle": "Im sure there are better grinders out there",
            "reviewDate": "May 13, 2018",
            "reviewText": "Have to grind up small amounts at a time, grind for 5 seconds, stir, grind again for 5 seconds, stir. Yes they grind in 15 seconds but if you dont break that up and stir you end up with with big chunks not ground up. Im sure there are better grinders out there."
        },
        {
            "reviewerName": "Linda Aveline",
            "rating": "3.0 out of 5 stars",
            "reviewTitle": "Effective average grinder",
            "reviewDate": "December 6, 2017",
            "reviewText": "This does bring coffee beans ok, but it does not grind them anywhere close to fine, just real course no matter how long you hold the button in or repeat. It will ok until I can get a better more expensive grinder."
        },
        {
            "reviewerName": "Terrence Kelley",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Good coffee grinder",
            "reviewDate": "October 7, 2017",
            "reviewText": "Good coffee grinder. It works well and seems like good quality. I like that you can make it more coarse or less coarse depending on the type of coffee you desire."
        },
        {
            "reviewerName": "Gayle",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Great little grinder, works great!",
            "reviewDate": "November 14, 2017",
            "reviewText": "I don't use this for coffee, but for grinding golden flax seed for recipes. I have also used it to grind erythritol granules (a low carb sugar substitute) into powdered erythritol. It works great! Well worth the money. :)"
        },
        {
            "reviewerName": "GeneT",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Awesome grinder!",
            "reviewDate": "June 3, 2018",
            "reviewText": "Much larger capacity than my usual coffee grinder. 2 bowls is more than enough to fill my cold brew pitcher. Very quiet operation as well and sleek modern design doesn't hurt."
        },
        {
            "reviewerName": "Julian",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "I have been looking for a simple and easy coffee grinder and stumbled upon a winner",
            "reviewDate": "October 17, 2017",
            "reviewText": "Beans to smithhereens! I have been looking for a simple and easy coffee grinder and stumbled upon a winner. Place your desired amount of beans in and pulse for about 10 seconds and you have a fairly decent ground bean. You can do more pulsing for desired texture but be sure not to hold the button down for too long per directions. It also came with a little brush to help remove any leftovers and clean the reservoir better. I am definitely happy with the product and would recommend to all coffee lovers!"
        },
        {
            "reviewerName": "Chelsey Wevers",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Everyone should own a coffee grinder",
            "reviewDate": "September 23, 2017",
            "reviewText": "The grinder has a smooth touch to the outside. Good size, easy to clean. The cord for the grinding is around 30\" which is nice. Doesn't take up a lot of room for storing."
        },
        {
            "reviewerName": "Ana Panait",
            "rating": "4.0 out of 5 stars",
            "reviewTitle": "Works great and the price is unbeatable",
            "reviewDate": "October 30, 2017",
            "reviewText": "Works great and the price is unbeatable. This grinder is good if you are using a coffee maker because it's grind is coarse. If you like a french press or some other method for making your coffee a grinder that grinds more finely might be a better choice."
        },
        {
            "reviewerName": "Marguerite M. Core",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Cute and Powerful.",
            "reviewDate": "November 20, 2017",
            "reviewText": "Cute and Powerful. I've had a lot of coffee grinders over the years. I love this one. I like the nubby grips and the powerful motor."
        },
        {
            "reviewerName": "KT",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Great for what it is!",
            "reviewDate": "January 24, 2019",
            "reviewText": "Used once. Not thrilled with the mess vs the results. It's great for the price and what it does. It's not me."
        },
        {
            "reviewerName": "Brandon Michael",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Durable & Easy to Use",
            "reviewDate": "March 6, 2019",
            "reviewText": "Works great every morning grinding coffee beans."
        },
        {
            "reviewerName": "Shopsfromhome",
            "rating": "3.0 out of 5 stars",
            "reviewTitle": "Works well, quality is a little lower than expected",
            "reviewDate": "August 19, 2018",
            "reviewText": "Work perfectly but after a few uses the spring button broke, still functions fine but still disappointed with it breaking so quickly"
        },
        {
            "reviewerName": "Amy E. Hammond",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Grinds that coffee like a pro barrista!",
            "reviewDate": "September 25, 2017",
            "reviewText": "This little dynamo is incredible. I've been wanting to purchase and grind whole bean coffee, but it seemed like too much of a hassle. This electric coffee grinder makes the process simple - and the coffee is so much better than the already-ground kind that comes pre-packaged! I also love that it grinds spices. I can make cinnamon that tastes extremely fresh. Also, going along with their 'cool' vibe, this Vremi product looks so stylish that I haven't taken it off my counter since it arrived. I love that it's bright red and that the nubs on the outside make it easy to handle. Definitely recommend!"
        },
        {
            "reviewerName": "Raven",
            "rating": "4.0 out of 5 stars",
            "reviewTitle": "Good product",
            "reviewDate": "November 14, 2017",
            "reviewText": "Got as a present for my brother and he loves it. Says it works well and the whole-bean coffee I got him was gone very quickly!"
        },
        {
            "reviewerName": "Amazon Customer",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "It Grinds!",
            "reviewDate": "January 29, 2019",
            "reviewText": "Making your coffee from fresh roasted beans? This is a grinder, it performs exactly as it promises!"
        },
        {
            "reviewerName": "jeanette Dubray",
            "rating": "1.0 out of 5 stars",
            "reviewTitle": "Have to hold button the entire time it is grinding",
            "reviewDate": "July 30, 2018",
            "reviewText": "Not liking this one for griding coffee beans. Never grinds grounds fine enough sleays leabes a few beans"
        },
        {
            "reviewerName": "Jewels",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Quiet Coffee Bean Grinder",
            "reviewDate": "September 20, 2017",
            "reviewText": "What a great way to grind coffee beans!! Very smooth and quiet to be exact. No more waking up family members when I need to grind my coffee beans in the morning. Perfect Gift Idea too!!"
        },
        {
            "reviewerName": "Donovan & Samantha P.",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Awesome!",
            "reviewDate": "July 26, 2018",
            "reviewText": "I love this coffee grinder. It grinds the beans extremely smooth. The size is perfect for a large pot of coffee worth of beans. Very easy to clean as well."
        },
        {
            "reviewerName": "dirtydeedsreviewsyou",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "BIG Grinder Finally!",
            "reviewDate": "May 9, 2018",
            "reviewText": "Grinds a bunch for us coffee people! Not a teeny tiny little machine for a one cupper. This is a pot or two, plus some spare in a jar grinder! Love it!"
        },
        {
            "reviewerName": "Kursti Barton",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Sleek",
            "reviewDate": "July 2, 2018",
            "reviewText": "Well, shoot! Vremi never fails to impress me. Its super sleek, looks nice and not annoyingly tiny like the others I've bought in the past."
        },
        {
            "reviewerName": "Grand24",
            "rating": "1.0 out of 5 stars",
            "reviewTitle": "Small capacity coffee grinder!",
            "reviewDate": "November 4, 2017",
            "reviewText": "Would only hold small amount to grind-returned. Did not try it. Found a burr grinder we liked better."
        },
        {
            "reviewerName": "S. Muir",
            "rating": "1.0 out of 5 stars",
            "reviewTitle": "Poor quality",
            "reviewDate": "January 9, 2019",
            "reviewText": "Not made well\nLow quality doesnt grind all the beans"
        },
        {
            "reviewerName": "rmartin",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Ordered 2 by mistake. Waiting to hear from Amazon or just get credit.",
            "reviewDate": "November 1, 2018",
            "reviewText": "Ordered two by mistake, refused this one tracker number 9361 2896 9509 0351 6583 42. Kept 9361 2896 9509 0351 0089 01."
        },
        {
            "reviewerName": "sunie purvis",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Awesome!",
            "reviewDate": "September 27, 2017",
            "reviewText": "Love this coffee grinder. I love grinding my own coffee beans because the coffee tastes so much better and more fresh. This little grinder did the job wonderfully! Highly recommend this product!"
        },
        {
            "reviewerName": "KHO",
            "rating": "4.0 out of 5 stars",
            "reviewTitle": "It's fine for drip",
            "reviewDate": "June 30, 2018",
            "reviewText": "It's fine for drip, but not matter how long you run it, it really doesn't grind it to the really find espresso powder."
        },
        {
            "reviewerName": "Dominus Mouse",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Good quality",
            "reviewDate": "September 1, 2019",
            "reviewText": "Great quality, easy to use."
        },
        {
            "reviewerName": "Lesli Rawles",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Looks great, works great!",
            "reviewDate": "November 28, 2017",
            "reviewText": "Looks stylish and works great. It's on the large side which we like because we often make more than one cup!"
        },
        {
            "reviewerName": "Sanssouci572",
            "rating": "3.0 out of 5 stars",
            "reviewTitle": "Slightly better than using a mortar",
            "reviewDate": "May 19, 2018",
            "reviewText": "I like the way this looks but the blades are not as sharp as ones I have owned in the past. It was very tedious to grind almonds in."
        },
        {
            "reviewerName": "Alice",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "nice looking and nice working",
            "reviewDate": "October 23, 2019",
            "reviewText": "Great product works great! Plus looks good.. yay all the way around"
        },
        {
            "reviewerName": "Christine B",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Works Great!",
            "reviewDate": "July 10, 2018",
            "reviewText": "I use this for my espresso beans daily, and Im very please. Great grinder!!! It grinds them to the perfect texture."
        },
        {
            "reviewerName": "lynn gray",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Five Stars",
            "reviewDate": "August 13, 2018",
            "reviewText": "so pretty works perfect and I just love it"
        },
        {
            "reviewerName": "MParis4386",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Love it!",
            "reviewDate": "September 22, 2017",
            "reviewText": "Love this grinder!! Works quickly and evenly. I've had coffee grinders in the past that leave the beans uneven, not this one. It's also super easy to clean and it looks great :)"
        },
        {
            "reviewerName": "Shortee231",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Perfect for the office",
            "reviewDate": "November 5, 2017",
            "reviewText": "I bought this for my husband to have at his office. It is perfect for his gourmet coffee beans, on the go, and not super loud or disturbing to everyone in the office."
        },
        {
            "reviewerName": "None",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "As expected",
            "reviewDate": "January 29, 2019",
            "reviewText": "This works great and looks really good on the counter."
        },
        {
            "reviewerName": "Jan M.",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Great job!",
            "reviewDate": "September 28, 2017",
            "reviewText": "This is my first coffee grinder...man, what a difference! This little guy works great! Quick and easy ??"
        },
        {
            "reviewerName": "GrandmaCAT",
            "rating": "1.0 out of 5 stars",
            "reviewTitle": "No home brewed coffee tomorrow morning!",
            "reviewDate": "October 11, 2017",
            "reviewText": "I purchased this coffee grinder based on the positive reviews and also because I didn't want to spend a lot of money. Well, you get what you pay for. It came on time, neatly packed. I went to set up my coffee for tomorrow morning and nothing happened. I tried using different amounts of coffee beans, plugging into a different outlet - still nothing. Don't waste your time or money."
        },
        {
            "reviewerName": "TamBlake",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Happy",
            "reviewDate": "October 30, 2017",
            "reviewText": "I love the look of this grinder. It works well to grind my coffee beans. I am glad I purchased this."
        },
        {
            "reviewerName": "Tjw1221",
            "rating": "3.0 out of 5 stars",
            "reviewTitle": "Doesn't grind as well as any other grinders that I've had.",
            "reviewDate": "July 2, 2018",
            "reviewText": "It takes too long to grind to the extent I like my beans. It looks nice. I would not buy this brand again."
        },
        {
            "reviewerName": "Christie Klein",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "I use the ground coffee for my reusable keurig cup and I get great coffee every time",
            "reviewDate": "October 12, 2017",
            "reviewText": "While this is my first coffee grinder, I don't ever see myself buying another! It's rather quiet, fast, and grinds incredibly well! I use the ground coffee for my reusable keurig cup and I get great coffee every time!"
        },
        {
            "reviewerName": "nomossonmyrocks",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "This is the quietest grinder I have ever owned and ...",
            "reviewDate": "October 29, 2017",
            "reviewText": "This is the quietest grinder I have ever owned and grinds coffee to any grind with the proper timing. Would buy again."
        },
        {
            "reviewerName": "Alicia K.",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Great value",
            "reviewDate": "November 14, 2017",
            "reviewText": "Nice and compact. I like the vibrant red color. This functions well & grinds the coffee beans perfectly."
        },
        {
            "reviewerName": "Laura",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "If you love grinding your own coffee beans then this is the ...",
            "reviewDate": "December 5, 2017",
            "reviewText": "If you love grinding your own coffee beans then this is the tool for you. It's easy to use and easy to store!"
        },
        {
            "reviewerName": "LINA DIFILIPPO",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Coffee grinder",
            "reviewDate": "October 3, 2017",
            "reviewText": "Fast, efficient coffee grinder. I love the fact that you control how fine you would like your grounds.open tip, push down in cover until u ground to your likings"
        },
        {
            "reviewerName": "Krieg",
            "rating": "4.0 out of 5 stars",
            "reviewTitle": "and this was waaay worth the price and great for my first time",
            "reviewDate": "December 29, 2017",
            "reviewText": "I only recently started grinding my own coffee beans, and this was waaay worth the price and great for my first time. :)"
        },
        {
            "reviewerName": "Amazon Customer",
            "rating": "2.0 out of 5 stars",
            "reviewTitle": "Very underpowered",
            "reviewDate": "July 29, 2018",
            "reviewText": "Very underpowered. Poor grinding. I gave it away and bought a Braun."
        },
        {
            "reviewerName": "Why can't I just do stars?",
            "rating": "4.0 out of 5 stars",
            "reviewTitle": "The customer service I got from my seller was great.",
            "reviewDate": "June 5, 2018",
            "reviewText": "The grinder is so-so but does the job. The customer service I got from my seller was great."
        },
        {
            "reviewerName": "Andrew Torres Bruce",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Great coffee Grinder",
            "reviewDate": "September 25, 2017",
            "reviewText": "Great coffee Grinder. Got as a gift for my father, he was so excited to use! works great and makes coffee taste 10x better!"
        },
        {
            "reviewerName": "J A W",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "This is a wonderful grinder. I can get very fine or course",
            "reviewDate": "September 21, 2017",
            "reviewText": "This is a wonderful grinder. I can get very fine or course. Very compact and small enough to be portable. I am planning on ordering more gifts."
        },
        {
            "reviewerName": "SCOT",
            "rating": "3.0 out of 5 stars",
            "reviewTitle": "Pretty, quiet, but slow.",
            "reviewDate": "November 11, 2017",
            "reviewText": "So, so performance. It is nice and quiet, but needs more horsepower.. My Mr. Coffee grinder would win if this were a drag race."
        },
        {
            "reviewerName": "tabatha floyd",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Five Stars",
            "reviewDate": "July 1, 2018",
            "reviewText": "Super fast shipping! Works great! We love this grinder. Quick and powerful!"
        },
        {
            "reviewerName": "Itapipoca Ceara",
            "rating": "1.0 out of 5 stars",
            "reviewTitle": "Doesn't even grind small amounts well, forget it!!",
            "reviewDate": "July 22, 2018",
            "reviewText": "Doesn't grind evenly, leaving large unground chunks. Cannot recommend."
        },
        {
            "reviewerName": "Rose Gibbs",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Coffee bean grinder for the price it works perfectly so far.",
            "reviewDate": "November 4, 2019",
            "reviewText": "Love this item very much does exactly what I bought it for."
        },
        {
            "reviewerName": "kelly loudermilk",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Five Stars",
            "reviewDate": "June 14, 2018",
            "reviewText": "Works great! Grinds beans very well!"
        },
        {
            "reviewerName": "Amazon Customer",
            "rating": "2.0 out of 5 stars",
            "reviewTitle": "Two Stars",
            "reviewDate": "November 13, 2017",
            "reviewText": "It is okay. Makes a mess after you grind it. Does not allow you to control coarseness."
        },
        {
            "reviewerName": "Amber Cerchione",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Five Stars",
            "reviewDate": "October 28, 2017",
            "reviewText": "I like how its small enough to grind a few days worth of coffee."
        },
        {
            "reviewerName": "Phillip Collins",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "cheap, disposable, and simple grinder",
            "reviewDate": "October 5, 2017",
            "reviewText": "cheap, disposable, and simple grinder; we use it for spices"
        },
        {
            "reviewerName": "Miss Veracruz",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "good price",
            "reviewDate": "March 6, 2019",
            "reviewText": "it does the job"
        },
        {
            "reviewerName": "Me",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Grind up yur spices",
            "reviewDate": "August 3, 2018",
            "reviewText": "Got this to grind toasted spices for my BBQ rubs. Works great."
        },
        {
            "reviewerName": "Lindiloo 302",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Dalek",
            "reviewDate": "November 4, 2017",
            "reviewText": "This is a brilliant addition to my kitchen gadgets, looks like a Dalek (for those of you who watched Dr Who know what I mean), the motor is quiet, I've only used it for coffee but 2 x 15 second bursts grind the beans perfectly."
        },
        {
            "reviewerName": "Charchar",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Awesome sauce",
            "reviewDate": "August 1, 2018",
            "reviewText": "What a great coffee grinder! My coffee is perfect every day!"
        },
        {
            "reviewerName": "C. Wilhite",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Works well",
            "reviewDate": "February 10, 2018",
            "reviewText": "I use it for crushing seeds and spices. It works well."
        },
        {
            "reviewerName": "Y.C.",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Cheaper",
            "reviewDate": "July 6, 2019",
            "reviewText": "Very nice and helpful"
        },
        {
            "reviewerName": "Cheryl Beyer",
            "rating": "2.0 out of 5 stars",
            "reviewTitle": "Two Stars",
            "reviewDate": "July 2, 2018",
            "reviewText": "IT TAKES FOR EVER TTO GRIND COFFEE BEANS"
        },
        {
            "reviewerName": "Laura Funk",
            "rating": "4.0 out of 5 stars",
            "reviewTitle": "Very versatile",
            "reviewDate": "October 12, 2017",
            "reviewText": "I bought this to grind up whatever my heart desires. So far I have done coffee beans in a pretty fine consistency and it worked well. I also tried dried basil and a few other herbs and was able to stock up my herbs for a really long time. I am excited to try some other things in it as I think it is a super versatile kitchen device. I will say that I did not have the easiest time cleaning all the herbs out of it and that is the only drawback I have. Otherwise this is a great little grinder."
        },
        {
            "reviewerName": "Daniel Southall",
            "rating": "2.0 out of 5 stars",
            "reviewTitle": "It does the job, but the control button got ...",
            "reviewDate": "November 22, 2017",
            "reviewText": "It does the job, but the control button got stuck, now it turns on everytime it is plugged in."
        },
        {
            "reviewerName": "Heyerrrn",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Dope grind",
            "reviewDate": "October 19, 2019",
            "reviewText": "Packaging was hilarious. Such a funny company. Great bang for buck."
        },
        {
            "reviewerName": "Red Tees for Me",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Five Stars",
            "reviewDate": "July 8, 2018",
            "reviewText": "Very good little coffee bean grinder."
        },
        {
            "reviewerName": "Jason Novicky",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Five Stars",
            "reviewDate": "April 30, 2018",
            "reviewText": "Great little coffee grinder!"
        },
        {
            "reviewerName": "DEEDA",
            "rating": "4.0 out of 5 stars",
            "reviewTitle": "Four Stars",
            "reviewDate": "June 29, 2018",
            "reviewText": "Haven't used it yet but like the large capacity"
        },
        {
            "reviewerName": "Shlomit Ankonina",
            "rating": "2.0 out of 5 stars",
            "reviewTitle": "Doesn't do the job, takes a long time to ...",
            "reviewDate": "October 1, 2017",
            "reviewText": "Doesn't do the job, takes a long time to grind coffee, and still doesn't grind it enough, looking for a way to return it."
        },
        {
            "reviewerName": "Phyliss Garrison",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Five Stars",
            "reviewDate": "June 12, 2018",
            "reviewText": "Great addition to our kitchen"
        },
        {
            "reviewerName": "Liliana B. Misteroni",
            "rating": "1.0 out of 5 stars",
            "reviewTitle": "Weak",
            "reviewDate": "September 14, 2018",
            "reviewText": "Very weak! It doesnt do much"
        },
        {
            "reviewerName": "JA",
            "rating": "3.0 out of 5 stars",
            "reviewTitle": "Doesn't grind the beans fine. You have to use more coffee when is ...",
            "reviewDate": "November 9, 2017",
            "reviewText": "Doesn't grind the beans fine. You have to use more coffee when is coarsely ground."
        },
        {
            "reviewerName": "Buyer of Things",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Five Stars",
            "reviewDate": "November 22, 2017",
            "reviewText": "Easy and functional for home use."
        },
        {
            "reviewerName": "Cliente Amazon",
            "rating": "1.0 out of 5 stars",
            "reviewTitle": "One Star",
            "reviewDate": "May 15, 2018",
            "reviewText": "It broke after a fewer than a month and they don't respond the emails.\nDon't buy this."
        },
        {
            "reviewerName": "Danell Rankin",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Five Stars",
            "reviewDate": "September 28, 2017",
            "reviewText": "I use it for spices and it works great!!"
        },
        {
            "reviewerName": "Abdulrahman Alshehari",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Five Stars",
            "reviewDate": "April 8, 2018",
            "reviewText": "It works very nice"
        },
        {
            "reviewerName": "Crish",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Five Stars",
            "reviewDate": "December 3, 2017",
            "reviewText": "nice product"
        },
        {
            "reviewerName": "Elizabeth",
            "rating": "4.0 out of 5 stars",
            "reviewTitle": "Four Stars",
            "reviewDate": "April 15, 2018",
            "reviewText": "Works fine"
        },
        {
            "reviewerName": "Angela Whitmore-High",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Five Stars",
            "reviewDate": "November 26, 2017",
            "reviewText": "Works quickly and well."
        },
        {
            "reviewerName": "David W. Ricks",
            "rating": "4.0 out of 5 stars",
            "reviewTitle": "Four Stars",
            "reviewDate": "November 8, 2017",
            "reviewText": "So far so good."
        },
        {
            "reviewerName": "Amazon Customer",
            "rating": "1.0 out of 5 stars",
            "reviewTitle": "One Star",
            "reviewDate": "May 17, 2018",
            "reviewText": ""
        },
        {
            "reviewerName": "K",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Easy to clean",
            "reviewDate": "September 25, 2017",
            "reviewText": "Grinds coffee very well. Easy to clean."
        },
        {
            "reviewerName": "Belinda Trewern",
            "rating": "2.0 out of 5 stars",
            "reviewTitle": "Two Stars",
            "reviewDate": "September 1, 2018",
            "reviewText": "Worst most inconsistent grind ever. Takes forever. Cheap though."
        },
        {
            "reviewerName": "knuckles",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Nice quality for the price",
            "reviewDate": "December 7, 2017",
            "reviewText": "Works great"
        },
        {
            "reviewerName": "Sunshine",
            "rating": "1.0 out of 5 stars",
            "reviewTitle": "Stopped working",
            "reviewDate": "May 14, 2018",
            "reviewText": "It broke three weeks after the return window closed. No good! Not fair! I want to get a refund."
        },
        {
            "reviewerName": "Amazon Customer",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Cute & well made.",
            "reviewDate": "October 29, 2017",
            "reviewText": "Cute, strong well made much better than expected great value for money."
        },
        {
            "reviewerName": "Linda A.",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Love my coffee grinder!",
            "reviewDate": "April 4, 2018",
            "reviewText": "Grinds the beans very well, so easy to use"
        },
        {
            "reviewerName": "Berk",
            "rating": "1.0 out of 5 stars",
            "reviewTitle": "Broke after 6 months",
            "reviewDate": "April 10, 2018",
            "reviewText": "Broke after 6 months. Very disappointing. I would appreciate a replacement."
        },
        {
            "reviewerName": "Nancy M. Laird",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Found the coffee grinder from your picture",
            "reviewDate": "October 18, 2017",
            "reviewText": "I found it from picture. thank you."
        },
        {
            "reviewerName": "Samuel Payne",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Five Stars",
            "reviewDate": "April 20, 2018",
            "reviewText": "great price...works well"
        },
        {
            "reviewerName": "C or E Kleinman",
            "rating": "3.0 out of 5 stars",
            "reviewTitle": "Only Fair Performance",
            "reviewDate": "February 17, 2018",
            "reviewText": "This grinder was a disappointment because it did not grind all the beans to equal consistency (fine/medium) for cone drip coffee. The blades seem to be too dull for the job. Even after running the grinder for 2-4 periods of about 10 seconds the coffee came out with some beans still whole or in chunks. That was the reason for purchasing a new grinder as our old one had begun to leave a handful of beans unground.\nWe returned the item."
        },
        {
            "reviewerName": "Sheila",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Five Stars",
            "reviewDate": "April 1, 2018",
            "reviewText": "Love it ... works fantastic"
        },
        {
            "reviewerName": "SugarChef",
            "rating": "3.0 out of 5 stars",
            "reviewTitle": "Grinds unevenly (but you get what you pay for).",
            "reviewDate": "April 1, 2018",
            "reviewText": "Bought this to replace my Proctor Silex grinder and have been using it daily for three months. However, I'm thinking of replacing it with a more expensive burr grinder because I'm just annoyed by the lack of consistency on the grind. After 15 seconds of grinding a couple tablespoons of beans, I still have chunks of beans mixed with ground coffee (for French press). Only gave it three stars because I got what I paid for.\n\nThe pros: Lightweight and stylish.\nThe cons: Longer time to grind and grinds unevenly."
        },
        {
            "reviewerName": "kimberly m oyler",
            "rating": "4.0 out of 5 stars",
            "reviewTitle": "Very happy with this little guy",
            "reviewDate": "September 27, 2017",
            "reviewText": "Very happy with this little guy! I needed a secondary grinder for my coffee and it works great! Would definitely recommend!"
        },
        {
            "reviewerName": "Amazon Customer",
            "rating": "3.0 out of 5 stars",
            "reviewTitle": "... welll but wish that they would of made it easy to clean around",
            "reviewDate": "May 1, 2018",
            "reviewText": "Works welll but wish that they would of made it easy to clean around blades"
        },
        {
            "reviewerName": "BBRose27",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Fresh Ground Coffee",
            "reviewDate": "June 18, 2018",
            "reviewText": "My thoughts on the Vremi Knife Set. These blades are just amazing. It was perfect timing to have received these because my set was becoming dull. I am food enthusiast and cook a lot at home, so I am constantly slicing and dicing. With the Vremi knife set I could cut easily through tomatoes without them squishing. I can also easily slice through onions with no struggle. Overall, I would give this knife set a 5 because it made the cooking process so much more easier."
        },
        {
            "reviewerName": "Yen",
            "rating": "4.0 out of 5 stars",
            "reviewTitle": "Quiet and does what it is intended to do",
            "reviewDate": "June 10, 2018",
            "reviewText": "?The Vremi Coffee grinder is lightweight, compact for easy storage and comes in 2 color selections (black or red). I was pleasantly surprised that this grinder is quiet and I didnt have to yell out a warning to anyone nearby when I turned it on. My coffee beans were not as finely grounded as I would like but this grinder did the job. ?"
        },
        {
            "reviewerName": "Verotechno",
            "rating": "4.0 out of 5 stars",
            "reviewTitle": "Great purchase",
            "reviewDate": "May 15, 2018",
            "reviewText": "I've been using this for about a week now and I like it. It works fast, it's simple to use, not too noisy and gets the job done. I chose black to blend in with my kitchen. Now I can purchase my coffee grinds wholesale and save money. Also works well with grinding fresh spices and making your own powdered sugar."
        },
        {
            "reviewerName": "Natural4life",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Cute and handy indeed!",
            "reviewDate": "June 12, 2018",
            "reviewText": "My hubby is the BIG coffee lover in our home so he uses this coffee grinder the most. He has never ground his own coffee before so this is now his favorite kitchen toy. He grinds up enough to make a big single cup of coffee then store the rest of the grounds in a jelly size Mason jar to use over the next few days. Have you taken notice of the puns outside and inside the box? My hubby thinks the puns were really clever."
        },
        {
            "reviewerName": "Ashley Gray",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Holds up to frequent use",
            "reviewDate": "January 27, 2019",
            "reviewText": "My husband uses this frequently and regularly and it has held up well!"
        },
        {
            "reviewerName": "Regina",
            "rating": "2.0 out of 5 stars",
            "reviewTitle": "Not a Great Product ?",
            "reviewDate": "September 9, 2018",
            "reviewText": "It seems to grind coffee beans okay. My daughter used it to ground her Cheetos to put on her corn. Works well but the design is terrible. The button comes off so I have to store the lid pieces separately. In all honesty, I don't recommend this product."
        },
        {
            "reviewerName": "alex",
            "rating": "2.0 out of 5 stars",
            "reviewTitle": "Too bulky",
            "reviewDate": "February 9, 2019",
            "reviewText": "Too bulky for coffee grinder, take up a lot space too difficult to hold that means not so easy to operate because in order to operate in safely it has to be easy to hold in one hand and pushing the button in other hand."
        },
        {
            "reviewerName": "Literary Diva Of Blogtalk Radio",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Great Product!",
            "reviewDate": "July 7, 2018",
            "reviewText": "This product has given me a whole new perspective on \"grinding your beans.\" Its quick, easy, not loud like other products and allows me to enjoy the perfect cup of coffee to my liking. All I can say is, if you want a smoother cup of coffee in the mornings then try this product. It's a product that I \"must\" use to get my mornings started."
        },
        {
            "reviewerName": "cwyatt",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Super grinder!!!",
            "reviewDate": "May 31, 2018",
            "reviewText": "I absolutely love the Vremi coffe Grinder, I've used another brand previously but it didnt fo as well this one gets the job done and cleans up easy."
        },
        {
            "reviewerName": "Timmerz",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Five Stars",
            "reviewDate": "June 2, 2018",
            "reviewText": "works great on fresh roasted beans. Easy to use, no problems with clean up."
        },
        {
            "reviewerName": "Janet",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Works well",
            "reviewDate": "October 30, 2018",
            "reviewText": "Small"
        }
    ],
    "title": "Vremi Electric Coffee Grinder - 150 Watt Portable Coffee Bean Grinder with Easy Touch Settings Stainless Steel Blades - Grinds Coarse Fine Ground Beans for 12 to 14 Cups of Coffees - Red",
    "manufacturer": "Vremi",
    "currentPrice": "$9.99",
    "rating": "3.9 out of 5 stars",
    "totalRatings": "405 ratings",
    "features": [
        "\n         Make sure this fits\n                by entering your model number.\n        \n",
        "INSTANT ELECTRIC COFFEE GRINDER - Our electric coffee grinder is designed with an easy one-touch control that allows for a continuous grind. Simply place your coffee beans in the grinder, place the lid on top and press the button. In just a few seconds you'll have fresh grounds right at your fingertips",
        "WITH DOUBLE STAINLESS STEEL BLADES - Features sharp and durable double stainless steel blades that grind with precision from whole to coarse to fine ground beans for making french press coffees, espresso or just your regular cup of joe. Note: Do NOT use to grind other types of food",
        "LARGE CAPACITY GRINDER with SAFETY LID - This quiet compact coffee maker with rubber grip exterior has a 100g capacity for coffee beans, enough for 12 to 14 cups of coffee. It also features a removable safety lock lid for quick and safe use. This makes it great for travel or as a housewarming gift",
        "HASSLE FREE GRINDING EXPERIENCE - This small home kitchen coffee grinder machine is equipped with anti-slip feet for added stability, a convenient cord storage and a high power 150W (25000-28000 R/MIN) low noise motor making sure your family sleeps peacefully while you prepare their morning cup",
        "PORTABLE COFFEE GRINDERS with BRUSH CLEANER -This grinder measures 7.5 x 4 x 3.5 inches in classic black and red. No disassembly required to clean the mini grinder, just use the included cleaning brush in a kit to clean (NOTE: always UNPLUG appliance before cleaning)"
    ],
    "reviewsAspects": [
        "easy to use",
        "easy to clean",
        "french press",
        "works great",
        "works well",
        "matter how long",
        "cold brew",
        "coffee bean",
        "every day",
        "little brush",
        "small enough",
        "quick and easy",
        "definitely recommend",
        "job done",
        "whole beans",
        "grinder is great",
        "poor design",
        "fine enough",
        "fresh ground",
        "cleaning brush"
    ],
    "qAndA": [
        {
            "question": "How come the description says \"for coffee bean or spices\", and the instructions say, \"do not use for spices!!!??",
            "answer": "Yep, coffee and some herbs really have a way of infusing things with their smell and taste. I won't even let a roommate put flavored beans in my grinder, let alone herbs! It's best to have separate grinders if you care about the taste of your coffee... I would think that most people buying a grinder care."
        },
        {
            "question": "what is the voltage rating of this grinder?",
            "answer": "110v only as far as i know."
        },
        {
            "question": "Dos it work with 220V ?",
            "answer": "This model is a 110 only. You would need a converter for use with a 220 volt outlet."
        },
        {
            "question": "Capacity in ounces?",
            "answer": "Answer not available"
        },
        {
            "question": "Can one clean it by putting both unit and plastic lid under running water? The brush is good but does not take off everything.",
            "answer": "Running water is not enough. I will run water over it and use the brush too. The plastic lid I hand wash with my dishes."
        },
        {
            "question": "What does portable mean? Is it battery operated?",
            "answer": "No it is not battery operated. It has a power cord. By portable they mean it is light not heavy. Small, as you can easily fit it in a suitcase."
        },
        {
            "question": "How many seconds to grind for drip coffee?",
            "answer": "Close to a minute."
        },
        {
            "question": "2 ?s: 1) Can this be used for one or two cups of coffee? 2) Does it coarsely grind appropriate for a French Press?",
            "answer": "Can be used for whatever amount of coffee you need to grind. Sorry, not familiar with French Press."
        },
        {
            "question": "What is the expected life of the blade (in uses, months, years?) if used only for coffee?",
            "answer": "Answer not available"
        },
        {
            "question": "Can I wash the main unit under running water? Mainly the grinder portion?",
            "answer": "I haven't had mine that long, but I'm not sure I would do that. It doesn't look like it would be \"water resistant\". I think that simply wiping it off with a soft, damp cloth would clean it up just fine. I had another brand for nearly 10 years, and never needed to rinse it off either. It looks like new, and still wo see more"
        },
        {
            "question": "How long is the cord?",
            "answer": "The cord on mine is approximately 31\" long."
        },
        {
            "question": "funciona con 220 volt?",
            "answer": "Solo con 110 voltios."
        },
        {
            "question": "The photo shows the blade removed, in mid-air. The blade is removable?",
            "answer": "Answer not available"
        },
        {
            "question": "Where is this coffee grinder made?",
            "answer": "THEIR HEAD OFFICE IS IN NEW YORK CITY NOT SURE WHERE ALL THEIR PRODUCTS ARE MADE BUT I GUESS SOME OVERSEAS"
        },
        {
            "question": "Um, what is the power source? i can't see a plug in the photos, no one has mentioned plugging it in and the travel aspect makes me wonder about batter",
            "answer": "Answer not available"
        },
        {
            "question": "Does it have a cord or is it battery operated?",
            "answer": "It has a cord :)"
        },
        {
            "question": "Does it have multiple settings?",
            "answer": "It broke"
        },
        {
            "question": "received and used item - I want the customer service phone # for the manufacturer of this product before I can submit a legitimate review",
            "answer": "Answer not available"
        },
        {
            "question": "Does this grinder have a European plug for use in the Netherlands?",
            "answer": "Not sure what the European plug looks like. However this grinder has a standard two pronged USA plug"
        },
        {
            "question": "How good is this grinder for fine espresso powder?",
            "answer": "yes, the blades are small but sharp. you can grind very fine."
        },
        {
            "question": "The pictures show the gridner uses blades, not burr. So why call it burr-grinder?",
            "answer": "Who called this a burr grinder? Blade grind, only."
        },
        {
            "question": "How do you choose grind setting?",
            "answer": "There is only one speed. The length of time you pulse the beans determines the grind. I am very pleased with this product."
        },
        {
            "question": "Would this work for grinding up eggshells (for composting use)?",
            "answer": "Answer not available"
        },
        {
            "question": "Would this work for nutmeg?",
            "answer": "Vremi Engineering says yes, and to ensure the nutmeg is dry."
        },
        {
            "question": "Does this product have warranty? The blades are loosing.",
            "answer": "Answer not available"
        },
        {
            "question": "Do you have rebates?",
            "answer": "Answer not available"
        },
        {
            "question": "any problem with static keeping powder in lid?",
            "answer": "I only used it one time. The grind was way too coarse for me so I gave it away. There was no powder in the grind, it's very coarse."
        },
        {
            "question": "What kind of batteries does this require?",
            "answer": "Answer not available"
        },
        {
            "question": "Where is the brush?",
            "answer": "My brush was inside the grinder"
        },
        {
            "question": "Is this grinder good for single use?",
            "answer": "It worked. Not the greatest grinder but the price is reasonable."
        },
        {
            "question": "how does this work?",
            "answer": "You put your coffee beans in and push down on top . That is all it takes to get perfect ground coffee! Highly recommend!"
        },
        {
            "question": "Is this product available on 220 volts?",
            "answer": "Nope. Device says 120v... 150w. Can't do spices, no brush. Used it twice now... quieter than the old one, and takes a little longer. But bigger capacity. Probably will keep it."
        }
    ]
}