{
    "title": "Manual Coffee Grinder – Adjustable Ceramic Conical Burr Coffee Bean Mill With Stainless Steel Body & Easy Hand Crank, Brewing Grinders for Office Home, Traveling Camping Consistent Grind French Press",
    "manufacturer": "Tundras",
    "currentPrice": "$10.19",
    "rating": "4.0 out of 5 stars",
    "totalRatings": "69 ratings",
    "features": [
        "\n         Make sure this fits\n                by entering your model number.\n        \n",
        "PERFECTLY GRINDED COFFEE: For lovers of coffee everywhere, our grinder turns your beans into the finest coffee grinds however you like it - French press, pour over, drip, AeroPress and more!",
        "MANUALLY OPERATED: Don’t worry about annoying wires or constantly thinking if the batteries work! Our manual grinder grinds easily so you can have perfectly ground coffee beans in seconds!",
        "CONVENIENTLY PORTABLE: A sleek lightweight design allows you to easily carry it around wherever you need to have a quick pick me up just the way you need it. It fits in any bag, purse, or carry on!",
        "STAINLESS STEEL CONSTRUCTION: A durable makeup of brushed stainless steel means it will last you a very long time so you not stress about it breaking or malfunctioning for a long-term purchase.",
        "PREMIUM CERAMIC BURR GRINDING: Enjoy effortless grinding with a premium quality mechanism that is designed to last for years! Easily adjustable from course to fine, choose what you love."
    ],
    "reviewsAspects": [
        "french press",
        "easy to use",
        "works well",
        "coffee grinder",
        "little grinder",
        "camping or travel",
        "takes three to five minutes",
        "cup of coffee",
        "beans like",
        "manual grinder",
        "coffee beans",
        "grinds my coffee",
        "bought this to grind",
        "grind enough",
        "love this grinder",
        "grinder because",
        "ceramic",
        "electric",
        "grinding",
        "pepper"
    ],
    "productInformation": [
        {
            "Package Dimensions": "9.2 x 2.5 x 2.5 inches"
        },
        {
            "Item Weight": "10.2 ounces"
        },
        {
            "Shipping Weight": "10.2 ounces (View shipping rates and policies)"
        },
        {
            "Manufacturer": "Tundras"
        },
        {
            "ASIN": "B078RW6QDJ"
        },
        {
            "Item model number": "8541892550"
        },
        {
            "Customer Reviews": "4.0 out of 5 stars\n    69 ratings\n4.0 out of 5 stars"
        },
        {
            "Best Sellers Rank": "#14,965 in Kitchen & Dining (See Top 100 in Kitchen & Dining)\n#10 in Manual Coffee Grinders\n"
        },
        {
            "Date first listed on Amazon": "January 2, 2018"
        }
    ],
    "productDescription": [],
    "reviews": [
        {
            "reviewerName": "Rachel",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Used for senior cat",
            "reviewDate": "August 16, 2018",
            "reviewText": "I have a terminal foster with no teeth and tumors in her mouth. She can’t eat even pates anymore; everything has to be of a baby food texture. I bought this to grind her medicated dry food into a fine powder and mix it in with ok’ed baby food and it has saved her life. She’s gained weight to have her stronger meds and has energy to have a quality of life she deserves to experience before the cancer truly takes her down. I realize this is an unorthodox and unsponsored use, but this tool is easy to clean and use, of great quality, and matched my budget."
        },
        {
            "reviewerName": "William Schlesinger",
            "rating": "2.0 out of 5 stars",
            "reviewTitle": "Handle fails after a few uses.",
            "reviewDate": "February 8, 2019",
            "reviewText": "The grinder worked decently. Semi consistent grind, not bad for the price. It takes quite a while to grind one cup of coffee though. a solid two to three minutes of vigorous turning. After about 10 cup of coffee the black handle broke off. I now chuck my electric drill to the handle attachment and have an electric grinder."
        },
        {
            "reviewerName": "WeezyG",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Using to make veggie powders",
            "reviewDate": "November 3, 2018",
            "reviewText": "I dehydrated different herbs and vegetables from my garden and used this to grind them up into powder. I'm having a lot of fun mixing up my own seasoning mixes. I made one combo of sweet onion, garlic and pepper that's sooo good on scrambled eggs and meatloaf. I'm looking forward to creating more of my own secret ingredients."
        },
        {
            "reviewerName": "Slartidbartfast",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Great little hand coffee grinder. Can't beat it for the price.",
            "reviewDate": "February 27, 2019",
            "reviewText": "Does what it says - grinds coffee. Burr grinder is supposed to be better than other designs. The ceramic grinding elements not only wear slower than steel but produce a more consistent grind and are easily replaceable. Stainless steel body and handle seem like pretty good quality and the parts fit together nicely. The bean reservoir holds enough for ~5 cups and it takes 40-70 cranks to produce enough ground coffee for a decent cup (depending on your preference.) Long handle gives a lot of leverage but means you have to grip the smooth steel body pretty tight. Best thing for me is, it fits perfectly inside my Aeropress plunger without the ground container on the bottom (not needed.)"
        },
        {
            "reviewerName": "Kiki Vogel",
            "rating": "4.0 out of 5 stars",
            "reviewTitle": "Nice little grinder.",
            "reviewDate": "September 30, 2018",
            "reviewText": "This takes a lot of arm power to grind up but it does the job. I feel like it's less abusive to the beans and the grind is more even than my electric, time saving grinder. When I have the time, I use this."
        },
        {
            "reviewerName": "Clayton A Weis",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "This grinder delivers!",
            "reviewDate": "October 14, 2019",
            "reviewText": "This is a great little grinder, I highly recommend it. This is my 2nd purchase of these grinders, but that doesn’t mean there’s anything wrong with it. I used my first grinder for hundreds of grinds and almost four years before an internal plastic part broke. This grinder is robust, compact and extremely effective. You can adjust the size of your grind easily and reliably, and it will grind for every type of coffee maker (from ultra fine for espresso to extremely coarse for French-pressed coffee). The ceramic burr is extremely durable and does its job perfectly. In four years and probably over one-thousand cups of coffee ground, I never needed to do a second of maintenance. This grinder is great for travel, and has been to Afghanistan and back with me.\n\nThe absolutely ONLY possible criticism of this grinder to consider is that it takes three to five minutes of steady, fast grinding to grind a full load of beans, which makes about two eight ounce cups of French-pressed coffee. This isn’t a big deal to me, and it is a manual grinder, so this met my expectations; however, if you haven’t used a manual grinder before, you may be surprised by how long that three to five minutes feels."
        },
        {
            "reviewerName": "Lane Sax",
            "rating": "1.0 out of 5 stars",
            "reviewTitle": "Avoid seller, avoid this product",
            "reviewDate": "May 22, 2019",
            "reviewText": "First time it came, I didn't have a handle. Had to get a new one sent out. The handle on the new one broke after the third use. It's cheaply made. I tried to return it, but I ducked up and selected \"UPS Store\". The closest UPS store is an hour away. No way to cancel, so I got charged for two grinders that are pure crap."
        },
        {
            "reviewerName": "MXStilgar",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Works great for about three years, then...",
            "reviewDate": "July 18, 2019",
            "reviewText": "Works great for about three years, until the plastic wash/spindle that fits inside\nthe ceramic cone will split, making the entire device useless.\nOf course, they do not sell the flimsy plastic piece separately,\nso when that breaks, you have to get a whole new grinder.\nI am planning a trip to the hardware store to see if I can MacGyver a stainless washer and bolt that will replace the plastic washer/spindle inside so this device can work for a few decades."
        },
        {
            "reviewerName": "Marissa Vecca",
            "rating": "4.0 out of 5 stars",
            "reviewTitle": "Small but works well",
            "reviewDate": "December 30, 2018",
            "reviewText": "Works well however is small and time consuming. If you’re in a hurry it takes what feels like forever to grind a whole full load of beans. I like that you can control the size of the grind. All and all a good little grinder."
        },
        {
            "reviewerName": "JEANNE SCANTLIN",
            "rating": "2.0 out of 5 stars",
            "reviewTitle": "Too old for this",
            "reviewDate": "September 22, 2019",
            "reviewText": "Having read the other reviews, I understand the discrepancy. For those who are young and strong, this probably is great. For myself, 74 years old, I found it difficult to use. I bought this for the occasional mistaken purchase of whole bean instead of ground coffee. I read the directions carefully. I needed a rubber grip to hold the canister steady, and it did take at least a couple hundred turns of the handle to make one cup of coffee. I'm glad it wasn't set to fine grind!"
        },
        {
            "reviewerName": "Amanda Faith",
            "rating": "3.0 out of 5 stars",
            "reviewTitle": "Inconsistent grounds",
            "reviewDate": "August 14, 2019",
            "reviewText": "This grinder makes really inconsistent grounds. I've tried adjusting it several times and still get grounds that are hard to brew. Half of them are very fine and would be good for a pour over or esspresso while the other half are larger and would work better for a French press. The handle is also difficult to turn at times. The one thing is has going for it is that it's small and easy to transport. If you just need a little grinder for camping or other travel it would probably work fine. If you're looking to make a quality cup of coffee everyday this probably isn't the grinder for you."
        },
        {
            "reviewerName": "R. Neumann",
            "rating": "4.0 out of 5 stars",
            "reviewTitle": "Not for flax seed for sure.",
            "reviewDate": "August 14, 2018",
            "reviewText": "I bought this to grind flax seeds. It takes me about 15 minutes to get less than a tablespoon. I usually use 2 tablespoons every morning so it takes over half an hour to get 2 tablespoons. I have adjusted and readjusted the burrs to no avail. I think I will find a steel burr grinder as opposed to ceramic burrs. If you're grinding flax seed this grinder is not it. Not sure how it does for coffee beans since I don't drink coffee. I will add that the actual grind size is nice I just don't have the time or the patience to grind for more than half an hour. And I also know this was not billed as a spice or seed grinder but someone in the q & a section said they use it with success which was why I chose it. I am only writing to let others know that while it does work... it takes way more time than I care to put in."
        },
        {
            "reviewerName": "Amazon Customer",
            "rating": "4.0 out of 5 stars",
            "reviewTitle": "Not best quality but no branding and good for the price.",
            "reviewDate": "April 5, 2019",
            "reviewText": "No logo was what I was looking for, works well but burs make contact unless they're adjusted to max grinding size, which is good for french press"
        },
        {
            "reviewerName": "JD Dela Cruz",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Useful for Turkish coffee",
            "reviewDate": "July 9, 2019",
            "reviewText": "I use this to grind light roasted coffee beans to make Turkish coffee and, it grinds really fine. It is perfect to use for camping with a stove and cezve, who says I can't have a cup of Turkish in the middle of the Redwood forest? I love this grinder."
        },
        {
            "reviewerName": "Kirk Mantay",
            "rating": "4.0 out of 5 stars",
            "reviewTitle": "Surprisingly decent and reliable.",
            "reviewDate": "April 5, 2019",
            "reviewText": "I needed a manual grinder for early morning french press, and I didn't want to pay a lot of money. This fit the bill and I've used it without incident every day for more than a month. It will probably hold up for awhile. Good value for the low price."
        },
        {
            "reviewerName": "MrsEZ",
            "rating": "3.0 out of 5 stars",
            "reviewTitle": "Eh",
            "reviewDate": "April 21, 2019",
            "reviewText": "Unfortunately, this was difficult to use. The too kept falling off for me. I’ve used a manual coffee grinder before and this was just much more laborious."
        },
        {
            "reviewerName": "Suzi",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Also a pepper grinder",
            "reviewDate": "July 13, 2019",
            "reviewText": "I use it for pepper. I can get a nice coarse grind and it is super easy to use. Love the storage for my pepper when cooking"
        },
        {
            "reviewerName": "Trevor Gamar",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Great for a dorm room/ camping/ travel",
            "reviewDate": "November 5, 2019",
            "reviewText": "It's great for a camping addition. It's not something you want to use everyday but I did buy one for my recently married brother to teach him how to use a coffee grinder for his first french press."
        },
        {
            "reviewerName": "Cathy Edmondson-Ball",
            "rating": "3.0 out of 5 stars",
            "reviewTitle": "doesn't grind enough coffee, fast enough",
            "reviewDate": "July 8, 2019",
            "reviewText": "This would be great for a single serve French Press. The course grind was what I was after, but to get enough course ground coffee for my French Press, well, I'm exhausted. Quality of the product is great. Shipping time was as promised, just not quite what I was hoping for."
        },
        {
            "reviewerName": "Nickol",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Five Stars",
            "reviewDate": "September 13, 2018",
            "reviewText": "Wonderful Works incredibly well"
        },
        {
            "reviewerName": "Rain Rogers",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Well worth the price",
            "reviewDate": "June 7, 2019",
            "reviewText": "Easy to use. Grinds up coffee perfectly and bonus nice upper arm workout.."
        },
        {
            "reviewerName": "suzzyloulou",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "It's very easy to use",
            "reviewDate": "October 12, 2019",
            "reviewText": "Handy dandy little gadget my coffee always tastes so good when I grind it"
        },
        {
            "reviewerName": "dean nelson",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Early use",
            "reviewDate": "May 4, 2019",
            "reviewText": "I've only used for a short time but seems quality for what it's meant for."
        },
        {
            "reviewerName": "William Holmes",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Quite good",
            "reviewDate": "February 9, 2019",
            "reviewText": "Worked well even though my purchase of coffee from another website wasnt full beans like I thought. nice to have around, easy to change grind coarseness with. Though until you get used to it it can take a while for a larger pot."
        },
        {
            "reviewerName": "Jingbo.Qi",
            "rating": "4.0 out of 5 stars",
            "reviewTitle": "Four Stars",
            "reviewDate": "September 16, 2018",
            "reviewText": "Perfect and artistic!"
        },
        {
            "reviewerName": "Emily Colson",
            "rating": "4.0 out of 5 stars",
            "reviewTitle": "Good so far",
            "reviewDate": "July 25, 2019",
            "reviewText": "Works pretty well and easy to clean."
        },
        {
            "reviewerName": "Drew",
            "rating": "4.0 out of 5 stars",
            "reviewTitle": "Not bad at all",
            "reviewDate": "March 23, 2019",
            "reviewText": "Works about as well as you could expect. Just a tip, find a socket and drill to use instead of the crank. Makes it a heck of a lot easier."
        },
        {
            "reviewerName": "Amazon Customer",
            "rating": "1.0 out of 5 stars",
            "reviewTitle": "Did Not Last",
            "reviewDate": "September 28, 2018",
            "reviewText": "I bought this at the first of August and at the end if September the handle came off. Not well designed."
        },
        {
            "reviewerName": "mike",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "It does take a bit to grind manually but that wouldnt keep me from buying this again.",
            "reviewDate": "October 9, 2019",
            "reviewText": "Love this! It's handy and can be stored and carried with you for camping trips etc. Does take a little bit to crank out the beans so I attached my dewalt drill to it and it is awsome!"
        },
        {
            "reviewerName": "genesis",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Great For Coffee, Salt and Peppercorns",
            "reviewDate": "July 5, 2019",
            "reviewText": "It's great. Pricing is very reasonable and I bought another (have 2 now) to use for pepper and salt. Very convenient."
        },
        {
            "reviewerName": "Hannah Nielsen",
            "rating": "2.0 out of 5 stars",
            "reviewTitle": "Just buy a power grinder",
            "reviewDate": "December 10, 2018",
            "reviewText": "If you really want to manual grinder this is probably fine for the price but if your looking for a cheap grinder just spend a few extra bucks on one that is not manual and save yourself a headache."
        },
        {
            "reviewerName": "Nancy",
            "rating": "2.0 out of 5 stars",
            "reviewTitle": "Not durable",
            "reviewDate": "April 23, 2019",
            "reviewText": "Coffee grinder worked well for about a pound of coffee. Then the knob broke off the handle and the hole stripped out."
        },
        {
            "reviewerName": "Carrie A Roch",
            "rating": "1.0 out of 5 stars",
            "reviewTitle": "Coffee Grinder purchase",
            "reviewDate": "September 17, 2019",
            "reviewText": "It looked good but, it did not work well. I wanted it to also grind flax seed and it did but took forever to get a teaspoon."
        },
        {
            "reviewerName": "Snoogans",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Great for all you coffee lovers on the go",
            "reviewDate": "May 2, 2019",
            "reviewText": "Perfect for all you on the go or camping needs."
        },
        {
            "reviewerName": "Michalia Gorden",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Works just like you would want it to",
            "reviewDate": "November 6, 2019",
            "reviewText": "I thought it was a bit flimsy at first but it has held up and performed well. I would definitely buy it again!"
        },
        {
            "reviewerName": "Set",
            "rating": "1.0 out of 5 stars",
            "reviewTitle": "Really not up to the task.",
            "reviewDate": "March 26, 2019",
            "reviewText": "It takes five minutes and 1000 turns to grind enough coffee beans for a single cup. Look elsewhere if you value your time."
        },
        {
            "reviewerName": "ORjohn",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Best mill for awesome coffee",
            "reviewDate": "February 21, 2019",
            "reviewText": "My friends agree this coffee grinder makes the best brew. Great for camping or power outages."
        },
        {
            "reviewerName": "Amazon Customer",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Ease of use",
            "reviewDate": "June 12, 2019",
            "reviewText": "Great coffee grinder when camping"
        },
        {
            "reviewerName": "Amazon Customer",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "A great grinder",
            "reviewDate": "October 23, 2019",
            "reviewText": "I use it to grind whole spices. It is an excellent grinder and it is very easy to use. Our family loves it."
        },
        {
            "reviewerName": "sydell stapler",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Great product",
            "reviewDate": "June 25, 2019",
            "reviewText": "Traveling to home without grinder or coffee pot"
        },
        {
            "reviewerName": "William",
            "rating": "1.0 out of 5 stars",
            "reviewTitle": "It is crap.",
            "reviewDate": "October 18, 2019",
            "reviewText": "CRAP."
        },
        {
            "reviewerName": "Peter",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Ideal",
            "reviewDate": "December 12, 2018",
            "reviewText": "Excellent"
        },
        {
            "reviewerName": "Harvey Robillard, III",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Well made",
            "reviewDate": "August 13, 2019",
            "reviewText": "Good size for single-use"
        },
        {
            "reviewerName": "Cjf",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Great camping coffee grinder",
            "reviewDate": "October 11, 2019",
            "reviewText": "Easy to use and nice size for travel"
        },
        {
            "reviewerName": "Esthela Fischer",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "That it's easy to carry with you",
            "reviewDate": "May 21, 2019",
            "reviewText": "It takes some time to grinder"
        },
        {
            "reviewerName": "Gene A. Camargo",
            "rating": "1.0 out of 5 stars",
            "reviewTitle": "Useless",
            "reviewDate": "August 3, 2019",
            "reviewText": "Useless"
        },
        {
            "reviewerName": "Pandaranda",
            "rating": "4.0 out of 5 stars",
            "reviewTitle": "ok",
            "reviewDate": "September 25, 2019",
            "reviewText": "loose"
        },
        {
            "reviewerName": "Amazon Customer",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Back to basics",
            "reviewDate": "July 18, 2019",
            "reviewText": "Wonderful little product"
        },
        {
            "reviewerName": "Scrooge McDuck",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "It is the ideal camping tool. Works well and ...",
            "reviewDate": "July 25, 2018",
            "reviewText": "It is the ideal camping tool. Works well and can be used without making a mess. Can change the grind for portable drip or French press."
        },
        {
            "reviewerName": "Emily",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Wonderfully easy to use",
            "reviewDate": "May 17, 2019",
            "reviewText": "I bought this coffee grinder because I had recently bought a French Press. I've never used a coffee grinder before, so I didn't really know what to expect. I love the slim profile and just how easy it is to use. It's easy to assemble and disassemble and to change the coarseness of the grind. It's easy to grind and doesn't take long at all. It feels solid and really well made. The window at the bottom so I can see how much ground I have left is a really nice touch. And it's portable, which is nice. 100% would buy again."
        },
        {
            "reviewerName": "JulesK",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Best little grinder for camping or travel",
            "reviewDate": "September 21, 2019",
            "reviewText": "Best grinder for travel and or camping. Small compact cylindrical chamber. Fits in a purse or backpack easily. Removable crank. Easy to wipe out and clean. Ceramic burr doesn’t burn the coffee beans like metal blades can. Manual crank works better than electric in that it is gentle on beans. coffee tastes creamier without bitterness from electric grinder. The work involved in manual grinding is gratifying and meditative."
        },
        {
            "reviewerName": "Dawnelle Rocks",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Great easy to use grinder",
            "reviewDate": "June 26, 2018",
            "reviewText": "This coffee grinder is just what I needed! I got some bagged coffee that I didn't grind enough for what i use it for and decided to pick this up so the bag didn't go to waste. It is so easy to use and adjust for a finer or course grind. I love that it is manual and does not require batteries or to be plugged in. Super easy to use, doesnt take up a lot of room either. I love that we can take it when we go camping too and grind our own beans to taste."
        },
        {
            "reviewerName": "Amazon Lover",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Works on Loose Dry Teas Leaves as well",
            "reviewDate": "August 2, 2018",
            "reviewText": "I bought this to grind dried tea leaves. It was a great work out....LOL."
        },
        {
            "reviewerName": "The Lawn Ranger",
            "rating": "3.0 out of 5 stars",
            "reviewTitle": "Not very quick or effective, but it does work...",
            "reviewDate": "August 20, 2018",
            "reviewText": "It works, but not very well, no matter how I adjust it. I have an old mostly plastic hand grinder from the 80s or 90s that works better. This one is slow - I need to grind with this one for several minutes or more even for 15 grams or less of beans, for just one cup - it's actually quicker and esthetically more satisfying and just as effective to use a mortar and pestle to do the job."
        },
        {
            "reviewerName": "noone",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Love my grinder",
            "reviewDate": "June 14, 2019",
            "reviewText": "I love this product! It grinds my coffee fast and easy. Cleaning it is simple. When you wash it, let it air dry for a while because it will hold moisture by the little window it has. It came on time and arrived in perfect condition. I recommend this product."
        },
        {
            "reviewerName": "Monique F.",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "works",
            "reviewDate": "September 7, 2018",
            "reviewText": "as advertised, not big enough to quickly make a whole lot for the gang, but perfect for one or two people"
        },
        {
            "reviewerName": "rachel",
            "rating": "3.0 out of 5 stars",
            "reviewTitle": "Dissatisfied",
            "reviewDate": "December 9, 2018",
            "reviewText": "Very slow grinder. Very coarse grounds. Attachment didn't stay tight. I have to occasionally tighten it. Very dissatisfied."
        },
        {
            "reviewerName": "narissa",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Small and efficient",
            "reviewDate": "April 25, 2019",
            "reviewText": "This grinder is nice for my trips. It packs well because of its size. It takes a while to grind beans, but I don't mind."
        },
        {
            "reviewerName": "Alex Villanueva",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Made is Stainless steel material and easy to use. Very compact for camping",
            "reviewDate": "July 11, 2019",
            "reviewText": "Bought this product coz I saw someone using it on YouTube. I love this grinder I could use it at home as well as outdoors"
        },
        {
            "reviewerName": "Pulpit Pounding Political Pundit",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Great for the RV!",
            "reviewDate": "June 22, 2019",
            "reviewText": "This plus a 4-cup French Press is a great combination!"
        },
        {
            "reviewerName": "Lynn",
            "rating": "1.0 out of 5 stars",
            "reviewTitle": "Not worth it.",
            "reviewDate": "September 3, 2018",
            "reviewText": "Worthless. After almost an hour and thousands of turn (and sore shoulder) I got about 2 tablespoons full. I tried adjusting it per the instructions but that didn’t help"
        },
        {
            "reviewerName": "Troy T.",
            "rating": "3.0 out of 5 stars",
            "reviewTitle": "Handle broke off",
            "reviewDate": "March 14, 2019",
            "reviewText": "Really good but at first but the handle broke off a few months after buying. Cheap starter but you'll need a better one soon after"
        },
        {
            "reviewerName": "JJ",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Bought as a gift",
            "reviewDate": "October 10, 2018",
            "reviewText": "Friend loves having this in his \"tiny house\""
        },
        {
            "reviewerName": "Suzanne Holcomb",
            "rating": "1.0 out of 5 stars",
            "reviewTitle": "You have to guess how to adjust the grind",
            "reviewDate": "September 1, 2018",
            "reviewText": "The directions were worthless"
        },
        {
            "reviewerName": "Mikelle",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Great!",
            "reviewDate": "August 16, 2018",
            "reviewText": "Bought as a gift. He loves it and says it works perfectly!"
        },
        {
            "reviewerName": "Reynaldo Williams",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Easy to use",
            "reviewDate": "April 5, 2019",
            "reviewText": "Great coffee grinder"
        },
        {
            "reviewerName": "wzacpt",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "What a great value and product!",
            "reviewDate": "November 30, 2018",
            "reviewText": "For a small hand grinder it works without flaw! Easy to adjust coarseness and a breeze to work! Makes for some great brew!!"
        },
        {
            "reviewerName": "b.david",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Great",
            "reviewDate": "October 13, 2018",
            "reviewText": "Great"
        }
    ],
    "qAndA": [
        {
            "question": "Would this work on cat litter? I know weird question but I need to make casting sand instead of buying it.",
            "answer": "I can’t say I have used it on cat litter. Sure don’t plan to try, either."
        },
        {
            "question": "Is the actual interior of the grinder where the coffee sits stainless steal or are there plastic parts?",
            "answer": "The knob that allows you to adjust the grind setting is plastic.\nThe grinder is ceramic, but there is also a PLASTIC washer-type insert with a stem on it that fits\ninside the ceramic grinder cone which is what determines a coarse, medium or fine grind. … see more"
        },
        {
            "question": "Can this grind herbs (dried tea leaves) without damaging the grinder?",
            "answer": "I use it to grind flax seeds and it does really well, so I am going to assume it can grind tea leaves, or other herbs, but I don't know for sure, because that's not what I use it for."
        },
        {
            "question": "Whats the finest possible setting?",
            "answer": "There are no settings. I've gotten a very fine blend out of it."
        },
        {
            "question": "can this grind flaxseeds?",
            "answer": "You should consider yourself lucky if it grinds ground cinnamon."
        },
        {
            "question": "can it be used to grind salt?",
            "answer": "I would think so, as my electric coffee grinder can."
        },
        {
            "question": "Country of origin?",
            "answer": "US"
        },
        {
            "question": "How many cups of coffee does it grind at a time?",
            "answer": "About 3-4."
        },
        {
            "question": "How high do you fill the canister with beans?",
            "answer": "To the very top."
        },
        {
            "question": "Will this grind fine enough for espresso?",
            "answer": "Yes, but it takes a loooooooong time. 5-8 minutes for espresso. I don't use it anymore. I had to put a drill on it just to get a small brew of coffee in 5 minutes.\nGood exercise though."
        },
        {
            "question": "What is the return policy?",
            "answer": "Not sure. I kept mine even though it didn’t work."
        }
    ]
}