{
    "title": "KRUPS GX420851, Coffee Grinder with Scale, 39 grind settings, large 14 oz capacity, intuitive interface, Black",
    "manufacturer": "KRUPS",
    "currentPrice": false,
    "rating": "3.5 out of 5 stars",
    "totalRatings": "30 ratings",
    "features": [
        "\n         Make sure this fits\n                by entering your model number.\n        \n",
        "THE PERFECT GRIND - The perfect amount of coffee, grounded on demand, at the touch of a button",
        "EASY TO USE INTERFACE - Just choose the number of cups and the Auto-Dose Grinder will automatically deliver the grinds to achieve the Golden Ratio for a balanced cup of coffee, every time",
        "LARGE GRINDING RANGE - Bean hopper designed for easy coffee filling with a large 14oz/400g capacity for an entire bag of coffee",
        "REMOVABLE HOPPER - It is designed to be easily removable to transfer coffee beans or cleaning",
        "HOPPER AUTO-SHUT DOORS - The bean hopper is engineered with auto-shut trap doors to hold the whole bean coffee when the hopper is removed from the grinder body. This allows the transfer of coffee beans to be stored when grinder is not in use"
    ],
    "reviewsAspects": [
        "every time",
        "burr grinder",
        "coffee grinder",
        "beans",
        "container",
        "machine",
        "scale",
        "amount",
        "grinds",
        "grounds",
        "cup",
        "mess",
        "error",
        "cuisinart",
        "everywhere",
        "grinders",
        "hopper",
        "jammed",
        "owned",
        "quieter"
    ],
    "productInformation": [
        {
            "Package Dimensions": "18.5 x 10.4 x 6.6 inches"
        },
        {
            "Item Weight": "6.25 pounds"
        },
        {
            "Shipping Weight": "6.25 pounds"
        },
        {
            "Manufacturer": "KRUPS"
        },
        {
            "ASIN": "B07L6VRLDF"
        },
        {
            "Item model number": "GX420851"
        },
        {
            "Customer Reviews": "3.5 out of 5 stars\n    30 ratings\n3.5 out of 5 stars"
        },
        {
            "Best Sellers Rank": "#79,072 in Kitchen & Dining (See Top 100 in Kitchen & Dining)\n#36 in Burr Coffee Grinders\n"
        },
        {
            "Date first listed on Amazon": "December 7, 2018"
        }
    ],
    "productDescription": [
        "Better coffee starts with a quality burr grinder. The Auto-Dose Grinder with Scale is built with stainless steel conical burrs to deliver consistent grind size for the optimal coffee extraction. Select from a range of 39 grind sizes for use in Espresso, Pour Over, Drip, Cold Brew, and French Press brewing methods. Adjust one grind size notch at a time to expose different flavors of your favorite coffee. Gain the ability to produce consistent results by precisely measuring your grind quantity. The integrated scale on the Auto-Dose Grinder with Scale automatically doses by weight, giving you the best coffee taste. Choose to dose by cups, grams, ounces, or through manual operation of the grinding cycle. To preserve the delicate flavors of coffee, always grind right before you brew. Brew like a pro barista, without being one, by programming the exact dose you need for your daily routine. And grind exactly the amount you need to maximize the usage of every single coffee bean.",
        "Just choose the number of cups and the Auto-Dose Grinder will automatically deliver the grinds to achieve the Golden Ratio for a balanced cup of coffee, every time. Choose to grind automatically by selected Cups, Grams, or Ounces. Or grind in manual mode for absolute control.",
        "Select from a range of very fine to coarse grind profile with 39 grind sizes for Espresso, Pour Over, Drip, Cold Brew, and French Press brewing methods. Adjust one grind size notch at a time to expose different flavors of your favorite coffee.",
        "Large 14oz/400g whole bean hopper capacity can hold up to an entire bag of your favorite coffee. It is also designed to be easily removable to transfer coffee beans or cleaning.",
        "The bean hopper is engineered with auto-shut trap doors to hold the whole bean coffee when the hopper is removed from the grinder body. This allows the transfer of coffee beans to be stored when grinder is not in use.",
        "The stainless steel conical burrs was designed and engineered to deliver consistent coffee grinds while preserving the optimal taste.",
        "The Auto-Dose grinder can deliver a range of grind sizes from the finest to the coarsest results. The wide grinding range allows you to brew coffee with your favorite brewing method. Allowing for experimentation of different coffee brewing techniques and giving you absolute control over the results.",
        "Bean hopper designed for easy coffee filling with a large 14oz/400g capacity for an entire bag of coffee.",
        "The pour over dripper is included in pack.",
        "\t\t\t\n\tKRUPS F203 Blade Grinder\tKRUPS GX5000 Burr Grinder\tKRUPS Auto-Dose Conical Burr Grinder with Scale\nPerfect for\tCoffee Lovers and Cooking Enthusiasts who appreciate the elevated taste of fresh spices and ground coffee beans\tCoffee Lovers who desire more control over the size and uniformity of their freshly ground coffee to maximize taste\tCoffee Aficionados who expects extreme accuracy in grind consistency and quantity control for professional level brewing\nGrind Size Settings\tManual control\t9 grind size settings\t39 grind size settings\nFor Espresso, Filter, Cold Brew, and French Press Grinding\t✓\t✓\t✓\nFor Small Batch Grinding\t✓\t✓\t✓\nFor Versatility : Spices, Herbs. Coffee\t✓\tCoffee only\tCoffee only\nSuitable for Dark, Medium, or light Roast Beans\t✓\t✓\t✓\nProduct Attributes You'll Appreciate\tCompact for easy storage, Easy-pour spout, High speed grinding to tackle a wide range of ingredients: coffee beans, flax seeds, peppercorn, cumin, cinnamon sticks, almonds, walnuts, etc.\tLarge bean hopper, Easy to use dials for grind size and amount selection, Built-in grinding brush, Low noise\tBuilt in scale for precise coffee brewing, Low noise, LED display\nGrinding Mechanism\tStainless Steel Blade\tMetallic flat burr\tStainless steel conical burr\nBean Hopper Capacity\t3 oz. (10-12 cups)\t8 oz. (30-32 cups)\t14 oz. (52-54 cups)\nCleaning Brush Included\tNot included\t✓\t✓"
    ],
    "reviews": [
        {
            "reviewerName": "Peter R.",
            "rating": "1.0 out of 5 stars",
            "reviewTitle": "Grind switch stopped working after three months - Unit is dead",
            "reviewDate": "June 16, 2019",
            "reviewText": "Update - June 21, 2019:\n----------------------------------------------\nKrups Warranty process is unnecessarily slow. Here's the process:\n- Email Customer Support - 3 business days until they responded.\n- Response states that a shipping label will be sent in two business days - Never received the email with the label.\n- Once the item is shipped back and received - TWO to THREE weeks for them to determine whether to repair or replace.\n\nTotal time to receive a fixed grinder, assuming the rest of their timeline pans out and Krups doesn't ship via PONY EXPRESS: 5 weeks.\n\nThe more cynical side of me would think this is a corporate delay strategy to get the customer to just give up on the claim.\n\nOriginal Review - June 16, 2019:\n----------------------------------------------\nPros:\n- Set it and forget it - the 12 cups setting with the proper grind turned out flavorful coffee. No more guessing on the amount. Smaller amounts also were perfect for us.\n- Quiet - this unit was quite a bit quieter than our KitchenAid.\n\nCons:\n- The GRIND switch stopped working after ONLY three months of near daily use. VERY DISAPPOINTED. Now I have to weave my way through Krups' warranty process (supposedly two years if I read it right) to hopefully get this unit replaced quickly.\n- Coffee beans don't always feed and the unit periodically grinds air. This could be our particular brand of bean (Peets whole beans, which tend to be oilier than local roasters), but we find ourselves having to shove the handle of a plastic spoon into the hopper to restart the feed process at least one every seven days.\n\nNote, should I receive a positive, quick reply from Krups I will update this review to reflect that."
        },
        {
            "reviewerName": "Number1Gal",
            "rating": "4.0 out of 5 stars",
            "reviewTitle": "Almost Perfect",
            "reviewDate": "June 17, 2019",
            "reviewText": "Bought the coffee grinder with scale after the Cuisinart I had for about 8 years finally gave up the ghost. I have to say, this grinder is fantastic and the flavor it brings out of the beans is so much better than my old grinder. There is one design flaw, IMO, that keeps it from being perfect. The grounds fall into the container from the top, which end up making a mess when you remove the container and grounds fall from the mouth onto the scale. I'll try tapping each time before pulling the container and hopefully that will prevent loose grounds from falling on the scale and counter every day. My old grinder tossed them in from the side, so this was not an issue."
        },
        {
            "reviewerName": "PBota",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Handles as much as you want/need and works GREAT!!!",
            "reviewDate": "May 17, 2019",
            "reviewText": "I had a different brand burr grinder, it was a pain to clean, left coffee dust everywhere and could only handle a small amount of coffee at a time. Then it jammed up underneath the plastic plates and never worked good after clearing the jam. This grinder will handle almost a pound of beans at a time and grinds much quieter than the other model I owned as well as about half the noise level. The grind and drop down into the ground container is a great design and simple to clean with very little coffee dust left around the counter. While it seemed large, it actually takes up just a little more overall space than many \"compact\" burr grinders. All metal burr's, great choice and recommended for all."
        },
        {
            "reviewerName": "JPM.Cuisine",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "The most versatile grinder ever",
            "reviewDate": "September 4, 2019",
            "reviewText": "This grinder has all the grind settings you need to dial in from coarse french press to fine turkish coffee. You can get the perfect grind for your cup. You adjust the grind on this one before you start grinding vs the other grinders where you waste a bit having to adjust while it's grinding. It weighs in cups, oz, and grams and you can even select servings. I use 46-60g for my French press and it's pretty much automatic and on point every time. You want this grinder!"
        },
        {
            "reviewerName": "LOU",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "A really decent grinder!",
            "reviewDate": "June 14, 2019",
            "reviewText": "Compared to the highly rated disk burr grinder I replaced, this one gives a consistent grind (not a lot of dust), is quieter, doesn’t try to spit out the grounds fast enough to almost etch the container and does not give enough static electricity to hold the coffee dust to the sides of the container. You MUST read the directions. My one minor complaint is that the size of the cups does not agree with the size on my Cuisinart carafe. My 4 mugs of coffee uses 8 cups on the carafe but now needs 6 cups indicated on this grinder for a “good” cup of joe."
        },
        {
            "reviewerName": "Mickey La Bronx",
            "rating": "3.0 out of 5 stars",
            "reviewTitle": "Decent grinder with a initial learning curve",
            "reviewDate": "October 4, 2019",
            "reviewText": "3/5 stars. This grinder has a learning curve. The very first time I used this, the display showed: Err (error). The machine shut down. I pressed buttons, unplugged it, plugged it back in, etc. I determined it must be jammed on the first try. The machine will also not work if the top plastic container that holds the beans is not locked in properly which is hard to determine at first. It’s working now. Let’s see how long it lasts."
        },
        {
            "reviewerName": "MomOf1",
            "rating": "1.0 out of 5 stars",
            "reviewTitle": "Jams Constantly and Makes a Mess!",
            "reviewDate": "October 30, 2019",
            "reviewText": "We invested in this grinder hoping to receive a quality grinder, only to be incredibly disappointed. Honestly, we were way happier with our $35 Cuisinart grinder that this grinder was bought to replace after years of use! The grinds go everywhere during the grinding process and when you open the reservoir to dump them out, making an absolute mess. But, worse than that, the machine jams constantly. It's currently taking us about 1-2 minutes to get enough coffee ground for a pot of coffee (there's lots of plugging, unplugging, banging, and doing whatever else we can to get the thing to grind!). We've only owned the machine 7 months. We'll be replacing this ASAP, which is so frustrating after spending so much on the grinder."
        },
        {
            "reviewerName": "Edward R",
            "rating": "1.0 out of 5 stars",
            "reviewTitle": "Going to buy a manual grinder",
            "reviewDate": "May 22, 2019",
            "reviewText": "Only had this a month. Jams jams jams jams!"
        },
        {
            "reviewerName": "Jacci",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Perfect bean grinder, pleased with purchase",
            "reviewDate": "August 17, 2019",
            "reviewText": "I was a little hesitant after reading reviews before purchasing, but I love this coffee grinder! It is so easy to use, the recommended cups per water is right on, and the hopper holds a good amount of beans. The product is louder than I would prefer, but understandable since it is grinding."
        },
        {
            "reviewerName": "z",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "LOVE THIS THING",
            "reviewDate": "June 15, 2019",
            "reviewText": "It measures out the resultant coffee, which is amazing, and the burr grinder is quick, and makes very evenly-sized grinds. This thing is great, the best grinder I've ever had."
        },
        {
            "reviewerName": "Jansen",
            "rating": "1.0 out of 5 stars",
            "reviewTitle": "You will SPEND TIME doing maintenance, for NOTHING, and it will still JAM JAM JAM.",
            "reviewDate": "October 15, 2019",
            "reviewText": "This grinder will JAM. Do not use it. You'll get an error message almost every time. Making coffee should be relaxing. Imagine you had to remove a screw off a wall every day, and every single one of those screws stripped and you could get it off. Yeah, thats how this MF'in Krups, excuse me, Kraps machine. Dont add stress to your day. Buy something else. I hope Kraps goes out of business."
        },
        {
            "reviewerName": "PhdG",
            "rating": "1.0 out of 5 stars",
            "reviewTitle": "Poor Quality Control",
            "reviewDate": "February 17, 2019",
            "reviewText": "Defective right out of the box, displayed the “jammed” Err message on the first attempt to use it"
        },
        {
            "reviewerName": "Bpatton07",
            "rating": "3.0 out of 5 stars",
            "reviewTitle": "Makes a mess.",
            "reviewDate": "November 2, 2019",
            "reviewText": "Easy to use. Easy to clean. But it sprays coffee grounds all over the place. The spout needs to be longer so that it goes directly into the catch container."
        },
        {
            "reviewerName": "ampwurx02",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Great product",
            "reviewDate": "May 9, 2019",
            "reviewText": "Love it. Works perfect. I never expected a grinder to be silent... none are easy to clean unless you want cheap and throw away."
        },
        {
            "reviewerName": "Amazon Customer",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Yes.",
            "reviewDate": "April 7, 2019",
            "reviewText": "Love it. Quality and it looks good."
        },
        {
            "reviewerName": "Dominic",
            "rating": "4.0 out of 5 stars",
            "reviewTitle": "Great Grinder but messy",
            "reviewDate": "June 29, 2019",
            "reviewText": "Great coffee grinder with a perfect amount every time. Grinds go everywhere during the grind tho making a large mess"
        },
        {
            "reviewerName": "EngineeringMom",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "A grinder for the nerd in me",
            "reviewDate": "July 13, 2019",
            "reviewText": "Makes the same strength coffee every time."
        },
        {
            "reviewerName": "dru00d",
            "rating": "1.0 out of 5 stars",
            "reviewTitle": "I returned it immediately. Don't waste time buying this!",
            "reviewDate": "May 27, 2019",
            "reviewText": "Grinding quality is poor, and the machine smells weird.\nNOPE, don't put any hope into this machine."
        },
        {
            "reviewerName": "luz pumarejo",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Good grinder",
            "reviewDate": "October 3, 2019",
            "reviewText": "Very easy to use"
        },
        {
            "reviewerName": "Amazon Customer",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Very good product just whst",
            "reviewDate": "October 23, 2019",
            "reviewText": "Very satisfied"
        },
        {
            "reviewerName": "allenrt22",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "grinder",
            "reviewDate": "April 3, 2019",
            "reviewText": "I've used it for a month now and , so far, it's awesome. No issues"
        },
        {
            "reviewerName": "Jerry Rowley",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Excellent!!",
            "reviewDate": "March 11, 2019",
            "reviewText": "Unbelievable grinder for the money."
        },
        {
            "reviewerName": "Cody B.",
            "rating": "1.0 out of 5 stars",
            "reviewTitle": "DO NOT BUY",
            "reviewDate": "September 5, 2019",
            "reviewText": "Worst grinder I have ever purchased. It stopped working after 4 uses"
        },
        {
            "reviewerName": "Richie_S.",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Compact and Feature-Rich",
            "reviewDate": "March 12, 2019",
            "reviewText": "I use this grinder in conjunction with the Oxo BREW Single Serve Pour Over and it’s a perfect pair. The Oxo’s basket fits perfectly on the Krup’s base and the “tare” function allows it to easily grind directly into the dripper. This also allows to me avoid any static issues with the included plastic container.\n\nThe grinder isn’t loud in comparison to other grinders I’ve owned (and there have been plenty) and it remembers your last measured amount. I grind using grams, but “cups” and “manual” grind modes are also available. I store a weeks worth of beans in the removable hopper and haven’t noticed any freshness issues.\n\nThe grinder also comes with a pour over basket and a cleaning brush. The metal base of the grind is removable for easy cleaning. You’ll be hard pressed to find a more feature-rich grinder in this price range."
        },
        {
            "reviewerName": "Phaedra MckB",
            "rating": "1.0 out of 5 stars",
            "reviewTitle": "Extremely disappointed in this purchase and here is why!",
            "reviewDate": "June 4, 2019",
            "reviewText": "I am finally done and returning this grinder. From the first use we had issues with the beans not dropping into the burr and the machine would error. This is not a cleaning issue, it happened the very first time using and EVERY time after. The \"Golden Ratio\" grind setting for 10 cups barely fits into my Bunn coffee maker and if I use a grind setting that is more than 5 cups it over flows the grounds on the coffee maker. I am tired of standing next to the grinder and having to reset it no less than four times to finish a grind. I am past done with having to figure out a complex mathematical equation just to find a grind cup/weight so that my maker doesn't overflow and actually fits into the basket. For a $100+ grinder I am disappointed."
        },
        {
            "reviewerName": "Allen Stairs",
            "rating": "3.0 out of 5 stars",
            "reviewTitle": "Underwhelming",
            "reviewDate": "July 7, 2019",
            "reviewText": "This grinder does more or less what it's supposed to do. But...\n1) The grind is inconsistent, and whole beans end up getting through on settings where you really shouldn't expect it.\n2) Sometimes undectable misalignments in the placement of one or another part will keep it from working.\n3) There's no obvious way to clean out the old grinds properly.\n\nThe main thing this product convinced me to do was to get a good hand grinder, because frankly if I'm just making a cup for myself it's a lot less fuss with a lot more consistency."
        },
        {
            "reviewerName": "Bob S",
            "rating": "3.0 out of 5 stars",
            "reviewTitle": "A good concept when it works consistently regarding it's key feature, the built in scale.",
            "reviewDate": "May 12, 2019",
            "reviewText": "The size is good, the noise level is acceptable, the grind size seems consistent enough. I use it for french press so mostly on the course grind setting. Has plenty of settings. The issue is that the feature that weighs the coffee as its dispensed to you setting only works right about 60% of the time. The scale is very touchy and I have to re-tare it often with the empty canister. Even when I do it sometime only dispenses half or less what it is set to dispense. Usually if I unplug/replug the machine and let it reset that way it will work ok for a few days then I have to do it again. The control panel method of setting the tare indicates it works but it doesnt always stay, Meaning I usually set for 45g of coffee to be dispensed. A little over half the time it does that plus/minus a little. However other times even when the tare is set to the empty canister it only dispenses half (20g) or less coffee I set the controls to. Therefore I have to futz with my separate scale and keep grind coffee in batches to get what I need. I think the overall concept of this coffee grinder with a built in scale is great but it still needs some fine tuning. Been using it for over a month and I kept it as I know how to work around the issue but shouldnt have to."
        },
        {
            "reviewerName": "Ira",
            "rating": "3.0 out of 5 stars",
            "reviewTitle": "Would not recommend - hard to clean and no actual fine grind.",
            "reviewDate": "September 23, 2019",
            "reviewText": "Kept it too long deciding whether to keep or not so cannot return it. But we would not recommend it for a couple of key reasons. One, it is very difficult to clean (have to unclamp the bean container from within the grinder using a lot of hand strength and twisting to unsnap it to get it out. They you have to use brushes to clean out the interior and usually awkwardly have to hold it upside down and bang on it to get all the grinds out. Then a thorough wipe down. Too much work - and because it doesn't do a really fine grind for espresso, the taste isn't to our liking."
        },
        {
            "reviewerName": "Kelly",
            "rating": "3.0 out of 5 stars",
            "reviewTitle": "Should work better for the price",
            "reviewDate": "August 1, 2019",
            "reviewText": "The beans dont fall down while the grinder is on. So it needs to be shaken to get the full amount. If I dont catch it, it will error out and there is no way to get the right amount once it errors."
        },
        {
            "reviewerName": "Jeovany Rodriguez",
            "rating": "4.0 out of 5 stars",
            "reviewTitle": "Nice grinder",
            "reviewDate": "July 31, 2019",
            "reviewText": "Great grinder the only issue I have is when you stop grinding you have a bit of what your grinding left behind and falls on the scale instead in the cup."
        }
    ],
    "qAndA": [
        {
            "question": "What is the grounds container made of?",
            "answer": "Hello ...\n\nMichael Allison the container is hard plastic thank you very much for your question"
        },
        {
            "question": "why are all the reviews for dozens of unrelated products? this is a disaster of a product page.",
            "answer": "Not sure but I bought a burr grinder. I think they have similar product number"
        },
        {
            "question": "Is it compatible with 220v?",
            "answer": "No, just 110v"
        },
        {
            "question": "How tall is this thing when sitting on the counter?",
            "answer": "The exact height measurement is 13.5\""
        },
        {
            "question": "Does anyone have a problem with the beans not filtering down in the hopper? Ours just runs and the motor finally stops and errors out?",
            "answer": "I have used it to grind flax seed and peanuts. Have had no issues. Grinds these things to powder form."
        },
        {
            "question": "Capacity in # cups from drip coffeemaker? Will it grind and hold enough, in one pass, for 14 cups?",
            "answer": "Yes, just be sure to turn grinder upside down, before slipping it off.trust me , if u don't , then u know how much it will hold😂"
        },
        {
            "question": "Where is this made?",
            "answer": "China"
        },
        {
            "question": "why are all the reviews for dozens of unrelated products? this is a disaster of a product page.",
            "answer": "Same product number. Same issue when you look it up on line"
        },
        {
            "question": "How many cups can it grind in one go?",
            "answer": "1.75 cups"
        },
        {
            "question": "What is the watt of GX420851",
            "answer": "It says “200w” on the bottom of my Krupa coffee grinder."
        },
        {
            "question": "Does $110 krups burr grinder gx420851 grinds fine enough to make real espresso coffee? please don't answer if you don't know/make espresso!",
            "answer": "The Krups has 39 different grind settings from fine (espresso grind) to Coarse (French press grind). I hope that answers your question."
        },
        {
            "question": "In the weight mode (auto doser model), the tare did not reset the scale to zero but remained at 3g. Is it initially preset at 3g instead of 0g?",
            "answer": "Have most inexpensive Burr grinder which does not weight anything."
        },
        {
            "question": "Why are the reviews for the blade grinder attached to a completely different product (krups gx420851, coffee grinder with scale)? it’s misleading.",
            "answer": "Never ordered one"
        },
        {
            "question": "In the weight mode (auto doser model), the tare did not reset the scale to zero but remained at 3g. Is it initially preset at 3g instead of 0g?",
            "answer": "I always see mine at 3g I use weight or just normal cup size"
        }
    ]
}