{
    "productInformation": [
        {
            "Package Dimensions": "8.5 x 5.2 x 5 inches"
        },
        {
            "Item Weight": "2.5 pounds"
        },
        {
            "Shipping Weight": "2.5 pounds (View shipping rates and policies)"
        },
        {
            "ASIN": "B07NYVDTQF"
        },
        {
            "Customer Reviews": "4.7 out of 5 stars\n    182 ratings\n4.7 out of 5 stars"
        },
        {
            "Best Sellers Rank": "#9,345 in Kitchen & Dining (See Top 100 in Kitchen & Dining)\n#16 in Electric Coffee Blade Grinders\n"
        },
        {
            "Date first listed on Amazon": "February 20, 2019"
        }
    ],
    "productDescription": [
        "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n      \n\n\n    \n    \n        \n    \n\n\n\n\n\n",
        "SHARDOR is specialized in kitchen small appliance. Main products include hand mixer, electric blade coffee grinder, burr coffee grinder and kettle.",
        "SHARDOR will be committed to kitchen small appliance and will develop and launch durable cooking tools constantly.",
        "SHARDOR CG715S has a stainless steel outlayer, which is sleek and fits nicely under most kitchen cabinets.",
        "High-quality stainless steel blades and 200-watt powerful motor grind coarse powder in 5 seconds, which unlocks the delicious characteristics of the roast coffee right before brewing. The lid activates the switch mechanism, allowing you to customize the settings by yourself. No matter which coffee machine you use, SHARDOR brand grinder is a good choice for you.",
        "\n",
        "\n",
        "\n",
        "Stainless steel blade of good quality offers powerful and quick performance, grinding coffee beans sharply and evenly.",
        "Press down the lid to activate the 3 switches and release to stop. In seconds your favorite coffee beans are ready for brewing.",
        "4 to 12 cups coffee available. Removable bowl, which holds 70g, is easy to clean.",
        "\n",
        "\n",
        "\n",
        "The time of pressing the lid decides how fine the powder would be. You can stop at any time you want.",
        "The seal ring presses the rim of bowl tightly during the working process, effectively prevent coffee powder splashing out of it.",
        "Good at grinding coffee bean, spice, nuts. Nice helper in your kitchen.",
        "Put some beans into the bowl with the included spoon.",
        "\n            The amount of bean should be at least cover the blade to prevent blade spinning while not cutting. And the amount should not be over the MAX line, which would cause overloading working.\n        ",
        "\n            Put your hand on the lid and push down to activate the switch. You can stop at any time when you think the powder is ok.\n        ",
        "\n            Pour over the powder from the bowl with the included brush.\n        ",
        "Step 1",
        "Step 2",
        "Step 3",
        "Step 4"
    ],
    "reviews": [
        {
            "reviewerName": "Teri E.",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Good to grind",
            "reviewDate": "May 9, 2019",
            "reviewText": "This review is for the Silver Shardor Coffee Grinder Model number CG715S. We had a German coffee grinder for many years that finally the blades broke, so we were in the market desperately for a new one at a reasonable price. This coffee grinder is a beast with a 200 watt motor that makes short work of grinding beans. This model comes with one basket so it is exclusively for coffee beans. We grind for drip coffee and it takes about 15 seconds total grinding for how we like it. The noise level is what you would expect. The basket that contains the blades is nice and large. It's very easy to use, remove the grinding basket and pour your ground coffee into your coffee maker. You can clean up the basket with the supplied little brush which is handy. I think this is an exceptional, nice looking, quality unit. It has more than met my expectations."
        },
        {
            "reviewerName": "S. DeRuiter",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Nice grinder",
            "reviewDate": "May 5, 2019",
            "reviewText": "I bought this as a gift for my husband that loves fresh ground coffee and drinks a LOT of it! It is not very loud and based on the amount of time you grind creates perfectly ground coffee in no time.\nThere are no fancy extra chambers or buttons...simply add in the beans, snap on the clear top and push down. Has performed perfectly since we opened the box."
        },
        {
            "reviewerName": "Foreverjaded",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Must have for an Expresso drinker (and full time mom of 2 under 2)",
            "reviewDate": "July 9, 2019",
            "reviewText": "In 30 seconds I have expresso fine coffee. The blender has a pretty large capacity but I just blend 2 servings worth each morning to start my day. Im sure it can be used to blend dry spices as well. The blender is a power house!"
        },
        {
            "reviewerName": "Bluedevil01",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Easy to use. Good grind for drip or percolator",
            "reviewDate": "June 8, 2019",
            "reviewText": "I bought this to replace my current bean grinder. It is a smidge quieter than it seems on the video and 50% quieter than the one I already had. I grind beans for a stovetop percolator and a drip coffee maker. Works great for that.\nThe bowl comes off easy so I can dump the grounds right into the basket."
        },
        {
            "reviewerName": "boss_man",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Very First Spice Grinder!",
            "reviewDate": "July 21, 2019",
            "reviewText": "First time owning a spice grinder, I been using Magic Bullet Blender as an all in one till now. Actually I been in the market for one of these bad boys but never had time get one that is worth it. I was recommended to give this a try.\n\nAt first, I thought the bowl wasn't deep enough but was surprisingly holds a good amount. Overall, restaurant quality and I really love the stainless-steel housing and blades, they don't disappoint. Even the lid seems durable from what I can say from few days of using it. I been using for more than spices like chopped tomatoes, onions with spices to make pastes and the motor is powerful enough to coarse it within seconds.\n\nAlso, it is super convenient and easy to clean. Everything from the blade to the bowl is removable which makes cleaning a lot easier. The measurement markings are definitely a plus.\n\nCompared to the Magic Bullet Blender this one is not as loud or about the same depending on the content. I was hoping for multiple blade variations and bowls. This will do for now. Hopefully, they'll sell bowls and blades separately. I might just switch to this as my new all-in-one grinder. Plus, these are pretty valuable housewarming gifts.\n\nEdit:\nFirst time I ran the grinder smokes came out but I haven't had any after but I'll be checking with the seller to make sure."
        },
        {
            "reviewerName": "Jami",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Works well and easy to clean.",
            "reviewDate": "June 7, 2019",
            "reviewText": "This grinder is not nearly as loud as our old one. I like that the bowl is removable. That makes it much easier to use and clean. My wife loves the brush spoon combo that came with it. Grinds fine enough for espresso but can grind a coarser grind for a drip coffee maker too."
        },
        {
            "reviewerName": "Ahbi",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Great grinder",
            "reviewDate": "June 30, 2019",
            "reviewText": "Main purpose for me to buy this grinder is to grind spices. And till now it has worked good. Best part is metal bowl so that i can grind hot tomato to make tomato pickle serving 2 people easily. The plastic bowl i had previously cracked after putting hot things on it. It also works great to make garlic ginger paste. I am not a coffee lover but this coffee grinder has help me a lot in preparing other food."
        },
        {
            "reviewerName": "SherBear",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Not Just for Coffee Beans!",
            "reviewDate": "June 1, 2019",
            "reviewText": "Purchased this specific coffee grinder because it has a removable bowl which makes it so easy for cleaning. I use it for grinding so much more than just coffee beans which is why cleaning it out is so important. I dont want my ground pepper or ground cinnamon sticks mixing in with my ground coffee beans. Cleaning it is so easy and it works wonderfully!"
        },
        {
            "reviewerName": "best buy",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Work Great",
            "reviewDate": "June 2, 2019",
            "reviewText": "I love the coffee made by fresh coffee bean with the machine. I find It easy to empty and clean with great shape. It is also not a very noisy. I think it is fast and powerful. It does not take big space in my kitchen. I love it and recommend"
        },
        {
            "reviewerName": "Shihab",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Perfect for grinding",
            "reviewDate": "July 3, 2019",
            "reviewText": "Wow this grander is really good. Very easy to clean up. Quality is also good of this product. It comes with replacement warranty."
        },
        {
            "reviewerName": "Nancy",
            "rating": "2.0 out of 5 stars",
            "reviewTitle": "began smoking in first 20 seconds",
            "reviewDate": "July 28, 2019",
            "reviewText": "I bought this due to great reviews and always wonder which are real and which are not. every time I have a bad experience these sellers are emailing me to offer me free product if I will change it to 5 stars or remove. I'm not removing this review and only being honest. Not a good system if we have sellers that send you a faulty product only to ask you take your review down or change to five stars and i'll give you a free one. I don't want a free one...I wanted one that works and was mortified the motor blew up in 20 seconds as recommended for expresso. I've tried several brands and have not found one that grinds fine and none of those smoked the motor. be careful if you order this...it is really pretty so very disappointed the motor could not handle the operation."
        },
        {
            "reviewerName": "Nick",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "must have Kitchen appliance",
            "reviewDate": "July 7, 2019",
            "reviewText": "Being an Indian, I use a lot of spices in m day to day cooking. Being an Indian living in the USA, I have to do this more often because we don't get such good spice mix powders as in India here. I also love coffee, and the readymade ground coffee isn't fresh enough.\nThis is a perfect handy kitchen appliance for all these problems. First, it is so small. So little amount of things get ground very well too unlike the big grinders needing a lot of stuff every time. Second, it doesn't feel like a lot of work to wash this, since it is small. Third, the grinder is powerful enough to grind spices or coffee beans, which allows me to use fresh materials almost every time."
        },
        {
            "reviewerName": "Matt H",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Thank God for electric coffee grinders",
            "reviewDate": "April 24, 2019",
            "reviewText": "Last time we bought coffee my roommate bought a bag of unground beans at Costco by accident. We didnt have a coffee grinder, so he bought a manual crank one. That thing was hell. Ever since this coffee grinder has arrived my mornings have been a piece of cake. For one I can grind more than one cups worth of coffee at a time....which is amazing. The fact this does all the work for me is AMAZING. The quality of this grinder is great. It feels sturdy and solid. I think its gonna last a long time. Its easy to use and is quick. It looks great on my counter with all my other kitchen gadgets too. Pretty happy with this grinder. Price to quality ratio is good here."
        },
        {
            "reviewerName": "seattlejanie",
            "rating": "2.0 out of 5 stars",
            "reviewTitle": "big mess of coffee",
            "reviewDate": "October 31, 2019",
            "reviewText": "I've been buying coffee grinders since the 80s, I've never had one that was so difficult to get the grinds from the grinder to the coffee basket as this. Just a poor design, if you detach the metal basket (great idea if there wasn't so much fly away coffee dust) it will attach to everything in sight. Especially the bottom part of the grinder that houses the motor, which I expect would definitely shorten the life to have debris work its way down into the motor of the grinder.\nI tried keeping the basket attached while dumping the grinds, as I'm used to grinders that have no detachable basket. It only helped a bit. This generates so much static electricity that fine grinds are everywhere & you can't clean them off without busting out a vaccuum cleaner or washing the washable parts every time.\nReally wanted to love this grinder as it looks good, is reasonable & grinds ok. But it's not even an option to grind it really coarse to avoid the fine dust - if you don't grind thoroughly the bottom half of it is all chunky beans. Will have to return, unfortunately, no way I'm dealing with mess in my kitchen every day. The metal basket that holds the beans is huge, but if you only fill to the fill line its the same as smaller grinders like bodum or my old vintage braun."
        },
        {
            "reviewerName": "cwconline",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Great product and customer service",
            "reviewDate": "September 2, 2019",
            "reviewText": "This coffee grinder is very powerful and easy to use. I was worried that it might be too loud, but to my surprise, it is much quieter than the one I had before. It grinds coffee beans quickly!\nIn the box theres a note indicating you can extend you warranty by contacting the seller. I emailed them and they responded in 24 hours. Not only did they extended my warranty but also extended the replacement time. I am happy with their product and customer service!"
        },
        {
            "reviewerName": "Lindsay Wilson",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Removable Bowl is Essential in a Coffee Grinder",
            "reviewDate": "April 20, 2019",
            "reviewText": "Easy to use, love the removable bowl, safe. I use coffee grinders for more than just coffee (to make almond flour, powdered sugar, etc). I hated washing it in the sink with the cord attached. The removable bowl is an great feature to actually wash out the inside before its next use."
        },
        {
            "reviewerName": "Martine",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Pricey, but a good grinder!",
            "reviewDate": "June 22, 2019",
            "reviewText": "1. Price was high, not too happy about that.\n2. Grinder grinds fast, and well. Did a batch of coffee beans and got an espresso fine grind easily. Did Indian spices - coriander seeds, and got a fine ground dust, great!\n3. Stainless steel cup - yay!\n4. Cup comes out for cleaning - hurrah!!!!! This is the best feature!\n6. Nice looking stainless steel exterior.\n\nConsidering how tough it is to find a good spice grinder, I highly recommend this product. Bosch is unreliable. If made in Spain it works, if made in Mexico it does not. Cuisinart grinder is hopelessly slow and useless. There are very few choices. Buy this and you won't regret it. Wish they sold replacement cups as well. I would buy a few spares."
        },
        {
            "reviewerName": "Hi_From_Me",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Great Little Grinder",
            "reviewDate": "June 14, 2019",
            "reviewText": "I needed to replace my old coffee grinder because my roommate melted my old one! (She left it sitting on top of the toaster oven...then used the toaster oven at a very high temp. Sad.) I can't lie, my requirements were simple.\n1. Nice Looking\n2. Small (My kitchen is literally about 5 square feet, and we have only one 1' counter - which is how the old grinder got melted....everything gets stacked on everything else.) I digress.\nThis grinder fit both requirements. It's nice looking - neutral, metallic. Bonus - it's smaller than my old grinder and gets its own tiny spot next to the microwave, so no melting this one on the toaster oven! Yay!) Not any louder than my old kitchen aid grinder."
        },
        {
            "reviewerName": "Amazon Customer",
            "rating": "1.0 out of 5 stars",
            "reviewTitle": "The worst product ever",
            "reviewDate": "July 1, 2019",
            "reviewText": "It did not work at all and the blade and supporting components fell apart on second use. The first use I couldnt get the coffee beans to grind up. Dont buy this product."
        },
        {
            "reviewerName": "Ken L.",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Good Quality",
            "reviewDate": "April 22, 2019",
            "reviewText": "Solidly Built product. I use for grind my coffee every morning. I love the removable cup easy to clean. Not a lot of the coffee grinders on the market have this feature. Because they are so easy to clean I also use for chopping garlic and onion, I find they work well as a kitchen tools as well."
        },
        {
            "reviewerName": "Shopaholic",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Electric being grinder",
            "reviewDate": "October 13, 2019",
            "reviewText": "Finally got to purchase electric bean grinder for coffee and for black sesame seeds its good for health so we decided to purchase this item on Amazon inexpensive stainless steel easy to clean very powerful and easy to use.\nIts dishwasher safe compact so it could be stored away easily.\nI am sure we can use it other items like green onions ginger garlic black sesame etc... also comes with a spoon and cleaning brush."
        },
        {
            "reviewerName": "Veronica Ryan",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Super easy to use",
            "reviewDate": "May 16, 2019",
            "reviewText": "I literally burned up my last coffee grinder. I love coffee and using beans instead of ground coffee taste so much better to me. I found this coffee grinder and when I read that it had a detachable cup I knew I wanted to try it. The price was reasonable. I love it. It is so easy to use and fast. The cup allows for easy pouring and for easy cleaning. I couldn't remove cup on my last one so I never really got it clean."
        },
        {
            "reviewerName": "Grace",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "I enjoy to use it",
            "reviewDate": "August 30, 2019",
            "reviewText": "I use this grinder to make coffee each day and am super impressed by the output of this little machine. It is a tiny workhorse and gets the coffee beans to the right consistency for use in a french press. I have used this to make a finer raw sugar powder and it also did the job. It is a tiny bit hard to clean, but without having too many detachable parts the only piece that can be completely washed in the dishwasher is the lid. So far wiping out the inside between uses is working all right."
        },
        {
            "reviewerName": "Miranda",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Quiet coffee grinder",
            "reviewDate": "September 4, 2019",
            "reviewText": "This grinder was a little more expensive than other grinders that we looked at but, I bought it because of the wonderl reviews. NormaIly, I make 4- 6 cups every day. I have gotten a great ground consistently and I am very happy with the quality and amount of beans that you can grind at once. I love that cleanup is easier due to the removable cup the beans go in."
        },
        {
            "reviewerName": "Angie",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Perfect size and easy to organize",
            "reviewDate": "October 26, 2019",
            "reviewText": "Im very satisfied with the grinder. I wanted a separate grinder just for coffee, not to big and easy to organize. It comes with a brush to I can clean the bottom. The volume is perfect for the coffee for the week which is exactly what I want. I dont have that much time to grind fresh coffee everyday, so I can so one jar for the whole week, and its still fresh to me."
        },
        {
            "reviewerName": "Nikul Patel",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Cute little grinder",
            "reviewDate": "August 14, 2019",
            "reviewText": "We use this grinder daily for coffee beans. I have used it for grinding coriander ,flax, chia seeds, and it did that just as well. It is a nice size, and looks good on the counter. It is easy to use, and easy to clean. This is about my favorite small appliance with an attractive sleek and modern design. I found a bit difficult to clean it in between spice and coffee grind load."
        },
        {
            "reviewerName": "Sandar Moy",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Small and easy",
            "reviewDate": "November 1, 2019",
            "reviewText": "This is my first Coffee Bean Grinder. Only my husband and me drink coffee at the house. I am looking for small Grinder. This product come out with stainless steel Bowl, pressing lid and you can stop anytime you want. We have really good Espresso fresh every morning due to this little Grinder. I has not yet try for Spice Grinder ."
        },
        {
            "reviewerName": "Shimmer",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Works great!",
            "reviewDate": "August 16, 2019",
            "reviewText": "I really like this coffee bean grinder. I use it a few times a week. It grinds the beans very well. I grind for 10 seconds for a course grind, 20 seconds for a medium grind and 30 seconds for a fine grind. Medium is what I prefer, unless I'm grinding course for Cold Brew. It's easy to use and clean."
        },
        {
            "reviewerName": "Brandon",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Good buy",
            "reviewDate": "August 21, 2019",
            "reviewText": "I'm using this to grind black pepper instead. About 15 seconds and all the peppers are finely grounded. The grinding cup is removable and made of stainless steel, which making cleaning pretty easy. I like the clear acrylic lid, help me know when to stop."
        },
        {
            "reviewerName": "RSH",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Perfect Choice",
            "reviewDate": "July 17, 2019",
            "reviewText": "I bought this product to use it with species and nuts. I use species so much on my recipes and I like to have them fresh. this machine works very well. It's very efficient. It's also easy to clean and easy to use. I highly recommend it. I never used it for coffee. But I used it many many times with spices and nuts."
        },
        {
            "reviewerName": "Susana Chan",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Good coffee grinder ??",
            "reviewDate": "May 7, 2019",
            "reviewText": "My husband likes to drink coffee every morning and he has to spend time waiting on line. My friend recommends this coffee grinder. So I bought coffee beans from Starbucks and made fresh brew coffee for my honey and we can enjoy our breakfast together everyday. And I make a extra cup for him to go too."
        },
        {
            "reviewerName": "Vicki Brosnahan",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Love my new coffee grinder",
            "reviewDate": "September 2, 2019",
            "reviewText": "This grinder is so easy to use and so much cleaner (less grounds to clean up on counter) than my previous coffee grinder. I think it grinds more smoothly and is even a little quieter than others I have had. Very good value for the money. I am pleased with my purchase."
        },
        {
            "reviewerName": "Tim K",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Great!",
            "reviewDate": "October 11, 2019",
            "reviewText": "I bought it with another french presser. I love them both of how they work because they work so well. They are easy to clean and easy to use. They are stylish as well. My house is made by wood and they perfectly fit into my house. I love them!"
        },
        {
            "reviewerName": "Camper Van Beethoven",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "A bit noisy but effectively grinds beans",
            "reviewDate": "May 27, 2019",
            "reviewText": "Best thing is zero static when pouring out the grounds. Other grinders always have this problem, this one doesn't.\nStays pretty clean."
        },
        {
            "reviewerName": "Amazon Customer",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Works just as well as name brand grinders",
            "reviewDate": "May 2, 2019",
            "reviewText": "Bought this after my previous grinder stopped working. As far as I can tell, it gets the job done just as well. I have even used it for food and it has held up just fine. Looks good and seems to be solidly built too. The stainless steel look is a nice touch."
        },
        {
            "reviewerName": "jessie xiao",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Super high powered and powerful grinder",
            "reviewDate": "October 12, 2019",
            "reviewText": "Super high powered and powerful grinder.i use it to grind turmeric roots which are extremely hard.i also make flour from dried corn kernels.works well for medium to large amounts of food."
        },
        {
            "reviewerName": "Christophe",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Price is reasonable, good to use",
            "reviewDate": "September 10, 2019",
            "reviewText": "So far so good, good product, it's working so well, very easy to use it as a gridiner for coffee, just plug in and push the button, it's easy to clean at the same time, price is $38.99, very good value, I like this item"
        },
        {
            "reviewerName": "WenW",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Love it",
            "reviewDate": "October 11, 2019",
            "reviewText": "This is perfect for fine grinding for coffee beans or herb spices. Its very sharp and easy to use. I really like how easy to clean and the size is perfect too. I now enjoy my fresh morning coffee everyday at home!"
        },
        {
            "reviewerName": "Alex",
            "rating": "4.0 out of 5 stars",
            "reviewTitle": "Simple & easy to use coffee grinder",
            "reviewDate": "May 10, 2019",
            "reviewText": "This grinder is simple and easy to use. It seems safe, I have used it few times so far and have not found any problems with it. Its compact and stylish."
        },
        {
            "reviewerName": "Mark and Amanda",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Great machine! Doesn't take too much space.",
            "reviewDate": "May 10, 2019",
            "reviewText": "I did not expect the grinder to be so compact. I'm glad to find that it a nice tight fit because my other grinder took up so much room on the counter. Great grinder for the price and I really love the wide range of variables from fine to course."
        },
        {
            "reviewerName": "Xiao jiang",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Worth it",
            "reviewDate": "August 10, 2019",
            "reviewText": "My very first coffee bean grinder. I got a bag of coffee bean from Starbucks a while back and been meaning to get grinder for a while finally got it. This is worth the money, very fast and bean turn to powder in few seconds. Very easy to clean too."
        },
        {
            "reviewerName": "kaylen",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Very happy with this grinder !",
            "reviewDate": "October 7, 2019",
            "reviewText": "just like what the pictures shows, it works so well with small quality of herbs or coffee, it makes really fine grenadine for me to cook! And it is fast, only takes up to 30sec it got its jobs done"
        },
        {
            "reviewerName": "Jason C",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Great Grinder",
            "reviewDate": "June 3, 2019",
            "reviewText": "This is my first grinder and wow! I am wondering now - how I was able to live without it :)"
        },
        {
            "reviewerName": "Nicole",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Perfect size",
            "reviewDate": "November 1, 2019",
            "reviewText": "I just get my shardpr coffee grinder, Stainless steel removable bowl this cool easy to wash or cleaning come with a spoon of brush. this side good for me use or store .the design Simple , nice and tiny . the cover seal ring is perfect when I during the process coffee coffee powder did not splashing out. Good quality"
        },
        {
            "reviewerName": "Edward Vail",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Very good grinder",
            "reviewDate": "August 10, 2019",
            "reviewText": "Powerful grinder. I use this for everything such as coffee bean and garlic and make sure clean throughtly after. The grinder itself made with nice material and looks very cool. I like it very much"
        },
        {
            "reviewerName": "jjacky",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Just so so",
            "reviewDate": "August 17, 2019",
            "reviewText": "It is working properly for the small and soft things. For example the sesames and peanut. but last time I use it to do the soybean. Not working well and the noise is strong. Finally I think it was ok for that price."
        },
        {
            "reviewerName": "HM",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Cup is removable!",
            "reviewDate": "June 22, 2019",
            "reviewText": "I am so in love with this grinder. Its sturdy, smooth, grinds well, the stainless steel cup detached easily and smoothly, so emptying & cleaning is easy. I searched high & low for the perfect, affordable grinder & this is it!!"
        },
        {
            "reviewerName": "Carrie",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Great purchase",
            "reviewDate": "May 8, 2019",
            "reviewText": "We have been using a food processor to grind beans and thought it did a decent job. Then I found this one and couldnt believe the difference! The grounds are so much more fine and it is way easier to clean."
        },
        {
            "reviewerName": "Sarah Bryan",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Perfect amount grinder!",
            "reviewDate": "April 25, 2019",
            "reviewText": "I loved this grinder because it was easy to use and fits the perfect amount needed for about 6 cups of coffee. We really love how easy this is so we can enjoy our fresh blends without the work."
        },
        {
            "reviewerName": "M. R.",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Good addition in my kitchen",
            "reviewDate": "September 30, 2019",
            "reviewText": "I am glad to have it. I use it to grind the flax seeds and chia seeds. It's really handy to use and works great. Cleaning is also easy. I like it."
        },
        {
            "reviewerName": "wlkkg123",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Convenient",
            "reviewDate": "October 13, 2019",
            "reviewText": "Convenient and easy to use, as long as the power after pressing can start grinding, whether coffee or other things are basically no problem! Cleaning is also very convenient!"
        },
        {
            "reviewerName": "Bette Thieneman",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Very efficient!",
            "reviewDate": "May 8, 2019",
            "reviewText": "There is nothing like the smell of fresh coffee in the morning. This grinder grinds perfectly. I have also used it to grind flax seeds. It is very versatile and easy to clean. Most of all it is quick!"
        },
        {
            "reviewerName": "perhaps?",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "fine",
            "reviewDate": "August 16, 2019",
            "reviewText": "I haven't started to use it yet. It's not difficult to try to operate it. It's just a little small. I can't put a lot of it. I need a little bit of it."
        },
        {
            "reviewerName": "Vee",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Easy to use.",
            "reviewDate": "November 6, 2019",
            "reviewText": "Very easy to use and easy to clean. Now my family and I can have fresh ground coffee. I intend on using it for my herbs as well."
        },
        {
            "reviewerName": "Cait K",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Great machine!",
            "reviewDate": "October 30, 2019",
            "reviewText": "Really love this coffee grinder! It works wonderfully, pretty much exactly what I'd expect. It grinds to a perfect consistency."
        },
        {
            "reviewerName": "Olivia",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Better than what I expect!!",
            "reviewDate": "June 20, 2019",
            "reviewText": "Actually I was looking for a grinder to grind some spices for cooking. I tried all kinds of ways. Always either time-consuming or exhausting. The grinder is great. Straightforward design!"
        },
        {
            "reviewerName": "Bethplaw",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Easy to clean",
            "reviewDate": "September 4, 2019",
            "reviewText": "Great product. Bought this to spice up my morning coffee. So easy to use, and love having freshly ground coffee right at my finger tips. Super easy to clean too!"
        },
        {
            "reviewerName": "John lee",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Love it",
            "reviewDate": "April 26, 2019",
            "reviewText": "Its a nice size for making coffee every day- and I love that its white. The white Looks nicer sitting on the counter.\nSeems to be made well, and easy to clean."
        },
        {
            "reviewerName": "Daphne",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Easy to use. Five stars.",
            "reviewDate": "August 30, 2019",
            "reviewText": "Besides the coffee beans, I may use to grind spices. Just press down the lid and release to stop. Very easy to use and clean."
        },
        {
            "reviewerName": "James Wang",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Easy to clean and effective",
            "reviewDate": "October 26, 2019",
            "reviewText": "Really nice spice grinder. I keep my coffee grinder and spice grinder separate usually but because this is so easy to clean you can use it for both!"
        },
        {
            "reviewerName": "Michelle in Portland OR",
            "rating": "4.0 out of 5 stars",
            "reviewTitle": "Large capacity",
            "reviewDate": "October 3, 2019",
            "reviewText": "I bought this for the capacity of beans I can grind at one time. The price was good and it's easy to use."
        },
        {
            "reviewerName": "XxRainaxX",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Used for everything",
            "reviewDate": "June 21, 2019",
            "reviewText": "I use this for everything. Coffee, crushing desserts, spices, anything I need to get down to a fine powder. It works really well."
        },
        {
            "reviewerName": "Customer 1",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Great coffee grinder",
            "reviewDate": "July 3, 2019",
            "reviewText": "Great coffee grinder. Can ground coffee beans for espresso in 20 seconds. Nice design and corase grinding. Easy to clean and operate."
        },
        {
            "reviewerName": "Myra",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "My Favorite Grinder",
            "reviewDate": "October 7, 2019",
            "reviewText": "It's easy to see the inside of grinder from the cover. I use it to grind black pepper and its powerful performance and durability and quickly grinding are incredible. I love it very much."
        },
        {
            "reviewerName": "Mandy",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "So many uses",
            "reviewDate": "October 29, 2019",
            "reviewText": "I bought this to grind coffee, but I have found lots of uses. It works quickly. I love it."
        },
        {
            "reviewerName": "Star",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Great quality",
            "reviewDate": "August 29, 2019",
            "reviewText": "This is exactly what I was looking for. Great product.Easy to measure out your coffee as the silver cup is removable."
        },
        {
            "reviewerName": "Cu C.",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Fast and easy",
            "reviewDate": "September 22, 2019",
            "reviewText": "I use it to making power. Its pretty fast and its exactly what I want! Good product!"
        },
        {
            "reviewerName": "Vickie",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "The smell of fresh ground coffee!!",
            "reviewDate": "June 30, 2019",
            "reviewText": "I love fresh ground coffee and this grinder did not disappoint! This little grinder does a great job."
        },
        {
            "reviewerName": "Jimmy Ramsahai",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Very good purchase",
            "reviewDate": "June 5, 2019",
            "reviewText": "Like it a lot. You can grind all kinds of dry spices like black pepper and sea salt etc. Works really good"
        },
        {
            "reviewerName": "wallnut",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Great product",
            "reviewDate": "October 21, 2019",
            "reviewText": "Works well. Love the removable cup to be cleaned easily. Well made."
        },
        {
            "reviewerName": "Stephen J Majewski",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "5 Stars",
            "reviewDate": "June 19, 2019",
            "reviewText": "Works great! ..and easy to clean."
        },
        {
            "reviewerName": "Min",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Fresh Coffee",
            "reviewDate": "June 2, 2019",
            "reviewText": "I bought it for coworkers. She grinds coffee beans and we drink fresh coffee every morning."
        },
        {
            "reviewerName": "Holly",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Great",
            "reviewDate": "June 12, 2019",
            "reviewText": "My first time grinding my own coffee for a French press and its soooooo good! Wow what a difference in taste!"
        },
        {
            "reviewerName": "Eli M",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Very easy to clean",
            "reviewDate": "June 15, 2019",
            "reviewText": "I use it every morning, Its super easy to use with 3 level indicator for min. and max beans input. Its also very easy to clean. I highly recommend this item!"
        },
        {
            "reviewerName": "Amazon Customer",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Good product",
            "reviewDate": "July 10, 2019",
            "reviewText": "Works well strong motor easy to clean\nGrinds very fine cup is roomy for large amount"
        },
        {
            "reviewerName": "Ling",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Well done ????",
            "reviewDate": "October 4, 2019",
            "reviewText": "This is the one that Im looking for for a long time. Great size and design. Mostly I like to ground spices. Easy clean and store."
        },
        {
            "reviewerName": "Anthony King",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Great product",
            "reviewDate": "October 10, 2019",
            "reviewText": "Good performance"
        },
        {
            "reviewerName": "Amazing customers",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Nice grinder",
            "reviewDate": "June 8, 2019",
            "reviewText": "Used for spices, perfectly for my beef stew"
        },
        {
            "reviewerName": "Wendy zeng",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Great product",
            "reviewDate": "June 28, 2019",
            "reviewText": "I love this one very easy to used and clean"
        },
        {
            "reviewerName": "A",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Easy to clean and use",
            "reviewDate": "October 19, 2019",
            "reviewText": "Very good. easy to use and clean. I bought it to grind my ingredients for cooking and making sauce instead of coffee and it grinds very well and smooth. my sauce doesnt have any chunks im glad. glad i bought this."
        },
        {
            "reviewerName": "Joseph Russo",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Great Product",
            "reviewDate": "September 26, 2019",
            "reviewText": "Works great. Used the grinder to grind down my home grown hot peppers into powder. Pay close attention to the instructions. the unit does get warm quickly. If doing a lot of grinding, be sure to pause frequently and let the unit cool."
        },
        {
            "reviewerName": "Milton W. Berg",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Great little coffee maker",
            "reviewDate": "October 13, 2019",
            "reviewText": "1 cup at a time! Perfect"
        },
        {
            "reviewerName": "Yu Z.",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Magic",
            "reviewDate": "October 23, 2019",
            "reviewText": "you can make anything you want with this magic\nEasy use easy clean"
        },
        {
            "reviewerName": "Christy",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Easy to use & clean the grinder",
            "reviewDate": "August 27, 2019",
            "reviewText": "I can use this grinder for coffee beans, sesame seed, red bean , etc. It is easy to operate and easy to clean after usage."
        },
        {
            "reviewerName": "Photopheat",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Awesome",
            "reviewDate": "June 8, 2019",
            "reviewText": "This is an awesome product! Ive had others that are not as powerful."
        },
        {
            "reviewerName": "Amazon Customer",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "It takes no time at all to have coffee beans ground and ready.",
            "reviewDate": "June 6, 2019",
            "reviewText": "Ive used this grinder for coffee beans and it works great. I love how easy it is to use and clean."
        },
        {
            "reviewerName": "Dongjie yan",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Love it",
            "reviewDate": "August 13, 2019",
            "reviewText": "Good job!"
        },
        {
            "reviewerName": "HeCly",
            "rating": "1.0 out of 5 stars",
            "reviewTitle": "Stopped working after two months",
            "reviewDate": "October 22, 2019",
            "reviewText": "I was excited about this product and it did a good job while it was working. I've only had it under 3 months and it completely stopped working."
        },
        {
            "reviewerName": "Karina R",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Me encanta",
            "reviewDate": "November 2, 2019",
            "reviewText": "Sper buena esta mquinita"
        },
        {
            "reviewerName": "julio p. rivera",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "good product",
            "reviewDate": "November 1, 2019",
            "reviewText": "It does what it says"
        },
        {
            "reviewerName": "kindler!",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Works great!",
            "reviewDate": "July 13, 2019",
            "reviewText": "Use daily works great! Comes apart easily for clean up."
        },
        {
            "reviewerName": "Joshua Calugay",
            "rating": "1.0 out of 5 stars",
            "reviewTitle": "Not durable",
            "reviewDate": "July 22, 2019",
            "reviewText": "I only use it 4 times & it just stop working."
        },
        {
            "reviewerName": "BadRoid",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Worth for the price",
            "reviewDate": "July 17, 2019",
            "reviewText": "Great product for the price"
        },
        {
            "reviewerName": "Amazon Customer",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Best coffee grinder we have ever used.",
            "reviewDate": "July 24, 2019",
            "reviewText": "Love everything about this grinder, cleans easy, grinds consistently even grounds.\nNot too nosiy. Looks great! This is the best one we have ever had!"
        },
        {
            "reviewerName": "Amazon Customer",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Good buy",
            "reviewDate": "October 31, 2019",
            "reviewText": "Heavy duty and built well , 10 seconds and it grinds coffee beans effortlessly. Nice grinder."
        },
        {
            "reviewerName": "Sophak",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Sophorn sun",
            "reviewDate": "July 16, 2019",
            "reviewText": "It works good"
        },
        {
            "reviewerName": "Amazon Customer",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Finish gridding so fast. Before you know it.",
            "reviewDate": "September 29, 2019",
            "reviewText": "I like everything on this. Felt like so small in first look but its ok because it work good."
        },
        {
            "reviewerName": "Michael Paladini",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Works well for me",
            "reviewDate": "June 18, 2019",
            "reviewText": "Works like a charm. Grinds coffee fast. Which is why I bought it"
        },
        {
            "reviewerName": "Bassam A.",
            "rating": "1.0 out of 5 stars",
            "reviewTitle": "Bad quality",
            "reviewDate": "October 22, 2019",
            "reviewText": "I used it only twice and it stopped working. I returned it."
        },
        {
            "reviewerName": "mww",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Great value",
            "reviewDate": "November 10, 2019",
            "reviewText": "Great value for the price"
        },
        {
            "reviewerName": "Brenna",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Impressed",
            "reviewDate": "September 6, 2019",
            "reviewText": "Very good quality and easy to clean!"
        },
        {
            "reviewerName": "Noah",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Amazing customer service!",
            "reviewDate": "November 3, 2019",
            "reviewText": "Great grinder. Amazing customer service!"
        },
        {
            "reviewerName": "diego",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "it works as advertised",
            "reviewDate": "July 30, 2019",
            "reviewText": "Easy to use. Looks sturdy."
        },
        {
            "reviewerName": "Eva",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Works perfectly",
            "reviewDate": "May 8, 2019",
            "reviewText": "The grinder works great and it definitely worth the money to buy it. Its very useful and easy to clean and use. I use it for my coffee beans, and it turn out great."
        },
        {
            "reviewerName": "Alicia Tong",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Fine grinder.",
            "reviewDate": "October 29, 2019",
            "reviewText": "I use this primarily for grinding coffee, peanuts and dry spices. Before using this grinder I was using a large food processor to do all of my grinding which was not very efficient and took long time to clean. This grinder is smaller which is exactly the scale of material I need to grind. The motor is powerful and grinds coffee beans effortlessly. It is very easy to clean and operate. I am very pleased with my purchase."
        },
        {
            "reviewerName": "S-R",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Worth for money",
            "reviewDate": "May 15, 2019",
            "reviewText": "The grinder worked perfectly fine. The motor noise is not v bad. I used it to grind dry coriander and cumun and it worked perfectly fine."
        },
        {
            "reviewerName": "Dondi LaRae",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Powerful grinder",
            "reviewDate": "April 26, 2019",
            "reviewText": "This is a fabulous coffee grinder! It was easy to set up. All you do is plug it in, fill up the cup, put the top on, and then press down to grind. I've used it for coffee beans and flax seeds and it works like a dream, grinding them both finely. Definitely worth the money!"
        },
        {
            "reviewerName": "lillish",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Grinder for all the things!",
            "reviewDate": "June 2, 2019",
            "reviewText": "This grinder is amazing. I love it for my coffee and for my herbs. It grinds all the things! Ive even used it as a food processor because Im #lazy. I can only do all of this because it breaks down to three pieces for easy cleaning! Super happy!"
        },
        {
            "reviewerName": "Grichard",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Good for spices",
            "reviewDate": "April 23, 2019",
            "reviewText": "The grinder is being used for spices. The removable cup makes it easy to clean."
        },
        {
            "reviewerName": "Joanne Hung",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Good for grinding spices too!",
            "reviewDate": "October 12, 2019",
            "reviewText": "I bought this coffee grinder mainly to grind spices actually. A lot of grinders I've used before were not able to grind spices fine enough and no one likes big chunks of spices in their food. This grinder is really good. I've checked out a lot of other grinders before deciding on this one and I'm happy with the results. Of course, you can use this to grind coffee. My husband used this grinder to grind whole beans before and he was able to get finely ground coffee.\n\nIt's pretty compact and doesn't take up too much space. I like that it's very easy to clean and not too loud. I have used the grinder to grind cumin seeds, sesame seeds, peppercorn and other spices. The smell of the spices does retain in the grinder but I try to wash it as soon as possible so I can wash off the oil from the spices. I also tried soaking the cup in diluted vinegar and it helped got rid of the smell."
        },
        {
            "reviewerName": "JKM3648",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Sleek looking, quiet, effective and washable electric spice/coffee grinder at a bomb price!",
            "reviewDate": "September 11, 2019",
            "reviewText": "I ordered this grinder because I needed something for both spices and coffee or whatever I want really. I really liked that it had a removable bowl for cleaning for this very reason. Ive always used a smaller grinder that cant really be washed because only the lid is removable. After unboxing the quality and feel is really nice. The look is very sleek looking. When I tried actually grinding something I used juniper berries and was pleasantly surprised on how quiet it was. Based on the sound I thought it wasnt going to grind very well but once I checked after maybe fifteen seconds the juniper berries were ground to a pretty fine powder. So Im officially a fan of this grinder. Clean up is a breeze and even put it in the dishwasher. I would recommend it to anyone else also looking for a cute and also easily washable electric spice/coffee (and whatever you want really) grinder."
        },
        {
            "reviewerName": "Lisa Severino",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Perfect grind",
            "reviewDate": "April 29, 2019",
            "reviewText": "I am a HUGE fan of freshly ground coffee and have been thru my fair share of coffee grinders. I was looking for something new and this one caught my eye. I love the design of the product and how easy it is to use. It states that it has a fast grind and that is SOOO true. It grinds the coffee quickly and holds enough for a 12 cup pot (I like to use a lot of beans and this has the capacity to hold it). Easy to detach and dump the grounds into the pot and cleans very easily."
        },
        {
            "reviewerName": "Brianna Ryan",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Coffee and spices",
            "reviewDate": "September 3, 2019",
            "reviewText": "We are ordering our coffee for the restaurants in packages of whole beans and using this grinder before brewing the pots. Strong and sharp blades have made for quick and easy grinding. I have been very happy with the speed and ease being that when we open we will likely be in a daily rush. So far, I have used this for coffee beans and sticks of cinnamon. Easy to take apart and clean; blade and bowl. I will probably end up ordering another of these so we have 2 to work with."
        },
        {
            "reviewerName": "BeccaRose2024",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Good grinder",
            "reviewDate": "October 19, 2019",
            "reviewText": "Super easy to use- put anything in the cup, put the lid on and press down until it's sufficiently grinded. Ground? You know what I mean.\nThe lid is clear plastic (but very sturdy plastic) so you can see what is being ground. Easy to take the cup off the electric part to rinse it out.\nI do also really like that it comes with a scoop/ brush.\nI do wish it had different speeds, but it is what it is (and it's still pretty great)."
        },
        {
            "reviewerName": "Christina",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Very good grinder.",
            "reviewDate": "October 27, 2019",
            "reviewText": "I bought this grinder for my mom who loves drip coffee and a freshly ground coffee.\nI tested it prior to giving it to her and I love how fast it grinds the coffee beans. I also love that there are no extra buttons or functions.\nYou just put on the cover and push on it and then the grinder starts working. The coffee comes perfectly ground up.\nShe has also used it every day since I gave it to her. She loves it as well."
        },
        {
            "reviewerName": "Bridget",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Detachable cup is essential!",
            "reviewDate": "May 9, 2019",
            "reviewText": "This coffee grinder works just as advertised. The main reason I like this coffee grinder is the detachable cup that holds the ground coffee. This small detail allows me to properly clean the coffee grinder after each use, preventing any old, stale coffee grinds from mixing into my fresh brew. As a bit of a coffee snob, this is essential for when Im testing out new coffee flavors in order to prevent the mixture of tastes. Simple coffee grinder that gets the job done."
        },
        {
            "reviewerName": "Tyler",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Works great!",
            "reviewDate": "September 1, 2019",
            "reviewText": "I love the smell and taste of freshly ground coffee so after years of buying store bought coffee, I decided to buy a coffee grinder and i am so glad i did. It's so nice tasting freshly ground coffee each morning. There really is a difference! This coffee grinder takes up little space and is super easy to use. The coffee beans grind up in just seconds with the blade being so sharp. This is a great product for the price."
        },
        {
            "reviewerName": "S.K.",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Simply coffee grinder",
            "reviewDate": "October 17, 2019",
            "reviewText": "I like this little grinder for its design and power. There are 2 blades. It grinds pretty quick from beans to fine ground coffee in seconds. The shape of the cover as well as its stand is like a triangle cylinder which makes it easy to grip. The switch turned on once you press down the cover. The scoop's other end is a brush for easy cleaning. The whole gadget is very easy to clean."
        },
        {
            "reviewerName": "G. W.",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Easy to use, easy to clean",
            "reviewDate": "October 30, 2019",
            "reviewText": "I got this not only ground coffee but also nuts, seeds, and spices. It's okay with these.\nBasically, I use to use ground coffee very often, cause I love coffee but the different thicknesses of coffee powder the tastes, texture, and flavor are different. This grinder very easy to operate and clean, therefore, it can ground the thickness that I want, I'm satisfied."
        },
        {
            "reviewerName": "Yaxingjia Jia",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Small print but powerful machine",
            "reviewDate": "August 13, 2019",
            "reviewText": "Small print but powerful machine\nLove this nice looking small elegant but powerful spice grinder. Does a fantastic job with all spices, sugar, coffee, etc.The customer service is great! Definitely will recommend this."
        },
        {
            "reviewerName": "Michelle",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Very good grinder",
            "reviewDate": "October 5, 2019",
            "reviewText": "This grinder is made of stainless steel and is of good quality and will not be easily damaged. You can get different thickness powders through different grinding times. Using it to grind coffee beans can better maintain the aroma of coffee beans. You can also use it to grind a variety of spices or nuts, which can be said to be a multi-purpose grinder."
        },
        {
            "reviewerName": "Amanda Duncan",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "So happy I ordered this!!",
            "reviewDate": "November 4, 2019",
            "reviewText": "I have been using my gullet to ground my coffee beans since recently discovering French pressed coffee. I ordered this to see if I would like it and boy do I! It is quick, powerful and grinds evenly so Im not left with bean chunks or powder! I am so happy I decided to get an actual grinder and for the price this one cant be beat!!"
        },
        {
            "reviewerName": "Diana B.",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Makes life easier",
            "reviewDate": "June 6, 2019",
            "reviewText": "Makes my life easier, my mornings specially! I love having the option to buy my own coffee beans and Grinding them myself, it is easy to use and easy to clean and you can tell the quality of the product."
        },
        {
            "reviewerName": "Derek.L",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Truly love it !",
            "reviewDate": "October 12, 2019",
            "reviewText": "I was amazed of how good of this coffee been grinder. Although its design for coffee bean, I use it for different spices as well. So useful for what every you want to make it into power. It comes with a small brush and its so easy to clean. Its very good value of money. Its a very good household kitchen gadget!"
        },
        {
            "reviewerName": "Tiffany",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Love it",
            "reviewDate": "October 21, 2019",
            "reviewText": "I am in love! It was super easy to use and came with a small brush that made clean up easy. I also love how compact it is, about the size of my travel cup which is nice since I hate counter clutter. I haven't used it for spices yet but if it's like the beans I'll be happy.and very easy to clean up ."
        },
        {
            "reviewerName": "Dylan Tang",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Beautiful and perfect coffee grinder!",
            "reviewDate": "April 29, 2019",
            "reviewText": "Well,it looks pretty once I opened the box and saw it, and the grinder cup could be dismantle easily which make my wife and I easy to wash the blade. And the grind mechanism is silimar to my nutribullet blender which I really like the way it works. Of course the grinding performance is nice so far and I really like and enjoy this product."
        },
        {
            "reviewerName": "Raymond Ho",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Its easy to use and it look fancy!",
            "reviewDate": "October 9, 2019",
            "reviewText": "This brand is recommended by my colleague and I like the design,it look fancy to put it in my coffee station,the removable bowl is easy to\nClean,it only take few seconds to grin the coffee,they provided the cleaning brush and the tea cup as well.I m happy with this purchase"
        },
        {
            "reviewerName": "andy",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Electric Coffee Bean Grinder",
            "reviewDate": "October 24, 2019",
            "reviewText": "Drinking a cup of coffee every morning has become a habit. I bought coffee, I dont have the taste of myself, and I dont have the satisfaction that I made myself. After I bought this coffee grinder, I can give myself a day. A cup of your favorite coffee, it is perfect."
        },
        {
            "reviewerName": "David Miller",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "30 seconds for fresh ground coffee",
            "reviewDate": "June 8, 2019",
            "reviewText": "This is perfect for our smaller kitchen. Super fast to ground our coffee. We really like fresh and this is the way to go. Has measurements on the side to make as much or little as needed. Super easy to clean. The power switch is only turned on by the lid, so there are no mistakes. We really love this grinder."
        },
        {
            "reviewerName": "Vanessa",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Convenient",
            "reviewDate": "May 1, 2019",
            "reviewText": "This is the first coffee grinder Ive ever tried and so far, so good. I have been using k-cups, but I wanted to start saving money and reducing plastic so I switched to buying the actual coffee beans. You just put some beans into the bowl, lock the bowl and press the lid to grind. Its easy to use and easy to clean!"
        },
        {
            "reviewerName": "Anna Mandernack",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Efficient grinder",
            "reviewDate": "August 31, 2019",
            "reviewText": "Wonderful! I recently began wanting to grind my own coffee beans after a friend was telling me about it. So I got this one. This works quickly and efficiently. Its not too loud, and is pretty easy to clean out afterwards. The beans are ground down perfectly! Would recommend"
        },
        {
            "reviewerName": "M Reynolds",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Good Grinder",
            "reviewDate": "October 25, 2019",
            "reviewText": "Weve had a coffee grinder for years that worked great but slowly started dying. Needing a new one, Im so thankful to have found this one. The grinder is easy to use and easy to clean. I like the stainless steal and the removable bowl. Good grinder!"
        },
        {
            "reviewerName": "Jessie",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Make your fresh coffee at home",
            "reviewDate": "November 4, 2019",
            "reviewText": "I bought this grinder for coffee bean grind. It is so convenient and easy to use. The stainless steel makes it easy to clean. I can use it just for less amount of coffee bean grind, since I like the fresh grind coffee taste. I dont have to go coffee shop anymore, and I can make amazing fresh coffee at home. Love this grinder!"
        },
        {
            "reviewerName": "Jenny white",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Very convenient and useful",
            "reviewDate": "October 26, 2019",
            "reviewText": "This coffee grinder is so convenient and useful. It makes my coffee grounds the perfect size. Its also really easy to use and clean. It also really cheap and really affordable for its price. Its also really small and doesnt take much space."
        },
        {
            "reviewerName": "Ted J.",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Exactly as it is supposed to do. Good grinder.",
            "reviewDate": "November 13, 2019",
            "reviewText": "Excellent grinder. Works in seconds for coffee beans and grinds as fine as desired. Nice construction: parts fit well and disassemble for cleaning. Takes about 30 seconds to grind enough coffee to perk or drip 4 cups. Recommend this model."
        },
        {
            "reviewerName": "KB",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Quite the bean juicer",
            "reviewDate": "May 1, 2019",
            "reviewText": "I love this little thing when it comes to grinding my coffee beans to shreds. This thing does wonders and i cant be more satisfied with the product i recieved. Great to use, fast, and easier then having to be social and actually go through the drive through at McDonalds."
        },
        {
            "reviewerName": "wenli",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "So Like",
            "reviewDate": "August 28, 2019",
            "reviewText": "I have been looking for a machine that can grind sesame seeds. It has not been easy to buy in the store because sesame oil is high. This machine is easy to operate and has a good grinding effect. It is a little smaller and looks forward to a larger capacity."
        },
        {
            "reviewerName": "Filmgeek",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Good quality and powerful",
            "reviewDate": "October 8, 2019",
            "reviewText": "This coffee bean grinder works great. Its very heavy and made with thick materials. It is very powerful and the noise is much lower than the normal ones. It takes shorter time for a normal to fine grind, and very easy to clean."
        },
        {
            "reviewerName": "Eva Dickman",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "high quality, easy to operate and clean, not noisy, pleasure to use",
            "reviewDate": "July 31, 2019",
            "reviewText": "well-designed, quality construction, grinder. I'm very pleased with this unit, oh, and it's fast. You do have to shake it to get the bigger pieces ground, and still there will be a few big pieces at the bottom. Little brush attached to spoon helps a lot with cleaning out the bowl. Love it; I hope it lasts a long time."
        },
        {
            "reviewerName": "J.M",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "It works very nice!",
            "reviewDate": "October 23, 2019",
            "reviewText": "Didnt expect a small thing is so powerful !I buy it because its look small so I can just put it anywhere in of the kitchen. I use it for the pepper and some other spices , its only used few seconds to have the works done. Perfect for me!"
        },
        {
            "reviewerName": "Samantha Banks",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Great",
            "reviewDate": "October 23, 2019",
            "reviewText": "This is great! We use it for everything, coffee, spices, etc. its easy to set up and use. Easy to take apart and clean. Grinds smoothly, no jumping. Was excited to buy for the price, definitely dont regret"
        },
        {
            "reviewerName": "Yes",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "A necessity",
            "reviewDate": "October 27, 2019",
            "reviewText": "Coffee bean grinder are a must. Its work well.is easy to clean, and is not too big so it doesnt take a lot of space on the counter. If youre looking for a good coffee bean grinder then l would recommend this one. Its realizable and gets the job done."
        },
        {
            "reviewerName": "Tiffany P",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Removable Cup So Convenient",
            "reviewDate": "April 28, 2019",
            "reviewText": "I have been in the market for a coffee grinder for a long time. I love the taste so much better of freshly ground coffee. This grinder is so easy to use a clean. The removable cup is genius. Great kitchen gadget that i use on a daily basis!"
        },
        {
            "reviewerName": "Patty708",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Great buy",
            "reviewDate": "November 5, 2019",
            "reviewText": "I bought this so I can grind my coffee beans. It is very easy to use, not noisy and easy to clean. I can also use this to grind my spices and nuts. It's also compact, easy to store."
        },
        {
            "reviewerName": "CKH",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Well made",
            "reviewDate": "May 9, 2019",
            "reviewText": "Well made, and this one doesnt disappoint. I like that the grinding basket is removable for cleaning. I do coffee pour overs, which need a fine grind, so I was happy to see how well it worked for that."
        },
        {
            "reviewerName": "NY Andrew",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Awesome",
            "reviewDate": "June 16, 2019",
            "reviewText": "Much better than the kinds you have to dump the entire unit to pour grinds. This disconnects for easy cleaning and pouring! Best coffee grinder there is and you can grind however you want."
        },
        {
            "reviewerName": "William L. Van Alstine",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Simple and not too noisy.",
            "reviewDate": "November 6, 2019",
            "reviewText": "Having a stainless, removable container for the coffee beans or nuts makes cleaning and using very simple. I previously tried a hand grinder. This is much better and easier to use. I've been very satisfied with this product."
        },
        {
            "reviewerName": "Brace Wang",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Best Grinder that ever had",
            "reviewDate": "August 29, 2019",
            "reviewText": "It's probably best to have one for coffee and one for Spices. B/c you don't want your coffee to taste like your spices. It's a little cumbersome to clean thoroughly"
        },
        {
            "reviewerName": "Amazon Customer",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Great spice grinder",
            "reviewDate": "October 27, 2019",
            "reviewText": "I grind all my whole spices SEEDS , my food is back to authentic taste , its my favorite and must helpful friend in the kitchen ??????"
        },
        {
            "reviewerName": "Jawairia Razi",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Works great",
            "reviewDate": "May 6, 2019",
            "reviewText": "This is a great product. I use this everyday to chop herbs and make babys food. Also great for ground spices. It grinds to a fine consistency in just under 2 minutes"
        },
        {
            "reviewerName": "Lacey Skelton",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Easy to use",
            "reviewDate": "September 5, 2019",
            "reviewText": "This coffee grinder is perfect for coffee and for spices if you need to grind them. It's very easy to clean and quiet while grinding"
        },
        {
            "reviewerName": "Leticia Martinez",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Best grinder for spices!!",
            "reviewDate": "September 7, 2019",
            "reviewText": "Bought this grinder to make my dry rub for my brisket!! OMG it is amazing. I use it to grind my spices before every Q!! Best Buy."
        },
        {
            "reviewerName": "JR",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Love it!",
            "reviewDate": "September 7, 2019",
            "reviewText": "Love this grinder! Easy to use right out of the box and easy to clean. Very sleek looking design. Couldnt ask for more!"
        },
        {
            "reviewerName": "LORI BRACKETT",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Great value",
            "reviewDate": "May 8, 2019",
            "reviewText": "I love that this does fine and coarse options! I have tried both and it works really well. I love having this so we can use whole bean coffee more often"
        },
        {
            "reviewerName": "Osman Sami",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Value product",
            "reviewDate": "June 15, 2019",
            "reviewText": "It is a perfect size for small family and fresh coffee lover. You can purchase small weight coffee seeds and using this grinder for it."
        },
        {
            "reviewerName": "Mariel",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Quick and efficient!",
            "reviewDate": "May 3, 2019",
            "reviewText": "This grinder works perfectly! It's quick and efficient, grinds a whole cup full of coffee beans in seconds. It's sturdy and is really good quality."
        },
        {
            "reviewerName": "Lbgirl",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Great grinder!",
            "reviewDate": "September 8, 2019",
            "reviewText": "Great quality for the value !\nWorks perfectly and cleans easily!\nWonderful investment!"
        },
        {
            "reviewerName": "Alex",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "works great",
            "reviewDate": "June 8, 2019",
            "reviewText": "It is very convenient to use. The ground powder is uniform. And the most important thing is that the cup is detachable, making cleaning very simple."
        },
        {
            "reviewerName": "Chris",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Great if you love fresh ground coffee",
            "reviewDate": "August 31, 2019",
            "reviewText": "This product is quiet, and it provides a good grind. I also appreciate how easy it is to clean."
        },
        {
            "reviewerName": "Sandy",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Very simple but effective",
            "reviewDate": "April 28, 2019",
            "reviewText": "I like its features especially that it grinds quickly and the cup removes to easily put the grounds into my coffee maker."
        },
        {
            "reviewerName": "Bob",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Excellent grinder",
            "reviewDate": "August 14, 2019",
            "reviewText": "Love the way it grinds coffee evenly and in such a short time. Very easy to use and clean."
        },
        {
            "reviewerName": "Klyn",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Grinds coffee and seeds really well!",
            "reviewDate": "October 17, 2019",
            "reviewText": "Love it. Works better than expected. I use it for seed cycling and coffee beans."
        },
        {
            "reviewerName": "Rosanna",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Not only for coffee beans, but also for different",
            "reviewDate": "May 28, 2019",
            "reviewText": "Supra easy to use, not only for coffee beans, but also for different nuts, etc. Very powerfully, like it"
        },
        {
            "reviewerName": "Amazon Customer",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Electric coffee grinder",
            "reviewDate": "July 11, 2019",
            "reviewText": "Works really good , love it ! Grinds very fast and well. Would recommen..."
        },
        {
            "reviewerName": "Amber",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Great",
            "reviewDate": "May 29, 2019",
            "reviewText": "Great coffee grinder. It grinds the beans right down and is easy to use."
        },
        {
            "reviewerName": "yoyo",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "short time,good work",
            "reviewDate": "August 10, 2019",
            "reviewText": "good work for walnut,only 1 minutes,very good job"
        },
        {
            "reviewerName": "Honest Feeback",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "High quality",
            "reviewDate": "October 11, 2019",
            "reviewText": "Works very very well! Recommend"
        },
        {
            "reviewerName": "Ovidiu A.",
            "rating": "2.0 out of 5 stars",
            "reviewTitle": "Very noisy",
            "reviewDate": "May 16, 2019",
            "reviewText": "Very noisy for such a small machine."
        },
        {
            "reviewerName": "Hilary",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Quality stuff",
            "reviewDate": "August 21, 2019",
            "reviewText": "Looks very solid quality, will keep checking."
        },
        {
            "reviewerName": "vald",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Great quality",
            "reviewDate": "November 6, 2019",
            "reviewText": "Love it, looks very lux"
        },
        {
            "reviewerName": "Ma GUI qi",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Good quality",
            "reviewDate": "August 2, 2019",
            "reviewText": "Good quality, small and light, quiet, very strong, black and gray fashion color"
        },
        {
            "reviewerName": "Thomas Lusby",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Great product",
            "reviewDate": "November 9, 2019",
            "reviewText": "This is a FANTASTIC product. I love it."
        },
        {
            "reviewerName": "Matt",
            "rating": "3.0 out of 5 stars",
            "reviewTitle": "coffee grinder worth looking in to",
            "reviewDate": "November 4, 2019",
            "reviewText": "Was expecting a more powerful motor."
        },
        {
            "reviewerName": "tara linder",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "The bowl comes off to clean fantastic",
            "reviewDate": "July 24, 2019",
            "reviewText": "This is a great grinder it's quiet and best of all , easy to clean."
        },
        {
            "reviewerName": "Douglas Johnston",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Well worth the money",
            "reviewDate": "April 27, 2019",
            "reviewText": "Powerful, easy design, easy to clean."
        },
        {
            "reviewerName": "wangpingwei",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Great Grinder",
            "reviewDate": "June 8, 2019",
            "reviewText": "It is beautiful and powerful. easy to clean and very simple to use"
        },
        {
            "reviewerName": "D's Mommy",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Looks and works great",
            "reviewDate": "May 14, 2019",
            "reviewText": "It is very easy to use. You can take it apart easily to clean. It looks great on my countertop."
        },
        {
            "reviewerName": "JB18",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "The most excellent coffee grinder",
            "reviewDate": "November 13, 2019",
            "reviewText": "This very powerful grinder grinds coffee very quickly and evenly with less noise. The easiness makes my morning coffee experience more enjoyable.. The only downside is the cover is loose so that when storing it can fall off easily."
        }
    ],
    "title": "SHARDOR Electric Coffee Bean Grinder, Spice Grinder, 1 Removable Bowl with Stainless Steel Blade, Silver",
    "manufacturer": "SHARDOR",
    "currentPrice": "$32.95",
    "rating": "4.7 out of 5 stars",
    "totalRatings": "182 ratings",
    "features": [
        "\n         Make sure this fits\n                by entering your model number.\n        \n",
        "Press the lid to start with different grinding time to custom grind settings. Fastest: 5 seconds to get coarse powder.",
        "High quality stainless steel housing and blades, also with 200W powerful motor guarantee continuous and even grinding for better maintaining the original rich aroma and oil of the coffee bean.",
        "One removable bowl with Measurement Markings 70g capacity - enough for 12 cups of coffee.",
        "With nice sealing ring in the lid to prevent powder splashing, no worry of being messy in kitchen.",
        "ETL approved ensures your safety. 120V. 2 in 1 spoon with brush. One bowl for dry grinding. 1 year hassle-free replacement warranty."
    ],
    "reviewsAspects": [
        "easy to clean",
        "easy to use",
        "stainless steel",
        "works great",
        "coffee bean",
        "removable bowl",
        "freshly ground",
        "every morning",
        "long time",
        "good quality",
        "bean grinder",
        "spice grinder",
        "worth the money",
        "grind spices",
        "super easy",
        "nice looking",
        "fresh ground",
        "much better",
        "highly recommend",
        "perfect size"
    ],
    "qAndA": [
        {
            "question": "Are there separate bowls available for purchase? I would like to buy an extra 2 blade bowl. bowl",
            "answer": "Sorry that we do not sell separate bowl currently. Maybe we will sell it in the near future."
        },
        {
            "question": "Can I grind dried lentils and almonds?",
            "answer": "I think so. I use mine for coffee only."
        },
        {
            "question": "How may grinding cups does this come with?",
            "answer": "One grinding cup with 2-blade."
        },
        {
            "question": "This seems to come with the 2-blade bowl. Can I add an interchangeable 4-blade bowl in my order? I cannot find the 4-blade bowl.",
            "answer": "Mine came with a 4 blade bowl included, as well as the 2 blade bowl for grinding coffee."
        },
        {
            "question": "can i use it to grind coffee bens for pour over ?",
            "answer": "Yes, dear. You can use it to grind coffee bean."
        },
        {
            "question": "is this grinder supposed to be really loud?",
            "answer": "I believe it is loud. But I believe that has to do with the power it has to do with it's ability to grind nuts etc."
        },
        {
            "question": "can this work in 220-240V or only 110-120V?",
            "answer": "110-120v."
        },
        {
            "question": "Has anyone used this to crush pills? I'm concerned about getting all the contents out with th blades.",
            "answer": "uh, I have not used it for that particular purpose. I mostly wanted to grind leaf to powder. I will say I wouldn't put much past this device it is not only cool looking but powerful and I recommend it"
        },
        {
            "question": "Is it can make sesames powder?",
            "answer": "Yes. You should be able to."
        },
        {
            "question": "Can you purchase replacement seal rings? I wish to grind dehydrated hot peppers. I don't want to have to breathe the powder.",
            "answer": "Answer not available"
        },
        {
            "question": "can this work in 220-240V or only 110-120V?",
            "answer": "I'm pretty sure it's 110-120v."
        },
        {
            "question": "what quantity of beans can you grind at one time?",
            "answer": "You can grind 7 ounces of beans at one time. That's the Max line on the container."
        },
        {
            "question": "Can you grind less than the minimum recommended amount?",
            "answer": "You may not. If you put coffee bean less than the minimum line, the blade will only spin while not cut anything, which would do harm to the motor and also the blade."
        },
        {
            "question": "How do I adjust the grinding fineness?",
            "answer": "There is no adjustment just grinding time"
        },
        {
            "question": "where are the instructions for this? mine came with nothing on grinds etc?",
            "answer": "Very easy to use"
        },
        {
            "question": "Can you grind cinnamon sticks?",
            "answer": "Dont know"
        },
        {
            "question": "Is the lid made of glass or plastic?",
            "answer": "Plastic"
        },
        {
            "question": "Can i use it to grind grain?",
            "answer": "I think you can but not the hard wheat ?? Im not an expert. I did grind chia seeds for flour and sesame seeds so far to make tahini (had to add avocado oil and scrape down the sides) but turn out well."
        },
        {
            "question": "How many bowls are in package?",
            "answer": "One bowl"
        },
        {
            "question": "Is the removable bowl made of stainless steel or just plain aluminum?",
            "answer": "Stainless steel. This is a GREAT product"
        },
        {
            "question": "Do you have to clean every time the top portion where the blades are?",
            "answer": "I think it's a good idea to clean the top portion every time. I use a bottle brush to clean it."
        },
        {
            "question": "Whats the minimum amount allowed for grinding? Will it a grind a teaspoon of flaxseeds?",
            "answer": "Ive tried a tsp of cumin. It worked for me as i wanted it coarse."
        },
        {
            "question": "french press coffee for how long?",
            "answer": "5-8 sec is enough."
        },
        {
            "question": "Is this one loud?",
            "answer": "Yes, very loud. We have found that if you put it on top of a towel, it deadens the noise somewhat"
        },
        {
            "question": "How big it is? I do not want to buy a grinder which can not fit under my cabinet.",
            "answer": "It is 9 inches tall."
        },
        {
            "question": "Is the outlayer stainless steel?",
            "answer": "Yes, it is stainless steel."
        },
        {
            "question": "Does it come with two removable jars (for wet & dry grinding)? The product description & images dont include it but customer images do",
            "answer": "It comes with 2 cup on had 2 blade for grinding coffee and herbs. The second had 4 blade and is for chopping herb or other small thing"
        },
        {
            "question": "where are the instructions for this? mine came with nothing on grinds etc?",
            "answer": "Awesome, I used it every day to grain chia and flaxseeds as well small chopping"
        },
        {
            "question": "Can i put it into dishwasher?",
            "answer": "We do not recommend using dishwasher to clean it. A little dishwashing liquid and running water is easy but useful enough."
        }
    ]
}