{
    "productInformation": [
        {
            "Product Dimensions": "3.2 x 3.8 x 6.2 inches"
        },
        {
            "Item Weight": "1.6 pounds"
        },
        {
            "Shipping Weight": "1.71 pounds (View shipping rates and policies)"
        },
        {
            "Manufacturer": "4Q Brands"
        },
        {
            "ASIN": "B07P6SGD8B"
        },
        {
            "Item model number": "KF2020"
        },
        {
            "Customer Reviews": "4.7 out of 5 stars\n    372 ratings\n4.7 out of 5 stars"
        },
        {
            "Best Sellers Rank": "#4,983 in Kitchen & Dining (See Top 100 in Kitchen & Dining)\n#9 in Electric Coffee Blade Grinders\n"
        },
        {
            "Date first listed on Amazon": "February 27, 2019"
        }
    ],
    "productDescription": [],
    "reviews": [
        {
            "reviewerName": "Trevor Franks",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Quiet convenient grinder",
            "reviewDate": "July 22, 2019",
            "reviewText": "This grinder works great! It's pretty compact so it fits in a cupboard or pantry easily but can still grind plenty of beans at one time. It feels solid and study. My favorite part is that it's pretty quiet when grinding. Didn't have a grinder before we got this so I was using a blender or food processor and both were at least twice as loud. It's very simple to use, just put on the lid and push the button. There might be an easier way to clean it out that I haven't figured out yet but a damp paper towel seemed to do a pretty good job. Great grinder for the price."
        },
        {
            "reviewerName": "Clyde_Sr",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Quiet and Huge Capacity",
            "reviewDate": "July 17, 2019",
            "reviewText": "I love how quiet this grinder is and the capacity is huge. Does a great job with coffee beans. Unfortunately it wasn't much of a match for grinding my dried mushrooms into powder. It left huge chunks. I've been using a cheap grinder from my local discount shop for years and it always did a perfect job. I guess this is just relegated to grinding coffee, kind of a bummer. Also, the motor heats up really quickly so you have to be careful when you're grinding as it's easy to overdo it."
        },
        {
            "reviewerName": "Joe will never know enough",
            "rating": "4.0 out of 5 stars",
            "reviewTitle": "Gets the job done with little effort",
            "reviewDate": "September 8, 2019",
            "reviewText": "If you need to grind coffee quickly, this is for you. I have a hand crank coffee grinder and while I love the precision, it does take about 4 minutes and not suitable for large batches.\n\nSo enter the kaffe grinder.\n\nBefore use wash the lid and grinder with soapy water and dry.\nThe first time I only filled to halfway and after 5 long presses on the power button, it was nearly the consistency I wanted. There were some large bean pieces, but not too many. The second time I filled it up all the way. I had to grind it for much longer because although it appeared to be consistent on top, there were whole beans on the bottom. I scooped some of the done out to finish the rest and I was then able to get them more uniform. One of the pictures I attached includes the big pieces when I thought the top of the pile was done.\n\nOverall, this grinder is about as good as the other electric grinders. Some things to note: it is relatively easy to clean, however, you can not remove the grinder base to clean. The only part that can be fully removed is the lid and it is dishwasher safe."
        },
        {
            "reviewerName": "James D White",
            "rating": "4.0 out of 5 stars",
            "reviewTitle": "Great Grinder",
            "reviewDate": "July 15, 2019",
            "reviewText": "Great grinder, especially for the price! Its easy to clean and does a great job grinding the coffee. The only issue I have with the grinder is the fact that there are not different settings to grind the coffee wither fine or coarse."
        },
        {
            "reviewerName": "KayLyn",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Compact and easy to use.",
            "reviewDate": "July 16, 2019",
            "reviewText": "This is my first time using a grinder and coffee beans and I am in love! It was super easy to use and came with a small brush that made clean up easy. I also love how compact it is, about the size of my travel cup which is nice since I hate counter clutter. I haven't used it for spices yet but if it's like the beans I'll be happy."
        },
        {
            "reviewerName": "JGReviews",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Very good grinder",
            "reviewDate": "October 7, 2019",
            "reviewText": "I just bought this coffee grinder after reading through lots of reviews for this one and others here on Amazon. In my search filter, this came up as the best reviewed coffee grinder that wasn't incredibly expensive, so ultimately that was the deciding factor in getting it. Something happened to our last grinder and it has become really loud and was probably too loud to being with -- we have a young kid who is often asleep when we are making coffee. So, we really needed a quieter grinder and many of the reviews said that it was pretty quiet and I have to say that I am relieved that it is substantially quieter than our last few grinders. It still makes some noise, but it's pretty reasonable since all grinders will make noise. I don't have to push down nearly as hard on this grinder for it to work either. It also looks really nice. The stainless steel matches our other kitchen appliances and I would say makes our kitchen look nicer, whereas our old one probably just felt like more clutter on the counter. I'd highly recommend this coffee grinder to anyone."
        },
        {
            "reviewerName": "Twirlwavecurl",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Great tool if you cook a lot of curries",
            "reviewDate": "July 17, 2019",
            "reviewText": "Although it is designed for grinding coffee beans, I use it exclusively to grind spices. I love Indian food and cook curries every day. No Indian food is complete without a dash of spice powders. My blender did not do a great job of grinding my spices finely so I decided to gift myself this one. I must say I LOVE IT! My curries and biryani game has stepped up a notch. Coffee-lovers do check it out. The functionality is superb!"
        },
        {
            "reviewerName": "Melissa",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Ultimate coffee grinder",
            "reviewDate": "July 22, 2019",
            "reviewText": "We needed a grinder for our coffee during camping and this little number was phenomenal! A precious grinder sounded like it was grinder nuts and bolts that I took this one outside (kiddo was napping) and I could not believe how quiet it was. Not only was it quiet, it grinder the coffee quickly and efficiently. Was also super user friendly that Id recommend this product to my grandmother lol. Its also very sleek looking and have great counter appeal. We LOVE this grinder!"
        },
        {
            "reviewerName": "jia",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Save my time, space and money",
            "reviewDate": "July 24, 2019",
            "reviewText": "I use it for my bakery. I always want to buy a nut grinder. but all my search that their size are too big. I already got a lot cooking/bakery machine. I don't want to buy one more big one. I only live in small apartment.\nThis one just a right size for me. It work great. Heavy made and easy to clean. Good value. Much more lower than other big brand grinder."
        },
        {
            "reviewerName": "luckyck",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Great little coffee grinder",
            "reviewDate": "August 1, 2019",
            "reviewText": "My husband used our old grinder for spices, and I feel like I could taste some of that in the coffee, so I decided to buy a second grinder just dedicated to grinding coffee. Love this little unit. It's compact, and it works great. It's super easy to use and gets the job done. I do wish it had more options for grinding preferences, but we were looking for something compact. But it feels like it's good quality, and I am more than happy with it."
        },
        {
            "reviewerName": "Nishanth Reddy",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Good Looking and Strong Competing Compact Coffee Grinder",
            "reviewDate": "November 5, 2019",
            "reviewText": "Design: 4/5\nSturdiness: 4/5\nDurability: N/A (Will Update in Time)\nValue for Money: 5/5\nNoise Level; 5/5\nPackaging: 5/5\n\nPros: What a beautiful looking machine. I love the stainless steel exterior option. I've tried grinding dried coconut in it (obviously to check if it was upto the task) and it faired really well. Although I would strongly advice against grinding dried coconut. It is pretty easy to use and comes in a small and compact package which means its easy to stow away when it is not being used. The lid on top is clear which means you can see the fineness of the spice being ground inside the grinder. The lid was pretty easy to clean once the grinding was complete.\n\nCons: The product could use from a removable inner compartment for easier cleaning. It can be quite challenging at times to clean but that is the only gripe I have. Unfortunately, this is not the only product that suffers from this flaw."
        },
        {
            "reviewerName": "Steven",
            "rating": "4.0 out of 5 stars",
            "reviewTitle": "Works well, just don't overfill",
            "reviewDate": "August 6, 2019",
            "reviewText": "Pros:\n- Cost friendly\n- Grinds beans to a nice, fine powder\n- Small so it can be easily stored away\n\nCons:\n- Putting too many beans in (but not exceeding the max recommendation) results in the grounds caking to the side during the grinding process\n- Cord could be a bit longer"
        },
        {
            "reviewerName": "K.",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Efficient and quiet coffee grinder!",
            "reviewDate": "July 8, 2019",
            "reviewText": "Just received this new coffee grinder to replace the one we've had for years. I was concerned when I opened it because it doesn't appear to be a deep even though it advertised a \"large capacity\". However, I was very happy when grinding coffee for the first time. It handled the whole beans just fine, ground even faster than our previous model, and it was quite a bit quieter. I am glad this is the grinder we chose!"
        },
        {
            "reviewerName": "vidya",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Works Perfectly",
            "reviewDate": "July 31, 2019",
            "reviewText": "I have only good things to say about this grinder. I got this to grind lentils, rice and spices. It works perfectly, the noise is super low and it takes very little space on the counter. I love it."
        },
        {
            "reviewerName": "CaptnTeague",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Fresh coffee spoils me",
            "reviewDate": "September 17, 2019",
            "reviewText": "There really is nothing like fresh coffee.\nThis little machine makes it so much easier.\nIts easier to clean than any other Ive dealt with, but its coffee grinds, so its still a potential mess.\nIts easy to use, works well. It wasnt as loud as I had feared.\nIm happy with it."
        },
        {
            "reviewerName": "Elis momma",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Love this little guy! Quiet and Efficient!!",
            "reviewDate": "October 31, 2019",
            "reviewText": "Our past coffee grinder bit the dust so when it was time to purchase a new one I did my homework! I wanted one that was stainless steal as well had a good track record for not waking the whole house when I wanted a cup of coffee!! I am extremely satisfied with my purchase since this is everything I was searching for!! It holds a ton of beans too which makes it perfect for your daily coffee fix by being able to grind coffee for the whole day at once!"
        },
        {
            "reviewerName": "William A. O'Connor",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Very nice size, easy to use",
            "reviewDate": "July 15, 2019",
            "reviewText": "I love this little guy. I am a big coffee guy and having this guy on my counter adds to the overall experience. Being able to grind down beans and have a fresh cup every morning is just the bees knees for me. Really wish I would have discovered this before. At this price point, you can't go wrong."
        },
        {
            "reviewerName": "TLee",
            "rating": "4.0 out of 5 stars",
            "reviewTitle": "Good for smaller servings",
            "reviewDate": "September 3, 2019",
            "reviewText": "Good grinder. It can't be used continuously- it'll over heat. But all in all great for the price. Happy with this purchase."
        },
        {
            "reviewerName": "Amazon Customer",
            "rating": "1.0 out of 5 stars",
            "reviewTitle": "maybe a fluke",
            "reviewDate": "September 13, 2019",
            "reviewText": "inoperative straight out of the box."
        },
        {
            "reviewerName": "ChanFann",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "My first electric coffee grinder",
            "reviewDate": "November 12, 2019",
            "reviewText": "Honestly, it always came down to the price for me. So I always had the manual grinders and it took forever. Especially when I had company. So i tried this one out and turned out for the better. I churned out more coffee in a matter of minutes. It was such relief. It is a little cumbersome to clean since the bowl can't be taken out. None the less it is a great grinder for coffee"
        },
        {
            "reviewerName": "happydresses13",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Dry rice test worked well",
            "reviewDate": "October 22, 2019",
            "reviewText": "This coffee grinder has a nice deep bowl. I tested the grinder with some dry white rice. You simply place the rice in the bowl, put the lid on, and depress the button. The machine ground 2-3 TB rice in about 30 seconds. As you can see, it grinds very finely. Since we don't drink coffee, we plan to use this as a spice grinder. I have no complaints about this product."
        },
        {
            "reviewerName": "Amy Elsner",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Good power. Little noise.",
            "reviewDate": "October 25, 2019",
            "reviewText": "This is a nice little grinder. My husband stole my spice grinder for his coffee and I saw this one was reasonably priced and had good reviews so decided to try it. Glad I did. He now has his own grinder and he says this works better than the one he stole from me! Now he can enjoy his French press coffee and in larger batches than what other grinder's capacities are."
        },
        {
            "reviewerName": "Sandeep Kumar",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Love the Little machine",
            "reviewDate": "November 5, 2019",
            "reviewText": "I own a vitamix and was looking for a small grinder to grind spices in small quantities. Amazed by the power of this little machine. I would compare it with my vitamix. I have grinder chickpeas and in minutes I have fine powder. The noise level is also very low. Very easy to use and clean. Love love love this machine."
        },
        {
            "reviewerName": "itsZACyo",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Really like this grinder for herbs, not so much for coffee",
            "reviewDate": "October 29, 2019",
            "reviewText": "For a blade grinder it does a good job blending herbs to a powder. I don't use this for coffee as I prefer a burr grinder. My family grows a lot of different spices and herbs that we dehydrate and blend to use in cooking. This grinder does the job. It isn't the easiest to clean as my previous grinder that died was easier, but it's not that big of an issue"
        },
        {
            "reviewerName": "August J",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Beauty in my kitchen!",
            "reviewDate": "September 16, 2019",
            "reviewText": "I needed one grinder just for coffee since I grind spices very frequently and did not want them to mix with coffee. This one makes a fine powder,just like it is supposed to do. My husband and I both are happy. It is not easy to clean directly but it's not a huge problem for me since it is meant only for coffee.. I wipe it with a wet cloth and its good to go."
        },
        {
            "reviewerName": "SingRGal",
            "rating": "1.0 out of 5 stars",
            "reviewTitle": "Blunt Blades",
            "reviewDate": "October 27, 2019",
            "reviewText": "The blades on this coffee grinder are absolutely blunt. The old one which I was replacing are sharper. This machine looks lovely but it just doesnt grind the beans well. I returned it."
        },
        {
            "reviewerName": "sagar",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Can grind coffee and spices!!! quickly",
            "reviewDate": "July 27, 2019",
            "reviewText": "So far I've found it very easy to use, easy to clean and at a great price\nPros:\nEasy to Clean,\nEasy to Use,\nNice Design,\nPerforms Well,\nless noise and takes very small space"
        },
        {
            "reviewerName": "John",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Good grinder for a good price",
            "reviewDate": "October 15, 2019",
            "reviewText": "We drink a lot of coffee and we enjoy being able to try different kinds, but some of them are whole bean\nSo we got a coffee grinder and have been trying all sorts of coffee's. The grinder is simple to use and clean. You just pour the beans in and turn it on. They included a brush that you can easily wipe out coffee grounds. We've used this for awhile now and so far it works well."
        },
        {
            "reviewerName": "Cztxz",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Good compact design and great quality",
            "reviewDate": "November 4, 2019",
            "reviewText": "I like the steel design and the compactness of this product. It goes well with my other products in the kitchen. It works very well to blend the spices and coffee. I've used this to blend small quantities of ginger/garlic paste, it worked well. I found this as a very durable and quality product, I would recommend this product."
        },
        {
            "reviewerName": "T.R.",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Nice size",
            "reviewDate": "October 23, 2019",
            "reviewText": "I was always intimidated by grinding my own coffee. But then my fianc bought me special coffee online that only came in while bean. Its been sitting in my fridge so it was finally time to buy a grinder. This one is great. Its relatively small, easy to clean, and pretty quiet"
        },
        {
            "reviewerName": "Tech Junkie",
            "rating": "4.0 out of 5 stars",
            "reviewTitle": "Decent little grinder",
            "reviewDate": "October 31, 2019",
            "reviewText": "This grinder definitely does the job and for its price point is a good deal. Its about as loud as any other grinder Ive used, I like that the cover has a large seal surface area. I grind everything from coffee to dried hot peppers and dried herbs. With that said, I do wish the bowl was detachable for easier cleaning."
        },
        {
            "reviewerName": "Manuel D.",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Love this",
            "reviewDate": "October 24, 2019",
            "reviewText": "I love this coffee grinder. I like to buy coffee in bulk to save money but its much easier and lasts longer when its beans and not ground. This allows me to grind what I need and store the rest to stay fresh. It is super powerful and comes with a little brush to clean"
        },
        {
            "reviewerName": "Parth",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Wide range",
            "reviewDate": "July 29, 2019",
            "reviewText": "Wide range of grinding the bean. I love fine grinded while my partner prefers coarse.\n\nLoved the product. 0 noise and loved it"
        },
        {
            "reviewerName": "Audrey Ashcraft",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Large and sturdy",
            "reviewDate": "November 8, 2019",
            "reviewText": "Excellent coffee grinder and easy to clean. It is very sturdy unlike my previous grinder and was made of plastic and ultimately had a fall to it's death. Isn't overly noisy for a coffee grinder and it's simple to choose how finely or coarse you'd like your beans."
        },
        {
            "reviewerName": "Melrj",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Great grinder",
            "reviewDate": "July 12, 2019",
            "reviewText": "Small, powerful and super quiet. I can now grind my coffee while my kids are napping! Amazing! It grounds enough for 2 cup of coffee if u r using for cold brewer. Im just amazed how quiet and efficient it is! It looks great and doesnt take much room. Buy it. You wont regret!"
        },
        {
            "reviewerName": "Tia",
            "rating": "4.0 out of 5 stars",
            "reviewTitle": "Standard but attractive",
            "reviewDate": "July 13, 2019",
            "reviewText": "Intuitive to use, lovely to look at and compact enough to fit in a cabinet or on the counter. I was nervous the button might be off-center when I tried to push it before I plugged it in, but it worked just fine when I used it. No quieter than a normal grinder, but I do like the grind I get. No chunks or unground beans. I only gave it four stars because Im not sure how the on/off button will hold up after a while."
        },
        {
            "reviewerName": "Chris S",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Well built",
            "reviewDate": "July 23, 2019",
            "reviewText": "This grinder does a great job with little effort. Even coming out of the box I was happy with how well built the unit is. Now I'm waiting for my herb garden to come into season so I can start grinding the dried herbs with this newest addition to my kitchen appliances."
        },
        {
            "reviewerName": "Suks14",
            "rating": "4.0 out of 5 stars",
            "reviewTitle": "Easy to use and compact",
            "reviewDate": "October 27, 2019",
            "reviewText": "I used it to grind some dry spices and it worked well .It did take some time for I was able to get the required consistency . Because of its compact size I will be using it quite a bit since I grind coffee and spices in small batches and using big grinder is hassle ."
        },
        {
            "reviewerName": "Amazon Customer",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Works Perfectly, Looks Good in Kitchen!",
            "reviewDate": "July 10, 2019",
            "reviewText": "This coffee grinder works great! Its super quick and easy to use. I hate having too many things on my kitchen counters, but also don't have a lot of storage space in my cabinets, so this design is perfect because it's sleek, small, and a good addition! My husband and I use it every day, and we definitely would recommend getting this one!"
        },
        {
            "reviewerName": "Angela",
            "rating": "4.0 out of 5 stars",
            "reviewTitle": "Making my morning coffee with this grinder every morning",
            "reviewDate": "October 26, 2019",
            "reviewText": "This coffee grinder was a bit smaller than I expected but it works very well. Pretty much have been using it to grind my coffee beans to make my morning coffee before work since I got it. Great value for the price you pay I have to say."
        },
        {
            "reviewerName": "Adriann Smith",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "THE. BEST. EVER!",
            "reviewDate": "November 10, 2019",
            "reviewText": "I LOVE IT! I really needed an electric grinder and this came in clutch! It grinds really well and is extremely simple to use and clean. It's not very loud but it's not very quiet either. Overall it's an amazing grinder! Makes a great gift for true coffee drinkers ?"
        },
        {
            "reviewerName": "Ashish",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Small powerful coffee grinder",
            "reviewDate": "November 2, 2019",
            "reviewText": "Very compact yet powerful coffee grinder . It's easy to maintained and clean . It hardly makes any noise . I use it for coffee grinding and other spices grinding and it makes very fine mix. Looks well made and sturdy"
        },
        {
            "reviewerName": "B Siegel",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Small, Compact, Grinds Well",
            "reviewDate": "July 17, 2019",
            "reviewText": "The product is smaller than expected but the motor on this product is great and grinds coffee beans really well. It is simple to use with the on/ off button and that's all you really need. It cleans really easily too which is an added bonus!"
        },
        {
            "reviewerName": "Tina",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Works great and makes good coffee",
            "reviewDate": "July 20, 2019",
            "reviewText": "Holds a good amount of beans and is quick to grind. I like you have control over the amount and size of the ground beans. I can leave them a little bigger for iced coffee or super smooth for hot. Easy to clean and the compact size is nice."
        },
        {
            "reviewerName": "Tera Hilton",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Grind the beans",
            "reviewDate": "October 29, 2019",
            "reviewText": "I got this as a gift for my dad and he says it worked great. Quieter than his last one. Now hes a guy so he isnt super fancy but its a coffee grinder that does its job. Came with a little brush for easy cleaning."
        },
        {
            "reviewerName": "Sanja",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Call it a kitchen essential! ??",
            "reviewDate": "October 9, 2019",
            "reviewText": "Tiny, yet efficient!\nNothing like a fresh grind coffee in the comfort of your own home! This coffee grinder works wonders for me! It takes up barely any space in our kitchen, very powerful for its size, and pretty quiet for the job it does! Me and my husband love it! ??"
        },
        {
            "reviewerName": "Amazon Customer",
            "rating": "4.0 out of 5 stars",
            "reviewTitle": "Good, simple coffee grinder",
            "reviewDate": "July 23, 2019",
            "reviewText": "This coffee grinder definitely gets the job done, and is good value. It is a bit hard to clean, since both the lid and the inside of the grinder get full of coffee grinds. There are no settings, just an on button."
        },
        {
            "reviewerName": "L. Nicole",
            "rating": "4.0 out of 5 stars",
            "reviewTitle": "Grinds well",
            "reviewDate": "August 8, 2019",
            "reviewText": "Grinds coffee well but a little hard to clean. Nice size container and easy to store"
        },
        {
            "reviewerName": "Mitochondria",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Very Powerful and Compact",
            "reviewDate": "July 14, 2019",
            "reviewText": "I bought this nice grinder to grind spices in small amount and coffee beans. Grinding in small amounts preserves their aroma and freshness. It is very compact and doesn't eat much space in kitchen closet or shelf. Must buy if you make coffee from beans!"
        },
        {
            "reviewerName": "Rachel",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Good for fresher coffee & not too loud",
            "reviewDate": "November 5, 2019",
            "reviewText": "Easy & not too loud! Came with a cute little brush for cleaning- will update later after further use, but so far I like not having to rely on pre-ground coffee & being able to control the grind & freshness."
        },
        {
            "reviewerName": "Salem",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Great little bean grinder",
            "reviewDate": "October 22, 2019",
            "reviewText": "Perfect grinder for those who buys fresh beans or likes fresh ground coffee. The lid holds the max amount of beans and makes just enough for a full pot of coffee. Clean up was easy with the brush!"
        },
        {
            "reviewerName": "Annika Jay",
            "rating": "4.0 out of 5 stars",
            "reviewTitle": "Looks nice on the counter and works well.",
            "reviewDate": "November 6, 2019",
            "reviewText": "Its totally quiet, holds a good amount of coffee beans and easy to clean. Every so often if I dont leave it running long enough Ill find a few large pieces that didnt get ground but overall it works well."
        },
        {
            "reviewerName": "diwell",
            "rating": "4.0 out of 5 stars",
            "reviewTitle": "Good little grinder",
            "reviewDate": "October 13, 2019",
            "reviewText": "Good little grinder. I found that by filling the grinder FULL with beans I got a perfect fine grind. Using less beans left a few hole or broken beans and not a fine grind. Good price, works great."
        },
        {
            "reviewerName": "Courtney W.",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Compact and efficient",
            "reviewDate": "October 24, 2019",
            "reviewText": "This little thing is great! It is very small but it grinds the max amount of coffee beans in about 10 seconds. It is stainless and looks nice in the kitchen. It is also very quiet. Very pleased!"
        },
        {
            "reviewerName": "Kenneth Ngai",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Easy quick grinder",
            "reviewDate": "November 8, 2019",
            "reviewText": "I love fresh ground coffee in the morning. Previously I had a manual one that would take forever. This one does a nice job grinding my coffee and is much quicker. Good product for the price."
        },
        {
            "reviewerName": "Lindsay McLaughlin",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Great replacement. Happy I bought this!",
            "reviewDate": "September 6, 2019",
            "reviewText": "My last coffee grinder died on me, and Ive been looking for a replacement. This is compact, but definitely does the job! Nothing like a cup of fresh ground coffee! Easy to clean and works great!"
        },
        {
            "reviewerName": "nana tod",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Buy it",
            "reviewDate": "November 12, 2019",
            "reviewText": "Its my morning friend :) i love grinding the coffee beans in the morning.\n\nThe size is really good. It is easy to clean too. Its good quality and worth the price."
        },
        {
            "reviewerName": "Hakan",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Great grinder",
            "reviewDate": "November 3, 2019",
            "reviewText": "Have been using it daily for more than a month, as i like to brew my fresh coffee daily. This machine is a small monster, works great, grinds fast and be efficiently."
        },
        {
            "reviewerName": "Nikki",
            "rating": "1.0 out of 5 stars",
            "reviewTitle": "Grind button just quit after a few weeks.",
            "reviewDate": "October 25, 2019",
            "reviewText": "Loved this coffee bean grinder...worked great....then the on off button just quit working. Only way to grind is plug in to outlet and unplug. 10 days past return window, so have to replace with new one. Won't buy this brand again."
        },
        {
            "reviewerName": "lulu",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Compact + quiet",
            "reviewDate": "October 27, 2019",
            "reviewText": "Typically I grind coffee the night before so I dont wake anyone up. This said itd be quiet, and it really was compared to my old Burr. I like that its sleek too."
        },
        {
            "reviewerName": "Dana Rios",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Grinds quick",
            "reviewDate": "November 1, 2019",
            "reviewText": "I have this same electric grinder and live it. I bought another for my aunt who really likes how mine works. It grinds up coffee thin and fast. Its easy to cleanup"
        },
        {
            "reviewerName": "jen jen",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Works great",
            "reviewDate": "November 2, 2019",
            "reviewText": "The motor in my Cuisinart grinder stopped working. I found this one for a great price and figured I would give it a try. I used it this morning and it worked perfectly! My coffee was just as great as ever. I will update this review once I've used it for a while if anything changes.\nThank you."
        },
        {
            "reviewerName": "MU family...",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Light weight and does the job.",
            "reviewDate": "November 5, 2019",
            "reviewText": "Relatively quieter than regular coffee grinder machine.\nBlade is not an actual blade so no worry for cuts while cleaning.\nStainless makes cleaning part easy."
        },
        {
            "reviewerName": "Aboth",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Great product",
            "reviewDate": "November 12, 2019",
            "reviewText": "Great coffee grinder. Very easy to use and clean. I use it every day and there is no noise produced while it's in use. Just an awesome addition to my kitchen tools"
        },
        {
            "reviewerName": "Eleni",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Easy to use",
            "reviewDate": "October 25, 2019",
            "reviewText": "I like that I can now grind my coffee more efficiently. However I dont like that you cant take the compartment off to throw it in the dishwasher after uses. But overall it was easy to use and my coffee was grounded the way its supposed to be."
        },
        {
            "reviewerName": "Manan Patel",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Best coffee grinder for it's vaule.",
            "reviewDate": "July 16, 2019",
            "reviewText": "Coffee grinder worked great as advertised; it even grinds Indian spices very fine. I grounded fresh Turkish coffee at home with whole cardamom pods. Must buy product for it's value."
        },
        {
            "reviewerName": "Amit Patel",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Coffee Grinder..!!!",
            "reviewDate": "October 7, 2019",
            "reviewText": "A very nice coffee grinder, worth the price, it is easy to clean and very quiet when using it. It has only one setting so you dont have an option if you have to grind it more fine."
        },
        {
            "reviewerName": "Keith & Priyashna",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Very convenient",
            "reviewDate": "July 26, 2019",
            "reviewText": "Such a wonderful grinder. Totally love it. The fact that I can grind possibly anything such as nuts, coffee beans. Is compact which is convenient. Easy to use and clean. Just the prefect size."
        },
        {
            "reviewerName": "Prachi",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Cute little useful grinder",
            "reviewDate": "September 30, 2019",
            "reviewText": "This cute little coffee grinder is amazing. It works super awesome. Not only for coffee but it will grind all me spices which are in small amount. Very useful!!"
        },
        {
            "reviewerName": "Katie Bee",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Great",
            "reviewDate": "October 24, 2019",
            "reviewText": "Great coffee grinder! Started making my own coffee from scratch and its great. It Grinds to a perfect consistency, and is very sleek and small, doesnt take up a lot of space"
        },
        {
            "reviewerName": "Ankit Bhardwaj",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Nice product and a good Build quality",
            "reviewDate": "August 1, 2019",
            "reviewText": "Good for grinding coffee for coffee lovers.\nNice build quality and does the job quickly without getting extremely hot. i've also used it as a regular grinder to grind spices."
        },
        {
            "reviewerName": "Adam Yousufzi",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Great Grinder.",
            "reviewDate": "November 11, 2019",
            "reviewText": "This is a grinder for all who want to have thier smooth coffee or tea. Its was easy to use and quick. I'm also using it to grind my Cardinmin to make my tea taste better. Thx"
        },
        {
            "reviewerName": "Liu",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Easy to use, sleek and powerful coffee grinder!",
            "reviewDate": "November 10, 2019",
            "reviewText": "It has a wide opening for easy cleaning and also a neat button for easy push operation for my daily dose of coffee powder.\nGreat product!!!"
        },
        {
            "reviewerName": "Vanessa M",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Very nice",
            "reviewDate": "October 2, 2019",
            "reviewText": "Very easy to use and very light weight. Ill be using for coffee and to blend and mix my spices."
        },
        {
            "reviewerName": "Bri",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Great buy",
            "reviewDate": "September 17, 2019",
            "reviewText": "This coffee grinder is small but powerful, its very handy especially in my kitchen where space is limited. It works great & is very easy to store."
        },
        {
            "reviewerName": "J Smith",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Works fast and quiet",
            "reviewDate": "November 5, 2019",
            "reviewText": "Great coffee grinder, compact and easy to clean. It runs pretty quiet too. Make sure you shake the coffee beans in between for the ground coffee to be even."
        },
        {
            "reviewerName": "subid",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Fresh grounded coffee every morning",
            "reviewDate": "August 6, 2019",
            "reviewText": "I use this grinder to make 4-5 cups of fresh grounded coffee. Finally I do not have to buy grounded coffee, and get coffee beans. Great product, easy to use and clean."
        },
        {
            "reviewerName": "Stephen J.",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Good coffee grinder",
            "reviewDate": "July 24, 2019",
            "reviewText": "Nice little coffee grinder. It isnt too loud either. If you like strong coffee you need to run it twice, since it doesnt like being filled over the stainless line"
        },
        {
            "reviewerName": "PR",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Great for coffee/ spices. Handy little brush",
            "reviewDate": "November 4, 2019",
            "reviewText": "I like this little grinder. I use it to grind fresh spices and it works great for that. I like that it comes with a little brush."
        },
        {
            "reviewerName": "JW",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Stainless steel look",
            "reviewDate": "July 19, 2019",
            "reviewText": "I like this grinder. I had one before, plastic look but this is a stainless steel look, sturdy, kind of oval shape. Very cute and slick. Love it."
        },
        {
            "reviewerName": "Jenni",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Compact grinder-great for on the go!",
            "reviewDate": "October 31, 2019",
            "reviewText": "This is a great looking solid grinder. Easy to use then store away. I am excited to have a small portable coffee grinder."
        },
        {
            "reviewerName": "Ariel",
            "rating": "3.0 out of 5 stars",
            "reviewTitle": "A Basic Automatic Coffee Grinder",
            "reviewDate": "November 3, 2019",
            "reviewText": "Its definitely saved that trip to the coffee shop or grinder machine. However, Ive noticed internal scratches upon the 3rd use and Im not sure if thats common in all coffee bean grinders. Its also a bit difficult to clean and Id love to see a better brush included."
        },
        {
            "reviewerName": "Elijah&Jamie",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Good buy.",
            "reviewDate": "November 4, 2019",
            "reviewText": "Easy to use and clean. I bought this after my last one broke and its very similar. I use it for coffee every morning."
        },
        {
            "reviewerName": "Matt DiGeronimo",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Very impressed!!",
            "reviewDate": "July 16, 2019",
            "reviewText": "Ive been looking for a reasonably Leicester good quality grinder to grind For a gourmet bean subscription. I was not disappointed with this one!"
        },
        {
            "reviewerName": "David C. Bailey",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Easy to use!",
            "reviewDate": "September 27, 2019",
            "reviewText": "This grinder is perfect for grinding your own coffee beans at home for that fresh taste. Its super easy to set up and use!"
        },
        {
            "reviewerName": "Tien Le",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Strong little coffee grinder",
            "reviewDate": "November 1, 2019",
            "reviewText": "It works perfectly. It's also easy to clean. You just have to wipe it clean with a napkin and use the brush for spots that a napkin can't get too. Besides of that, I use this grinder for pepper and other grains."
        },
        {
            "reviewerName": "Jeremy",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Compact coffee grinder",
            "reviewDate": "July 11, 2019",
            "reviewText": "This is a great coffee grinder and does exactly what it says. Super compact and easy to use! It will be a great one to take when I travel."
        },
        {
            "reviewerName": "Gabe Miller",
            "rating": "1.0 out of 5 stars",
            "reviewTitle": "Stopped working after 5 weeks",
            "reviewDate": "October 29, 2019",
            "reviewText": "Stopped working 5 weeks in. Would like my money back."
        },
        {
            "reviewerName": "skichic",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Good, compact grinder",
            "reviewDate": "September 9, 2019",
            "reviewText": "Compact grinder that does a good job! Stainless steel, does not take up a lot of space, easy to clean. Easy to use."
        },
        {
            "reviewerName": "KP",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Grinds well",
            "reviewDate": "September 30, 2019",
            "reviewText": "Awesome addition in kitchen. It grinds the spices nicely. I tried dry cumin and it was perfect. Something I was missing in my kitchen and I got it now."
        },
        {
            "reviewerName": "RK",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Compact and great quality",
            "reviewDate": "July 15, 2019",
            "reviewText": "I love the fact that it is compact. It stores well. I ground some coffee and it did a great job. It is a nice looking appliance."
        },
        {
            "reviewerName": "Abdullah Mohammed",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Grinds Well",
            "reviewDate": "November 5, 2019",
            "reviewText": "Really great. Needed an update from my old spice grinder and this did the trick and more. Works well and the stainless steel looks nice on my counter."
        },
        {
            "reviewerName": "Brittany",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Great and affordable!",
            "reviewDate": "July 14, 2019",
            "reviewText": "Such an affordable Coffee grinder! I love this thing! It works great! Perfect for grinding for cold brew and for regular coffee"
        },
        {
            "reviewerName": "Victoria",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Blends amazingly",
            "reviewDate": "November 9, 2019",
            "reviewText": "Blends beautifully. Not too noisy band very simple which makes it easy to use. Would definitely recommend"
        },
        {
            "reviewerName": "Fallee",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Great grinder!!",
            "reviewDate": "July 20, 2019",
            "reviewText": "I like this grinder, it is larger than my last one and very easy to use. It also does a good, quick and easy grind"
        },
        {
            "reviewerName": "Racquelle",
            "rating": "4.0 out of 5 stars",
            "reviewTitle": "does its job, but small capacity",
            "reviewDate": "October 30, 2019",
            "reviewText": "easy to use, doesnt hold a lot of beans so it takes like 4 go's to actually grind enough"
        },
        {
            "reviewerName": "NJ",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Easy to use",
            "reviewDate": "July 28, 2019",
            "reviewText": "Was waiting for my package to arrive and so happy with the purchase. Easy to use and clean, would recommend."
        },
        {
            "reviewerName": "Michl",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Nice little grinder",
            "reviewDate": "October 9, 2019",
            "reviewText": "This is a great little coffee grinder. Its not too loud and not too big. Super easy to use"
        },
        {
            "reviewerName": "Monti",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Fantastic and very happy with product",
            "reviewDate": "November 11, 2019",
            "reviewText": "Ive never had a coffee grinder before and its wonderful , it really grinds the beans fine and\nThe coffee is fresh and is more vibrant then buying coffee grounds"
        },
        {
            "reviewerName": "Hen Hen",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Powerful Grinder",
            "reviewDate": "July 12, 2019",
            "reviewText": "Its compact and powerful grinder.\nVery stylish and modern design.\nSo beautiful and great a gift too"
        },
        {
            "reviewerName": "Elias",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Simple yet so great!",
            "reviewDate": "November 2, 2019",
            "reviewText": "I got this for my mom since she loves coffee and she told me she loves and it uses a lot. plus the price is great. totally recommend!"
        },
        {
            "reviewerName": "Christina Peterson",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Not as loud as my older model.",
            "reviewDate": "October 22, 2019",
            "reviewText": "The brush is a helpful tool to get the coffee out. It grinds very well and is quieter than the one I was replacing."
        },
        {
            "reviewerName": "LaToya J.S. Fortier",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Quiet. Easy to use.",
            "reviewDate": "November 10, 2019",
            "reviewText": "I did like this coffee grinder. It definitely was quieter then my current coffee grinder. The initial start of the grinding of the beans makes noise but after two seconds it got quieter. It really is easy to use just place the beans in and push the button to your desired level."
        },
        {
            "reviewerName": "Nisha",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Grinder and storage",
            "reviewDate": "July 12, 2019",
            "reviewText": "I wanted to buy a good coffee grinder since long and I am happy for this purchase. This is a perfect fit"
        },
        {
            "reviewerName": "Daisy W.",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "convenient on the go grinder",
            "reviewDate": "July 23, 2019",
            "reviewText": "This very ideal for travel such compact powerful grinder, easy to clean and put away."
        },
        {
            "reviewerName": "bush144",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Nice product!",
            "reviewDate": "July 15, 2019",
            "reviewText": "Great bean grinder! Looks nice and produces a well ground coffee! Easy to clean after using as well!"
        },
        {
            "reviewerName": "ZF",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Best",
            "reviewDate": "November 5, 2019",
            "reviewText": "I love my new coffee grinder. It's the best.makes my life so easy. I use it to grind other stuff too."
        },
        {
            "reviewerName": "Sarah",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Seems like a good quality coffee grinder!",
            "reviewDate": "November 11, 2019",
            "reviewText": "Got this for a gift! Will update review once user uses the coffee grinder!"
        },
        {
            "reviewerName": "Holli Leroux",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Good quality, easy to use.",
            "reviewDate": "October 28, 2019",
            "reviewText": "Happy with the size and durability of this product. Its very easy to use."
        },
        {
            "reviewerName": "Ashley",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Compact",
            "reviewDate": "September 9, 2019",
            "reviewText": "Good size. It's small so it doesn't take up alot of counter/cupboard space!"
        },
        {
            "reviewerName": "Ashley",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Great product",
            "reviewDate": "October 29, 2019",
            "reviewText": "Love the depth works quickly with low noise and the cleaning brush is perfect!"
        },
        {
            "reviewerName": "Alexis Starnes",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Recommend",
            "reviewDate": "November 1, 2019",
            "reviewText": "Great quality, nice and sturdy, large space for the grinding area."
        },
        {
            "reviewerName": "Emjay",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "I love this thing!!!!",
            "reviewDate": "July 7, 2019",
            "reviewText": "This is great so simple and easy to clean !!!!! Fresh ground coffee when u want omg!!!!!!!"
        },
        {
            "reviewerName": "Elsa",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Coffee lover!",
            "reviewDate": "July 19, 2019",
            "reviewText": "I like the sleek design and color! And its not loud as other coffee grinder! Easy to use!"
        },
        {
            "reviewerName": "Sara S",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Works great",
            "reviewDate": "July 24, 2019",
            "reviewText": "Easy to use. Seems kind of difficult to get all of the coffee out of it. Great value for the price."
        },
        {
            "reviewerName": "Kiran Ali",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Makes coffe grind faster",
            "reviewDate": "July 9, 2019",
            "reviewText": "I love this brand. It is better then any offer brand I have used for grinder my coffee"
        },
        {
            "reviewerName": "Peg",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "easy to use and it does the job",
            "reviewDate": "July 16, 2019",
            "reviewText": "This is a very easy to use grinder. Its design is nice as well. I would recommend it."
        },
        {
            "reviewerName": "Elsafih",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "High quality product",
            "reviewDate": "November 10, 2019",
            "reviewText": "It works absolutely great. It can ground many things. Well made"
        },
        {
            "reviewerName": "Mark Koson",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Really like it!!",
            "reviewDate": "November 7, 2019",
            "reviewText": "We really like this product. Top quality, easy to use, great price!!"
        },
        {
            "reviewerName": "Richard D Roberts",
            "rating": "4.0 out of 5 stars",
            "reviewTitle": "Good Value",
            "reviewDate": "September 4, 2019",
            "reviewText": "it is easy lightweight and quiet are the positives... but It isn't grinding every last bean...there is always a few beans not ground. Not sure if it is the design or not. does a good enough job. but if you are a coffee connoisseur you may want to go with a more industrial model."
        },
        {
            "reviewerName": "Artem Aleksandruk",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Amazing Coffee Grinder",
            "reviewDate": "July 13, 2019",
            "reviewText": "Love this coffee grinder! Works perfectly, its not too loud, and has a big enough space inside when I want to grind for more than one cup! Definitely recommend!"
        },
        {
            "reviewerName": "D. Simpson",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Works great!",
            "reviewDate": "July 26, 2019",
            "reviewText": "Compact and easy to use! I grind my coffee daily so I do put a grinder to use, so far this one seems to be great."
        },
        {
            "reviewerName": "Melissa k",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Great coffee grinder",
            "reviewDate": "September 27, 2019",
            "reviewText": "Works amazing! Not to loud, quick and easy to clean and use! Great product!"
        },
        {
            "reviewerName": "Michelle",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Nice little grinder",
            "reviewDate": "September 3, 2019",
            "reviewText": "It grinds well and isnt loud as long as you hold the grinder in your hands."
        },
        {
            "reviewerName": "Caitlin",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "A great coffee grinder!",
            "reviewDate": "November 8, 2019",
            "reviewText": "This is a nice little coffee grinder. It is well made, and it is super quiet! I love fresh ground coffe, so I'm excited to add this to my kitchen!"
        },
        {
            "reviewerName": "Momof3",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Quiet",
            "reviewDate": "July 24, 2019",
            "reviewText": "Easy to clean, way quieter than the other one I purchased. Glad I found it"
        },
        {
            "reviewerName": "Kristin",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Compact power",
            "reviewDate": "November 7, 2019",
            "reviewText": "This grinds like a dream and for the price you can't go wrong. Low Noise level for a calm brewing"
        },
        {
            "reviewerName": "adriana lozano",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Excellent!!",
            "reviewDate": "July 8, 2019",
            "reviewText": "This coffee grinder isnt bulky and aesthetically blends in well with my other stain less steel appliances. It grinds my favorite beans evenly and finely which makes for the best cup of coffee in the mornings. Its not too loud, which is a pet peeve of mine. All in all, excellent product for an even better price!!"
        },
        {
            "reviewerName": "Oliver Crocco",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Great quality!",
            "reviewDate": "October 16, 2019",
            "reviewText": "This grinder is very powerful and great quality!"
        },
        {
            "reviewerName": "levpasha",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Small and lightweight",
            "reviewDate": "November 10, 2019",
            "reviewText": "Looks and works great! Small and lightweight. I really like it."
        },
        {
            "reviewerName": "Anthony Menconi",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Good buy",
            "reviewDate": "October 14, 2019",
            "reviewText": "It comes with a little brush so it's super easy to clean. Grinds well which is nice for my french press which requires a course grind."
        },
        {
            "reviewerName": "Roozbeh Hamed",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "No noise easy to use",
            "reviewDate": "November 6, 2019",
            "reviewText": "Easy to use not noisy cuts up beans well"
        },
        {
            "reviewerName": "Julie S",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Works well",
            "reviewDate": "October 11, 2019",
            "reviewText": "Works good. Not as loud as our old one"
        },
        {
            "reviewerName": "YanHao Tan",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "bigger size serves bigger coffee needs",
            "reviewDate": "November 11, 2019",
            "reviewText": "better than my last coffee grinder"
        },
        {
            "reviewerName": "Amy S",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Grinds well",
            "reviewDate": "July 11, 2019",
            "reviewText": "Works really well. Grinds coffee evenly. Easy to clean out."
        },
        {
            "reviewerName": "Joshua Cortese",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Great!",
            "reviewDate": "July 11, 2019",
            "reviewText": "Great product! Works well and makes good coffee!"
        },
        {
            "reviewerName": "Dawn",
            "rating": "4.0 out of 5 stars",
            "reviewTitle": "Good value",
            "reviewDate": "July 22, 2019",
            "reviewText": "I like that its made of stainless steel. Good value for its price!"
        },
        {
            "reviewerName": "Debbie Chen",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Excellent coffee bean grinder",
            "reviewDate": "July 26, 2019",
            "reviewText": "This product doesn't have extra bells and whistles, which is exactly what I was looking for. It's small so it doesn't take up a lot of space on the counter, and is intuitive to use."
        },
        {
            "reviewerName": "Simeta",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Fresh ground coffee!",
            "reviewDate": "July 13, 2019",
            "reviewText": "Feeling fancy! Fresh coffee at home!!! Super excited!"
        },
        {
            "reviewerName": "Chris G.",
            "rating": "1.0 out of 5 stars",
            "reviewTitle": "Didnt turn on",
            "reviewDate": "October 20, 2019",
            "reviewText": "Didnt work try agian dont work id say this product grinder is a big pile of dog crap.."
        },
        {
            "reviewerName": "viv egolf",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Easy to use",
            "reviewDate": "July 18, 2019",
            "reviewText": "Great product and does what its supposed to do!"
        },
        {
            "reviewerName": "Chico",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Coffee grinder",
            "reviewDate": "September 25, 2019",
            "reviewText": "Couldnt wait to open and use. It worked great absolutely a great product."
        },
        {
            "reviewerName": "Kaitlin Retzlaff",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Less noisy",
            "reviewDate": "July 16, 2019",
            "reviewText": "High power works great and easy to clean"
        },
        {
            "reviewerName": "TMD2010",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Compact",
            "reviewDate": "September 3, 2019",
            "reviewText": "Fits perfect on the counter"
        },
        {
            "reviewerName": "CB",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "It's good product",
            "reviewDate": "July 22, 2019",
            "reviewText": "If you're a coffee lovers, you need it"
        },
        {
            "reviewerName": "So Hyun Rhee",
            "rating": "2.0 out of 5 stars",
            "reviewTitle": "Black water leaking",
            "reviewDate": "October 12, 2019",
            "reviewText": "There seems to be something leaking from underneath the coffee grinder - some disgusting black water. Is this a malfunction of the machine?"
        },
        {
            "reviewerName": "andrew kolakowski",
            "rating": "1.0 out of 5 stars",
            "reviewTitle": "VERY FILMSY",
            "reviewDate": "November 12, 2019",
            "reviewText": "NO GOOD"
        },
        {
            "reviewerName": "Kiran Agarwal",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Much more than coffee",
            "reviewDate": "August 2, 2019",
            "reviewText": "Excellent way to grind dry stuff"
        },
        {
            "reviewerName": "MOHAMMAD PARVEZ",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Good",
            "reviewDate": "November 2, 2019",
            "reviewText": "Good"
        },
        {
            "reviewerName": "Lotsallamas",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Easy to use",
            "reviewDate": "September 12, 2019",
            "reviewText": "Feels sturdy. Easy to use."
        },
        {
            "reviewerName": "Emmett",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Quick and easy to use",
            "reviewDate": "July 15, 2019",
            "reviewText": "Great coffee grinder"
        },
        {
            "reviewerName": "cynthia carroll",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Amazing deal",
            "reviewDate": "November 3, 2019",
            "reviewText": "Very nice and well made !"
        },
        {
            "reviewerName": "Jennifer Hoxie",
            "rating": "4.0 out of 5 stars",
            "reviewTitle": "Compact, easy to use",
            "reviewDate": "July 7, 2019",
            "reviewText": "Just recieved my grinder and I'm already enjoying it! Small, easy to use, and good quality."
        },
        {
            "reviewerName": "Eugene",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Coffee grinder",
            "reviewDate": "October 18, 2019",
            "reviewText": "Good price for the money. It does what I need it to do."
        },
        {
            "reviewerName": "Becky",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Super quiet!",
            "reviewDate": "October 24, 2019",
            "reviewText": "Super quiet and works great!"
        },
        {
            "reviewerName": "Audrey Kuykendall",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Good deal!",
            "reviewDate": "October 25, 2019",
            "reviewText": "Ive gone through coffee grinders.\nThis is heavy duty and simple to use!\nIts exactly like the picture, too!"
        },
        {
            "reviewerName": "Anneta Glavin",
            "rating": "4.0 out of 5 stars",
            "reviewTitle": "This coffee grinder grinds coffee really well.",
            "reviewDate": "July 22, 2019",
            "reviewText": "I use this grinder to grind coffee. I like it well enough...however, I dont love that some of the coffee sticks to the bottom after I grind it. Id prefer if all the coffee came out at once."
        },
        {
            "reviewerName": "embro",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Great Grinder!",
            "reviewDate": "July 12, 2019",
            "reviewText": "I love this grinder- I am so glad i got it. it is small yet sturdy/heavy. I knew right away when I took it out of the box that it was going to be good quality. very nice design and works great. A+"
        },
        {
            "reviewerName": "Ashley",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Great product!",
            "reviewDate": "July 19, 2019",
            "reviewText": "I love that it is stainless steel! So easy to use and cleans well! Love it!"
        },
        {
            "reviewerName": "Amazon Customer",
            "rating": "1.0 out of 5 stars",
            "reviewTitle": "Does not grind evenly!",
            "reviewDate": "November 5, 2019",
            "reviewText": "This grinder does not grind evenly. It leaves large chunks of coffee that are not ground, often whole beans. I recently tried shaking it as I grind & that does help. It is still a coarse grind. I would not purchase again."
        },
        {
            "reviewerName": "Shr",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Typical coffee grinder",
            "reviewDate": "July 16, 2019",
            "reviewText": "Good grinder. Not too noisy and i have used it to grind a spice mix as well."
        },
        {
            "reviewerName": "D1723",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Small size",
            "reviewDate": "July 10, 2019",
            "reviewText": "Love the size and how simple it is to use. Nice to store in small areas."
        },
        {
            "reviewerName": "Stuart White",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Great Buy!",
            "reviewDate": "July 9, 2019",
            "reviewText": "I was looking for a small and easy to use coffee grinder and this is it! The quality is great and I can also use it to grind nuts and spices. I would highly recommend this product!"
        },
        {
            "reviewerName": "Heidi King",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Works as advertised...Simple, no frills, reliable!",
            "reviewDate": "July 22, 2019",
            "reviewText": "Easy open lid and easy to collect coffee once ground. Cleaning is very simple. Takes up very little space so easy to store on counter or in cabinet. Would buy again in a heartbeat."
        },
        {
            "reviewerName": "Shamain Lakhani",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Great product",
            "reviewDate": "November 10, 2019",
            "reviewText": "Great product.. Grounded coffee well."
        },
        {
            "reviewerName": "Andres maya",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Great product",
            "reviewDate": "June 27, 2019",
            "reviewText": "Great product, great design"
        },
        {
            "reviewerName": "Amazon Customer",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Relatively quite and very easy to use",
            "reviewDate": "October 11, 2019",
            "reviewText": "Great value for the money. Replaced our old grinder from hamilton beach brand. This was same price and is far superior."
        },
        {
            "reviewerName": "Kelvin Huang",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "easy to operate",
            "reviewDate": "November 6, 2019",
            "reviewText": "I like this grinder a lot, very easy to use and clean"
        },
        {
            "reviewerName": "Mikhail Panasyuk",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Great product!!!",
            "reviewDate": "July 18, 2019",
            "reviewText": "Love love love this grinder! Super easy to use and the best addition to my little coffee station!"
        },
        {
            "reviewerName": "Jeslyn",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Electric coffee grinder review",
            "reviewDate": "November 11, 2019",
            "reviewText": "It is very good size for personal use and easy to carry for traveling. It is very powerful for grinding. I love it so far."
        },
        {
            "reviewerName": "Melissa Ann Marshall",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Easy to store",
            "reviewDate": "September 28, 2019",
            "reviewText": "Perfect and small for easy storage"
        },
        {
            "reviewerName": "Daniel Mendoza",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Awesome Coffee Grinder!",
            "reviewDate": "July 4, 2019",
            "reviewText": "Really easy to use and grinds coffee in no time."
        },
        {
            "reviewerName": "Ricardo Gomez",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Works great!",
            "reviewDate": "July 5, 2019",
            "reviewText": "Works great! Ground my coffee perfectly and with ease"
        },
        {
            "reviewerName": "Tom Johnson",
            "rating": "4.0 out of 5 stars",
            "reviewTitle": "Second time was a charm!",
            "reviewDate": "November 4, 2019",
            "reviewText": "Had to return the first one as it didn't work, but the second time around, all is good. Works like a coffee grinder should.."
        },
        {
            "reviewerName": "Eric Huth",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Perfect",
            "reviewDate": "September 8, 2019",
            "reviewText": "Its a perfect little coffee grinder for an 8, 10 or 12 cup home brew machine."
        },
        {
            "reviewerName": "Jeanette",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Love it",
            "reviewDate": "July 20, 2019",
            "reviewText": "Not just for coffee great for other uses and perfect for what I need and very easy to clean after use"
        },
        {
            "reviewerName": "Nguyen",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "great product",
            "reviewDate": "July 31, 2019",
            "reviewText": "very easy to use and work well."
        },
        {
            "reviewerName": "Amazon Customer",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Great product!",
            "reviewDate": "July 22, 2019",
            "reviewText": "Great product!"
        },
        {
            "reviewerName": "Andriy S. Zavyalov",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Works good.",
            "reviewDate": "November 4, 2019",
            "reviewText": "Nice grinder. Doesnt take a lot of space in the kitchen and grinds pretty fast."
        },
        {
            "reviewerName": "Geoffrey",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Easy to empty",
            "reviewDate": "October 31, 2019",
            "reviewText": "Grinds fast and coffee its easy to transfer coffee out!"
        },
        {
            "reviewerName": "Veronica",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Best coffee grinder ever",
            "reviewDate": "July 9, 2019",
            "reviewText": "Awesome product !!!!!! So happy with this purchase :)"
        },
        {
            "reviewerName": "Niteshkumar Shah",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "portable coffee blender",
            "reviewDate": "July 13, 2019",
            "reviewText": "This is great, works really well and quietly."
        },
        {
            "reviewerName": "Amazon Customer",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Great product",
            "reviewDate": "July 7, 2019",
            "reviewText": "The product arrived quickly and works really well"
        },
        {
            "reviewerName": "Hai nguyen",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Great product",
            "reviewDate": "September 5, 2019",
            "reviewText": "Small, quiet."
        },
        {
            "reviewerName": "Evan H.",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Best coffee grinder Ive had",
            "reviewDate": "July 13, 2019",
            "reviewText": "Best coffee grinder Ive had"
        },
        {
            "reviewerName": "Leona Duerksen",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Not too loud!",
            "reviewDate": "July 7, 2019",
            "reviewText": "I've had it for 2 days now, used it multiple times each day. It works fantastically and isn't too loud either. About the sound level of a vaccuum cleaner.\nGrinds perfectly, no large chunks and everything is pretty evenly ground."
        },
        {
            "reviewerName": "Kayla May",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Easy and great",
            "reviewDate": "September 19, 2019",
            "reviewText": "Great price was a great addition to my kitchen easy to use and clean I see my mother in law getting for the holidays as a gift thank you so much"
        },
        {
            "reviewerName": "cheryl",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Great grinder!",
            "reviewDate": "July 10, 2019",
            "reviewText": "Works great! I like being able to have fresh ground coffee. There's nothing better!"
        },
        {
            "reviewerName": "Vanessa mendez",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Coffee maker",
            "reviewDate": "November 3, 2019",
            "reviewText": "Easy to use"
        },
        {
            "reviewerName": "KE",
            "rating": "3.0 out of 5 stars",
            "reviewTitle": "Doesn't Grind Beans Completely.",
            "reviewDate": "September 15, 2019",
            "reviewText": "The coffee grinder does not grind all of the beans completely."
        },
        {
            "reviewerName": "Nyssa",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Perfect Size and Grind for my Mornings??",
            "reviewDate": "September 4, 2019",
            "reviewText": "I got a HUGE bag of whole coffee beans as a present so I decided it was a grown up decision to buy a coffee grinder, since when you bring them in smaller quantities it has a better flavor and taste. I'M SO GLAD! First off it's fun. I like grinding things and it's nice to know you're purposefully doing so instead of hearing those accidental grinding noises that tell you you really messed up... I also decided to make myself a small cup of coffee to try it out and so I put a servings worth of beans in and then transferred it to my single serve reusable filters and wow, the coffee came out so flavorful and aromatic. it's always so funny to me the things that make me happy now compared to when I was a kid (I never would have dreamed of getting a coffee grinder at 15), but they really help me feel like I'm living a higher class adult life by making my day to day necessities so much nicer.\n\nWhat was cool to find out is that I can also bring different herbs in here as well which is great to know because it feel like fancy herbs is always a gift someone decides to get you when you're having a bridal shower. XD"
        },
        {
            "reviewerName": "Jess",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Stylish and sleek yet a powerful little coffee grinder!",
            "reviewDate": "July 16, 2019",
            "reviewText": "I am really happy with this purchase. I was looking for something that would look nice but would also function excellent and a breeze to clean. This is it. It took me no time to finely grind my coffee and get my perfect cup of Joe. It is lightweigh and quiet and very user friendly. The coarseness of the beans are up to you. Really loving and enjoying this little grinder!"
        },
        {
            "reviewerName": "Katie Branham",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Great for the price.",
            "reviewDate": "July 16, 2019",
            "reviewText": "I have always been interested in grinding my own beans to make coffee, but I had never done it. For the price, I wanted to try it, and I am glad I did. It takes a little more time than scooping coffee out of the canister, but it is SO WORTH IT!!\n\nThe build quality on this is amazing, there is no settings for courseness but, I was happy with the outcome. All you have to do is grind it a little longer if you want less course beans. The blade is easy to clean as is the entire maching. I have used it over a week with no problems what so ever. I hope that it continues to perform as well as it is now. I will be so happy with this.\n\nThe only downside is the beans are more expensive, but the taste makes it well worth it."
        },
        {
            "reviewerName": "MNB",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Compact, quiet and can grind coffee beans to coarse or fine!",
            "reviewDate": "November 2, 2019",
            "reviewText": "So I have been using a manual coffee grinder for the past year to make my cold brew coffee because the internet said an automatic grinder is too loud and itll grind the beans too fine. After a year of grinding, I got tired of doing it so my lovely wife started to grind the beans for me but we both finally gave up. Browsed around and decided to purchase the Kaffe Grinder and let me tell you, this is the best thing ever! It is not loud at all and itll grind the beans any way you like it, fine or coarse. You just dump some beans inside the grinder, attach the top and tap the button on and off until you get the grounds youre looking for. I actually used it to make cold brew as well as hot brew and it was fast and easy. The Kaffe Grinder is also very compact, making it easy to store. Overall, this is a great product and I would highly recommend to anyone thats a coffee lover!"
        },
        {
            "reviewerName": "Sri j",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Great at grinding and its multi purpose! Worth purchasing!",
            "reviewDate": "September 5, 2019",
            "reviewText": "We have owned this machine for a week now and we are completely satisfied with this product. We are not only using this to grind coffee beans, but also grinding the other cooking spices into a fine powder. Its a multi purpose grinder and completely worth of purchasing.\n\nPros:\n1) By using this product we can make fine powders\n2) its multipurpose\n3) Compatible and easy to clean\n4) compare to others less noisy\n\nHope this review help others who are looking for good coffee grinders (but also other spices ??)."
        },
        {
            "reviewerName": "Ram Bhattarai",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Simple, quite and powerful!",
            "reviewDate": "July 14, 2019",
            "reviewText": "Simple yet very powerful! Easy to clean and looks great in the kitchen. Love this product as this my now most used kitchen gadget. We are using this product to grind coffee as well all the spices. Much quieter than the previous coffee grinder we had that died out of nowhere. This one has three years warranty. Buy it!!"
        },
        {
            "reviewerName": "Azura Lanoue",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Kaffe-Quiet Coffee Grinder",
            "reviewDate": "July 16, 2019",
            "reviewText": "I received the Kaffe electric coffee grinder in the mail today and used it right away.\nPros- Sleek and stainless steel and design that matches my kitchen. Thumbs up.\nEverything was in the package and directions were easy.\nGrinder was very quiet while grinding.\nEasy to use with an on button and also seems safe.\nClear lid allowed me to see the coarseness of the grind.\nDusting broom allowed me to clean both the lid and the inside part of the grinder to maximize amount of coffee grounds in my filter.\n\nCons- the only con I can see so far is trying to clean the inside of the lid on the corners by the \"On\" button. The coffee grounds seem to like that area, and it takes a little extra brushing to get them out of that crevice. Other than that, no other concerns with the Kaffe electric coffee grinder\n\nI would definitely recommend the Kaffe electric coffee grinder for a quiet and easy coffee grinder"
        },
        {
            "reviewerName": "Nick Underwood",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Fresh Ground Coffee Is Better.",
            "reviewDate": "July 10, 2019",
            "reviewText": "Something about grinding your own beans. Makes the aroma of freshly ground coffee fill the room 10x more than just opening a bag of already ground coffee. This grinder makes that possible. Holding 2.5oz of coffee beans and a pulse on/off switch - you have the option of making your coffee as finely ground or as coarsely ground as youd like. Cold brew coffee and French press I use a bigger grind and regular drip I prefer a thinner blend. This makes it possible and Im in love."
        },
        {
            "reviewerName": "Lincoln Cao",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Perfect for Pour Overs",
            "reviewDate": "November 7, 2019",
            "reviewText": "I have been doing alot of research lately on various types of grinders. I like to prep my coffee with a Pour Over, and need finely ground the beans. You need them to be finely ground to bring out the full taste of the coffee bean.\nThis grinder does just that, and I feel like I never fully tasted that coffee if not for this. This is a blade type grinder and gets the job done quickly. Just place a few cups of beans into the grinder, cover, then wait a few minutes till the coffee is ground to almost sugar like consistency. The container is solid and easy to wipe clean.\nI would buy this again for our office Christmas party."
        },
        {
            "reviewerName": "Phung Lam",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Great compact coffee grinder",
            "reviewDate": "September 27, 2019",
            "reviewText": "My dad is a coffee-holic. He has been searching for his ideal coffee grinder. He told me the coffee grinder he had been using started to have some problems, which did not worked as before. Thus, i went on Amazon and found this coffee grinder for my dad. After using for few days, he called me saying that he finally found his ideal coffee grinder and thanked me a lot. It is a great value for a coffee grinder."
        },
        {
            "reviewerName": "BMoney",
            "rating": "3.0 out of 5 stars",
            "reviewTitle": "Good but not perfect",
            "reviewDate": "September 9, 2019",
            "reviewText": "Update: I gave knocked this product down a star because while I thought it was user error, another person tried it and it is just too hard to get the right grind for french press coffee. We still have it as a backup in case our breaks, but this is not that great.\n\nPros: Seems pretty powerful, nice looking, seems easy to clean (it comes with a nice little brush).\nCons: Still pretty loud.\nThis is a nice little grinder, and grinds very well and quickly. It is however, just as loud as my current one which is a little disappointing as a lot of reviews on here mentioned it was quieter than most other grinders."
        },
        {
            "reviewerName": "Lani",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Way better than a reputable brand",
            "reviewDate": "October 25, 2019",
            "reviewText": "My sister in law let me borrow her coffee grinder when I was gifted a bag of whole bean espresso so I have been wanting to get one of my own. Here is a comparison of her Mr. Coffee one and my new Kaff one. It is much sleeker looking and shorter is easier to stow away or display on a counter. Its also one easy top off that can be cleaned with a brush thats included. Props to the customer that submitted the video of flipping the machine over to easily get the ground coffee out. Great tip! Also, the other machine has three components while this one is easier with just the top lid. Easy peasy."
        },
        {
            "reviewerName": "Naga",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Perfect Electric Coffee Grinder",
            "reviewDate": "July 9, 2019",
            "reviewText": "If we want to try a fresh coffee this is the best grinder I have ever seen, the way it grinders coffee beans are so good & I can feel the fresh taste. It's so fast & easy to use, the quality of the product is awesome and as its a stainless steel item it's so easy for cleaning. After using for few times, I got one more & gifted to my sister. I love this product & recommend this."
        },
        {
            "reviewerName": "Hira Salman",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Works great for dry grinding",
            "reviewDate": "September 9, 2019",
            "reviewText": "Comes with a cleaning brush that makes it easy to clean. Although it's a coffee grinder but I use it for grinding spices too. Works great for all the dry grinding."
        },
        {
            "reviewerName": "Bells",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Fresh coffee everyday",
            "reviewDate": "October 27, 2019",
            "reviewText": "I decided to finally go from grinding my beans in store to grinding it fresh everyday. Since I started brewing coffee with a French press every morning, I decided it was time for me to invest in a coffee grinder so I can brew the best cup of Joe I can at home.\nThe Kaffe grinder is fairly simple to set up and operate: plug in, pour beans in, cover, press button.\nOne batch holds enough beans for 1-2 cups of coffee, so I recommend this grinder if youre brewing fo 1-2 people."
        },
        {
            "reviewerName": "Matthew Schuler",
            "rating": "2.0 out of 5 stars",
            "reviewTitle": "Inconsistent size of ground coffee beans",
            "reviewDate": "November 9, 2019",
            "reviewText": "The size of the coffee grinds varies a lot within a grind. If you grind too long, you get a mix of fine powder and bean chunks, and it makes the coffee taste bad. If you grind for the correct amount of time, you get whole beans left, which is just a waste. The noise level is fine, and the grinder looks nice (stainless outside). One of the grinders that I bought has a slight metallic smell when I grind the coffee, reminiscent of the smell my grandmothers blender used to have. I'm keeping the grinders because returning them is a hassle, but this grinder does not deserve high praise. I would never recommend this product to a friend."
        },
        {
            "reviewerName": "Vince",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Great for my cup of coffee!",
            "reviewDate": "July 13, 2019",
            "reviewText": "Sorry, this video is unsupported on this browser.\nGood grinder, small and easy to use. Depending on how fine you want the coffee, my pepper sized grinds take about 30 seconds. You just have to try to see what works best for your drinks! The top is removable and washable, while the bottom I lightly wipe with a damp cloth. Easy to use and very quiet! These wont come as uniform as conical burr grinders but this works great for quick and easy grinds!"
        },
        {
            "reviewerName": "MNRN",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Great price, easy to use. Grinds spices as well.",
            "reviewDate": "November 4, 2019",
            "reviewText": "Bought this to grind spices not cofee. We dont grind our coffee. This grinds spices like black pepper, red chilli , and whole cumin. We are extremely happy with the result. Grinding your spices saves lots of money. It will pay off in 2-3month. The 2 year warranty is a plus. I never had appliances with 2 year warranty. It is little noisy but I understand. Grinding spices is not easy on the motor."
        },
        {
            "reviewerName": "Ankit Mehra",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Compact and powerful coffee grinder!!",
            "reviewDate": "July 15, 2019",
            "reviewText": "Was bit susceptible before purchasing as was not sure if this compact grinder could stand tall to grinding coffee beans.... But it proved me completely wrong. This 120v grinder can pulverize your beans in a jiffy. Very impressed with the quality and design of this grinder. Have used it for grinding roasted Indian spices as well and the results were perfectly acceptable. Cleaning is easy and storage takes very little space."
        },
        {
            "reviewerName": "Hemal B",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Works well and easy to use",
            "reviewDate": "July 26, 2019",
            "reviewText": "This coffee grinder is great. I like using freshly ground coffee and this machine is very easy to operate and easy to clean. It grinds coffee very finely and also works well for other spices, like cumin. I like that it comes with a cleaning brush and a two year warranty, but don't imagine why I'd need the warranty. It seems like it will work for a long time. The size is nice and compact so it doesn't take up much space."
        },
        {
            "reviewerName": "sri v.",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Silent and strudy grinder",
            "reviewDate": "November 7, 2019",
            "reviewText": "It's very compact and very sturdy. Above all very very silent grinder.\n\nI'm an Indian and we have a lot of spices to be grounded every now and then and have trouble in cleaning the bulky grienders. But this one's very compact trust me.\n\nTried with grinding the strongest pulses- it did grind them well without any hassle. I am sure it pretty much grinds anything ??"
        },
        {
            "reviewerName": "Jacob Neder",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Perfect Coffee Grinder",
            "reviewDate": "July 16, 2019",
            "reviewText": "First time buying a coffee grinder and I am beyond pleased. Placed my whole coffee beans in, put the lid on, pressed the power button and in a matter of seconds I had freshly ground coffee. What a game changer. This little machine really packs a lot of power and is so quick. Fresh grounds = fresh coffee. I won't be going back to ground coffee as long as I have this grinder. Easy to clean too. Perfect buy."
        },
        {
            "reviewerName": "Andres",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Great little grinder",
            "reviewDate": "July 10, 2019",
            "reviewText": "This has been a great little tool in my kitchen to use specifically for grinding dehydrated foods and spices into powders. Sure, I could also use a high-powered blender but loose a lot of product when trying to scrape it off the jar and lid.\nThis compact unit keeps everything neatly contained and does a perfect job of \"powderizing\" even woody dehydrated foods. Very glad to have this in my kitchen arsenal."
        },
        {
            "reviewerName": "Awsam",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Dont invite me over if you dont freshly grind your coffee beans",
            "reviewDate": "July 14, 2019",
            "reviewText": "I wish I would of got one of these along time ago. This works pretty good if you want some fresh ground coffee in the morning. You can even grind those beans down to a powder for your espresso machine if you want. Or if your a caffeine fiend and need that extra kick you can grind those beans real fine and put it in your coffee maker. Its real simple to use and can easily empty out into your coffee pot."
        },
        {
            "reviewerName": "Ritesh",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Coffee just a button away",
            "reviewDate": "October 14, 2019",
            "reviewText": "I got the Coffee Grinder really faster. Its very compact and powerful too. Its very portable and fits anywhere during travel..even in your backpack. Its very convenient to travel with it and get your cup of coffee anywhere with just a push button. It's get cleaned up even with a damp paper towel. Definitely recommended fort all the coffee lovers."
        },
        {
            "reviewerName": "Meghan Dickard",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "My husband loves it!",
            "reviewDate": "July 17, 2019",
            "reviewText": "My husband recently was gifted coffee beans, not having a need for grinding beans all the time I was looking for a solution that fit the budget. This small grinder worked excellent! It ground the coffee beans super quick, was easy to clean afterwards (even came with a small brush), stores away nicely because of it's small size."
        },
        {
            "reviewerName": "Sarah",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Fresh Ground Coffee <3",
            "reviewDate": "July 10, 2019",
            "reviewText": "My morning routine is now a little bit longer, but a whole lot more delicious. This little coffee grinder grinds up the perfect amount of coffee beans for a big pot of coffee to get your morning going. And if you've never had a cup made with fresh ground beans, you need to try it.\n\nThis coffee grinder is made from stainless steal and has a simple on/off button."
        },
        {
            "reviewerName": "abu salim",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Great for Turkish Coffee",
            "reviewDate": "July 18, 2019",
            "reviewText": "This a great coffer grinder. Now I don;'t have to get my coffee grounded at the store for my Turkish Coffee. I can do it at home. It's also great to ground all your spices. Be sure to wash very good after each use."
        },
        {
            "reviewerName": "Daniel Sung",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Works well! Grinds my beans just the way I like it",
            "reviewDate": "November 4, 2019",
            "reviewText": "Needed a simple bean grinder for my coffee in the morning and this works well. I didnt need a fancy grinder with different settings since I just make drip coffee. This one was really easy to use and nice and compact and easy on the eyes on the counter. Havent had a problem yet and Ive used it plenty of times already. I like it!"
        },
        {
            "reviewerName": "Rezul H.",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Grinder away!",
            "reviewDate": "July 10, 2019",
            "reviewText": "Just got this grinder and used to make coffee for my wife. So far it worked great. If fit perfectly in the cabinet with all the coffee products we have. Good to travel with as long you have a power outlet."
        },
        {
            "reviewerName": "Mary Beth",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Effortless, perfect grinding.",
            "reviewDate": "July 14, 2019",
            "reviewText": "This design is simple. Plug in grinder, pour in beans, push button, grind. Boom! There is no guess work and the design is intuitive. I can watch through the window to get my perfect left of grounds. I only cold brew my coffee and my old grinder was clunky. This product is small and lightweight. No improvements needed on this neat product."
        },
        {
            "reviewerName": "Jane Gardner",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Good grinder",
            "reviewDate": "October 31, 2019",
            "reviewText": "Im impressed at the size of this coffee grinder. Im used to smaller ones that sometimes will take me a few times to get the amount I want. It takes this one just one time. Also, it doesnt get hot the longer I use it like my old one. Overall this is an upgrade from what Ive had, very good coffee Grinder"
        },
        {
            "reviewerName": "Sayed Wasi",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Best quality cafe grinder",
            "reviewDate": "July 6, 2019",
            "reviewText": "As a described by seller, it is best caffee grinder, good quality and well working, I used it for nuts, seed ... it worked good as you would expect. Recommended product for all friends."
        },
        {
            "reviewerName": "Derek",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Simple and efficient little coffee grinder",
            "reviewDate": "August 5, 2019",
            "reviewText": "A simple little coffee bean grinder. This machine will grind up the beans with ease. Its quiet, powerful and efficient. Afterwards, it is quick to clean out and get ready for the next batch. Its small so it can be put in the cupboard without taking up a bunch of space. Definitely, a good value for the money. I use it often."
        },
        {
            "reviewerName": "SP",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Compact and easy to use !",
            "reviewDate": "August 1, 2019",
            "reviewText": "I'm a huge coffee fan and I like using freshly ground coffee. It works perfectly fine. The machine is petite and compact, so it doesn't take up too much counter space. Very easy to operate, not very loud and so much better than my last coffee grinder. Grinds the beans into fine grounds. Easy to clean and comes with a brush"
        },
        {
            "reviewerName": "Brian Linzer",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Coffee Grinder Powerhouse",
            "reviewDate": "July 12, 2019",
            "reviewText": "I got this on Monday and have used it for grinding coffee all week and it does a really good job. I initially was a little worried because its not completely round like my old one, but with the slightly off round shape, it does a really good job of moving the beans around and evenly grinding.\n\nPerfect cups of coffee."
        },
        {
            "reviewerName": "NRenee",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Great value, easy to use, even for spices",
            "reviewDate": "July 17, 2019",
            "reviewText": "Use this for coffee or spices or anything for that matter! This is a product I never knew I needed until I bought it. Truly a needed kitchen staple! Great value and easy to use!"
        },
        {
            "reviewerName": "mary ayres",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Awesome grinder",
            "reviewDate": "September 15, 2019",
            "reviewText": "Recently I discovered freshly ground coffee tastes so much better!! I now grind my coffee myself every 2-4 days and this little thing does a great job! Grinds easily and perfectly for me to put my coffee in my kcup filter! Great purchase, Im happy I went with this rather than the expensive alternatives"
        },
        {
            "reviewerName": "Rakib Hasan",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Good quality product!",
            "reviewDate": "August 5, 2019",
            "reviewText": "This is my first coffee grinder. After uses for several weeks, I like it. Its perfectly grind coffee beans without making too much noise. It comes with a brush that makes it easy to clean.\nOverall, design is pretty good and the material is very durable.\nFor me its a quality product for a coffee lover."
        },
        {
            "reviewerName": "zashira",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Best Coffee Grinder Ever!!!",
            "reviewDate": "October 13, 2019",
            "reviewText": "This is by far the best, heavy duty, steinless Steel Coffee Grinder. Its easy to clean, small compact which is great for storing, and very fast and efficient. I love the fact that I can grind as much or as little coffee beans as I desire. Highly recommended. Fantastic value for your money."
        },
        {
            "reviewerName": "Frank R.",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Nice coffee grinder",
            "reviewDate": "July 15, 2019",
            "reviewText": "Easy to use coffee grinder. Not too loud and doesn't leave any chunks or half-beans. I've been using daily since I got it and have been very happy. It is nice and compact as well, so easy to take with me to the office or on road trips. Freshly ground really is better and the coffee tastes better than ever."
        },
        {
            "reviewerName": "Az_Reviews",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Nice quality! Stainless steel jar",
            "reviewDate": "July 24, 2019",
            "reviewText": "This is a sturdy grinder and has ample room to grind coffee/ spices/ dry fruits. I recently used it to fine grind cardamom and nutmeg and it did a great job. Must say very quick and easy to use. What i love most about this is the stainless steel jar unlike some of the other grinders, making cleanup a breeze."
        },
        {
            "reviewerName": "Prakash Singh",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Great coffee Grinder with great design and look !",
            "reviewDate": "July 15, 2019",
            "reviewText": "Really compact,Small, powerful and great design grinder.Its very easy to use .It has great capabilities and its easy to clean. I can use it for grinding coffee and spices .It is very smooth in function and it grinds very well.I really loved its great finishing and look !I would highly recommend this to others !"
        },
        {
            "reviewerName": "Greeneyezka",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "This was money well spent.",
            "reviewDate": "July 25, 2019",
            "reviewText": "My coffee intake has increased drastically, so I decided to give grinding my own beans another shot. In the past I used a cheap version of a bullet to grind my coffee. Which no longer works. So I invested in this grinder and I am glad of the purchase. It served it's purpose and has doubled as an herb grinder."
        },
        {
            "reviewerName": "Kushal Joshi",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Consistent and easy to use.",
            "reviewDate": "November 10, 2019",
            "reviewText": "Was looking for a electric coffee grinder after my hand-held one took WAY too long. I can throw in around a cup worth of coffee beans and in around 10-15 seconds I have some perfectly ground beans! It's also much quieter than expected and looks very modern with the silver finish."
        },
        {
            "reviewerName": "Jessica",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "RV coffee grinder",
            "reviewDate": "July 11, 2019",
            "reviewText": "I got this for my Rv its just perfect, Small coffee grinder can fit anywhere. I like the ability to grind coffee and also nuts. Its worth what you pay for."
        },
        {
            "reviewerName": "Fironica Lao",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Easy and fine grinding",
            "reviewDate": "September 8, 2019",
            "reviewText": "This grinder is easy to use, keep clean and gives really good fine powder for coffee! Ive been drinking a cup of every day for months now and recently brought a coffee machine. This grinder is quick to grind and dont need to do it manually. Works just as described and good quality."
        },
        {
            "reviewerName": "Sierra",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Perfect grinder!",
            "reviewDate": "October 22, 2019",
            "reviewText": "Ive been needing a coffee grinder for sometime now and decided to get this one! Absolutely love it! It works great! I love being able to Grindr fresh coffee grounds in the morning! Its super easy to clean and its super annoying loud which is a huge plus for early moring risers!"
        },
        {
            "reviewerName": "Ramy",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "tiny but powerful",
            "reviewDate": "July 27, 2019",
            "reviewText": "Very powerful for any grinding, I use it for coffee, spices . It is better than most 1000 w blenders. Excellent product & stylish ,, product quality is good., adds an appeal to the kitchen unit. This unit is very handy and light weight and easy to use at excellent price. Good Value for money"
        },
        {
            "reviewerName": "Tica17",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Great coffee grinder!",
            "reviewDate": "October 14, 2019",
            "reviewText": "Im from Costa Rica and Im an avid coffee drinker. Im also very picky regarding coffee. I found Costa Rican coffee beans at Costco so I decided to get this coffee grinder. This is my first time using one of this. It works perfectly fine for me and its very easy to use."
        },
        {
            "reviewerName": "reader101",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Great coffee grinder, strong and high quality",
            "reviewDate": "July 20, 2019",
            "reviewText": "I had been looking for a good coffee grinder for a while and Im so glad I found this one. Its super strong and high quality, it also looks really nice on my kitchen counter. It comes with a cute little brush for cleaning and it grinds the perfect size grinned so you always get what you need."
        },
        {
            "reviewerName": "MS Toni",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Multi-Purpose Coffee Grinder",
            "reviewDate": "July 28, 2019",
            "reviewText": "I love this product. I use it to grind my coffee beans and homemade dried herbs. And its works really great. Its small and easy to clean, too. This grinder wont start unless the cup is on and close, which is a good one... safety is important."
        },
        {
            "reviewerName": "Nichele B",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Good value",
            "reviewDate": "July 25, 2019",
            "reviewText": "Needed a good coffee grinder and found this one. Broke the last one. This does the trick. Big enough to grind what I need for the day and quickly grind what I put in it. It is quiet and efficient, and easy to clean. Says I can use for nuts but havent tried that yet. Good for what I needed."
        },
        {
            "reviewerName": "Brandon Nolan",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Nice Grinder",
            "reviewDate": "November 8, 2019",
            "reviewText": "This grinder works great! It's pretty small so it fits in the cabinet easy. It feels solid and study and is quiet. Much quieter than using a blender or food processor. Very simple to use. You just put on the lid and push the button. Great grinder for the price."
        },
        {
            "reviewerName": "Drew",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Compact but powerful little coffee grinder",
            "reviewDate": "July 16, 2019",
            "reviewText": "Very useful gadget, even if you don't use coffee. I use it to grind down my flax seeds into a meal form and add to my shakes. This device is powerful for being small and lightweight and does a great job of grinding it into a powder. I would highly recommend this one."
        },
        {
            "reviewerName": "Heather Marie Stephenson",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Love this",
            "reviewDate": "September 27, 2019",
            "reviewText": "I love this little coffee grinder! It is compact and fits on my kitchen cabinets and is shiny and pretty. Serves its purpose and grinds well. Im a huge coffee person so I appreciate this grinder because I love fresh coffee and grinding my own coffee grounds."
        },
        {
            "reviewerName": "G",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Quiet coffee grinder",
            "reviewDate": "September 9, 2019",
            "reviewText": "I got This for my mom who is an avid coffee drinker and her coffee grinder is the loudest thing on the planet. I got This one specifically because it was advertised as quieter than the average coffee grinder and it definitely holds true. Im a happy camper"
        },
        {
            "reviewerName": "Munsu",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Great little grinder in a great price !!!",
            "reviewDate": "July 13, 2019",
            "reviewText": "Does a great job of grinding.Grinder is very easy to use, just plug it in and it immediately works. It comes with a small brush that works great for getting the sticky grounds outfrom around the blade and cup. The added bonus;freshly ground beans have a better flavor."
        },
        {
            "reviewerName": "Kayee",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Great product !",
            "reviewDate": "November 2, 2019",
            "reviewText": "Brought this to try and for the convenience of not going to the store to grind the coffee beans. This product works awesome. Very easy to use and to clean. Its not as noisy as I thought it would be. Would recommend for any coffee lovers!"
        },
        {
            "reviewerName": "Cheryl",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Dad is happy.",
            "reviewDate": "July 23, 2019",
            "reviewText": "Good little compact grinder, fits lovely in my coffee cabinet. I got this especially for my dad who loves his coffee beans. He is very happy with it, says he is surprised at how quiet it is when grinding the beans. Very easy to clean and easy to use."
        },
        {
            "reviewerName": "josh fu",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Great grinder",
            "reviewDate": "October 23, 2019",
            "reviewText": "Super user friendly! Love the size because it doesnt take up much counter space in our small kitchen. Grinds up coffee beans in a pinch. Good weight, love that its stainless steel and not plastic like most coffee grinders."
        },
        {
            "reviewerName": "Jane C. Johnson",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Great compact grinder!",
            "reviewDate": "July 16, 2019",
            "reviewText": "I have been wanting to get a small coffee grinder for my personal use and finally decided to order this one. I love the compact design because I have a small kitchen and didnt want to use up a lot of counterspace. This grinder is perfect for my needs."
        },
        {
            "reviewerName": "Deivanayagam Meyyappan",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Nice little grinder",
            "reviewDate": "July 20, 2019",
            "reviewText": "I got this grinder for grinding spices along with coffee bean. This is very handy and easy to use. Easy to clean as well. The motor is powerful. I can grind any indian spices such as cinnamon, cardamom, cloves, chili, coriander seeds etc! It is a must buy for any kitchen!"
        },
        {
            "reviewerName": "AMZ Boy",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Stylish, portable, affordable and does the job!",
            "reviewDate": "August 1, 2019",
            "reviewText": "I loved the stylish chrome metallic structure of this cute little coffee grinder. Looks very modern and sleek. Very low noise, easy to carry or place on office desk. Easy to clean. Very satisfied with it and using it everyday. Great buy."
        },
        {
            "reviewerName": "Tawny",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Freshly grounded coffee everytime.",
            "reviewDate": "October 28, 2019",
            "reviewText": "This coffee grinder is quicker than my previous one and it grinds my coffee beans uniformly when filled 3/4. I have not tried it with spices yet but my coffee is perfect so far. A must if you are a coffee lover."
        },
        {
            "reviewerName": "Trung Tran",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Compact and convenient",
            "reviewDate": "October 30, 2019",
            "reviewText": "This coffee grinder is very well made and simple to use. It grinds fast, but a little bit noisy which most grinder does. Compact in size so it takes very little room on the counter. Easy to use and easy to clean."
        },
        {
            "reviewerName": "AngNorReviews",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Great quality, fine grind.",
            "reviewDate": "July 17, 2019",
            "reviewText": "This is a simple to use product that grinds your beans to a nice powder ready for your coffee maker. The grinder is quiet as far as grinders go. I like that it is small and fits nicely in my kitchen cabinet. I would suggest this product."
        },
        {
            "reviewerName": "Hollie Locke",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Love it so much!",
            "reviewDate": "November 9, 2019",
            "reviewText": "So excited to be able to finally enjoy fresh ground coffee. This little grinder is exactly what I was looking for. It has small foot print which I appreciate and it works perfectly! Great purchase! Thank you!!"
        },
        {
            "reviewerName": "amy",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Grinds very well.",
            "reviewDate": "September 4, 2019",
            "reviewText": "This is my first coffee grinder and I love it . It works very well and i love using it. Ive only used it for coffee but it can be used to grind other things as well. Its small enough that I can put it always on drawer ."
        },
        {
            "reviewerName": "Kennedy Fitzsimmons ",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Amazing quality, very quiet, super easy to clean.",
            "reviewDate": "September 5, 2019",
            "reviewText": "This coffee bean grinder is amazing! Now on our weekend mornings we can grind up fresh coffee beans to put in our coffee maker. It works really well, fairly quiet. And very easy to clean! Super happy with this purchase."
        },
        {
            "reviewerName": "Kayla Barham",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Great Grinder",
            "reviewDate": "July 21, 2019",
            "reviewText": "Love the grind that this grinder does on my coffee. We love fresh grinder coffee every morning. This grinder is easy to get out and use daily and clean with no real extra effort to make my coffee each day. Really love this grinder"
        },
        {
            "reviewerName": "Preston & Macy",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Solid grinder",
            "reviewDate": "October 9, 2019",
            "reviewText": "Nice, compact, sturdy grinder. Really grinds grounds finely. As others have mentioned the motor heats up quick, so i wouldn't do extended grinding. Really short bursts work well for me. Easy to clean too."
        },
        {
            "reviewerName": "Chandu",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Very small kitchen gadget but powerful..",
            "reviewDate": "July 19, 2019",
            "reviewText": "Very small and powerfull. Easy to use and very easy to clean the item and always u can grind fresh coffee beans. Powerful motor it will grind the beans in a couple of seconds. Would love to recommend this to my friends."
        },
        {
            "reviewerName": "S. Chakraborty",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Good quality",
            "reviewDate": "July 20, 2019",
            "reviewText": "This is my first coffee grinder and I am quite happy with it. Aesthetically pleasing and effective. It was very easy to clean after use. I have also used it for making a spice paste and worked out really nice. Recommended"
        },
        {
            "reviewerName": "Colin O.",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Makes great coffee",
            "reviewDate": "July 26, 2019",
            "reviewText": "Quiet. Easy to use. Fill it up with your favorite coffee beans, hit the button, and ipso presto, you have freshly ground coffee that makes for an exceptional pot. Cleanup is a breeze and it stores well in the closet."
        },
        {
            "reviewerName": "Marisol panganiba",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "To all the coffee lovers this is a must have",
            "reviewDate": "September 21, 2019",
            "reviewText": "My husband always wanted one but we finally got one great price amazing quality and hes in love he has recommended to hes peers from work and for\nAll the coffee\nLovers its a must have"
        },
        {
            "reviewerName": "lovepeaceaubrey",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Great Small Coffee Grinder",
            "reviewDate": "July 22, 2019",
            "reviewText": "This is the perfect small coffee grinder. Its easily grinds up your coffee beans. It comes with a little instruction manual on how to properly use it. Its portable and has a good length on the cord. Would recommend!"
        },
        {
            "reviewerName": "Pa",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Tiny cute coffee grinder",
            "reviewDate": "September 11, 2019",
            "reviewText": "This coffee grinder is quite tiny. However, it works good. The small size does make it easier to clean. Its nice to have this because I drink coffee quit often and this blends up my coffee beans nicely."
        },
        {
            "reviewerName": "Neda",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Awesome product",
            "reviewDate": "October 3, 2019",
            "reviewText": "Efficient , quit , very stylish and easy to clean as well. I love to ground my coffee beans daily and my old grinder was very hard to clean. This is very compact and easy to clean. Love this thing !!!"
        },
        {
            "reviewerName": "Shikha",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Best coffee grinder",
            "reviewDate": "July 10, 2019",
            "reviewText": "Really easy to use and compact grinder. I am living is add it is easy to use and super easy to clean. It is so compact that it is not taking much space on counter and due to steel body it goes with any kitchen decor"
        },
        {
            "reviewerName": "Bryan",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Keep on grinding",
            "reviewDate": "July 20, 2019",
            "reviewText": "I got a bag a coffee beans from a friend as a gift. I usually purchase already ground coffee, but it is way better grinding your own coffee! This is the grinder to get. Cost effectively and grind the coffee well."
        },
        {
            "reviewerName": "Arianna Hosinski",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Worth the money, perfect for apartments!",
            "reviewDate": "October 21, 2019",
            "reviewText": "This compact coffee grinder is so perfect for my apartment! Im a coffee person and I love how small this is and how well this works. This grinder is great quality and Im really impressed with it."
        },
        {
            "reviewerName": "Laura",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Does the job and not too expensive. Over all, good buy so far.",
            "reviewDate": "July 18, 2019",
            "reviewText": "I have been looking for a good/less expensive coffee grinder for awhile now. I am happy I found this one. It is very easy to use. I like to use it for coffee and for grinding dried spices. Works great for both."
        },
        {
            "reviewerName": "AngryMartigan",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Great deal!",
            "reviewDate": "July 16, 2019",
            "reviewText": "I really like this coffee grinder so far. Price is right and the grind is consistent. Also the selling point for me is the slick stainless steel look that matches my other appliances (Im replacing a plastic one). Recommend!"
        },
        {
            "reviewerName": "Happy Camper",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Coffee Grinder",
            "reviewDate": "October 27, 2019",
            "reviewText": "What a great coffee grinder!! It sleek looking. Seems well made. Definitely does the job well! I wasn't surprised by the noise level at all. This is a great little kitchen gadget!"
        },
        {
            "reviewerName": "OmgLOl",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Great!",
            "reviewDate": "September 4, 2019",
            "reviewText": "Love this! It doesnt feel or look cheap at all in which I like. Not only does it look good, it works so great! I love grinding my whole coffee beans in there to make my own espresso drinks!"
        },
        {
            "reviewerName": "Nidhi parikh",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Easily grind the coffee beans",
            "reviewDate": "July 17, 2019",
            "reviewText": "If u love fresh ground coffee this is must have product. It grinds the coffee beans so fine and fast. Its stainless steel so easy to clean. I am using it for grind my coffee beans and i am loving it."
        },
        {
            "reviewerName": "Surya",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Worth the price",
            "reviewDate": "September 9, 2019",
            "reviewText": "Grinder works great and grinded 11oz beans and its working fine just check my video. Can be useful for grinding spices and other dry item"
        },
        {
            "reviewerName": "Carson Kleinknecht",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Best grinder",
            "reviewDate": "July 8, 2019",
            "reviewText": "This electric coffee grinder is a must have for any and every coffee lover. It is super compact and does such an amazing job grinding the beans. It is by far my favorite grinder that Ive ever used."
        },
        {
            "reviewerName": "TONY",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Awesome coffee grinder!!",
            "reviewDate": "July 25, 2019",
            "reviewText": "Shipping was fast and the item was packaged well. I really like the design and it works great. It's easy to clean and even easier to use. I'm more than happy with it and I highly recommend!!"
        },
        {
            "reviewerName": "The Siemers",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Grinds so well",
            "reviewDate": "July 9, 2019",
            "reviewText": "Such a smooth operator grinder. Love it so much. You put the beans in, press the button, and in seconds youve got ground coffee. Very small and compact  so easy to take with me on the train. A+"
        },
        {
            "reviewerName": "Roland Yung",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Like our Krups",
            "reviewDate": "July 30, 2019",
            "reviewText": "Had a Krups grinder that was making a terrible noise. Wanted to find something that worked just as well and this does. Grind beans every morning and it's able to get a consistent grind."
        },
        {
            "reviewerName": "Amazoner",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Handy Spice Grinder !",
            "reviewDate": "July 10, 2019",
            "reviewText": "I bought this grinder for grinding spices. I just got this delivered today and immediately i put it to use for grinding dry coconut slices and as expected it did grind very well. Happy with my purchase!"
        },
        {
            "reviewerName": "Sravani",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Cute and compact",
            "reviewDate": "July 17, 2019",
            "reviewText": "Its a nice small appliance for your kitchen. You can grind fresh coffee every time. Power is great and can be pulsed just the way you like. Very easy to clean and lightweight."
        },
        {
            "reviewerName": "Sarah T.",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Very useful tool.",
            "reviewDate": "October 22, 2019",
            "reviewText": "This is super easy to use and clean. It's perfect for me so I can grind what I need and waste less. It has a powerful motor that grinds everything nicely."
        },
        {
            "reviewerName": "Viswa",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Good coffee grinder",
            "reviewDate": "July 11, 2019",
            "reviewText": "It works well for the coffee beans. It grinds to a nice texture. It grinds really fast. I also used for nuts. It was good. It would take few more moments. It is easy to clean."
        },
        {
            "reviewerName": "Navi",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Best coffee grinder!",
            "reviewDate": "July 22, 2019",
            "reviewText": "This is my 3rd coffee grinder in the past 10 + years. Lovely and compact, fits on the counter.Grinds the coffee bins very smoothly. I would love to recommend this product."
        },
        {
            "reviewerName": "Nykole Preuss",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Great Product! Amazing Quality",
            "reviewDate": "July 16, 2019",
            "reviewText": "I can't believe the quality for the price! This thing is amazing, and is very high quality! It is not loud at all, and works amazingly well. Very much recommend!"
        },
        {
            "reviewerName": "Anne",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Mmm coffee!",
            "reviewDate": "September 27, 2019",
            "reviewText": "Came well packaged. Easy to use and clean. Does the job well - nice to be able to now order in whole beans - freshly ground smells and tastes best!"
        },
        {
            "reviewerName": "G. Pina",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Great for coffee lovers",
            "reviewDate": "November 4, 2019",
            "reviewText": "Awesome product very easy to use and clean. Makes the morning coffee experience an even better one, it fills the whole house with the aroma of fresh ground coffee."
        },
        {
            "reviewerName": "Zoeygirl",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Powerful!",
            "reviewDate": "July 20, 2019",
            "reviewText": "Excellent coffee grinder. After a week of every day use I am pleased with it. It is powerful, easy to clean, and the cord stores easily. I would recommend it."
        },
        {
            "reviewerName": "Heidi J Storm",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "you need two!",
            "reviewDate": "November 5, 2019",
            "reviewText": "these are versatile and you will need one for coffee and another for spices! great if you like to make coffee using french press."
        },
        {
            "reviewerName": "Miranda R. Guzman",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Works perfect ??",
            "reviewDate": "July 16, 2019",
            "reviewText": "This grinder works well! It isnt as loud as my old one was. I also love the sleek design! Great deal!"
        },
        {
            "reviewerName": "Miller",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Good coffee",
            "reviewDate": "September 5, 2019",
            "reviewText": "This is great and for such a cheap price. It works so well with my favorite coffee. It grinds it super smooth just like I like it to be."
        },
        {
            "reviewerName": "Mirko Spinella",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "It is very easy to use and grinds perfectly.",
            "reviewDate": "July 22, 2019",
            "reviewText": "This grinder is great, I use it for coffee and It can hold a good amount of beans. Compact and easy to clean with a coffee brush. Great buy!!!"
        },
        {
            "reviewerName": "Bajraban",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Quiet Grinder for everyday use",
            "reviewDate": "July 8, 2019",
            "reviewText": "This is one of my fav products in my kitchen. I use it for grinding coffee beans to other everyday spices like cumin seeds etc. Highly recommended."
        },
        {
            "reviewerName": "NIHARIKA PAPISHETTY",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Love it",
            "reviewDate": "October 25, 2019",
            "reviewText": "Very compact and easy to use. Blends perfect andmakes fine powder. Easy to clean and store. Occupies less space"
        },
        {
            "reviewerName": "Maitry",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Love the look and works great",
            "reviewDate": "October 25, 2019",
            "reviewText": "This is perfect edition to my kitchen for spices. It works well and fast. It is small for easy storage as well."
        },
        {
            "reviewerName": "Mari R.",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "perfect and great price",
            "reviewDate": "July 11, 2019",
            "reviewText": "must have for the coffee addict like myself. easy to use, easy clean up. just as good as the expensive overpriced grinders! love it. thanks"
        },
        {
            "reviewerName": "Van Phan",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Good for black peppercorns !",
            "reviewDate": "July 12, 2019",
            "reviewText": "I used it for grinding black peppercorns and it come out perfectly. It takes only 20 seconds and The pepper is very fine. Love it!"
        },
        {
            "reviewerName": "Lauren M",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Easy to use!",
            "reviewDate": "September 28, 2019",
            "reviewText": "Super easy to use and functional. Can be used to grind coffee as well as herbs. Slick design and compact size."
        },
        {
            "reviewerName": "Emily",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Fresh ground coffee = the best!",
            "reviewDate": "September 6, 2019",
            "reviewText": "This thing rocks! Its super easy to use & cleaning is very simple also. Fresh ground coffee is a life changer!!!"
        },
        {
            "reviewerName": "AMcowden",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Works well!",
            "reviewDate": "November 7, 2019",
            "reviewText": "Noisy but works well. It doesn't have any settings so you just have to watch how coarse you grind it."
        },
        {
            "reviewerName": "Felicia Mercado",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Very good",
            "reviewDate": "July 15, 2019",
            "reviewText": "I like that it powerfull and it the right size and it fit on my kitchen counter. It not that loud when grideing the coffee"
        },
        {
            "reviewerName": "Olga & Ashley Turner-Perez",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Great coffee grinder!",
            "reviewDate": "July 7, 2019",
            "reviewText": "My wife made us coffee with this grinder this morning. Worked great, beans were completely ground in like 15 seconds! Love it!"
        },
        {
            "reviewerName": "Matt Raines",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Fast and furious",
            "reviewDate": "July 25, 2019",
            "reviewText": "I get perfectly ground coffee with this at a fraction of the time when compared to my Burr grinder. This thing is a beast"
        },
        {
            "reviewerName": "V. Kline",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Good, functional grinder",
            "reviewDate": "October 10, 2019",
            "reviewText": "We bought this grinder to replace our 35 year old grinder that finally died. It's an excellent replacement."
        },
        {
            "reviewerName": "Mohammed I.",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Coffee drinker must have",
            "reviewDate": "July 13, 2019",
            "reviewText": "Well made product for the price. Easy to use and make coffee after grinding. Must have if you are a coffee maker."
        },
        {
            "reviewerName": "Viru Chakilam",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Efficient and quiet coffee grinder",
            "reviewDate": "July 23, 2019",
            "reviewText": "It was as described. It is very easy to use. I bought this grinder for grinding homemade spices. It works like a charm and is easy to clean.I have only used it today but it came highly recommended."
        },
        {
            "reviewerName": "Mo",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "One of the best orders Ive had on Amazon",
            "reviewDate": "July 22, 2019",
            "reviewText": "Not only you can use it to grind coffee beans, I also use it to grind all kind of herbals, saffron, etc very very useful"
        },
        {
            "reviewerName": "LEAH HJ",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Very satisfied!",
            "reviewDate": "November 7, 2019",
            "reviewText": "It is really quiet compar to other brands and works great! Worth the money ten times!!!!!!"
        },
        {
            "reviewerName": "Rims",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Nice grinder",
            "reviewDate": "July 18, 2019",
            "reviewText": "Nice coffee grinder. Grinds the coffee bins very smoothly. I like the model and color too. . I would recommend it."
        },
        {
            "reviewerName": "Amelia",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Good coffee grinder",
            "reviewDate": "October 15, 2019",
            "reviewText": "Nice grinder. Small enough to store away when not in use and big enough to get the job done."
        },
        {
            "reviewerName": "Marsha Jones",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Great product!",
            "reviewDate": "November 2, 2019",
            "reviewText": "This is a really nice and not to loud coffee grinder. The company was easy to work with. Highly recommend!"
        },
        {
            "reviewerName": "Mighty joe",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Good grinder",
            "reviewDate": "October 16, 2019",
            "reviewText": "Love it. I used every weekend. Doesnt grind all the beans but a little tap to kove the beans and it does the job."
        },
        {
            "reviewerName": "Jamie",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Fresh ground beans make such a difference nice and quiet.",
            "reviewDate": "September 8, 2019",
            "reviewText": "Smells so good! Easy to clean , quiet and nice design."
        },
        {
            "reviewerName": "N.taw",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Makes life easier",
            "reviewDate": "October 22, 2019",
            "reviewText": "Use to use my blender to blend up coffee for my espresso machine. This makes it soo much easier especially to clean"
        },
        {
            "reviewerName": "Himangi",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Good product!",
            "reviewDate": "July 12, 2019",
            "reviewText": "I like the blending power of this machine. I like how it can blend my coffee beans and other spices as well."
        },
        {
            "reviewerName": "hayley",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Work very well",
            "reviewDate": "July 11, 2019",
            "reviewText": "Works really well! Grinds the coffee beans really well! Pretty quiet too compared to the one I was using!"
        },
        {
            "reviewerName": "Boris Krasniansky",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Great coffee grinder! Simple and does the job",
            "reviewDate": "July 20, 2019",
            "reviewText": "Great coffee grinder, you can grind to a very small particles size, to prepare Turkish coffee at home."
        },
        {
            "reviewerName": "Alyssa Risher",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Very nice",
            "reviewDate": "July 8, 2019",
            "reviewText": "Really nice grinder. Came with a little brush to help clean it out. Works perfect! Highly recommend"
        },
        {
            "reviewerName": "Emma C.",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Small coffee grinder",
            "reviewDate": "July 9, 2019",
            "reviewText": "This coffee grinder is very nice that it is small enough to store if your kitchen space is limited."
        },
        {
            "reviewerName": "Long Nguyen",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Good grinder!!",
            "reviewDate": "July 7, 2019",
            "reviewText": "This is compact and grinds the beans pretty well. It is pretty sturdy and has some weight to it."
        },
        {
            "reviewerName": "Rezaul Karim",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Good electric coffee grinder.",
            "reviewDate": "July 11, 2019",
            "reviewText": "Small electric coffee grinder. Good for home or office. It works fine. I think quality is good."
        },
        {
            "reviewerName": "bleujean",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Good siye, nice grounding",
            "reviewDate": "September 4, 2019",
            "reviewText": "Grounds the cofee really fine. Not too load, nice small size, it fits everywhere"
        },
        {
            "reviewerName": "Rachael A. Ciupek",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Great product",
            "reviewDate": "November 11, 2019",
            "reviewText": "Wonderfully manufactured product. Works quick and efficient. !"
        },
        {
            "reviewerName": "A Side of Crunchy",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Grind up your life",
            "reviewDate": "November 1, 2019",
            "reviewText": "I love how small and compact this is. I use it to grind all kinds of stuff. It isn't that loud either which is great with a baby in the house."
        },
        {
            "reviewerName": "Hiba",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Works effectively",
            "reviewDate": "July 14, 2019",
            "reviewText": "I like how small this product is. I can now use small amounts of coffee to grind."
        },
        {
            "reviewerName": "Erin K",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Great quality",
            "reviewDate": "November 11, 2019",
            "reviewText": "Very nice quality. Sleek. Looks nice and not super loud."
        },
        {
            "reviewerName": "p D",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Easy to use",
            "reviewDate": "October 1, 2019",
            "reviewText": "Easy to use Grinder. Works really well for grinding nuts also."
        },
        {
            "reviewerName": "A E",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "easy to use",
            "reviewDate": "July 12, 2019",
            "reviewText": "nice grinder, easy to use and clean. worked for seeds too (flax, chia, etc.)"
        },
        {
            "reviewerName": "Lion",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Perfect for personal size",
            "reviewDate": "November 4, 2019",
            "reviewText": "Picked this up as a gift. I love the look and size."
        },
        {
            "reviewerName": "Donna PodgornikAmazon Customer",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Neat Grinder!",
            "reviewDate": "November 6, 2019",
            "reviewText": "Gift for my daughter who was very pleased with it."
        },
        {
            "reviewerName": "Jessie M.",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Works great! Excellent value!",
            "reviewDate": "July 19, 2019",
            "reviewText": "Works like a charm... strong motor... grinds beans smooth! Highly recommend!"
        },
        {
            "reviewerName": "Sara",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Amazing",
            "reviewDate": "July 13, 2019",
            "reviewText": "Amazing and powerful. Tried it on griding sugar and the result was sooo good."
        },
        {
            "reviewerName": "brandie fenton",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Portable",
            "reviewDate": "July 20, 2019",
            "reviewText": "This is the perfect little coffee grinder. Now I can enjoy fresher coffee"
        },
        {
            "reviewerName": "KCN",
            "rating": "4.0 out of 5 stars",
            "reviewTitle": "Meets my expectations",
            "reviewDate": "October 27, 2019",
            "reviewText": "It is not very noisy when using. The first time I used it to grind coffee all the grounds came out. However I now have to use the brush to get all of the grounds out every time I use it. It is not a problem just a little annoying."
        },
        {
            "reviewerName": "RnB",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Awesome product!",
            "reviewDate": "September 9, 2019",
            "reviewText": "Really good coffee machine! Grinds it well and does a good job!"
        },
        {
            "reviewerName": "nivedida",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Smooth and fine powder",
            "reviewDate": "July 12, 2019",
            "reviewText": "Grinds super fast and nice. Nice quality stainless steel coffee grinder."
        },
        {
            "reviewerName": "D. Music",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Grinds quiet and fast",
            "reviewDate": "November 1, 2019",
            "reviewText": "This grinder is excellent. Its quiet and and fast."
        },
        {
            "reviewerName": "Brenda G. McGuire",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Great coffee grinder",
            "reviewDate": "October 5, 2019",
            "reviewText": "Perfect for grinding coffee for French Press"
        },
        {
            "reviewerName": "Ashutosh Wadhwa",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Great style!!!",
            "reviewDate": "September 22, 2019",
            "reviewText": "Its very sleek and worked really good for my spices."
        },
        {
            "reviewerName": "Gala",
            "rating": "4.0 out of 5 stars",
            "reviewTitle": "Small but powerful",
            "reviewDate": "September 26, 2019",
            "reviewText": "Smaller than expected but does the job well"
        },
        {
            "reviewerName": "Kellkrew",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Best grinder ever",
            "reviewDate": "July 11, 2019",
            "reviewText": "Awesome quiet grinder replaced my other very nicely"
        },
        {
            "reviewerName": "Phong Truong",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Very durable and heavy built",
            "reviewDate": "July 16, 2019",
            "reviewText": "Great coffee grinder stainless steel material make it easy to clean."
        },
        {
            "reviewerName": "Lavanya",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Light weight",
            "reviewDate": "July 7, 2019",
            "reviewText": "Its pretty good and compact able grinder .its really very handy"
        },
        {
            "reviewerName": "Noah torrez",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Lill guy over preforming",
            "reviewDate": "November 4, 2019",
            "reviewText": "I did not expect much from this lill guy - happily surprised by the lack of noise from it, how fast it chews up the coffee beans ( havent used it for anything else yet ) and yeah its damn easy to clean"
        },
        {
            "reviewerName": "Ferris",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Love this coffee grinder",
            "reviewDate": "October 5, 2019",
            "reviewText": "Smaller then I though. Quiet and functional."
        },
        {
            "reviewerName": "Dylan Coleman",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Buy it! Fantastic grinder.",
            "reviewDate": "July 27, 2019",
            "reviewText": "Fantastic quality, great sleek look. Highly recommend."
        },
        {
            "reviewerName": "Jack",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Cute small grinder works well",
            "reviewDate": "November 9, 2019",
            "reviewText": "Cute small grinder works well"
        },
        {
            "reviewerName": "Amber Danneman",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Solid purchase",
            "reviewDate": "November 6, 2019",
            "reviewText": "What a great little grinder! Ergonomic shape, quiet, grinds evenly, and the stainless steel gives it a sleek appearance Im happy to have on my beverage station."
        },
        {
            "reviewerName": "Lisa",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Reasonable price",
            "reviewDate": "September 6, 2019",
            "reviewText": "Nice shape, easy to clean and use"
        },
        {
            "reviewerName": "Rikki",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Works great!",
            "reviewDate": "September 27, 2019",
            "reviewText": "Easy to use and works great!"
        },
        {
            "reviewerName": "Brandy Petersen",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Electric coffee grinder",
            "reviewDate": "July 23, 2019",
            "reviewText": "Good quality and easy to use works well"
        },
        {
            "reviewerName": "bob alderman",
            "rating": "2.0 out of 5 stars",
            "reviewTitle": "waste of money",
            "reviewDate": "October 16, 2019",
            "reviewText": "makes a mess"
        },
        {
            "reviewerName": "Liza Haniff",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "easy",
            "reviewDate": "July 21, 2019",
            "reviewText": "easily grinds my coffee beans"
        },
        {
            "reviewerName": "Venkat",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "How is it?",
            "reviewDate": "July 12, 2019",
            "reviewText": "It was really working good"
        },
        {
            "reviewerName": "Heather F",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "GREAT",
            "reviewDate": "July 8, 2019",
            "reviewText": "Small yet works well!"
        },
        {
            "reviewerName": "Blake Garcia",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Beautiful",
            "reviewDate": "June 30, 2019",
            "reviewText": "Nice quality decent size"
        },
        {
            "reviewerName": "Woody",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Whole Coffee Beans Meet Gronder!",
            "reviewDate": "November 12, 2019",
            "reviewText": "Sending ratings."
        },
        {
            "reviewerName": "Amazon Customer",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Works good",
            "reviewDate": "November 7, 2019",
            "reviewText": "Works good. Came in new condition, arrived on time ."
        },
        {
            "reviewerName": "Leonel S Martinez",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Great product!!",
            "reviewDate": "July 4, 2019",
            "reviewText": "Awesome grinder, I'm able to grind coffee as fine or coarse as I want. Easy to use, cleaning up is very easy, the pulse power control allows you to get the desire texture. Definitely a gadget worth to keep on your kitchen."
        },
        {
            "reviewerName": "Jason",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Coarse ground coffee perfection",
            "reviewDate": "July 12, 2019",
            "reviewText": "My wife makes cold brew but it's hard to find a coarse ground coffee without buying in bulk and grinding your own. So I got her this. This was exactly what she needed to make coarse coffee. Now her grounds don't make it through the strainer in the cold brewer. Quick and easy, little cleanup, and fresh ground coffee smells amazing."
        },
        {
            "reviewerName": "Amy",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Better than I expected",
            "reviewDate": "July 9, 2019",
            "reviewText": "This little grinder packs a punch! We prefer to grind our coffee fresh daily for the taste. I like that it takes up minimal space. Great purchase!"
        },
        {
            "reviewerName": "Lochan",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Quality grinder.",
            "reviewDate": "November 12, 2019",
            "reviewText": "My previous grinder broke so I was in the market for a new one. Came across this and was pleasantly surprised. Works very well and is easy to clean. Grinds my beans perfectly and have not had any issues so far."
        }
    ],
    "title": "KF2020 Electric Coffee Grinder by Kaffe - Stainless Steel 2.5oz Capacity with Easy On/Off Button. Cleaning Brush Included ",
    "manufacturer": "Kaffe",
    "currentPrice": false,
    "rating": "4.7 out of 5 stars",
    "totalRatings": "372 ratings",
    "features": [
        "\n         Make sure this fits\n                by entering your model number.\n        \n",
        "COMPACT countertop electric coffee grinder (2.5 oz) quickly turns whole-bean into fresh grounded coffee right from your home or kitchen.",
        "FRESH COFFEE! Grinds whole coffee beans to fine grounds in seconds for quality home brewing using a French press, coffee percolator or other drip coffee makers.",
        "EASY TO USE on/off button positioned on safety lid: grinder wont operate without cover. Transparent lid lets you monitor grinding.",
        "MULTI-PURPOSE: Use it to grind nuts and spices or coffee beans. CLEANING BRUSH INCLUDED!",
        "EXTENDED 2 YEAR WARRANTY: Covers any damage or defect. Money back guarantee!"
    ],
    "reviewsAspects": [
        "easy to use",
        "easy to clean",
        "stainless steel",
        "fresh ground",
        "highly recommend",
        "freshly ground",
        "french press",
        "fine powder",
        "cold brew",
        "super easy",
        "every morning",
        "little brush",
        "grinds well",
        "good quality",
        "works perfectly",
        "noise level",
        "simple to use",
        "value for money",
        "push the button",
        "everyday"
    ],
    "qAndA": [
        {
            "question": "What is the input voltage? does it work with 220V input?",
            "answer": "110v"
        },
        {
            "question": "How long do you press button for coarse ground coffee?",
            "answer": "Answer not available"
        },
        {
            "question": "How many watts is the coffee grinder?",
            "answer": "Answer not available"
        },
        {
            "question": "How long do you press button for coarse ground coffee?",
            "answer": "Answer not available"
        },
        {
            "question": "How long do you press button for coarse ground coffee?",
            "answer": "I just pulse it 2-3 times."
        },
        {
            "question": "Course grind?",
            "answer": "Answer not available"
        },
        {
            "question": "Works in 220V ? Thx",
            "answer": "110V"
        },
        {
            "question": "Is this good for pour over method?",
            "answer": "Answer not available"
        },
        {
            "question": "Can the cord be completely tucked away when not in use?",
            "answer": "Not sure what you mean but the cord is hard wired to the grinder and is not easy to conceal. I disconnect mine and put it up, only take it out when Im going to grind beans."
        },
        {
            "question": "Is this made in USA?",
            "answer": "not 100% sure on manufacturing only what I found on their website https://kaffeproducts.com/pages/about that their design and operational headquarters are in Atlanta, Georgia"
        },
        {
            "question": "Is it easy to clean? Has anyone had it for awhile and it seems like it'll last a long time?",
            "answer": "Answer not available"
        },
        {
            "question": "How many Watts?",
            "answer": "KE"
        },
        {
            "question": "Does this work well for using grinds in a moka pot?",
            "answer": "Answer not available"
        },
        {
            "question": "Is there any plastic that touches the beans?",
            "answer": "No. Just stainless steel"
        },
        {
            "question": "how easyis it to transfer grounds to kpod?",
            "answer": "I don't know... I don't use kpods"
        }
    ]
}