{
    "title": "Electric Coffee Grinder, LOFTER 150W Portable Spice & Nut Grinder with Stainless Steel Blade, Large Grinding Capacity, Portable & Compact, Fast Grinding for Coffee Beans, Seeds, Spices, Herbs, Grains, 15 Cups, Black",
    "manufacturer": "LOFTer",
    "currentPrice": false,
    "rating": "4.5 out of 5 stars",
    "totalRatings": "56 ratings",
    "features": [
        "\n         Make sure this fits\n                by entering your model number.\n        \n",
        "【LARGE CAPACITY COFFEE GRINDER】: 150 Watt motor and 2 sharp 304 stainless steel blade offers durability and powerful performance, grinds 75g coffee beans at the same time for 15 cups coffee within 30s, make freshly brewed coffee for the whole family. Note: Don't run more than 30s to avoid burning smell.",
        "【USER-FRIENDLY DESIGN】: The fully-embedded cover protects from coffee grounds spilling out and the top is clear so you can see what is going on in the grinder. Just by simply pressing the lid with different seconds to perfectly control the precision of the grindering. Low noise motor will not disturb your family while you prepare their morning cup.",
        "【COMPACT & STYLISH】: With smart design, This coffee grinder takes up minimum counter space and can be easily stored in cupboards and drawers. The grinder are scratch-resistant, corrosion resistant, insulation resistant which can last a long time. The auto-shutoff and overheat protection can keep you safe.",
        "【MULTIPLE USES】: Not just for grinding coffee beans, our grinder can also grind spices, nuts, herbs, pepper, seeds, grains and more! You can grind quickly for coarse consistency or leave it running longer for finer powders – making this grinder perfect for French press, Espresso, Turkish or Drip coffee.",
        "【100% SAFE & NO RISK】: Providing the Best Quality Product & Customer Service is our NO.1 Principle. Purchase it now by click \"By now with 1-Click\"or\"Add to Cart\"."
    ],
    "reviewsAspects": [
        "coffee grinder",
        "easy to clean",
        "coffee beans",
        "easy to use",
        "clean good",
        "good coffee",
        "grind coffee",
        "compact",
        "morning",
        "machine",
        "convenient",
        "nuts",
        "powerful",
        "seconds",
        "seeds",
        "smell",
        "spices"
    ],
    "productInformation": [
        {
            "Product Dimensions": "4 x 6.8 x 4 inches"
        },
        {
            "Item Weight": "1.6 pounds"
        },
        {
            "Shipping Weight": "1.6 pounds (View shipping rates and policies)"
        },
        {
            "Manufacturer": "LOFTER"
        },
        {
            "ASIN": "B07P5LJ88Z"
        },
        {
            "Item model number": "MD180005"
        },
        {
            "Customer Reviews": "4.5 out of 5 stars\n    56 ratings\n4.5 out of 5 stars"
        },
        {
            "Best Sellers Rank": "#94,650 in Kitchen & Dining (See Top 100 in Kitchen & Dining)\n#56 in Electric Coffee Blade Grinders\n"
        },
        {
            "Date first listed on Amazon": "June 3, 2019"
        }
    ],
    "productDescription": [
        "【Enough capacity】: This grinder is enable to grind coffee beans up to 75g at a time for 15 cups coffee, which is enough for your family and friends to share. The motor is upgrade noiseless, it is quieter than most other coffee grinders.",
        "【Maintain the top aroma】: High-quality 304 stainless steel blade and 150W powerful motor ensure continuous and even grinding for better maintaining the original rich aroma and oil of the coffee bean.",
        "【Multiple uses】: Not just for grinding coffee beans, our grinder can also grind spices, nuts, herbs, pepper, seeds, grains and more! You can grind quickly for coarse consistency or leave it running longer for finer powders.",
        "【Use Safely】: Blades do not separate from grinder, so care should be used when handling and cleaning as blades are sharp. Make sure to unplug the grinder before cleaning.",
        "【Easy to use】: Just by simply pressing the lid with different seconds to perfectly control the precision of the grindering. Through the transparent cover, you can observe the grindering process and get coarse or fine coffee powder for cold brew coffee, French Press, Pour over, Moka pot, Espresso.",
        "Grinding your own coffee at home can dramatically increase your brewed coffee quality. Coffee loses it’s freshness much faster in ground form over whole bean form. Buying the right coffee grinder will give you some serious bang for your buck.",
        "Our LOFTER electric coffee grinder helps you get different coarseness of coffee beans. Anyway, our smart-design coffee grinder will be the best choice for you and your family as well as the best gift for your friends.",
        "Specifications",
        "Motor Power: 150W",
        "Power Supply: 120V, 60Hz",
        "Capacity: Up to 75g",
        "Grinder Material: 2 Stainless Steel Blades",
        "Package: 1*Coffee Grinder, 1*Cleaning Brush, 1*User Manual",
        "Customize to Your Liking",
        "Powerful 150-Watt motor grinds beans in seconds for a quick, efficient and consistent grind. Features sharp and durable stainless steel blades for customizing your grind from coarse to fine.",
        "Large Capacity",
        "With 75g coffee bean capacity you can grind enough for up to 15 cups of coffee in seconds, perfect for French press coffee, espresso, or just your regular cup of joe!",
        "Ground to Perfection",
        "Get freshly ground coffee with full-bodied flavor and better taste, with at home convenience! In addition to coffee beans, LOFTER versatile grinder can be used for chopping or grinding nuts, spices and more.",
        "Easy to Use",
        "Add the ingredient to the transparent cap, please note the max capacity is 75g. Pour the beans into grinding bowl and cover the lid. Press down the cap and make a fine uniform grind for 0~30s.",
        "Best Gift for Friends",
        "Compact design takes minimum space and can be stored easily. It can fit nicely for your counter, cupboard and drawer. Despite its small size, which is enough for your family and friends to share together.",
        "Care Instructions",
        "Always unplug when pouring out and cleaning or not in use. The solids need to be ground must be dry. Please be careful that your hand or fingers are safely away from the blade.",
        "Customize Your Evenly Grinding",
        "LOFTER coffee grinder meets various flavor needs. Different grinding time produces different coarsness. You can grind the coffee beans until it is the consistency you prefer."
    ],
    "reviews": [
        {
            "reviewerName": "Cynthia",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Quiet/fast, coffee powder came out like silk",
            "reviewDate": "June 26, 2019",
            "reviewText": "My mom is a huge coffee fan that she needs to drink coffee everyday but she doesnt like three in one coffee pack so I bought this so she can grind her coffee. It work perfectly fine. Not very loud and so much better than her last coffee maker. It is petite and fast to grind the bean. And the powder came out smooth and soft. Very satisfied with the price I paid."
        },
        {
            "reviewerName": "Almonds",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Can grind other stuff!",
            "reviewDate": "August 2, 2019",
            "reviewText": "I am looking for coffee grinder for a long time. But I want the coffee grinder can grind other stuff. Most coffee grinder not working grind other stuff. But this one did. It can grind spices, nuts, herbs, pepper, seeds, grains what ever you want. It's compact and easily stored in my kitchen. It's also easy to use and clean. I am happy the purchase. Recommend it to others."
        },
        {
            "reviewerName": "Shiraz Ali",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Works well and looks great",
            "reviewDate": "September 24, 2019",
            "reviewText": "It's small, its safe, and it gets the job done. It also looks pretty good given the size and the price.\n\nIf you like your coffee beans extra fine, you will need to shake it around a bit in between pulses. That's its only real drawback, if you even want to call it that. Cleaning isn't the easiest either, but its not so bad I would call it a pain.\n\nOverall, a great little buy for a great little kitchen for those of us who want to save just a little here and there on coffee."
        },
        {
            "reviewerName": "Cancan",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "a good coffee grinder",
            "reviewDate": "June 21, 2019",
            "reviewText": "i love this coffee grinder soooooo mush. i like grind coffee bean by myself because it could help to keep good smell and leave the taste from original bean. i bring to my office and i could make my coffee every morning .\nand it not only for coffee bean, but also could make power for sesame and walnuts. it so worth ~~"
        },
        {
            "reviewerName": "vicky",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Coffee helper",
            "reviewDate": "June 26, 2019",
            "reviewText": "Easy to use and convenient for small amount of coffee. Therefore, it’s easy to clean every time. The process of grinding was fast, wasn’t noisy."
        },
        {
            "reviewerName": "Cynthia",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "pretty good",
            "reviewDate": "June 27, 2019",
            "reviewText": "This coffee grinder is awesome, and for someone like me who loves coffee, grinding coffee beans is fun. It also improves the taste of the coffee. spend less money on a coffee grinder, It's a much bigger lift than adding it to the coffee machine."
        },
        {
            "reviewerName": "dave chen",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Great item",
            "reviewDate": "July 23, 2019",
            "reviewText": "So easy to clean. Omg much easier than the one I had last one. Very easy to used. I love it."
        },
        {
            "reviewerName": "stacey lee",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Good product",
            "reviewDate": "June 24, 2019",
            "reviewText": "first coffee grinder that I got. Never got one before because I usually bought ground coffee. I bought one bag of coffee bean by mistake so I purchase this. There is nothing that I didn’t like. Working well fast and fresh coffee. Good for me I can’t live without our coffee. I recommend this product."
        },
        {
            "reviewerName": "Helen",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "exactly what I wanted",
            "reviewDate": "August 16, 2019",
            "reviewText": "it grinds the coffee in record time.. and I love the size it fits well in the basket for the coffee cups making it CONVENIENT for saving space on the counter .."
        },
        {
            "reviewerName": "Amazon Customer",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Effortless and easy to use",
            "reviewDate": "September 11, 2019",
            "reviewText": "Used this for grinding Chia seeds and it did so rapidly and effortlessly. Easy to clean, small footprint, sleek, compact design yet roomy. Very happy with it."
        },
        {
            "reviewerName": "KorinnKulin",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "small and convenient",
            "reviewDate": "June 20, 2019",
            "reviewText": "This little gem is a great coffee grinder for those who only want to grind smaller amounts of coffee beans at a time to keep fresh . It reduces coffee beans to fine grind in a matter of seconds.\nHighly recommend."
        },
        {
            "reviewerName": "Yaocai B.",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Good investment",
            "reviewDate": "June 30, 2019",
            "reviewText": "My friend suggested me to make coffee by using fresh-ground one. So I bought this coffee grinder. It works perfectly for me. It is really a good investment as now I buy whole coffee beans from Costco and grind it using this coffee grinder every morning."
        },
        {
            "reviewerName": "Latina",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Best invention",
            "reviewDate": "August 22, 2019",
            "reviewText": "This is great for home to Grinding your coffee beans and have fresh espresso at home"
        },
        {
            "reviewerName": "Ryan",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Love it",
            "reviewDate": "September 28, 2019",
            "reviewText": "This has worked extremely well so far. Great value!"
        },
        {
            "reviewerName": "Amazon Customer",
            "rating": "3.0 out of 5 stars",
            "reviewTitle": "Sleek look, that's about it.",
            "reviewDate": "September 18, 2019",
            "reviewText": "The container is not removable so you need to be careful cleaning it. You also need to hold the on and off botton, you get what you pay for."
        },
        {
            "reviewerName": "Jesse Peschel",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Easy to use",
            "reviewDate": "November 9, 2019",
            "reviewText": "Great!"
        },
        {
            "reviewerName": "Linda K Roberts",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Great Price, Works Great",
            "reviewDate": "July 22, 2019",
            "reviewText": "Great grinder, especially for the price."
        },
        {
            "reviewerName": "Veta M Springer",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "It's worth the money",
            "reviewDate": "September 6, 2019",
            "reviewText": "I love ,love this product. I got it to grind/blend spices and it is excellent. I make sure to clean (using the brush mostly) and dry thoroughly after each use. Never used it for grinding coffee."
        },
        {
            "reviewerName": "ennifer W.",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "A powerful and durable machine.",
            "reviewDate": "July 25, 2019",
            "reviewText": "The device looks nice. It’s compact and stores easily. Very happy with the durability and effectiveness of the grinder. Well worth the price!"
        },
        {
            "reviewerName": "KindleReader",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Excellent purchase!",
            "reviewDate": "September 10, 2019",
            "reviewText": "A great little coffee grinder."
        },
        {
            "reviewerName": "john",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Good",
            "reviewDate": "August 21, 2019",
            "reviewText": "Coffee"
        },
        {
            "reviewerName": "Brenda Antonich",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Best little coffee grinder!",
            "reviewDate": "August 20, 2019",
            "reviewText": "Very easy to use and clean!"
        },
        {
            "reviewerName": "Peggy",
            "rating": "4.0 out of 5 stars",
            "reviewTitle": "Easy to use",
            "reviewDate": "September 19, 2019",
            "reviewText": "The instructions are very detailed! I can easily to use it!"
        },
        {
            "reviewerName": "Shawnee Huckstep",
            "rating": "4.0 out of 5 stars",
            "reviewTitle": "works well",
            "reviewDate": "September 8, 2019",
            "reviewText": "hard to clean"
        },
        {
            "reviewerName": "SAIMA AHMED",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Worth it.",
            "reviewDate": "October 3, 2019",
            "reviewText": "Excellent"
        },
        {
            "reviewerName": "Sheik Asweem",
            "rating": "2.0 out of 5 stars",
            "reviewTitle": "Hope the replacement work better",
            "reviewDate": "August 2, 2019",
            "reviewText": "Work less than 2 minutes and stop working"
        },
        {
            "reviewerName": "C. S. Wolfgram",
            "rating": "4.0 out of 5 stars",
            "reviewTitle": "Thought it would work better",
            "reviewDate": "September 23, 2019",
            "reviewText": "I'm a review freak. So after seeing the high ratings, and paying a few $ more, I expcted this grinder to work a little better. My two complaints are, with my unit, the grind button hangs up. Once you push hard enough to break it loose, it is very smooth and easy. But each time I remove the lid, then put it back on, it hangs up again :(\nSecondly, if you just put the grounds in and hold the grind button for however long, after 15 or 20 seconds, the grounds around the edge will stop circulating and give you an uneven ground, and even a few beans that are nearly whole ! The only way to rectify this, is to pick it up and shake it a few times... or even, to just hold it and shake it the whole time its grinding. So yea, it works, but not without some help.\nFeels pretty solid though. Compact and clean appearance."
        },
        {
            "reviewerName": "Leah lynch",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "I strongly recommend it!",
            "reviewDate": "June 17, 2019",
            "reviewText": "I'm really satisfied with this purchase. I need it to grind Chia's seeds. It's done very well. It provides very fine grinding. It's easy to clean. Good quality, quiet and powerful! I strongly recommend it!"
        },
        {
            "reviewerName": "flyevil",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "powerful coffee grinder",
            "reviewDate": "June 17, 2019",
            "reviewText": " this coffee grinder is powerful, can grind lots of things, very useful"
        },
        {
            "reviewerName": "Bensmom",
            "rating": "4.0 out of 5 stars",
            "reviewTitle": "Grinds smoothly but slightly hard to clean",
            "reviewDate": "August 3, 2019",
            "reviewText": "To me it is much quieter than my previous grinder, however my wife says it has a high pitch whine that I can't hear. It grinds quickly. My only issue is that certain types of beans stick to the cup after grinding and have to be swept out using the provided brush. That's not a show stopper, only a very minor annoyance."
        },
        {
            "reviewerName": "VikramRoscobG",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "This grinder is fantastic!",
            "reviewDate": "June 13, 2019",
            "reviewText": "This grinder is fantastic! Good job, grinding every bean. Grinding speed is fast, easy to use, easy to clean, and good quality. I like it. I'll do it again!"
        },
        {
            "reviewerName": "Teddy",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "It's compact and useful",
            "reviewDate": "July 17, 2019",
            "reviewText": "The coffee grinder is very compact and useful. I’m very happy with the product as my friend and an avid drinker of coffee and I got her this for her birthday. She told me how she loved it and how she’s been using it frequently. It’s efficient and it gets the job done. I would recommend this again."
        },
        {
            "reviewerName": "Vicky",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "useful item",
            "reviewDate": "June 17, 2019",
            "reviewText": "It is a useful grinder. It could be used to grind every bean and nut into powder. Pretty easy to use and clean. Good price for a full function."
        },
        {
            "reviewerName": "Chelsea Fletcher",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Worth it.",
            "reviewDate": "August 12, 2019",
            "reviewText": "Great product for the price! It makes quick work of my beans and nuts. It is powerful and super easy to use. I use it a lot for grinding up coffee beans for my uusbanda cold brew coffee. There is something that is just so much better about grinding your own coffee beans."
        },
        {
            "reviewerName": "jerm l.",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Quiet and fast grinder",
            "reviewDate": "July 15, 2019",
            "reviewText": "I bought some whole bean last week from Costco and forgot to grind before brought it home. I did not want to go back so I ordered this little grinder for my coffee. It does awesome job to grind my bean, it was quiet and fast within minutes that I have ground coffee for my morning. I used to have old coffee grinder was too loud."
        },
        {
            "reviewerName": "Ari",
            "rating": "3.0 out of 5 stars",
            "reviewTitle": "Smells like burning parts",
            "reviewDate": "October 27, 2019",
            "reviewText": "Works as described but emits a horrid smell. I keep this to use at work and my coworkers complain every time because it smells like burning plastic or motor parts. Overall, I wouldn’t recommend this grinder because of the stench."
        },
        {
            "reviewerName": "Xiaodongli",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "cool",
            "reviewDate": "June 19, 2019",
            "reviewText": "Like their own ground coffee beans, the smell is very fragrant, my friend recommended this machine to me, after using the feeling is very good, the strength is big, the grinding is very fine."
        },
        {
            "reviewerName": "Layelfulan Fernandez",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Quick grind coffee with low noise",
            "reviewDate": "June 27, 2019",
            "reviewText": "I used 1 min to learn and start to use this coffee grinder and start to enjoy coffee after 2 mins. I feel it is very easy to clean and the noise is low during working."
        },
        {
            "reviewerName": "Ted Krever",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Fast and Quiet",
            "reviewDate": "August 1, 2019",
            "reviewText": "We use this grinder for our coffee beans to make espresso and this grinder does it in seconds - and it's much quieter than others we have used. Since we sometimes grind beans in the morning this is much appreciated."
        },
        {
            "reviewerName": "Helen",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "compact",
            "reviewDate": "June 15, 2019",
            "reviewText": "it is really nice and compact coffee and nut grinder. it looks high quality kind. i used to do the nuts. it comes very good. the machinery is very stylish too."
        },
        {
            "reviewerName": "coasterfreak1",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "ver y well made machine",
            "reviewDate": "September 1, 2019",
            "reviewText": "very well made has a 1yr warranty buy and enjoy deep bowl so you can grind a lot of coffee or spices easy to clean"
        },
        {
            "reviewerName": "Monaz",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "i love it",
            "reviewDate": "July 1, 2019",
            "reviewText": "\"Simple, easy and quiet. Wow. Makes short work of the beans for my morning espressos.\n\""
        },
        {
            "reviewerName": "John Bradley",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "very nice!",
            "reviewDate": "June 25, 2019",
            "reviewText": "I bought a product bigger than this before, but after a while it broke. After that I met this, I bought it with a try, because it is a little cheaper and looks better. After receiving the goods, I found that it was exactly what I wanted! like it!Highly recommend."
        },
        {
            "reviewerName": "Anna S.",
            "rating": "1.0 out of 5 stars",
            "reviewTitle": "Low quality",
            "reviewDate": "November 4, 2019",
            "reviewText": "Low quality product for the price, it does not work properly."
        },
        {
            "reviewerName": "Portia",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Easy to use",
            "reviewDate": "July 5, 2019",
            "reviewText": "I use it to make almond ground, it works well.Very easy to clean.Nice!"
        },
        {
            "reviewerName": "Julie H",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Quieter than most",
            "reviewDate": "July 24, 2019",
            "reviewText": "So much quieter than our previous grinder"
        },
        {
            "reviewerName": "Josh",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Works great",
            "reviewDate": "November 6, 2019",
            "reviewText": "Arrived on time, as described, works well"
        },
        {
            "reviewerName": "Luise K.",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Excellent, very satisfied!!",
            "reviewDate": "September 6, 2019",
            "reviewText": "Love it!"
        },
        {
            "reviewerName": "liuyangping",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Coffee Grinder",
            "reviewDate": "June 15, 2019",
            "reviewText": "There is a lack of a coffee grinder at home.This coffee grinder works well."
        },
        {
            "reviewerName": "Giveypup",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Good customer service, good grinder",
            "reviewDate": "July 15, 2019",
            "reviewText": "I would do business with these people and buy this product, again."
        }
    ]
}