{
    "title": "Baratza Virtuoso+ Conical Burr Coffee Grinder with Digital Timer Display",
    "manufacturer": "Baratza",
    "currentPrice": "$249.00",
    "rating": "4.5 out of 5 stars",
    "totalRatings": "51 ratings",
    "features": [
        "\n         Make sure this fits\n                by entering your model number.\n        \n",
        "SPECIALTY COFFEE ASSOCIATION AWARD WINNING GRINDERS - Baratza grinders are preferred by coffee professionals and backed by Baratza’s world class support.",
        "DIGITAL TIMER and BACKLIT GROUNDS BIN - a 40-second digital timer, adjustable to a tenth of a second, and an LED backlit grounds bin to dose ground coffee accurately and consistently.",
        "40 GRIND SETTINGS - With enhanced commercial-grade conical burrs to help you explore an extensive range of brew methods (espresso, Aeropress, Hario V60, Chemex, French Press, and automatic brewers).",
        "STYLISH - A sculptured metal top and base give the Virtuoso+ a modern image that highlights your coffee corner.",
        "WARRANTY/QUALITY PARTS - Engineered with 40mm hardened alloy steel burrs manufactured in Liechtenstein, Europe, plus a powerful DC motor. This combination creates a consistent grind and durability ensuring the longevity users have come to expect from the Baratza brand. The Virtuoso+ is backed by Baratza’s world class support and a 1 year warranty."
    ],
    "reviewsAspects": [
        "ground coffee",
        "french press",
        "every time",
        "coffee grinder",
        "consistent grind",
        "grind settings",
        "burr grinder",
        "grind time",
        "another baratza grinder",
        "great grinder",
        "excellent grinder",
        "grinds",
        "virtuoso",
        "espresso",
        "timer",
        "machine",
        "capresso",
        "grinders",
        "mess",
        "parts"
    ],
    "productInformation": [
        {
            "Product Dimensions": "6.7 x 6.7 x 12.6 inches"
        },
        {
            "Item Weight": "7.05 pounds"
        },
        {
            "Shipping Weight": "8.5 pounds (View shipping rates and policies)"
        },
        {
            "Manufacturer": "Baratza"
        },
        {
            "ASIN": "B07QMY8GLX"
        },
        {
            "Item model number": "Virtuoso +"
        },
        {
            "Customer Reviews": "4.5 out of 5 stars\n    51 ratings\n4.5 out of 5 stars"
        },
        {
            "Best Sellers Rank": "#10,969 in Kitchen & Dining (See Top 100 in Kitchen & Dining)\n#15 in Burr Coffee Grinders\n"
        },
        {
            "Date first listed on Amazon": "April 10, 2019"
        }
    ],
    "productDescription": [
        "Virtuoso+",
        "The new classic...The Baratza Virtuoso grinder that has been loved for years and years just got even better! The Virtuoso+ now includes a digital timer that offers easy and repeatable dosing.",
        "The high performance burr set helps create cafe quality coffee, making this grinder perfect for your coffee journey. The Virtuoso+ has an accurate fine to coarse grind for all popular brew methods and grinds at a speed of 2g/second.",
        "\n            A convenient front-mounted dial allows you to adjust the 40-second digital timer to a tenth of a second. Press the dial to grind directly into portafilter or the included grounds bin. This makes it easy to adjust and replicate the ideal grind time for consistent dosing. The clear grounds bin is backlit so you can easily see when the grounds have reached the fill line indicating it needs to be emptied.\n        ",
        "\n            Featuring 40 individual grind settings, you can go from fine to coarse for all the popular brew methods such as espresso, Aeropress, Hario V60, Chemex, French Press, and automatic brewers.\n        ",
        "\n            With its small footprint, the Virtuoso+ fits nicely under most kitchen cabinets. The hopper can hold 8 ounces of whole beans. The quality engineering and build will give you excellent grinding performance. Baratza grinders are designed to be serviceable; parts and support are available to provide years of use and environmental sustainability.\n        ",
        "Enhanced Burr Set",
        "Easy, Intuitive control.",
        "40 steps of grind adjustment",
        "Small but Mighty Grinder.",
        "Most small, consumer appliances are designed to wear out, or stop being useful in a very short time. These appliances are difficult and expensive to repair, so consumers are trained to dump and replace which has big environmental implications.",
        "In contrast, we’ve purposefully designed Baratza grinders to be maintained like commercial grinders and maximize their value. With regular cleaning, maintenance, repair, and even rebuilds our grinders can give an excellent, accurate grind for many years."
    ],
    "reviews": [
        {
            "reviewerName": "Philip Ross",
            "rating": "1.0 out of 5 stars",
            "reviewTitle": "Not a good grinder",
            "reviewDate": "June 24, 2019",
            "reviewText": "I used a Breville for over a year and loved it, until it started jamming a lot, and I thought I needed an upgrade. I did a lot of research and found everyone saying this was the grinder to get, and it's about $100 more than the Breville, so I went with it.\n\nGrinder came in, I made a few cups at recommended settings + a little tweaking. Could never get any good flavor out of it. I used a Kruve sieve, and it confirmed what I tasted: the grinder was only giving me like 33% fines, 33% good range (400-800 microns), 33% boulder, distribution. In other words, it is literally all over the place, no consistency in distribution. My cheaper Breville gave me 12%, 75%, 12%. I have NO idea why this grinder is recommended by so many?? It's either not a good grinder, or there was a problem with the model they sent me.\n\nI requested a refund and they only sent me 50% of my money, which was extra disappointing. To be fair, my gf had already thrown out the product box (and I think I forgot to send in the brush which I recently found), but still, $125 for restocking, brush, and box? Come on.\n\nI held a grudge against the company, but eventually gave in and ordered a Forte anyway. That was quite the upgrade. Now I'm getting 90% in the desirable range.\n\nDon't spend your money on this and get a Breville if you're in this kind of price range."
        },
        {
            "reviewerName": "Chris Van Rees",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Great grinder",
            "reviewDate": "July 21, 2019",
            "reviewText": "Replaced my old Capresso grinder. Much quieter, much more even grind. The LED lighting is a really nice feature that I enjoy. All grinds are very consistent, and the construction of the unit as a whole just feels sturdy."
        },
        {
            "reviewerName": "David",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Great semi-pro coffee grinder I've ever used.",
            "reviewDate": "July 31, 2019",
            "reviewText": "Other coffee grinders I've used or owned were slow, noisy, and produced uneven grinds that clung to the receiver when it was opened (and often caused grinds to scatter on the countertop). This grinder has none of those flaws and is often used by coffee shops as a backup machine or for special orders. Very clearly worth the price, and able to be repaired and renewed at a very modest cost. My last grinder!"
        },
        {
            "reviewerName": "BRBDallas",
            "rating": "4.0 out of 5 stars",
            "reviewTitle": "BETTER COFFEE",
            "reviewDate": "July 29, 2019",
            "reviewText": "I bought this to replace another coffee grinder, and even though both are conical burr grinders, this one makes better tasting coffee. There is a very precise timer, so that you can make exactly the amount of coffee you want consistently, with nothing left over. That means that all the coffee is brewed from freshly-ground beans. It's pretty loud but most grinders are. Some assembly is required, and instructions are not great (who knew that they hid the gasket in the bin for ground coffee?); that is the only reason I did not give it 5 stars."
        },
        {
            "reviewerName": "Parker Frontier",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Even & Consistent Grind. Quiet, Too",
            "reviewDate": "August 18, 2019",
            "reviewText": "I'm very happy with the quality and consistency of the grind this machine produces. Most beans produce little or no static buildup. The grind timer has to be adjusted every time I try a new blend, since beans differ in weight by variety and I always use ground coffee by weight. The machine does remember its last setting. The hopper capacity is not more than 1/2 lb or so, so I continue to use an airtight canister as storage. Since I got this machine grinding coffee every morning no longer wakes my husband. ;-)\n\nThe machine is much more expensive than any other coffee grinder I've had, but having taken the plunge, I'm glad that I did. This is a very good piece of equipment, very solid and easy to clean, etc. Highly recommended!"
        },
        {
            "reviewerName": "Robert McCreary",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Quiet precision.",
            "reviewDate": "June 3, 2019",
            "reviewText": "Prompt delivery. Exactly as advertised. Easy set-up. Much less noise, and shorter grind time than my Cuisinart."
        },
        {
            "reviewerName": "Puter Puppy",
            "rating": "4.0 out of 5 stars",
            "reviewTitle": "Easy to use",
            "reviewDate": "July 14, 2019",
            "reviewText": "Only had for a short time and still making adjustments but it is easy to use. Might wake someone if they were a light sleeper but the timer will produce the same amount each time. Some grounds will fall out when you remove the the container holding the ground coffee but is minimal. Will update as time passes and have used it more."
        },
        {
            "reviewerName": "Charles R.",
            "rating": "2.0 out of 5 stars",
            "reviewTitle": "Beans jam burr grinding mechanism",
            "reviewDate": "July 20, 2019",
            "reviewText": "I've owned this product for 2 months and can't remember the last time I wasting $250 like this. I grind dark roasted Costa Rican beans once a week (10 uses to date). Twice beans have jammed between the burr and grinder wall and the setting got moved from mine of 18 all the way to zero ruining a complete hopper of beans. I wasn't, and don't want to have to be, standing next to the unit watching its every move. Have to use a small fork to pry out the jammed beans resulting is a real mess on the counter. This grinder is slow (knew this from reviews) but is also at least as noisy as than my old Capresso 560 grinder which I had for 6 years. Ease of cleaning is not much better than my Capresso, which always seems to be a major hit on the Capresso.. Going back to the Capresso. Not sure who to foist this Baratza on!"
        },
        {
            "reviewerName": "Juan",
            "rating": "4.0 out of 5 stars",
            "reviewTitle": "Beans get stuck but grinds beautifully.",
            "reviewDate": "June 16, 2019",
            "reviewText": "Love it!!! My only issues are with a little more grind retention than my last grinder with beans getting stuck in crevices. But it’s fast, quiet enough and overall consistent."
        },
        {
            "reviewerName": "pilgrim",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "This is the company I want to do business with.",
            "reviewDate": "October 27, 2019",
            "reviewText": "After much research, the Baratza Virtuoso+ came out on top and one of the biggest reasons is, it is not a disposable piece of equipment. Parts are replaceable and walk you thru it/ how-to videos abound for replacing worn parts, cleaning and maintenance. This is the company I want to do business with. Baratza makes quality, user friendly products. As for the noise factor, I've nothing to compare it with but consider it reasonable. Performance-wise, I'd say I got my money's worth. This grinder fits our needs for drip, pour over and french press preparation. No issues w/ mess or static. Though I would purchase again, I don't think I'll ever need to."
        },
        {
            "reviewerName": "George Karl",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Solid basic grinder",
            "reviewDate": "July 23, 2019",
            "reviewText": "I had another baratza grinder for 6 years and it finally broke down ( cracked drive gear). I’ve used it a minimum of two times a day for espresso. This is similar grinds fine enough that my Italian espresso maker can’t power through it. I love the price and the quality"
        },
        {
            "reviewerName": "hehdu01",
            "rating": "1.0 out of 5 stars",
            "reviewTitle": "What a disappointment- so messy!",
            "reviewDate": "September 7, 2019",
            "reviewText": "Bought this grinder as it was highly recommended. Grinding looked OK, no complaints. But the mess! Coffee grinds everywhere and impossible to avoid. No way we’ll have such a mess every time we want to have a coffee. Definitely do not recommend. Huge disappointment."
        },
        {
            "reviewerName": "SteveK1953",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Espresso to Pour over",
            "reviewDate": "October 19, 2019",
            "reviewText": "Purchased this for two purposes: 1. To grind for pour over coffee. 2. Espresso grind. Fills both reason well. The pour over is a easy job for almost any burr grinder, but this I am able to fine tune it to get well timed shots on a non pressurized 58mm portafilter. If I was drinking espresso only, the Sette 30 would have been better. Would purchase again in a heartbeat!\nIf you check Baratza web site this grinder is totally serviceable, replacement parts from A to Z, not a throw away item."
        },
        {
            "reviewerName": "Ray",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Fabulous coffee grinder with a small countertop footprint",
            "reviewDate": "July 4, 2019",
            "reviewText": "Upgraded from a blade Mr. Coffee to this Baratza Virtusoso Plus. Wow, what an upgrade! I make my daily cup of coffee in a Bonavita Metropolitan and dialed in to 20 on the grinder. The grinder looks lovely on my small apartment counter top, doesn't make too much noise, and makes a great cup of coffee."
        },
        {
            "reviewerName": "Bill",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Best grinder",
            "reviewDate": "September 13, 2019",
            "reviewText": "I used blade grinder, manual burr grind, and then this one. There is no comparison how well it grinds in terms of controls, evenness, and speed. It is great looking too. My only complaint is it would be nice if noise level could be lower a bit. Very happy customer. Well worth the money."
        },
        {
            "reviewerName": "Roy G",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Very good so far",
            "reviewDate": "July 20, 2019",
            "reviewText": "Bought 1 & didn’t work so sent back. Bought 2nd one few weeks ago. Works great"
        },
        {
            "reviewerName": "Virginia S. Nelke",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Best Burr grinder I've ever owned. Customer service is great too.",
            "reviewDate": "July 13, 2019",
            "reviewText": "I love this machine, especially that you can remove parts to clean and repair."
        },
        {
            "reviewerName": "Eric Friar",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "I like it!",
            "reviewDate": "July 20, 2019",
            "reviewText": "Messing with my morning coffee is a high risk enterprise. I haven't cleaned this machine, yet, but otherwise it exceeds expectations. No mess. No fuss. Morning fun."
        },
        {
            "reviewerName": "Raleighs",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "The best.",
            "reviewDate": "August 24, 2019",
            "reviewText": "Well made, Heavy, wide range of grinds, fast, quieter, precise, fresh flavors, powerful, fixable, consistent grinds, professional, espresso to French press,"
        },
        {
            "reviewerName": "Dennis",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "works great!",
            "reviewDate": "August 3, 2019",
            "reviewText": "Very happy with purchase! Feels and looks like Quality and does a good job. Makes very little mess."
        },
        {
            "reviewerName": "Jonathan Herbert",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "You Don’t Buy Your Beans Ground, I Hope",
            "reviewDate": "August 31, 2019",
            "reviewText": "Great coffee grinder. Perfect, evenly ground coffee every time. Gotta love this."
        },
        {
            "reviewerName": "Kat",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "A Beast",
            "reviewDate": "August 24, 2019",
            "reviewText": "Grinds very precisely; from cold brew-coarse to espresso-fine and fast! Feels very well made and likely to last forever."
        },
        {
            "reviewerName": "Amazon Customer",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Best Grinder!",
            "reviewDate": "July 2, 2019",
            "reviewText": "User friendly, perfect grind producing a smooth rich cup of French press coffee."
        },
        {
            "reviewerName": "gypsy",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Best for the money!",
            "reviewDate": "October 12, 2019",
            "reviewText": "Although I would consider this machine loud I’m sure there are louder. Adjustable grind settings and grind time make it easy to grind small or large amounts."
        },
        {
            "reviewerName": "Katie Timm",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Awesome.",
            "reviewDate": "July 19, 2019",
            "reviewText": "Awesome."
        },
        {
            "reviewerName": "P.C. Salter",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Major improvement over blade grinder.",
            "reviewDate": "August 14, 2019",
            "reviewText": "I thought this unit would dose a specified gram weight but no. Grind time is based in seconds.\nRegardless, I am pleased with my purchase."
        },
        {
            "reviewerName": "Ken Middaugh",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Excellent quality!",
            "reviewDate": "September 22, 2019",
            "reviewText": "This is a superb product. Well constructed, lots of grind settings. It is noisy though."
        },
        {
            "reviewerName": "William Buchanan",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Worth it!",
            "reviewDate": "November 8, 2019",
            "reviewText": "As advertised...works great and has improved flavor"
        },
        {
            "reviewerName": "Matthew Licata",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Great product for most grinding needs.",
            "reviewDate": "September 13, 2019",
            "reviewText": "Excellent all-around grinder. Makes a huge difference in n taste."
        },
        {
            "reviewerName": "Mark O",
            "rating": "2.0 out of 5 stars",
            "reviewTitle": "Timer Limitations",
            "reviewDate": "July 23, 2019",
            "reviewText": "Important note to pass along so others do not have misplaced expectations on the Virtuoso+ like I did. Bottom line is there can be anywhere from a 2 to 6 gram variance using same beans, same grind time and setting.\n\nFor example filling the hopper with beans and selecting an 18 grind setting for a time of 18 seconds results in about 20 grams of ground coffee. Press the button again with exact same settings and 26 grams of ground coffee comes out, press it again and you get 24 grams of ground coffee.\n\nIf you’re more of a ballpark scoop sort of coffee brewer then the Virtuoso+ is likely a great machine for you. But if you’re expecting the timer to produce precise, consistent and repeatable amounts of ground coffee then you will like me be disappointed. I verified this with Baratza who confirmed due to size, shape and position of beans in the hopper the margin of error I was experiencing is to be expected.\n\nNote I purchased this coffee grinder from a west coast online retailer who has been less than helpful in answering my questions, and I doubt they are going to publish my honest review, so that’s why I am posting it here on Amazon."
        },
        {
            "reviewerName": "William F.",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "GREAT GRINDER U.S. Company",
            "reviewDate": "October 21, 2019",
            "reviewText": "I want to start by saying I am honest and not connected to this company or Amazon. I have not been paid to write this. I have had my unit over 4 years and has always performed well. Today I got up started grinding my daily pot and noticed it slowing down. It was done would not work anymore. I was about ready to just pitch it and realize I had spent $250 on something that did not last. WRONG!!! ...I stumbled on the company's phone number in WA but did not expect much WRONG AGAIN. After talking to a very nice rep going through troubleshooting figured out motor died. We split shipping costs they are repairing for a FAIR fee and shipping it back. Not often you get this kind of service or a REAL person on the phone to talk to you. I am super happy and will never buy another grinder from anyone but them! 100% satisfied with the grinder and the U.S. company that makes it. Dont believe the negatives they stand by their grinders."
        },
        {
            "reviewerName": "ACW1120",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Damn...I feel this product stays the same and I am growing older",
            "reviewDate": "September 26, 2019",
            "reviewText": "I love this product, I like to buy the new version of virtuoso, but the old one I own refuse to die, it still grinds my coffee in a daily basis, my expresso machine after a faithful six years regular service, finally gave it up, but this grinder always keeps grinding away with powder-fine coffee, I toasted every kind of coffee beans I can find to it, Ethiopia, Nicaragua, Brazil, Columbia, Java, Kenya...you name it I tried it, it just refuses to quit.\nI know you should not submit a product review after so many years primarily on a newer version that you do not own, also, for an apparent reason, you should not fall in love with an appliance too much, but cannot help it. I am getting old, but this product stays the same, damn, I feel sad."
        },
        {
            "reviewerName": "The Exacting Consumer",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Fantastic improvement to the Virtuoso!",
            "reviewDate": "June 23, 2019",
            "reviewText": "I really didn't want to shell out another $200+ for a grinder but as a gen 1 Virtuoso owner with a few complaints, I had to give this a try. Everything I HATED about the gen 1 has been fixed in the Virtuoso+!\n\n1) Wind up timer yielding imprecise grind sessions...gone. V+ now has a digital timer easily adjusted to dial in precise and repeatable grinds.\n\n2) The dark smokey grounds bin hiding what you grind...gone. V+ now has an integrated light that illuminates the grinds bin.\n\nVirtuoso was already a great burr grinder with a strong motor and wide range of grind options. None of that has changed. If you have a gen 1 unit and are looking for an improvement or are a new buyer looking for a very good grinder... this is it!"
        },
        {
            "reviewerName": "Tech Savvy",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Three weeks in, I'm very happy with it",
            "reviewDate": "July 19, 2019",
            "reviewText": "My Bodum Bistro Burr grinder gave up the ghost after five years of every-other-day use. (The motor still works, but obviously a plastic gear or other internal part broke.) When I saw how highly rated the previous-version Virtuoso was and that Baratza sells replacement parts, I decided on this model. (The idea of selling product that's destined for the landfill after three or four years drives me nuts.)\n\nSo far I'm very happy with the performance of this grinder. It's quieter than Bodum it replaced (but by no means quiet). The plastic bin is a bit of a downgrade from the glass of the Bodum, but it holds much more coffee and will run *much longer* due to the higher-quality parts. I grind Hazelnut beans -- a little, but not too oily -- at 17 for drip coffee using brown paper filters, and the resulting rounds are consistent in size and perfect for my use. I hope to get MANY years out of this grinder, and will report back if anything goes awry. (Hopefully I'll have a positive update in a year's time.)"
        },
        {
            "reviewerName": "gm",
            "rating": "4.0 out of 5 stars",
            "reviewTitle": "Excellent grinder",
            "reviewDate": "September 21, 2019",
            "reviewText": "I really like the features of this grinder. I previously had a Baratza Encore which also was a great grinder. However, the Virtuoso+ has easier to read grind settings and has a timer which shuts off automatically. The Encore was all manual and the grind settings were hard to read. But as for the main function of grinding coffee for espresso, Aeropress, and drip coffee; both the Encore and Virtuoso+ are outstanding with consistent grind size."
        },
        {
            "reviewerName": "Michael Janusek",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Excellent grinder for those who are serious about coffee preparation",
            "reviewDate": "August 20, 2019",
            "reviewText": "This grinder is new to my coffee world. I truly seek perfection in a coffee grinder because I actually roast my own coffee and I am sensitive to the changes in flavor that are evoked through different sized grinds used in different brewing methods. This grinder produces a consistent grind and it is fairly quiet. The timer dial works well and is convenient. For my Chemex coffee-making pour-over system, this grinder is perfect every time."
        },
        {
            "reviewerName": "Ryan Johnson",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Great value",
            "reviewDate": "June 20, 2019",
            "reviewText": "So glad I chose this grinder. Upgrading from a cheap grinder makes such a difference in the aroma and flavor of quality coffees. I brought a pot to a meeting last night and as soon as I walked in the room people were commenting how good it smelled - it’s all due to a quality grind!"
        },
        {
            "reviewerName": "S. A. Joyce",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "One button function makes mornings simple!",
            "reviewDate": "July 1, 2019",
            "reviewText": "Love the timer. Once you determine grind and amount, you set timer allowing you only to have to push start all the days following. Simple design is unobtrusive. Good value for the product."
        },
        {
            "reviewerName": "CelticOne",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Great grinder!",
            "reviewDate": "November 12, 2019",
            "reviewText": "Not cheap, but a great machine. I bought it to replace a small blade type grinder that stopped working, and this is FAR superior. Grinds cooler (better flavor) and to a perfectly uniform size. Some reviewers find it noisy, but it does not bother me. I don't know about air-tight storage, as I do not store beans or ground coffee in it. Very happy with this!"
        },
        {
            "reviewerName": "steven m christensen",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "High quality, consistent grind and easy to use.",
            "reviewDate": "July 9, 2019",
            "reviewText": "Excellent product; heavy duty motor and VERY easy to operate. Easy to modify grind with consistent results."
        },
        {
            "reviewerName": "Teresa Lohmeier",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Consistent grind",
            "reviewDate": "September 4, 2019",
            "reviewText": "I love this grinder, it doesn’t take up much counter space, it looks nice and its not to noisy. I only gave it a 4 star on easy to clean because I haven’t cleaned it yet."
        },
        {
            "reviewerName": "Deborah",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Great for grinding fresh roasted coffee beans",
            "reviewDate": "August 1, 2019",
            "reviewText": "This was a birthday present for my husband. He has really enjoyed having it and using it to make his espressos from fresh whole coffee beans."
        },
        {
            "reviewerName": "Jerrykii",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Great grinder and quite.",
            "reviewDate": "October 13, 2019",
            "reviewText": "Nothing so far to say that is bad, only had a few weeks. The hopper top could be better, it is a bit under designed. However the consistency of grind is outstanding and quite."
        },
        {
            "reviewerName": "Stephen E Pazian",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Excellent Coffee Grinder for Espresso",
            "reviewDate": "August 13, 2019",
            "reviewText": "This is my second Virtuoso coffee grinder from this brand and you can't go wrong with it. I like the digital timer to grind and dispense just the right amount of coffee."
        },
        {
            "reviewerName": "Win231",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Excellent Grinder",
            "reviewDate": "July 12, 2019",
            "reviewText": "I was replacing a Cuisinart grinder that was OK until the plastic grinds bin cracked. Since I'm considering an espresso maker, I wanted a grinder that would grind fine enough for espresso. I haven't made espresso yet, but I did test the unit on the \"Fine\" setting & it did seem to be fine enough for espresso - almost a powder. The Baratza grinders have high ratings on cooking shows.\nThe Virtuoso \"Plus\" has a couple of features that I really like, such as the LED light that lets you see the fill level in the grounds bin and the digital readout on the front display.\nBaratza did an excellent job of solving the static problem with coffee grinders. I don't know how they did it, but there is NO spraying out of coffee grounds after grinding, like there was with my Cuisinart grinder. Also, there is no lid on the grounds bin, which allows you to grind directly into your pour over or espresso filter."
        },
        {
            "reviewerName": "M. J.",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Virtuoso Update",
            "reviewDate": "October 5, 2019",
            "reviewText": "Three years later, we just got a pebble in our coffee and it trashed the ring burr. I ordered a new one and the cone burr but looking closer it is ok and I could have got away with th ering burr for about $14.00 plus shipping. Actually this was probably a good thing as we grind daily, not a lot, but some and using french press, I noticed it was passing more fines than I wanted. It looks like the burr had been going three years before the damage. I got the Capresso out and it seemed to do a good job with a coarse grind as well. I will install then new burr and track usage but I think we use about a pound a week."
        }
    ]
}