{
    "productInformation": [
        {
            "Package Dimensions": "8.5 x 8.3 x 4.2 inches"
        },
        {
            "Item Weight": "1.45 pounds"
        },
        {
            "Shipping Weight": "1.45 pounds (View shipping rates and policies)"
        },
        {
            "Manufacturer": "TRIPLETREE BRANDING LLC"
        },
        {
            "ASIN": "B07VWN5B31"
        },
        {
            "Customer Reviews": "4.4 out of 5 stars\n    45 ratings\n4.4 out of 5 stars"
        },
        {
            "Best Sellers Rank": "#10,725 in Kitchen & Dining (See Top 100 in Kitchen & Dining)\n#6 in Manual Coffee Grinders\n"
        },
        {
            "Date first listed on Amazon": "July 31, 2019"
        }
    ],
    "productDescription": [],
    "reviews": [
        {
            "reviewerName": "MandBinc",
            "rating": "3.0 out of 5 stars",
            "reviewTitle": "I would not recommend this",
            "reviewDate": "October 18, 2019",
            "reviewText": "The grinder worked but for me not very well. The grinding handle on top requires that you grasp the base of the jar while turning it. I found this stressful on my wrist.\n\nThe grinding only takes place in a clockwise direction, fine for normally right handed people but left handers may find this a little disturbing,\n\nThe instructions recommend viewing the video before use, which is fine but to view the video you have to email the company and they will send you a link as to where the video is. Sneaky way of getting your email address.\n\nThey show how to clean the unit, did not look too hard till I tried it. Started out ok then the spring popped out of the top as did a small washer and that was when I threw it away.\n\nFor purest who are coffee aficionados' this may be the perfect appliance. I bought an electric grinder, ground up the bag and poured it into an empty coffee can."
        },
        {
            "reviewerName": "pislang",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Manual grinder is always better",
            "reviewDate": "September 21, 2019",
            "reviewText": "We recently purchased an electric coffee grinder but the coffee beans were ground fine even though its set to course. Unlike the manual grinders, we got a better control on the consistency of the grind and can re-adjust it when needed. And its also a great exercise in the morning!lol and its rewarding to have a freshly grind, freshly brewed coffee ;)"
        },
        {
            "reviewerName": "Sylvia Perez",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Great grinder",
            "reviewDate": "October 29, 2019",
            "reviewText": "Great coffee grinder. I used to have the Hario one and definitely loved it but I lost the handle, so decided to try a different brand and I dont regret it.\nWorks as good as the Hario one and even comes with another vase to store the grinder coffee, I also liked that the vase is made out of glass. Is not heavy and easy to carry."
        },
        {
            "reviewerName": "ItsHank",
            "rating": "1.0 out of 5 stars",
            "reviewTitle": "Not good experience",
            "reviewDate": "October 25, 2019",
            "reviewText": "It broke after a month in. It jammed then the bolt which secures to lever just wore out from the continuous motion"
        },
        {
            "reviewerName": "Travis",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Works great!",
            "reviewDate": "October 8, 2019",
            "reviewText": "This coffee grinder is fantastic!!!\nIt grinds the beans to the perfect consistency and is super easy to use.\nI had some questions and the customer service was prompt and helpful."
        },
        {
            "reviewerName": "A. Freitas",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Super easy to use!",
            "reviewDate": "November 8, 2019",
            "reviewText": "This product is super easy to use right from the box. There's a clear diagram in the package that shows all the parts, and they even supply a link to a video to show you exactly how to use it. I filled the reservoir with coffee beans and it took just over a minute of grinding to get a medium grind. I'm really excited about my coffee in the morning! Not as fast as an electric grinder but better control on the grind coarseness. Great product!"
        },
        {
            "reviewerName": "Joseph C.",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "grinds coffee well & its good for espresso!",
            "reviewDate": "November 2, 2019",
            "reviewText": "sturdy compartment and easy to use. pretty easy to clean and it came in nice packaging. Ive used it for making espresso and it does the job. edit: I dropped it and it didnt break or really scratch. pretty good quality!"
        },
        {
            "reviewerName": "TRACY DIAZ",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "COFFEE!!!!!",
            "reviewDate": "November 9, 2019",
            "reviewText": "Love this grinder! Its great for small batches, I like several different brand of whole bean coffee. I like to blend and grind coffee for fresh batches for each pot I'm making."
        },
        {
            "reviewerName": "Shey Burns",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Great coffee grinder!",
            "reviewDate": "August 28, 2019",
            "reviewText": "Great coffee grinder! I like that its glass so I can see how much Im grinding! It grinds the beans pretty fine so no big chunks are left. Theres also an extra container so thats nice!"
        },
        {
            "reviewerName": "Susie Q",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Works great at home and for travel",
            "reviewDate": "September 30, 2019",
            "reviewText": "I love fresh ground coffee and this manual grinder works well for always having fresh ground coffee at home and for travel. It comes with 2 jars so I can keep the beans in one and use the other for my fresh ground coffee even while camping. It works great and is easy to clean."
        },
        {
            "reviewerName": "jacob myers",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Works for coarse grind",
            "reviewDate": "November 8, 2019",
            "reviewText": "I needed a grinder\nTo make coarse beans as my electric makes them too fine. This works perfect for my French press"
        },
        {
            "reviewerName": "Caterina Koon",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Easy to use",
            "reviewDate": "September 30, 2019",
            "reviewText": "Works great. Used it to grind my coffee beans for iced coffee."
        },
        {
            "reviewerName": "william",
            "rating": "4.0 out of 5 stars",
            "reviewTitle": "Nice product",
            "reviewDate": "November 6, 2019",
            "reviewText": "I love it"
        },
        {
            "reviewerName": "Angel Gerdzhikov",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Great quality, well-built grinder!",
            "reviewDate": "October 1, 2019",
            "reviewText": "Great grinder, comes with extra jar and a lid. Well made, great quality. Handle slides on nicely, has a solid lid that stays on."
        },
        {
            "reviewerName": "Mehran Sedaghatpour",
            "rating": "2.0 out of 5 stars",
            "reviewTitle": "Unstable dial",
            "reviewDate": "November 2, 2019",
            "reviewText": "The dial turns our of place with continued use resulting in a grind that is coarser than desired"
        },
        {
            "reviewerName": "fred",
            "rating": "3.0 out of 5 stars",
            "reviewTitle": "Works as expected for the price",
            "reviewDate": "November 8, 2019",
            "reviewText": "Worked fine the first time but then it wouldnt stay adjusted right. I had to keep readjusting it to grind down to the size I wanted, I dont use it anymore"
        },
        {
            "reviewerName": "Sean Mo",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "its grinding performance satisfied me",
            "reviewDate": "August 21, 2019",
            "reviewText": "Using this manual coffee grinder for about a week, I'd like to share its pros and cons for its considerate customer service. I purchased many items at Amazon, but this is the most considerate seller I ever met.\n\nPros:\n-With 2 glass jars, 5.5oz each, helping me to store amount of coffee beans or ground coffee for short time, convenient to carry for outdoor activity.\n-The coarseness can be adjusted from coarse to fine, I did a test grind to see the current grinding setting, then adjusted and adjusted till my desired grind setting, suitable for both French Press and Espresso.\n-10-12g whole beans each time is advised, especially when you want finer grind, I tryed Ibrik, Turkish Grind, amazing flavor.\n-All parts is washable, I used a very soft brush to clean the silicone lid, ceramic burr, and other precise component, as advertised, they were cleaned throughly, and works well again after drying.\n-Considerate customer service. The manual grinder comes with a useful instruction, marking each part specificly, explaining specific disassembling and cleaning steps, practical operation tips, attaching advised brewing methods for different grind. I ground according to this instruction step by step, and finally brewed the coffee I want.\n\nCons:\n-The grinding process is slow, it takes about 2 minites to grind a cup of French Press (12-15g), and 3-5 minites to get 2 shot of Espresso, somewhat of elbow grease.\n-The handle is somewhat loose, you may feel it's of poor quality for first use, but it does not affect its working.\n\nIt's been the grinder I want so far, I like the 2 portable jars most, and its grinding performance satisfied me."
        },
        {
            "reviewerName": "Nathan Kim",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Simple to use",
            "reviewDate": "September 12, 2019",
            "reviewText": "I wanted to make coffee myself in classic way. I choose this because it comes with 2 jars. Setup was very easy. Both jars seems to be easy to clean. I bought fresh coffee and tried grinding. It was easy to grind. Cheap but quality is much better than expected."
        },
        {
            "reviewerName": "Anthony",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "High quality coffee grinder. Not sure what makes one better than another though.",
            "reviewDate": "August 30, 2019",
            "reviewText": "I'm not a coffee aficionado so I'm not sure what the difference between this and an expensive grinder. But I had a hand grinder at the office which I grew to love so I wanted an inexpensive one for home. This one looked fantastic, especially since it came with an extra jar/lid so I can grind some and save for later. The handle is large and easy to use. I think those are the only comments about a coffee grinder one can make.\n\nGrind sizes really do make a difference in the flavor in my kurig. There are few settings but I've found the medium/fine setting works best for me. I figure the larger grinds are for more french press styles that have longer brew times.\n\nOverall very happy. Easy to grind, and the difference between pre-ground, coffee pods, and fresh ground is amazing!"
        },
        {
            "reviewerName": "Kindle Customer",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Perfect for a single person",
            "reviewDate": "October 2, 2019",
            "reviewText": "I'd never ground my own coffeee before, but I accidentally bought beans instead of ground at the grocery store so figured I'd go ahead and try . I had to look for a grinder of course and was surprised by how expensive they can be. I went with this one as it was cheap and had decent reviews. Turns out I made a good choice. This is perfect for my needs. It takes about a minute to grind what I need and it's very sturdy so I don't feel like it will break anytime soon. I think if you need to grind for a lot more people though, this may not be the best choice. However, a really good choice if you're just looking for 1 or 2 cups and don't feel the need to spend a fortune on it."
        },
        {
            "reviewerName": "Satyajit Ghosh",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Tidy neat coffee/spice grinder",
            "reviewDate": "September 19, 2019",
            "reviewText": "Great coffee - even with the relatively inexpensive \"poor man's blend\" beans - Coffee Bean Direct Poor Man's Blend, Whole Bean Coffee, 5-Pound Bag - and I enjoy the process of grinding it up this way.\n\nMy friend had vetoed whole-bean coffee because of the price - but the cheap beans from Amazon convinced him to give it a try, and he loves the result too. The ceramic heads really make a difference, but love the end product, and when I tried using the electric coffee grinder I normally use to grind up flax seeds, the coffee came out somewhat bitter, we thought. But with this one I can make fine or coarse whatever I like."
        },
        {
            "reviewerName": "Michelle",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Grinds perfectly and doesn't wake my kids!!",
            "reviewDate": "September 20, 2019",
            "reviewText": "I like to enjoy a morning cup of coffee to myself while the house is quiet. 3 of my children have bedrooms off the kitchen and they are light sleepers. With this manual grinder I am able to enjoy fresh beans each morning without disturbing anyone. My coffee tastes great and it doesn't take much time at all to ground them."
        },
        {
            "reviewerName": "Mrs Raven",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Easy to Use and Good Performance",
            "reviewDate": "October 30, 2019",
            "reviewText": "So I have had this for a while and like it very much. I have a large moka pot and it takes me about 7-10 minutes to grind the amount of beans needed. That's about filling the top of the grinder twice, but the result is a dry velvety grind that makes excellent espresso. I have to experiment with the grind a bit. It would grind down to a turkish coffee grind if needed. The top has vanes in it to keep the coffee beans in place so every turn is effective. It is not hard to grind, but finer grinds will take longer. The \"bumper\" on the bottom keeps it in place doing grinding and I have never had the handle come off while grinding....just make sure it is well-seated before starting. You do have to hold it during grinding, of course; I have small hands and the diameter allows me to hold it securely. I noticed that my hand would get tired, but I found I could hold it with less force...I was basically working like I was trying to wrestle a wooly mammoth. So there is a learning curve, but really, just let it do the work of grinding. I am very happy with my purchase."
        },
        {
            "reviewerName": "Leila Ellerbe",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Grinds beans easily",
            "reviewDate": "September 21, 2019",
            "reviewText": "This grinder was easy to put together and grinds the beans easily. Being able to take it apart also saves space when not in use. I like that I can get course ground coffee from it since that's what we use for our French press. The containers hold enough coffee grounds to make several pots."
        },
        {
            "reviewerName": "Andre",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Works very well! I'm pleased with it",
            "reviewDate": "September 26, 2019",
            "reviewText": "Exactly what I was looking for! Works great for what I'm using it for. Also comes with 2 coffee \"containers\" which is nice. I can grind some extra and then if I want a different blend I can grind that in a different container."
        },
        {
            "reviewerName": "Level3backpack",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Well packaged with good instructions",
            "reviewDate": "October 5, 2019",
            "reviewText": "I've bought many manual coffee grinders but this one was the most well packaged. My third mill even shipped without foam board and there was a crack on the plastic handle. This one was well secured and came whole. The grinder's box had instructions for the perfect grind. The manual contains a lot of information about how to brew a cup of coffee. It illustrates each part of the mill clearly, so that I can assemble and disassemble it with ease. In addition, I sent an email to the one listed in the instructions and was provided a link to a video."
        },
        {
            "reviewerName": "A. grainger",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "just the job",
            "reviewDate": "October 5, 2019",
            "reviewText": "This is exactly the level of quality I was seeking in a manual coffee grinder. Quality design, craftsmanship, and materials. The cranking requires minimal effort and thanks to the silicone base it feels secure during operation. I have found the exact perfect grind-size for my French press. I plan on taking my new grinder to Thanksgiving dinner and helping with making holiday cappuccinos. I recommend this quality grinder to anyone who enjoys the freshest cup of coffee possible. Thank you for providing such a quality product."
        },
        {
            "reviewerName": "DD",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Easy to use",
            "reviewDate": "August 27, 2019",
            "reviewText": "Brought this on our weekend camping trip it was nice to be able to have fresh ground coffee in the morning. It was easy to use the coffee beans grounded with little effort and didnt take very long."
        },
        {
            "reviewerName": "Jasper Chan",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Works good for a manual coffee grinder. Easy to use.",
            "reviewDate": "November 3, 2019",
            "reviewText": "Works pretty well for a manual coffee grinder. Comes with two lower section glass containers, one with lid. Can adjust the quality of the grind by twisting the knob located under the upper section grinder. Interior of the upper section grinder is hard plastic but works well. For very fine grounds, I grind the same beans twice. Works pretty good for a manual coffee grinder."
        },
        {
            "reviewerName": "linda mclain",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Manual coffee grinder",
            "reviewDate": "November 12, 2019",
            "reviewText": "For a small grinder it does a great job on coffee beans. I use it to course grind beans for cold brew coffee. The only problem is cleaning the grinder. It seems to leave residue even after soaking it . Other wise, I like it and would buy the same grinder again if this one wears out. Also the 2 glass containers that are included are great for storing extra coffee. They are air tight and he coffee stays fresh."
        },
        {
            "reviewerName": "Trav",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Awesome coffee grinder",
            "reviewDate": "October 4, 2019",
            "reviewText": "Excellent coffee grinder. You Can adjust how fine you want it to be. I am just getting into buying whole bean coffee. I have always bought it already ground. Thought I would give whole bean a try and grind myself. This grinder does and excellent job. Company went above and beyond to make sure I was satisfied. Would definitely reccomend, if your looking for a grinder."
        },
        {
            "reviewerName": "Norm Deplume",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "A great manual grinder that gives consistent results!",
            "reviewDate": "November 10, 2019",
            "reviewText": "I previously bought an electric grinder that used a blade to chop rather than grinding the coffee. I was not able to get the consistent grounds with it, however. This little grinder goes exactly what I was looking for. It is adjustable to get the grind that you want, and it gives consistent results. All at a great price. I would recommend it!"
        },
        {
            "reviewerName": "Dale R",
            "rating": "4.0 out of 5 stars",
            "reviewTitle": "Add a nut for a perfect grinder.",
            "reviewDate": "November 4, 2019",
            "reviewText": "I had to add a metal hex nut to the unit to hold the nylon one in place. Without it the original one gradually loosens so that although you can get a fine grind to begin with, but as the nut loosens the grind becomes very coarse. That aside, I like the grinder very much. It fits well in the hand and once you get used to it, alternating hands to alleviate stress on the wrists is no problem. In fact, it's a great workout!"
        },
        {
            "reviewerName": "Francis Chau",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Smooth operation, perfect grind!",
            "reviewDate": "November 6, 2019",
            "reviewText": "Awesome grinder!\nInterchangeable glass chambers.\nSmooth operation.\nCan set the grind to the desired fineness/courseness.\n\nI like the manual grinding and adjustment levels. Being able to see the grind is great without having having to take apart."
        },
        {
            "reviewerName": "Vince&Alyssa",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Best grinder!",
            "reviewDate": "November 2, 2019",
            "reviewText": "This manual coffee grinder is fabulous so much easier to buy your coffee and bring it home then have to wait in the grocery store for an employee to yet you use their grinder you get to do it yourself in the comfort of your own home! i totally recommend this!"
        },
        {
            "reviewerName": "Rosita0222",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Durable and convenient manual grinder",
            "reviewDate": "October 13, 2019",
            "reviewText": "This coffee grinder does the trick. I love how handy it is. It grinds your coffee at different thicknesses. It even has an extra storage container to store your freshly grinded coffee. It comes part very easily to clean. Its made of a good durable material."
        },
        {
            "reviewerName": "DDD",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "A Great Coffee Grinder And No Mess To Clean Up!",
            "reviewDate": "November 2, 2019",
            "reviewText": "I ditched my electric grinder because of the mess it left all over the place. This hand grinder is just perfect! Grinds beans for all types of coffee. And no mess whatsoever. Plus it comes with an extra ground holder. Simply perfect!"
        },
        {
            "reviewerName": "jeanette",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Good purchase",
            "reviewDate": "October 14, 2019",
            "reviewText": "So far so good. Didnt arrive broken and hasn't broken on me since."
        },
        {
            "reviewerName": "Ramon Chavez",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Small but very useful.",
            "reviewDate": "November 8, 2019",
            "reviewText": "Very useful and very useful and serves to grind more than coffee."
        },
        {
            "reviewerName": "VMCozzi",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Nice to use",
            "reviewDate": "September 25, 2019",
            "reviewText": "Great kitchen tool. Use this as a source grinder and it's great!"
        },
        {
            "reviewerName": "Amazon Customer",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Perfect!",
            "reviewDate": "October 21, 2019",
            "reviewText": "I love this easy to use aswell as its a great size"
        },
        {
            "reviewerName": "mmj",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Nice grinder",
            "reviewDate": "October 2, 2019",
            "reviewText": "It's a nice grinder. I like that it has two jars to hold ground coffee."
        },
        {
            "reviewerName": "EC",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Perfect on the go and with aero press",
            "reviewDate": "October 14, 2019",
            "reviewText": "I am a fan of aero press and with this 5.5oz coffee grinder, works perfectly together! It's simple to operate and comes with two glass jars which works very well for me."
        }
    ],
    "title": "Manual Coffee Grinder, Hand coffee grinder mill with Ceramic Burrs, Two Clear Glass Jars 5.5 oz Each, Stainless Steel Handle,Suitable for Camping and Home Use",
    "manufacturer": "TRIPLE TREE",
    "currentPrice": false,
    "rating": "4.4 out of 5 stars",
    "totalRatings": "45 ratings",
    "features": [
        "\n         Make sure this fits\n                by entering your model number.\n        \n",
        "FINE OR COARSE GROUND COFFEE GETTING---With adjustable nut control, the manual coffee grinder can help you to get fine or coarse coffee powder, so that you can enjoy Espresso or French Press easily, convenient to control",
        "TWO 5.5 oz ClEAR GLASS JARS---The manual coffee grinder comes with two 5.5 oz clear glass jars, which could hold fresh ground coffee or beans during traveling or camping, convenient to carry, also act well as decorating containers",
        "EFFORT SAVING---With lengthening handle, the manual coffee grinder could save your effort when grinding beans. Though it is still slow, it is faster than other manual grinders, comfortable to enjoy the funny process of beans grinding",
        "ORIGINAL COFFEE FLAVOR MAINTAINING---Durable ceramic burr will not add heat during grinding, and will not damage the original flavor of coffee, better to grind beans before you brew coffee, best choice for coffee lovers",
        "EASY TO CLEAN---The coffee mill, removable handle and lid disassembled easily, all parts of the manual coffee grinder is washable, easy to clean thoroughly to make coffee of better scent next time"
    ],
    "reviewsAspects": [
        "coffee grinder",
        "easy to use",
        "french press",
        "whole bean",
        "fresh ground",
        "manual coffee",
        "grinds the beans",
        "works well",
        "link to a video",
        "ground coffee",
        "manual coffee grinder",
        "grinder it does a great",
        "coffee beans",
        "great coffee",
        "works great",
        "electric grinder",
        "easy to clean",
        "cup of coffee",
        "bean coffee",
        "grinder comes"
    ],
    "qAndA": [
        {
            "question": "Can i use this to grind spices?",
            "answer": "Hi~Nice day! Of course you can use the grinder to grind spice, some customers did that, and they said it works well, though it is a manual coffee grinder~Hope this could help you, and thank you for your support"
        },
        {
            "question": "I bought another brand and it took 10 minutes to get enough fine-grind for 1 espresso pull. Same with this one?",
            "answer": "It takes me about 2 minutes, but I guess that all depends on how fast you crank!"
        },
        {
            "question": "What is difference between first and second generation?",
            "answer": "Answer not available"
        },
        {
            "question": "Is it easy to clean?",
            "answer": "Answer not available"
        },
        {
            "question": "How many grams does this make in one go?",
            "answer": "Not sure about grama but usually able ro makwe 1-2 pots of coffee from the grounds"
        },
        {
            "question": "Where is this manufactured?",
            "answer": "China. Its a very well made unit and seems to grind coffee beans consistently. I am satisfied with it."
        },
        {
            "question": "Does this have lids for both jars?",
            "answer": "Hello - I received one lid."
        },
        {
            "question": "Can you purchase extra burrs for this grinder?",
            "answer": "I think you can. But if you follow the instruction and do not over tighten they should last you more then long enough for the price of this unit. The instructions were not very good at all, but this is not a complicated item at all, just remember how to take it apart for cleaning and putting it back together and all t see more"
        },
        {
            "question": "What materials make up the components of this product and where is it manufactured?",
            "answer": "glass, rubber, and hard plastic."
        },
        {
            "question": "The part holding the beans (the cone) appears to be made of plastic, is it?",
            "answer": "Yes. Seems pretty strong though."
        },
        {
            "question": "How many turns in 18gm of espresso ground?",
            "answer": "Hi,Nice day!It needs about 100-120 turns to get 18g of espresso ground. Hope this could help you, and thank you for your support!"
        }
    ]
}