{
    "productInformation": [
        {
            "Package Dimensions": "8 x 4.1 x 4 inches"
        },
        {
            "Item Weight": "1.5 pounds"
        },
        {
            "Shipping Weight": "1.5 pounds (View shipping rates and policies)"
        },
        {
            "ASIN": "B07V365CMQ"
        },
        {
            "Customer Reviews": "4.9 out of 5 stars\n    56 ratings\n4.9 out of 5 stars"
        },
        {
            "Best Sellers Rank": "#26,306 in Kitchen & Dining (See Top 100 in Kitchen & Dining)\n#31 in Electric Coffee Blade Grinders\n"
        },
        {
            "Date first listed on Amazon": "July 9, 2019"
        }
    ],
    "productDescription": [],
    "reviews": [
        {
            "reviewerName": "elly",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Perfect serving size",
            "reviewDate": "October 22, 2019",
            "reviewText": "I have never had a coffee grinder before but I accidentally bought whole bean coffee at the grocery store and figured it would be a good time to try. I wanted something small that didnt take up too much room and didnt take too many beans as Im lazy at measuring (esp at 5am)\n\nThe grinder holds enough beans for approx six cups of coffee or in my case 1 big cup, the blade spans the whole floor of the grinder which means the beans have a more even grind. There is a safety in place and the grinder wont turn on if the lid isnt securely in place, thats a benefit for anyone who has kids or anyone who like me can be very clumsy first thing in the morning, there isnt a coarseness setting but the lid is see-thru so the longer you grind the finer the beans get.\n\nI never knew how good fresh ground coffee tastes, it even smells more coffeee, I think this lil device is going to get a lot of use."
        },
        {
            "reviewerName": "Holly Poteat",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Very simple to use",
            "reviewDate": "October 19, 2019",
            "reviewText": "To me, there is nothing better than a pot of coffee made with freshly ground beans. This coffee grinder allows me to have it whenever I want - each time I brew a pot of coffee if I want! It is very simple to use - simply put the beans inside, put the top on, then hold the button and it quickly grounds your coffee beans. Afterwards, its very easy to clean for your next use. I really like how small it is - so it sits on my counter for when I need it next without taking up much space. I really appreciate that you can ground a decent amount at once, or enough for one cup if you have a reusable single brew cup."
        },
        {
            "reviewerName": "Amy S.",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Not only a great coffee grinder, but it makes perfect almond flour too!",
            "reviewDate": "October 20, 2019",
            "reviewText": "I have been looking for something for quite some time to make my own almond flour. I tried using my food processor and blender, but it wasn't giving me the almond flour texture I needed to bake macarons. Someone suggested I try using a coffee grinder, so I bought this one based on the 5 star reviews. I am so glad I bought this one because it really is top notch! It is really easy to use...all I have to do is fill the grinder with just enough almonds to cover the blade. Then just press and hold the start button, and release it when you get the texture you are looking for. So easy...and best of all, so easy to clean! I simply throw in some raw rice and blend it to clean out the grinder with brush that is included. Of course it also grinds coffee beans...but I will be using mine primarily to make my own nut flour. Great product!"
        },
        {
            "reviewerName": "HookedonAmazon",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Makes a nice little grinder for nuts too!",
            "reviewDate": "November 3, 2019",
            "reviewText": "Purchased this coffee grinder because my other one broke down. I never thought of using it to chop things other than coffee, but thought I would try chopping some nuts for some cookies I was baking. It worked great!\nMy last one was so hard to clean on the inside, but this one seems a little easier to get coffee out of the cracks when cleaning because of the curve design in the bottom. I just use a soapy rag and wipe it out. The lid is dishwasher safe which is really nice. Inside the grinder is stainless steel. Feels heavy for small grinder. Just push down on the silver button on the side of the lid to start grinding process.\nIt does come with a instruction booklet and 2 year warranty. Nice little unit and lower priced than my last one."
        },
        {
            "reviewerName": "Amazon4Me",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Compact and efficient",
            "reviewDate": "October 19, 2019",
            "reviewText": "I use the grinder for seeds. Mostly flax seed. I have been very pleased with this product. I put it to use right away out of the box. I grind seeds about every three days and it will take them to power if you desire. I find it easy to empty and clean. If you are looking for a small grinder that tucks away well in a small area and grinds like a champ then you would do well to consider this one"
        },
        {
            "reviewerName": "Lesh",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Use It For Flax",
            "reviewDate": "October 24, 2019",
            "reviewText": "I do not use this for coffee. I use it mainly for my flax seed. It is easy to use (better than my old one where my son broke it) and added easy to clean. I just use a dish towel and swipe the inside out and bam.. its really for the next time.\nGreat value for the price and if you are like me that needs something for herbs or flax. This little machine does the job."
        },
        {
            "reviewerName": "Thao",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Does exactly what I want!",
            "reviewDate": "August 5, 2019",
            "reviewText": "I really like this grinder. I use it to grind walnuts for my children. It doesn't need to be grinded for a long time, and it is very fine. I always buy things on Amazon. This grinder is the best product I bought. I will continue to buy."
        },
        {
            "reviewerName": "Qualls",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Grinds quickly",
            "reviewDate": "October 24, 2019",
            "reviewText": "I love this little coffee grinder. I dont drink anything but whole Bean coffee. I like my coffee to be ground very fine. I grind a whole bunch at once and fill my canister up that way I dont have to worry about grinding for a quite a while. This does the trick and the container in which it grinds in is a pretty decent size. It doesnt take a lot of room up in my cupboard which is what I prefer. It grinds the beans very quickly."
        },
        {
            "reviewerName": "Emo",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Easy to use",
            "reviewDate": "October 18, 2019",
            "reviewText": "We like to grind our own spices at our house and this grinder does that chore quickly. I found I can even powder sugar with the power of the grinder. Most spices rinse out easily with a spray of the faucet but sometimes its difficult to reach a cloth in by the blade to get peppers out. Easy to use by plugging in and aligning the cover then pressing the button on the right side of the cover to pulse or hold to whiz it around."
        },
        {
            "reviewerName": "Amazonaholic",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Great product!",
            "reviewDate": "October 25, 2019",
            "reviewText": "A great product. I was looking for something that looked nice and also functioned well! We are coffee lovers in my house and having fresh ground coffee is like a little slice of heaven! It can also be used for nuts, beans, spices...\nThis product is fabulous and does its job well. I love that the top is dishwasher safe and it only takes minute."
        },
        {
            "reviewerName": "Joby",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "A good little grinder",
            "reviewDate": "August 15, 2019",
            "reviewText": "I recently got into coffee brewing. This is a nice grinder to get beans grinded quickly and easily. I bought a manual Burr grinder which is awesome, but this is so good to use when in w hurry."
        },
        {
            "reviewerName": "Yasmeen",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Grind your beans until they squeak",
            "reviewDate": "August 6, 2019",
            "reviewText": "Sorry, this video is unsupported on this browser.\nVery good work, exquisite appearance and powerful motor, I am very happy every time I use this grinder, because you don't need too much time, you can finish the work in ten seconds, I don't have to worry about cleaning. Removable grinding bowl is the best design."
        },
        {
            "reviewerName": "Dana Rios",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Easy to use",
            "reviewDate": "October 27, 2019",
            "reviewText": "This coffee grinder is really easy to use. Put the coffee beans in and push the lid down. It grinds the bens fast and nice and fine. Cleaning is easy as well."
        },
        {
            "reviewerName": "Martha Lee Head",
            "rating": "3.0 out of 5 stars",
            "reviewTitle": "Depends on what you want from your coffee.",
            "reviewDate": "September 10, 2019",
            "reviewText": "Should have bought the manual burr grinder. This blade grinder isn't bad, it does grind but for people who are serious about their coffee, it isn't recommended."
        },
        {
            "reviewerName": "trina phillips",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Perfect for more then just grounding coffee.",
            "reviewDate": "October 23, 2019",
            "reviewText": "This product is perfect for more then just coffee. Its space saving and has a good strong motor. I like that it's easy to clean and doesnt make things messy."
        },
        {
            "reviewerName": "Cynthia Osuna",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Great grinder for more than just coffee beans",
            "reviewDate": "October 26, 2019",
            "reviewText": "I am happy I bought this. Its easy to clean and very simple to use. My teens will even use it to ground almonds to put in their protein shakes. It works very well for coffee and nuts. Its not very big so having it stay on my counter is a big plus for us as we are always on the go and like things at hand. Its big enough to grind beans for a full pot of coffee. I would recommend this grinder and I was happy with the price!"
        },
        {
            "reviewerName": "LinCal",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Grinds Coffee Well",
            "reviewDate": "October 19, 2019",
            "reviewText": "This grinder is perfect for grinding coffee beans! It grinds it pretty quickly and easily. Cleaning it is easy as well!"
        },
        {
            "reviewerName": "Janie Bright",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Great product for the price",
            "reviewDate": "October 20, 2019",
            "reviewText": "Great product allows you to adjust the course ness of the coffee. Will purchase more for gifts ?? !! Definitely recommend great product for the price."
        },
        {
            "reviewerName": "Ira",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Great product.",
            "reviewDate": "October 19, 2019",
            "reviewText": "This grinder is the best product I bought. Arrived very quickly.\nThis is a nice grinder to get walnuts, coffee grinded quickly and easily.It works as a normal blender. Very easy to clean. Great price."
        },
        {
            "reviewerName": "Aaron",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "5.0 out of 5 starsDoes exactly what I want",
            "reviewDate": "August 6, 2019",
            "reviewText": "Useful tool. Thank this you can have freshly ground coffee every day. It definitely does not taste the same. It is much better fresh every morning. It actually works as a normal blender. You can ground and blend any solid food really but I would prefer to use it only for coffee. Last but not least, whole coffee beans are cheaper, so you can save you money on the coffee."
        },
        {
            "reviewerName": "Sunil Patel",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Excellent for my herbs",
            "reviewDate": "August 12, 2019",
            "reviewText": "This little coffee grinder is absolutely gorgeous looking, it is very sturdy when in grinding. I grinder my herbs and spices as well and they came out so good and very easy to clean, less making noise."
        },
        {
            "reviewerName": "Lori",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Quick & Powerful Coffee Grinder",
            "reviewDate": "October 11, 2019",
            "reviewText": "Im impressed with this coffee grinder! It ground my coffee beans quickly and efficiently to the texture i like. It holds a good amount of beans. The stainless steel blades are sharp and the grinder cleans up easily."
        },
        {
            "reviewerName": "Coco",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Coffee helper",
            "reviewDate": "August 31, 2019",
            "reviewText": "I bought them as a replacement for the previous mill, which was in operation for 30 years and has not survived a fall on the kitchen tiles. I only use them to chop fresh spices, which works well, so far no weak points recognizable. If she lasts half as long as the old mill, I am satisfied."
        },
        {
            "reviewerName": "BetsyB",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Great product",
            "reviewDate": "August 15, 2019",
            "reviewText": "Nice and small. Grinds coffee well."
        },
        {
            "reviewerName": "MP",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Works great",
            "reviewDate": "August 18, 2019",
            "reviewText": "Works great and compact. I use it at work for fresh coffee and works wonderfully."
        },
        {
            "reviewerName": "MICK",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "My spice grinder!",
            "reviewDate": "August 9, 2019",
            "reviewText": "Arrived very quickly. Attractive, quality little coffee grinder which is sturdily built. Not as noisy as some I have used before. I use it to grind my seeds every morning and nuts when needed. Glad to recommend this quality grinder. Not a bad price either."
        },
        {
            "reviewerName": "Yuanyuan",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Nice device to make mixed spice powder.",
            "reviewDate": "August 16, 2019",
            "reviewText": "I used it once since I got it. So far so good. Perfect to make mixed spice powder. Noise is acceptable and the device is small so I can put it in the corner of my table."
        },
        {
            "reviewerName": "Amazon Customer",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "No cuts while cleaning",
            "reviewDate": "September 25, 2019",
            "reviewText": "I love how roomy this grinder is. Also it is super easy to clean. No cuts while cleaning. :)"
        },
        {
            "reviewerName": "Lynch",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "pretty good",
            "reviewDate": "August 25, 2019",
            "reviewText": "Very sharp blades, within a short time everything was crushed. I'm curious to try the mill with coffee beans. Top, great value for money!"
        },
        {
            "reviewerName": "Darilyne Tingle",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Nice",
            "reviewDate": "October 18, 2019",
            "reviewText": "Small, easy to use."
        },
        {
            "reviewerName": "Kate Gookin",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Not just for coffee! Oh so much more!",
            "reviewDate": "October 25, 2019",
            "reviewText": "My daughter is newly addicted to coffee and bid on a coffee basket at an auction. Not knowing the coffee was full beans, we began to research coffee grinders. We decided on this one and have been quite pleased.\n\nWe've learned that we can customize our texture of the grind based on how long you press. (Daughter and I have different preferences. )\n\nI have found many other uses for the coffee grinder as well. I've used it to make breadcrumbs, powdered sugar, almond flour, and graham cracker crust. My daughter has used it to make ice cream mix ins (skittles, toffee, peppermints, and red hots).\n\nWe are pleased that we can do so much with this and that it is so easy to clean."
        },
        {
            "reviewerName": "AMAZONCUSTOMER",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Perfect Keurig accessory",
            "reviewDate": "October 13, 2019",
            "reviewText": "Im tired of spending so much money on kcups and i really enjoy fresh ground coffee. I love this is plug and play. Plug it in, load your beans push the button on top to grind (nice uniform grounds too), filll a reusable kcup strainer and brew. Store your whole beans in the freezer to keep fresh longer. Only down fall is its electric only I wish it had a battery option for camping or hotel fresh coffee in my room. The department you put your beans in is plastic and it states not to wash with water. Comes with a little brush to wipe out the grounds which is effective . Overall does what i need it to."
        },
        {
            "reviewerName": "Wilber Home",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Powerful and fast!",
            "reviewDate": "October 19, 2019",
            "reviewText": "It is fall and for me that means hot drinks and my favorite is coffee... I recently got rid of my single serve brewer and am now back to buying bag coffees. This grinder is perfect because it gives you the freshest tasting coffee when you grind in small batches for each pot. The grinder is a nice sleek black with silver accents. It quickly grinds coffee so the minimal noise it makes passes without bothering anyone in my household. I definitely think the fresh ground coffee tastes better than pre-ground which goes stale quicker."
        },
        {
            "reviewerName": "Farmer Sue",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "More than a coffee grinder.",
            "reviewDate": "October 27, 2019",
            "reviewText": "The Sweet Alive Electric Coffee Grinder is also good for grinding my fresh right out of the garden herbs, for cutting up green peppers and celery, and just about all other things that need to be ground or chopped up. Including Nuts! I bought it for fresh coffee. To grind my own beans - to smell and taste the total freshness in each cup. It does that in a great way too! Adjust the coarse vs fine grind by how long you hold the button down. Simple!"
        },
        {
            "reviewerName": "Miranda S.",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Works great and easy to clean",
            "reviewDate": "October 31, 2019",
            "reviewText": "This is such a great item to have at home! I usually buy whole bean coffee and grind the whole bag at the store, but I sometimes forget to grind it there since the grinder is located in a different area. Ive had to return to the store to grind it, but no more with this great at home grinder! Its small enough to easily store in my cabinet and works well. It is easy to use and clean up is a breeze. I would definitely recommend."
        },
        {
            "reviewerName": "Tam Stephens",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Grind me up!",
            "reviewDate": "October 20, 2019",
            "reviewText": "Does anything truly smell better than fresh ground coffee? I will answer that and that is a big fat no. I absolutely adore this coffee grinder because it easily grinds coffee and makes my house smell like a little piece of heaven! I found it to be easy to clean. Even my middle Schooler can get it really clean which is unreal. The grinder perfectly grinds up my coffee to a fine grind, which is my preference."
        },
        {
            "reviewerName": "Furkat Tad",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Roomy and silent",
            "reviewDate": "October 19, 2019",
            "reviewText": "Much better then my previous grinder. This one is roomier, silent, and the lid is thicker. My old grinder's lid is all cracked, I hope this one won't. I was using the same grinder for both grinding my coffee and spices and the flavor was mixing up so I wanted another one to make it separate. Glad I gave this one a try. Thumbs up, it's perfect."
        },
        {
            "reviewerName": "Milette",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Space saving coffee bean grinder",
            "reviewDate": "November 1, 2019",
            "reviewText": "Affordable and efficient coffee grinder. This is coffee grinder works so well, I love it! I have attached a video to show the fill capacity of this grinder, as well as speed and just how it works overall. Very nice and small/space saving. Cute too if you want to leave it out on your counter."
        },
        {
            "reviewerName": "thewoodrabbit",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Perfect for grinding all kinds of different foods",
            "reviewDate": "October 15, 2019",
            "reviewText": "I use this for just about everything you can think of that is dry and needs to be ground down. The best is for nuts that go into pie topping or cookies so they are easier to chew preventing chocking by little ones that eat them. It's nice for coffee too as it comes out fresh and can be adjusted how coarse it is by the time ground."
        },
        {
            "reviewerName": "Pebblesalb6",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Strong and pwerful, grinds in seconds. Quiet motor. Counter size.",
            "reviewDate": "October 22, 2019",
            "reviewText": "This is a good strong grinder. So easy to use, just put coffee beans in, close lid and press button. You can gring other things like nuts, spices, beans. I grind nuts for nut flour and it works fantastic. Its very quiet too yet powerful. Easy to clean, comes with a small brush. Its the perfect size to sit on counter."
        },
        {
            "reviewerName": "MRSCEURE",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Grounds nicely and evenly",
            "reviewDate": "October 25, 2019",
            "reviewText": "A nice coffee grinder with so many options. I use it to grind coffee and it's also great to grind spices also. The finished grounds come out nice and uniform. I like it because it doesnt over grind and isn't loud. I found it really easy to clean and looks nice in my kitchen."
        },
        {
            "reviewerName": "Natknows",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Handy, compact easy to use",
            "reviewDate": "October 25, 2019",
            "reviewText": "This is a handy compact grinder. It is easy to use and dont take up alot of room. It cleans easily. I use this to grind coffee beans, nuts, wheat, and anything I need ground. It works great to grind my grand babies food, makes the perfect texture for them."
        },
        {
            "reviewerName": "Angela Palmer",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Beautiful and highly functional grinder at a great price!",
            "reviewDate": "October 17, 2019",
            "reviewText": "I love this grinder! I use this for our Jamaican Blue coffee and it is sooo good freshly ground! This machine is very sleek and nice looking I leave it on my counter next to my coffee machine! I am going to try it for grinding nuts and fresh herbs as well!"
        },
        {
            "reviewerName": "Janice",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Great for grinding more than just coffee beans!",
            "reviewDate": "October 6, 2019",
            "reviewText": "Grind my coffee, yes does a great job no matter what course blend Im looking to do. But this is my first time grinding and blending herbs. This sure beats the way I was doing it for sure, hand muddling."
        },
        {
            "reviewerName": "Donna G",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Strong and Quick",
            "reviewDate": "September 26, 2019",
            "reviewText": "I really like this coffee grinder. You can choose your grind, whether fine or course. Very fast and strong. Blades are sharp and quick. Thank you for this nice product! ??"
        },
        {
            "reviewerName": "rose07",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Quality coffee made easy",
            "reviewDate": "October 21, 2019",
            "reviewText": "This little grinder packs a punch! Its quick and powerful and easy to operate. It makes my morning coffee routine a breeze! Its easy to clean with a quick wipe."
        },
        {
            "reviewerName": "Theresa Sisco",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Convenient, saves time, and versatile",
            "reviewDate": "October 1, 2019",
            "reviewText": "I really like this electric coffee grinder. It grinds the coffee beans super fast with low noise level. It is easy to clean and I also used it to grind spices."
        },
        {
            "reviewerName": "Emily Johnson",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Grinds fast and efficiently",
            "reviewDate": "October 20, 2019",
            "reviewText": "Grinds coffee fast and efficiently. Very easy to operate. wipes clean easily. This one is way more quite then my last grinder.. I'm happy with this purchase"
        },
        {
            "reviewerName": "Llr",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Works great and cleans easily.",
            "reviewDate": "September 28, 2019",
            "reviewText": "Great for grinding beans for our French press. The grocery store only has whole beans or finely ground so I have been spending too much at Starbucks"
        },
        {
            "reviewerName": "yazen",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Great coffee grinder on a budget",
            "reviewDate": "October 20, 2019",
            "reviewText": "I start brewing my coffee and I wanted to buy a coffee grinder. I got this one because its within budget. The grinder work very well and its very powerful."
        },
        {
            "reviewerName": "Berry",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Easy to use and clean.",
            "reviewDate": "October 26, 2019",
            "reviewText": "This grinder is so easy to use. Ive done coffee and nuts in it. Chops or grinds them easily. Also very easy to clean."
        },
        {
            "reviewerName": "Constance W.",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Enjoy using this",
            "reviewDate": "October 2, 2019",
            "reviewText": "Was pleasantly surprised how well this worked. We really like having the fresh coffee. The taste is so good."
        },
        {
            "reviewerName": "BT",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Good seed grinder",
            "reviewDate": "October 23, 2019",
            "reviewText": "I really like the way this grinder ground my seeds. It is a powerful little machine for the size."
        },
        {
            "reviewerName": "Kooshul",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Works well for all types of coffee, durable",
            "reviewDate": "August 12, 2019",
            "reviewText": "Really works well to grind all types of coffee. Ive used it a bit and seems very durable and easy to use"
        },
        {
            "reviewerName": "Lisa",
            "rating": "5.0 out of 5 stars",
            "reviewTitle": "Great coffee grinder",
            "reviewDate": "August 29, 2019",
            "reviewText": "This is a great grinder! I love it! It is surprisingly quiet and very easy to use. I use this to grind coffee, cloves ,black pepper, cinnamon or even peanuts when I needed some delicious powder. The price is quite good as well."
        }
    ],
    "title": "Sweet Alive Electric Coffee Grinder, 120V Powerful Stainless Steel Blade With large Grinding Capacity And HD Motor, Suitable for Herbs, Nuts, cereals, etc. [2 years warranty]",
    "manufacturer": "Sweet Alive",
    "currentPrice": "$24.99",
    "rating": "4.9 out of 5 stars",
    "totalRatings": "56 ratings",
    "features": [
        "\n         Make sure this fits\n                by entering your model number.\n        \n",
        "PRODUCT SIZE: 20cm/7.87\"x10cm/3.93\" Powr: 120V/60HZ/150W",
        "MULTIPLE USE: Stainless Steel blades can grind a variety of food, including beans, pepper, spices, herbs, nuts, grains and more.",
        "Easy TO CLEAN:Dishwasher safe grinding chamber",
        "KEEP FRESH: With our Stainless Steel Electric Coffee Grinder, will never have to miss out on all the rich and wonderful flavors your coffee has to offer.",
        "FAST EVEN GRIND: with a strong motor and durable blades, you can grind beans efficiently and evenlyand fully grind each bean in seconds."
    ],
    "reviewsAspects": [
        "easy to clean",
        "coffee grinder",
        "easy to use",
        "coffee beans",
        "works well",
        "really like",
        "fresh ground",
        "grinds coffee",
        "cleans easily",
        "whole bean",
        "great product for the price",
        "freshly ground",
        "quickly and easily",
        "use it to grind",
        "fine grind",
        "grind spices",
        "works great",
        "bean coffee",
        "really easy",
        "grinding coffee beans"
    ],
    "qAndA": [
        {
            "question": "How much ground coffee (by weight) does the bowl hold?",
            "answer": "Answer not available"
        },
        {
            "question": "Is this battery powered or cord only?",
            "answer": "Cord only."
        },
        {
            "question": "What material is the jar?",
            "answer": "Answer not available"
        },
        {
            "question": "How many grams or ounces fit in the chamber?",
            "answer": "Answer not available"
        },
        {
            "question": "What material is the jar?",
            "answer": "Plastic"
        },
        {
            "question": "When the coffee grinder working, how loud is?",
            "answer": "It's the same as most small grinders, will have a little noisy."
        },
        {
            "question": "Does the bottom of the grinder leave marks on a laminate countertop?",
            "answer": "Answer not available"
        },
        {
            "question": "Why does the description say sweet alive but on the grinder it self says sweet alice?",
            "answer": "Answer not available"
        },
        {
            "question": "Is this battery powered or cord only?",
            "answer": "Well, there is no button to adjust it but the less you grind it the more coarse it will be."
        },
        {
            "question": "Is the grind adjustable?",
            "answer": "Answer not available"
        },
        {
            "question": "Is this battery powered or cord only?",
            "answer": "cord only"
        },
        {
            "question": "How long I have grind it to be perfect for Espresso ?",
            "answer": "It depends on the quantity you are grinding,you need to experiment until you find the perfect coarseness for you."
        }
    ]
}