{"title":"Samsung 54 W RMS SWA-8500S 2.0 Speaker System Wall Mountable Black Model SWA-8500S/ZA","manufacturer":"Samsung","currentPrice":false,"rating":"4.1 out of 5 stars","totalRatings":"526 ratings","features":["Bring wireless surround to these Samsung sound+ Soundbars:compatible with hw-m360,hw-m450, hw-m4500, hw-m550","Wall Mountable","Create an immersive surround experience to bring you into the action of your favorite movies, shows, and sports.","Simply plug-in and pair to enjoy all the action of your favorite entertainment in surround sound. Clutter-free experience"],"reviewsAspects":["rear speakers","surround sound","make sure","sound quality","living room","great addition","sounds great","easy to set","waste of money","adjust the volume","behind my couch","home theater","easy to install","left and right","easy setup","huge difference","mute button","dolby digital","truly wireless","speaker volume"],"productInformation":[{"ASIN":"B06XP324D7"},{"Customer Reviews":"4.1 out of 5 stars\n    526 ratings\n4.1 out of 5 stars"},{"Best Sellers Rank":"#1,491 in Electronics (See Top 100 in Electronics)\n#1 in Ceiling & In-Wall Speakers\n#14 in Home Audio Sound Bars\n"},{"Shipping Weight":"4.75 pounds (View shipping rates and policies)"},{"Date First Available":"March 5, 2017"}],"productDescription":["Expand your existing sound system with Samsung SWA-8500S Wireless Rear Speakers. Enjoy the immersive, clutter-free experience and get great sound all around by easily connecting the additional speakers wirelessly via Wi-Fi. Bring a new dimension to your home audio experience and feel the power and depth of your favorite movies and TV shows."],"reviews":[{"reviewerName":"John R. Hanson","rating":"5.0 out of 5 stars","reviewTitle":"SAMSUNG DOES NOT KNOW THEIR PRODUCTS","reviewDate":"July 28, 2017","reviewText":"Most reviews said volume was too low So i searched the sound bar manual and the rear spkr kit manual and called Samsung Support.by phone and got an E mail that both told me that there was NO WAY TO CONTROL VOLUME on the rear spkrs. Samsung does not Know their products very well, as there is a way\nSamsung needs to publish as I am sure many of these rear spkr kits have had poor reviews and likely returned\nHere is the FIX: Press the 'sound control' button on the soundbar remote. to get to rear speaker on/off, then 1 more time to get to rear speaker volume (-6 to +6).using up/ down arrows\nEasy. A further note, Using clear voice really makes a difference as the rear spkrs in some cases \"muddy\" the voices\nA great test is the James Bond opening in Specter the helicopter \"flys\" Behind you! Watch on Amazon Prime"},{"reviewerName":"Randy","rating":"4.0 out of 5 stars","reviewTitle":"Hard to Setup but once you figure it out they are quality","reviewDate":"The manufacturer commented on the review below","reviewText":"The base is wireless, the speakers are not. But that was fine for my install since I put my speakers behind my couch where you couldn't see the wires to each speaker.\n\nThe manual is absolutely terrible. Here are the keys to get these speakers working thanks to lots of google searches.\n\n1) Do not insert the speaker wire cables all the way in. The metal part must be touching the clamp. I found this out the hard way. Very frustrating that they don't mention this in the manual.\n\n2) Turn off the Samsung soundbar then press the up arrow button for 5 second for it to go into LINK mode. I have the Samsung HW-N550 sound bar but I read others need with different Samsung bars need to press and hold the mute button. The manual says press up on the volume button which didn't work for me. Once you see the LINK mode on the LED display the unit should pair with the wireless rear speakers.\n\n3) Once paired you will most likely find the volume is too low. To adjust it up click on the SOUND SETTINGS button which on my remote looks like a cog. Press it until REAR SPEAKERS displays, then WAIT! After showing you that it will say REAR SPEAKER VOLUME .. WAIT! then a number will show up (usually zero) the use the UP arrow to increase to your desired volume (0-6). I found 4 was optimal since you don't want the rear speaker volume to over power the main system.\n\nI give the HW-N550 sound bar five stars and these rear speakers four. I think they could be better but for the money it's totally worth the upgrade for true surround experience."},{"reviewerName":"Nick S.","rating":"5.0 out of 5 stars","reviewTitle":"I LOVE THESE!!!","reviewDate":"The manufacturer commented on the review below","reviewText":"These have improved my soundbar sound quality and loudness x3! These add a real surround sound.\n\nHERES MY ADVICE:\n1. Turn the rear speaker volume up to +4(+5/6 just overpower the sound bar. These are meant to add sound, not be the main source of the sound.)\n2. Turn your tv audio output settings to \"Surround\" and \"DTS/Neo 2:5\" (Dolby Digital can be a little quieter on sound effects)\n3. Turn surround on soundbar, and put it in standard audio mode.\n4. Use optical, not HDMI. For some reason the optical sound output is just louder than HDMI on Samsung soundbars.\n5. Buy some speaker stands that hide the wires through the stand tubing. It will look truly wireless."},{"reviewerName":"BlackGun","rating":"4.0 out of 5 stars","reviewTitle":"Samsung Makes the Best","reviewDate":"January 23, 2018","reviewText":"I like these speakers and they were specifically bought for use with my Samsung Soundbar system. The speakers a very small and can be put on stands or mounted on the wall. Best if placed behind where you sit to get the full effect of movie or sports sounds. I gave the four stars mainly because the volume that comes out off the speakers is not quite load enough but for the price they fit my needs just as the soundbar does. New 4K TV, soundbar, 4K Blue-ray Player, and these speakers make for a perfect movie night for the family. Samsung is very good quality stuff."},{"reviewerName":"Steven Denning-Garrison","rating":"4.0 out of 5 stars","reviewTitle":"great eventually once you know all the ins and outs","reviewDate":"July 26, 2018","reviewText":"great to pair with my Samsung sound bar. not to others that when you hear wireless that means that you do not have to have the whole unit connected to the other surround sound or mixer/soundbar as it should pair through your Samsung TV. the speaker do require wires from it to the main unit. For me, i have wires in my walls going to back off living room so i just had to slide in red and black in to the back of them. Then i had to run the wires from my back plate behind TV to the main unit. ** note that the wires are barely uncovered and the actual wires have to touch metal or contact otherwise you will not get sound.\nadjusting volume on the rear speakers is also very hard. If you have the soundbar in BT mode you will be able to cycle through treble, bass, etc to rear-speaker but then when you try and adjust volume it will just turn speaker of or back on. It wasn't until i hooked up my sound bar to the TV via optical cable that i was able to cycle through the rear speaker using sounbar remote and adjust the rear speakers to +6. not with these systems and cable boxes. cable boxes have there own volume control and you have to turn that all the way up and then control teh sound through the soundbar as i figured out. sound now eventually is great!"},{"reviewerName":"Kunkel Family","rating":"5.0 out of 5 stars","reviewTitle":"I mounted this to my wall behind my couch and it sounds just as great as my other samsung HTIB system in the other ...","reviewDate":"May 17, 2017","reviewText":"I purchased this rear speaker module to go along with my new Samsung soundbar https://www.amazon.com/gp/product/B06XP19HRW/ref=oh_aui_detailpage_o01_s00?ie=UTF8&psc=1\n\nThis module makes your soundbar a true surround system similar to the home theater in a box systems. I mounted this to my wall behind my couch and it sounds just as great as my other samsung HTIB system in the other room (which also uses a wireless rear module.)\n\nPros:\n- Easy to set up, just follow the instructions to link to the samsung system, very easy.\n- Low profile, easy to hide behind a couch or other furniture to make it out of sight.\n- Makes your new samsung soundbar a true 5.1 system.\n\nCons:\n- Yes the speakers themselves are wired, at this price point you are not going to find truly wireless speakers that are worth anything"},{"reviewerName":"mmsumulong","rating":"5.0 out of 5 stars","reviewTitle":"Great addition to the HW-N850 soundbar","reviewDate":"October 9, 2018","reviewText":"I just purchased this as an addition to my new HW-N850 which is a 5.1.2 Atmos capable system. As good as my soundbar is, it still lacks and immersed experience when watching. The HW-N950 has surround speakers and is a 7.1.4 system but is roughly $400 more. Thus comes in the SW-9000S. And since this model is on sale almost everywhere averaging $100 (lower in Amazon), the SW-9000S is a no-brainer for my soundbar. Setup is a breeze and there's no need to install the included receiver for N series soundbars. Volume is a bit tinny though and it's surprising that volume for this is at a max once paired with the soundbar. And though this speaker set does not convert my soundbar into a 7.1.4 system, a 7.1.2 system makes me a happy camper."},{"reviewerName":"PN","rating":"1.0 out of 5 stars","reviewTitle":"OK sound (except for subwoofer) but too expensive for limited flexibility","reviewDate":"The manufacturer commented on the review below","reviewText":"I purchased the whole set including the 750 Soundbar, 700 subwoofer, and wireless rear SWA-9000S/ZA) surrounds as a set.\n\nThe Soundbar and rears came first, so I set them up and used for two days without the sub.\n\nSoundbar is a vast improvement over cheap small speakers in even the newest nicest new TVs. The only shortcoming is there is no left-right volume balance control. Due to my bedroom setup my TV is in a corner, so there is no “room filling sound”. It just all comes from the corner of the room under my TV. Of the eleven speakers, one is right firing and the other left. With all their “modes” (which don’t seem to vary much), you’d think you could control left right balance. You can’t. With that being said, sound quality and volume were superb. Adjusting the “upward firing speakers” did give some nice depth of feel to the sound.\n\nRear surrounds: The only control you have is volume. Again, No left/right balance. For my placement of speakers that meant all I heard was the right speaker. No way to turn down the right and turn up the left. Horrible shortcoming. Sound quality was good (except for not hearing my left channel at all due to room placement.\n\nReceived s700 subwoofer two days later and hooked up. Even on value 6 (max) and after playing for hours with various settings/modes I honestly could not tell any difference with sub on at full volume or unplugged. It produced negligible volume and did not add one bit to the sound stage or any deep base enhancements at all. It produces virtually no effect. Add to that, there are zero controls (except the useless volume). No cross-over or frequency settings, nothing. The Soundbar decides what it gets and to me totally useless. Certainly not worth over $400.\n\nAfter hours researching on-line, and hours on Samsung’s phone tech support (very nice but not helpful) there were simply no solutions.\n\nIf you have a proper TV room or bedroom, with the TV in the middle of the wall, and your couch or bed directly opposed, the Soundbar and rear surrounds might be a good option. If you need flexibility and control of sounds this is not a good option. And unless my subwoofer was defective it little more than a joke.\n\nI am returning all. Even though I ordered as the set on Amazon, they billed each item separately, and as I tried to return the Subwoofer was informed this item was non-returnable. Thankfully a very nice Amazon rep I reached on the phone waived that.\n\nI’ve had some very nice Samsung products and like the brand and customer service. I guess I was expecting too much from the “Sound Bar” setup. I’ll be going back to ordering separates (Probably Denon-based) that I know I can customize to achieve the true surround sound I need."},{"reviewerName":"Naven","rating":"4.0 out of 5 stars","reviewTitle":"Great addition!","reviewDate":"January 27, 2018","reviewText":"Great compliment to the system. I located them on both sides of the couch and they help me hear the conversations better without turning it up loud. I did not find a way to control the volume separately to these speakers other than changing the sound mode in the main system. \"Music\" mode seems to give me the most sound through the speakers. I am glad I purchased them."},{"reviewerName":"Cwracing2000","rating":"4.0 out of 5 stars","reviewTitle":"Works great! Paired up to the Samsung HW-M550 sound bar","reviewDate":"February 4, 2018","reviewText":"Works great! Paired up to the Samsung HW-M550 sound bar. At first it was not pairing up with the sound bar, turned out the sound bar was the issue so i returned the sound bar to BestBuy and with the new sound bar everything works great and sounds great 👍🏾"},{"reviewerName":"E","rating":"5.0 out of 5 stars","reviewTitle":"You Neeed to Install Correctly for Maximum Sound","reviewDate":"The manufacturer commented on the review below","reviewText":"These work great, and contrary to most reviews they can get EXTREMELY LOUD if installed correctly.\nStep one is making sure they are even compatible with your soundbar.\n\nThe next steps are the biggest pain. You need to make sure your TV is set up correctly in its advanced audio settings and that the source is too (Cable box, Xbox, etc...). Your source needs to be set to Bitstream audio, then set to either Dolby Digital or DTS. THEN your TV's audio needs to be set to Bitstream then also Dolby Digital or DTS.\n\nEach time you switch between a Cable box or Xbox, your TV audio settings will revert back to non surround sound. You will need to switch it back to Dolby Digital or DTS.\n\nDoing all of the above will make the rear speakers work exactly as intended, and loud.\n\nIf you don't change the settings the rear speakers will be so quiet that it barely produces noise OR will act as nothing more than extra speakers for audio and will not produce surround sound."},{"reviewerName":"Daniel Hageman","rating":"5.0 out of 5 stars","reviewTitle":"When hooking up the speakers do not insert the shielding only insert the bare wire.","reviewDate":"January 26, 2019","reviewText":"I have the Samsung sound bar HW-N650 I purchased the Samsung SWA-8500S speaker system as an add on. Wow was I surprised. The hook up was so easy. The system paired up without any problems. I gave 4 stars only because the sound out of the speakers could be a we bit louder as they only max out at 6. Other than that this system is a must and will complete your setup. Over all watching a movie they do a very good job. When it comes to listening to music they will blow your mind. For the price you can't go wrong. I know there a lot of reviews on this but if you do your home work and take your time when hooking this system up I think you might be pleased. ( Just remember when inserting the wires into the speakers pay attention the positive and negative. Positive is marked in red, negative is marked in black. Only insert the bare wire not the shielding. If you insert the wire to deep in the speaker socket it catches the shielding and if this happens then you are not making contact and there will be no sound coming out of the speaker) Great product, Great price, Worth the purchase."},{"reviewerName":"Shamanjunior","rating":"4.0 out of 5 stars","reviewTitle":"Low volume??? Check that wires are STRIPPED!","reviewDate":"December 20, 2018","reviewText":"If your volume is low or you are not hearing anything check the wires to make sure they are fully stripped and metal is exposed. Mine were not, and it wasn’t apparent until I restripped the ends. I bet most, of not all the reviews with low volume have this defect from the factory. Wires seem ready to plug and play but they are not. Also, turn up volume of rears on soundbat."},{"reviewerName":"Dlivera","rating":"5.0 out of 5 stars","reviewTitle":"Very Happy I purchased the SWA-8500S Wireless Rear Speakers Kit.","reviewDate":"April 3, 2019","reviewText":"The kit complements the HW-MM55/ZA soundbar I also own. I knew that the kit was not completely wireless. The receiver module is wireless but you have to attach the two surround speakers using speaker wire that is provided. The speaker wires and receiver inputs are clearly marked.\n\nThe receiver module is paired to the soundbar. The paring process is as follows: The receiver module is plugged in, and the LINK LED indicator will blink. The soundbar should be turned off. Then, the instructions say to press the VOL button on the remote control to the sound bar for about 5 or 6 seconds until the \"ID SET\" message appears on the soundbar. This does not work. The button that should be pressed is the Mute button. Once the right button is pushed, the LINK LED button becomes a solid blue. At this point, the receive module is paired with the soundbar.\n\nAt first, I thought the speakers were not functioning. The issue is connecting the speaker wire to the speaker. If you push the wire in too far, it doesn't make the necessary contact. Pairing the speakers to the sound bar was difficult because the instructions given in the user manual are not correct. Once paired, the rear speakers are controlled using the remote control for the sound bar.\n\nThe soundbar must be set to Surround Sound using the SOUND MODE button. The Sound Control button adjusts the TREBLE, BASS, AUTO SYNC, REAR SPEAKERS ON, and REAR LEVEL. Changes are made using the UP and DOWN buttons. I turned the REAR LEVEL to max. The sound quality is awesome! Takes the sounds of Movies, Music & Games to whole other level with quality surround sound."},{"reviewerName":"Judd","rating":"4.0 out of 5 stars","reviewTitle":"Good sound for sound bar speakers","reviewDate":"October 11, 2019","reviewText":"Physical set-up very easy, pairing was easy, keep in mind that rear surround speakers are for accents, sound movement, and vary in volume depending on the show. The speakers are small, 3\" X 5\", I failed to look at the size before purchasing and was surprised at how small they were. The speaker wire is very thin attesting to the low voltage. All appropriate and typical for a sound bar system. We have our set-up in our basement living room and it's totally adequate for the space. The speaker quality and sound is good for what they're intended for. It's important to remember this type of set-up is not a high-powered, high-end system. We choose not to try and boost the volume as others have done, because they're not meant to act like the front speakers and are pre-set and balanced. Overall we're happy with the purchase but if you want powerful sound, don't even start with a sound bar, get a receiver and buy substantial front, center and rear speakers, plus the woofer. You'll pay about $1500+. So for the money, a sound bar, woofer, and these rear speakers are MUCH better than the TV speaker, and do better in a smaller space like a bedroom or small living room. If your expectations are appropriate for a sound bar system, you'll love them. If you're expecting a booming system that blows you away, you'll be very disappointed, because that's not what these speakers are intended for.\n\nUPDATE: \"HOW TO\": SWA8500s(ZA) \"ZA\" means made in America, same system, ignore it unless you live outside the US. \"ZC\" stands for made in Canada. Despite people saying the Samsung R60C (Costco) sound bar/woofer is not compatible with the SWA8500s, IT IS! We discovered \"rear speaker\" settings on our Samsung R60C (Costco) display box by repeatedly pressing the settings button (cogwheel), which is not made clear in the manual. Maxed out the rear speakers (+6), maxed out the bass (+6), maxed out the woofer (+6) and turned up the treble. Again, \"changing\" the settings from factory pre-sets (0) are done by pressing the top and bottom of the wheel for bass, treble and rear speakers, but adjusting the sound bar volume is done by toggling the volume switch up and down, and adjusting the woofer with the woofer toggle. So you use 3 different buttons for these adjustments. Very poor information from Samsung, and is probably the reason so many of these units are returned and the ratings are fairly poor. It's not obvious how to adjust these speakers, or the sound bar in general. Huge difference with new adjustments, much happier with the sound. Changed out the HDMI with the Optical cable which some said was an improvement, but it's' not. Went back to the HDMI because it carries more sound formats (especially with a 4K TV/DVD player) and is preferred over the optic cable if you have HDMI capabilities. Hang in there with the adjustments before you send it back, it will be worth it!"},{"reviewerName":"TooTechnical","rating":"5.0 out of 5 stars","reviewTitle":"Disappointed but Delighted!","reviewDate":"June 8, 2019","reviewText":"Quality overall for the price - 5 stars! I did not feel the need to ding these for terrible instructions or for the fact that they are not truly wireless. For those looking for true wireless, these are not them.\n\nAfter opening and discovering there are wires after all, my plans changed form mounting on the wall near the ceiling to sitting them on the end tables with the wires and the bluetooth receiver box under the couch. It won't make my wife happy, but it's good enough for now.\n\nComing back and reading many reviews (thank you to all those with the facts on how to operate these), these speakers are simply incredible. Compared to my bulky amplifier, the two 80 pound towers, 40 pound subwoofer and two 10 pound satellite speakers, not to mention the myriad of wires, well, there's simply no comparison! The cost is 1/4 that of the old traditional sound system and it opened up our living room to, well, more \"living room\" lol.\n\nBottom line, these worked out for me both for budget and definitely for quality."},{"reviewerName":"Z. J. Garcia","rating":"5.0 out of 5 stars","reviewTitle":"GREAT SPEAKERS. DECENT PRICE.","reviewDate":"March 5, 2018","reviewText":"The speakers work great. They look great. They are easy to set up. The only thing that I noticed is that it is not completely plug n play. I had to look up how to connect the speakers wirelessly to my system. And the instructions did not come with the speakers, so I had to find the instructions online. Once the speakers were connected. I have had nothing but a great experience with them. I bought them to work with my Samsung HW-M450/ZA 2.1 Channel Soundbar and they work perfectly."},{"reviewerName":"WKB","rating":"1.0 out of 5 stars","reviewTitle":"Faint sound; not wireless.","reviewDate":"The manufacturer commented on the review below","reviewText":"First, the sound is very faint. Certainly not worth the cost and extra clutter if you can barely hear the speakers. Second, the unit is only partially wireless. You need to plug in the amplifier/transmitter to a wall socket for power, but it doesn't need to be connected to the soundbar - so that is wireless. However, the two speakers need to be connected to the amplifier, so you're still running wires. I have a Samsung TV and a Samsung Soundbar, but I'll wait to buy additional speakers once Samsung can make remote, wireless speakers to match the sound quality of its Soundbars."},{"reviewerName":"spencerdl","rating":"5.0 out of 5 stars","reviewTitle":"Great Sound and Worthy Addition","reviewDate":"February 7, 2019","reviewText":"The Samsung 8500S 2.0 Wireless Speaker System is a great addition to my Samsung N450 Soundbar and Samsung 55\" 4K UHD Smart TV. It enhances my overall viewing and listening pleasure. The pairing of the 8500S was a little challenging at first because the instructions are not very clear, but I figured it out and haven't had any problems since. Basically just reset your soundbar before connecting with this system and pairing should be easily achieved. The surround sound is great and more prevalent on certain movies, shows and sporting events. I have my 8500S rear speakers (Soundbar description) sound level set on +3 and after some adjustments, which takes time, makes this entire Samsung set up enjoyable.\nRecommend"},{"reviewerName":"vardelda","rating":"3.0 out of 5 stars","reviewTitle":"Good speakers - WEAK volume control!","reviewDate":"The manufacturer commented on the review below","reviewText":"Here's the deal: it's no help to comment on speaker volume as good/bad without noting geometry of speaker layout. These are good, inexpensive speakers with few options to adjust. If you want value and simple these speakers may be great for you - BUT you must consider your speaker geometry.\n\nYes, there are Treble and Bass controls but driven by the sound bar for all attached speakers. Yes, there is a 0-6 rear satellite volume adjustment but this is not enough for many situations.\n\nSimply put, at Rear Speaker Volume +6, the satellite speaker output almost equals the main bar. Anything less and the main bar is stronger than the satellites. Whether this is a problem for you depends on distance between the speakers AND which way they are facing relative to listeners. Example: If both main and satellites are pointed directly at you, and are the same distance from you, at Vol +6, you will hear both about equally. If you are further from one, or if it is pointed away, you will get an imbalance.\n\nIn short: these work great for simple layouts where the satellites are closer to listeners than the sound bar. But they ARE NOT room filling speakers (particularly large rooms). Worse, they lack the independent controls to adjust for any imbalance situations."},{"reviewerName":"Mark","rating":"5.0 out of 5 stars","reviewTitle":"* They sound amazing. Volume can be adjusted from the cellphone app ...","reviewDate":"The manufacturer commented on the review below","reviewText":"To sum up what many reviews say (I have them connected to a Samsung Soundbar HW-650):\n* They sound amazing. Volume can be adjusted from the cellphone app Samsung Multiroom\n* It's a painful process to make them work. At the begining they joined to the soundbar in a minute, but then they got disconnected and took me 2 hours to join them again.\n* What I did to make it work? Tried a bunch of things, but at the end what it worked was:\n1) Disconnect all the devices from the soundbar (including the TV)\n2) Try to join them using the cellphone app.\n3) If it doesn't work, reset the soundbar to factory default, reset the speakers to factory default (using the little hole at the back, follow manual's instructions) and try to join them again\n4) Connect the rest of the devices to the soundbar (including the TV)\nHope it helps."},{"reviewerName":"charlyc","rating":"5.0 out of 5 stars","reviewTitle":"Great Addition to my HW-MS650 Sound+ Premium Soundbar","reviewDate":"October 4, 2018","reviewText":"I picked up HW-MS650 Soundbar (Bestbuy) and started to add the sub (Bestbuy) & rear speakers (Amazon) as they went on sale. Amazingly the price on Amazon dropped to $67.00 and since that's the lowest I have ever seen them I pulled the trigger. Even at regular price these speakers complement the surround sound and make a big difference. The Dolby effect is awesome and even the sub which is not the overpowering kind sounds great. Since I got all at a decent sale price this setup is worth it and I am very happy with it."},{"reviewerName":"Marv Carnes","rating":"5.0 out of 5 stars","reviewTitle":"Sweet unit when combined with rear satellite speakers.","reviewDate":"May 9, 2019","reviewText":"Great sound and works beautifully with my new Samsung Qled tv. Good voice reproduction and when paired with the optional rear surround speakers, you would think it is a 5.1 surround sound home theater system that cost much much more. Very happy with it. Replaced a Vizio unit that was constantly changing from my CEC digital in ARC setting to tv speaker all on its own. This unit keeps whatever settings I select and has better front indicators that tell you what level of volume setting you are selecting as you turn up or down the volume. The Vizio only had small light bar indicators that were not very helpful. So glad I replaced the Vizio with this Samsung soundbar and satellite speakers. Bluetooth pairing was automatic with this unit, unlike the Vizio which required me to press a button on the subwoofer to get the rear speakers to sync up with the soundbar, something you have to keep doing if the unit loses power. Worth the money, though it isn't an inexpensive purchase. Sound is excellent and woofer creates some excellent base responses when watching movies. I'm a happy camper!"},{"reviewerName":"AUTOoBSSESSED","rating":"3.0 out of 5 stars","reviewTitle":"not the best in terms of performance but they do add some ...","reviewDate":"The manufacturer commented on the review below","reviewText":"Ehhh...they're ok. I brought these to compliment my 750 soundbar... not the best in terms of performance but they do add some rear surrrond sound, albeit at a low volume, to my setup ( my advice with wall mounting is mount them low )\n. My only gripe is that the volume and effect options for these are limited. For 120 bucks they are worth it though, especially if your not looking to run a full 5.1 system with a receiver."},{"reviewerName":"Matthew Rogers","rating":"5.0 out of 5 stars","reviewTitle":"Impressive for a first timer like me having surround sound","reviewDate":"August 7, 2018","reviewText":"I'm not an audiophile, but upgrading my Samsung MS650 Soundbar with these Surround Sound speakers has been a great idea. In the past I only had a soundbar and a subwoofer, so adding these speakers definitely has added to the experience. My girlfriend even was impressed with the improved sound and I didn't tell her ahead of time that I was adding them. I also managed to get them on sale for only $80 so they've definitely been worth the investment. There's definitely a mixed experience depending on what I'm watching with some shows taking advantage of them much better than others, but Jurassic Park and outdoor movies have a noticeable surround sound feel."},{"reviewerName":"o2no1self","rating":"5.0 out of 5 stars","reviewTitle":"love em","reviewDate":"April 16, 2019","reviewText":"edit, about a week into having them, they are still awesome. my wife who was on the fence about the purchase and really just 'let me' get them, agrees they are great. and wants them on the other tv as well. very important to setup correctly, go into the soundbar settings and output surround, ( I found little differences with game, movie etc..) use surround. then settings on the tv, output 5.1 or PCM, then into your cable box settings and set audio to advanced 5.1 output. (Xfinity X1 boxes the simple mode outputs stero.) Do these things and the beauty of surround sound is yours.\n\nlove em, syncing was easy but only because of another review that explained NOT to use the volume key per the manual but rather the arrow up key. with that information in hand. 10 minutes tops. the hardest part was deciding where to put them. adjust the sound using the soundbars remote turn up rear speakers to desired setting, put the bar into 'surround mode\" and in my case turn up audio which I think is the center channel since I feel like it got clearer when I did."},{"reviewerName":"amzn-women-on-the-moon","rating":"5.0 out of 5 stars","reviewTitle":"Awesome on a Budget","reviewDate":"August 1, 2019","reviewText":"I purchased these to go with the $100 Samsung sound bar/sub [HW-MM36] that I bought a couple months ago. I didn't realize there were add-on speakers, but I'm glad I found these. They really are an amazing touch to this system when you consider price. Everyone says that they don't sound like Bose, and they are correct. However, if you are looking at these speakers, chances are you don't have $2500 to spend on the bottom model of a high end system anyway. They sound awesome for their price and you would be mistaken not to add these to your system. If you are on a budget and want to get surround sound, these are your speakers. Also, if you are watching movies off of your computer, try using Potplayer and playing around with the audio settings in the App. It acts as a pre-amplifier/equalizer and increases the sound quality/level by at least 10. Installation was simple and took less than 5 minutes.\nThings you should know:\nThere are a couple things you should know first. These speakers only work with select Samsung sound bars, so make sure your system is compatible.\nThe speakers are not truly wireless. They utilize a wireless device back to the sound bar, but they use wires from the wireless device to the rear speakers. Which is fine by me in my setup, most of us are just trying to get rid of the run from the sound bar to the rear speakers anyway.\nThe speakers are small, don't be alarmed, I think you will be happy with the sound.\nI am very happy with this purchase and have already told my friends about this system."},{"reviewerName":"MD","rating":"4.0 out of 5 stars","reviewTitle":"Sounds just as good as the soundbar","reviewDate":"January 1, 2019","reviewText":"Good speakers for the price. The convenience of 'wireless' surround speakers is wonderful (\"surround\" is in quotations because some people get confused -- only the base station which the actual speakers connect to via wires, is wireless). I had some difficulty setting them up as I was convinced that all they were doing was replicating the left/right channels instead of creating true surround sound. A couple of tweaks in my Xbox's settings proved that I was just excluding a certain setting (exactly which setting it is, I couldn't say for sure. I had to tweak it quite a bit.)\nGood speakers; would recommend."},{"reviewerName":"Erin Bowers","rating":"5.0 out of 5 stars","reviewTitle":"These work better then expected","reviewDate":"October 11, 2017","reviewText":"These work better then expected, the people leaving neg reviews are probably trying to pair them with non compatible sound bars.\n\nand yes you can adjust the volume of these speakers once paired, hit the setup or sprocket button on remote until you get to rear speaker level.\n\nI forget i have these and then i get spooked or hear things and it sounds like people talking behind me lol.\n\nI use the movie or cinema sound setting for tv and i also select the cinema sound setting on my tv since im using arc with hwm550."},{"reviewerName":"BigNutz","rating":"5.0 out of 5 stars","reviewTitle":"Awesome if You Are Planning to Use With Compatible Components","reviewDate":"May 15, 2019","reviewText":"I paired these with a compatible Samsung sound bar very easily. I guess you could use the speakers with any type of home audio system, but if you don't have a sound bar (Samsung or not), this is not the surround speaker set you should be considering. If you do have a compatible Samsung sound bar, and that sound bar is connected to a compatible Samsung 4K flat screen TV, you'll probably be very happy with this set up.\n\nI need to say something to the entire home audio industry first, though. It's about damned time I didn't need to take 6 hours out of my day to run and obfuscate all the speaker wires needed for each speaker. The next innovation needs to be quicker.\n\nSo, I had my Samsung sound bar and it's included wireless sub already hooked up to my Samsung TV. Consequently I spent some time being confused by the instructions included with these speakers. I highly recommend that instead of repeating my mistake, go directly to the sound bar's manual for pairing instructions. If it's compatible with these speakers, it will have a section on it. Apparently for a quick little giggle, Samsung made a funny and made the pairing process just a little different and unique for every different sound bar you can use. Thanks Samsung.\n\nNevermind reading the listing to determine the dimensions of something you want, these are WAYYYY smaller than the picture makes then look. Imagine a rectangle version of the older Bose cubes from the 90's. This wasn't a buzzkill for me, just unexpected, like when an 85 year old farts and wasn't expecting it.\n\nLike I said, setup was a breeze, I spent the most time looking for two screws to use (each takes 1). I am OCD about things I attach to the wall from the standpoint of choosing not to hang something if a stud is not a available to anchor the screw into. That said, these are so light, you'd hand no problem hanging out of a wood screw which is just screwed into drywall.\n\nThey sound pretty good, but these are satellite surround sound speakers, so when they emit a sound, it's usually very obscure, and if you don't the time and configure your audio like Jesus would, it would blend seamlessly into the what's playing on the front speakers.\n\nI'm a Samsung loyalist, but only to a certain point. Their products will usually recieve deference from me, but sometimes Allende brand has something they don't."},{"reviewerName":"David James","rating":"4.0 out of 5 stars","reviewTitle":"UPDATED: Speakers Review","reviewDate":"The manufacturer commented on the review below","reviewText":"UPDATE 2: With the new soundbar, the speakers work and do 5.1! There's been some crackling occassionally that I'm hoping I can solve but otherwise they work as 5.1. Really wish they'd note in the \"compatible soundbars\" section which do 2.1 and 5.1.\n\nUPDATE: After doing extensive digging, my samsung soundbar HW360 doesn't decode 5.1, meaning the issue is my fault. I have ordered the HW550 soundbar that is advertised as decoding 5.1 and will update my review of these rear speakers when they arrive. Should really be a warning on these that connecting to some soudbars won't give you true 5.1.\n\nI bought these in hopes that they would put out rear Left and Right channels in order to create a true surround effect. I was noticing I was getting full Left and Right on the speakers and so I called Samsung Support and they confirmed that there is no way to set them to do rear channel therefore you're not getting a full 5.1 experience. Seems like this could easily be implemented in a software update to push the rear channels to the speakers. They are nice speakers and do sound good so I still gave them 2 stars. Just disappointed they aren't giving me the full surround experience I was expecting to get."},{"reviewerName":"AR","rating":"1.0 out of 5 stars","reviewTitle":"Hit or miss, depending on the [SAMSUNG] soundbar you link them to.","reviewDate":"October 31, 2019","reviewText":"I tried these with the HW-Q60R soundbar. They worked well.\n\nHad to upgrade to the HW-Q70R soundbar, because the Q60R did not support uncompressed 5.1 PCM audio, and the Nintendo Switch and my PC only output 5.1 PCM; they don't output 5.1 Dolby Digital or DTS. These rear speakers are terrible with the Q70R. The sound is VERY quiet. Even turning the rear speakers volume up to the maximum volume, +6, results in a very quiet sound from the rear speakers. Samsung has acknowledged this issue in multiple Samsung forums, and they haven't fixed the issue in years. The volume was perfectly fine when synced with the Q60R soundbar, and I didn't even need to turn up the rear speaker volume with it, but it's really low with the Q70R.\n\nAdditionally, there is a low, but very noticeable to me, hissing sound coming from the rear speakers that WAS NOT present when connected to the Q60R soundbar.\n\nI'm giving the sound quality 5-stars, because I've listened to them when they work properly, but the incompatibility (there's no other word for this) with SOME soundbars - SAMSUNG soundbars for crying out loud! - makes me give them an overall rating of 1-star. This is an easy fix that could be solved with a firmware update, and Samsung has not done it."},{"reviewerName":"kennalie","rating":"4.0 out of 5 stars","reviewTitle":"Hard a hard time pairing to sound bar, close ...","reviewDate":"July 28, 2017","reviewText":"Hard a hard time pairing to sound bar, close to returning but got it going. Okay for sound but voices are not as loud as i had hoped"},{"reviewerName":"BarryP","rating":"4.0 out of 5 stars","reviewTitle":"Nice add on to sound bar with subwoffer, but install add on can be tricky - incomplete instructions","reviewDate":"November 15, 2018","reviewText":"Once got connected works well, some challenges trying to have it pair with the TV when you already have a Samsung sound bar that was paired. No instruction related to that aspect. In trial and error, what I ended up doing was unplugging the subwoofer power, then I could get the speakers to pair. When I plugged back in the Subwoofer, everything worked. Also to get the the settings to adjust the volume was hit and miss, finally got to it while not noted in the instructions. In doing so initially had unlinked the function where all the TV remotes would turn on and adjust the volume of the Sound Bar and speakers, so you do not need to use the soundbar remote. Got it back again, just annoying having to keep trying the sequence of actions with the buttons and some of the time outs. Very happy with performance and ability to fine tune settings once got the hang of it."},{"reviewerName":"J.Patel","rating":"5.0 out of 5 stars","reviewTitle":"I own all 3 components","reviewDate":"February 23, 2019","reviewText":"I own the 11 Speaker Samsung Sound bar Plus. I have the subwoofer and now these speakers.\n\nI have it set up in my living room in a condo. The room is configured in a 3 sided wall shape. It's trapezoid like. It makes for perfect sound bouncing and placement of speakers. Essentially the subwoofer at 0 level produces loud thunderous bangs and shakes for movies and smooth bass for music.\n\nThe addition of these speakers provide different sounds for different viewings. Some movies give background noises behind you while some give speech towards the back of you.\n\nAll in all. When I watch certain movies or play games I can sometimes here background noises and sometimes think someone is at the door or behind me. You will feel haunted if by yourself because of the magnitude of sounds."},{"reviewerName":"Jeff C.","rating":"5.0 out of 5 stars","reviewTitle":"Made a huge difference.","reviewDate":"October 31, 2019","reviewText":"Coming over from a 5.1 surround system I was worried that I would be missing something. Tried just the soundbar and sub and it definitely lacked so I oredered these. They paired right up with my Costco HW-R60C no trouble at all. I was also worried about the extra clutter and getting power to the wireless module, but I just put it on top of the sub in the spot where my old 5.1 receiver was and used the existing wires I had installed for that system to go from the module to my speakers. Nice and clean looking. Note, if you plan on just using your old maybe bigger rear channel speakers as I considered with this module, I wouldn't suggest it. These speakers are an oddball 3Ω. These filled in the sound feild nicely and passed the Steely Dan test.\nUpdate: I have found one issue. The sounbar always defaults to the digital input or TV ARC. This is a problem if you run your STB into the sounbar first and then out to the ARC port on your TV, as you will need to use the soundbar remote to switch back to the HDMI input. You can't just use one remote. If you run all your inputs to the TV first its not a problem, but you may lose 5.1 encoding."},{"reviewerName":"TNo","rating":"5.0 out of 5 stars","reviewTitle":"Excellent Addition to Soundbar","reviewDate":"January 2, 2019","reviewText":"Paired with: Samsung HW-M550 Soundbar\n\nVery easy and straight forward to setup.. literally 30 seconds and it synced right up.\n\nSound isn't mind blowing but in the end it's just your surrounds but definitely adds a lot to my Soundbar. Would highly recommend anyone who owns the soundbar to add this to it. You won't regret it.\n\nBe sure to verify it is compatible with your soundbar.\n\nSome are surprised when they find out wires to the speakers route back to the \"base\". The only thing this is doing is keeping you from having to run speaker wire from the front of your room to the back."},{"reviewerName":"Robert jones","rating":"1.0 out of 5 stars","reviewTitle":"don't buy","reviewDate":"The manufacturer commented on the review below","reviewText":"this is the second one of these I have ordered and the second one I am sending back. Neither of them paired with my sound bar and Samsung \"help\" was non-existent. I have decided with Samsung products, if it doesn't work the first time, it will never work."},{"reviewerName":"Hue Grey","rating":"2.0 out of 5 stars","reviewTitle":"not a good match with HW-Q70R","reviewDate":"The manufacturer commented on the review below","reviewText":"These do not have good output.. may work well if you have them directly behind your head but if you have them on the wall they do not have enough gain. I had to put them +6 and turn down the center / LR channels -6 to get a decent mix. Also, when in ATOMS mode they are pretty much useless which is very counter intuitive. possibly because atmos setups are supposed to have full range speakers all around you. either way it's just no enough signal to hear at any point of the cinima."},{"reviewerName":"Dartmouth Review","rating":"2.0 out of 5 stars","reviewTitle":"Tiny Speakers / Tiny Sound","reviewDate":"The manufacturer commented on the review below","reviewText":"Once you figure out how to install these and find proper instructions (by searching the internet not from the enclosed instructions, I recommend YouTube) they are super easy to set up.\n\nThese tiny speakers not much larger than a large coffee mug sit just above my head in my bed. I can barely hear them. I am always glad when I do, but it is rare. Really, don't bother. I went to a different sound system. Didn't return them, kept hoping they would get better and the issue was something other than tiny speakers. But tiny speakers give a tiny sound. Forget about spending money and time on these."},{"reviewerName":"Bamablueheat","rating":"5.0 out of 5 stars","reviewTitle":"Improve on Soundbar alone","reviewDate":"July 24, 2019","reviewText":"I had recently purchased the Samsung HW Q70R Soundbar and wanted the audio coming from my television to be a bit more immersive. These speakers do the trick, they make quite a bit of difference for the better."},{"reviewerName":"dJA","rating":"5.0 out of 5 stars","reviewTitle":"Nice Addition","reviewDate":"February 8, 2019","reviewText":"Nice addition to my Samsung HW-M430 soundbar. Wireless speakers connected automatically with the soundbar. Soundbar controls rear volume. Rear volume control is not explained in the instructions, so you have to play with the soundbar settings. Only short fall is no left/right balance control."},{"reviewerName":"Waldo","rating":"3.0 out of 5 stars","reviewTitle":"Honestly disappointed","reviewDate":"The manufacturer commented on the review below","reviewText":"I'm honestly disappointed in this item. After reading other reviews, I was skeptical of the poor performance, and purchased this anyway. It works, but genuinely, for me, it does nothing to improve the sound bar for movies and TV. The volume coming out of these is barely audible, despite the rear auxiliary volume on the sound bar turned all the way up. And I can only hear it if the speakers are within a couple of feet of my ear. Not what I was expecting at all. They seem to work better for Bluetooth streaming music than movies. Expected something better I guess."},{"reviewerName":"Kevin Suffern","rating":"5.0 out of 5 stars","reviewTitle":"Absolutely Essential Add On 2D v. 3D Sound","reviewDate":"October 15, 2017","reviewText":"Essential addition to Samsung MS 650 3.1 channel soundbar. Creates true 5.1 channel surround sound. Crystal clear sound that goes from 2D front wall sound to 3D full room sound with these wireless surround speakers. Did take me several tries to get the system paired and working. But despite the initial difficulties this system is a must have for compatible Samsung soundbars."},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Great speakers and even this lil’ old 75 year old granny got them to work","reviewDate":"June 16, 2019","reviewText":"Wired it up and turned it on and after a few tweaks had great surround sound. Have one speaker near me and keep looking for where the sounds of doors, phones, and dogs barking are coming from...the sound is so real."},{"reviewerName":"Norman Family","rating":"4.0 out of 5 stars","reviewTitle":"Has an easy mistake you can mistake when setting up. Wish they were louder.","reviewDate":"July 21, 2017","reviewText":"Was fairly easy to setup. Instructions lacked specifically when it came to inserting the wires into the speakers, which you have to make sure you only insert the exposed end of the wire and nothing more, otherwise the metal connection clamps will come down on the wire's jacket and the speakers will not produce sound.\n\nThe only thing that would make a future version of this product superior is more powerful speakers, but these are adequate for my setup after turning them up to max, and I do like that future versions of these may be backwards compatible with my current Samsung soundbar, so I may be able to get an improved version in the future. Still, I know from listening closely to 5.1 audio that it can vary in volume, and sometimes whatever you are listening to just had either a bad sound engineer or someone else along the way mucked the audio up.\n\nFollowing products were bought with these to accompany it.\n\nSpeaker Stands (Make sure you get a stand with keyhole support.): Mounting Dream MD5401 Height Adjustable Speaker Stands Mounts, Two in One Floor Stands, Heavy Duty Base and ExtendableTube with 11 LBS Capacity Per Stand, 35.5-48\" Height Adjustment\n\nSoundbar: Samsung HW-M550 3.1 Channel 340 Watt Wireless Audio Soundbar (2017 Model)\n\nHDMI Switch (Didn't want to take the chance of losing anything over Optical Audio and needed this due to four devices and only three inputs on TV.): Zettaguard 4K x 2K 4 Port 4 x 1 HDMI Switch with PIP and IR Wireless Remote Control, HDMI Switcher Hub Port Switches (ZW410)"},{"reviewerName":"B Mo","rating":"5.0 out of 5 stars","reviewTitle":"They are small and add a nice rear dimension of sound","reviewDate":"April 16, 2018","reviewText":"Got these as an addition to my Samsung sound bar I got at Costco. They are small and add a nice rear dimension of sound. Easy to pair and help to hear the TV better and add an element of theater feeling. For people complaining, these clearly aren't audiophile quality but for the price I'm more than pleased with them. Have a pretty great sound system now in our Rec room for a little over $200 all in. That's hard to beat"},{"reviewerName":"J. Warner","rating":"5.0 out of 5 stars","reviewTitle":"Great product!","reviewDate":"March 27, 2019","reviewText":"This is a really great product! I bought it as an expansion to the soundbar I purchased and I am really glad I did. The only thing you need to be aware of is when you try to pair it with the soundbar, the directions in the manual are incorrect. In order for it to pair and get it to the point where it will pair is you have to hold down the MUTE button on your television remote control. It took me a while to figure this out, even with the help of customer service, and ultimately discovered this issue on a message board. Once I did that, it paired without any problems and has been amazing ever since."},{"reviewerName":"Mickey Thompson","rating":"5.0 out of 5 stars","reviewTitle":"Great Product with Solid Sound from Small Satellite Speaker","reviewDate":"July 30, 2019","reviewText":"I was pleasantly surprised by the sound quality of these speakers...It's outstanding. The system works very well with Samsung Soundbar. The setup is straight forward...just remember to use the remote control of the Samsung Soundbar (use the Control button---press on the top portion of the control button for 3 to 4 seconds for parring)."},{"reviewerName":"Aaron Blackmor","rating":"1.0 out of 5 stars","reviewTitle":"These Don't Work At All!","reviewDate":"The manufacturer commented on the review below","reviewText":"I've worked and worked with these speakers to try and get decent sound out of them, and for the life of me I can't. I followed the suggestions of other reviewers on here by turning up the volume only to the back speakers to +6, and they're still just whisper quiet. I know they're on because I can hold the speaker up to my ear and hear a faint bit of sound. Unfortunately these just don't work."},{"reviewerName":"Evil2gdsm","rating":"3.0 out of 5 stars","reviewTitle":"VERY SMALL","reviewDate":"The manufacturer commented on the review below","reviewText":"I was expecting these to be much larger than they were. The Receiver box is about the size of a router maybe a tad bigger & the speakers are maybe EXTREMELY small. People mention they have a ton of issues getting these sync'd up with their soundbar? It's VERY easy, just popped on Youtube, found a vid & bam it was done within 2 minutes...very easy but the lack of instructions can be confusing. The speakers themselves are NOT loud at all."},{"reviewerName":"Jacqueline","rating":"5.0 out of 5 stars","reviewTitle":"Great buy for the price","reviewDate":"July 14, 2018","reviewText":"Love these! They paired effortlessly with my Costco bought Samsung sound bar. You can adjust the volume on them (a quick google search will show you how) and there's been numerous times I've then had to pause whatever show I was watching to make sure the police sirens or bird noises were not coming from inside my home haha.\n\nBefore purchasing, leave in your cart for a few weeks and see how the price fluctuates. I noticed that it went up and down in price by as much as $35"},{"reviewerName":"Autumn","rating":"4.0 out of 5 stars","reviewTitle":"These don’t work with standard speaker stands!","reviewDate":"September 23, 2019","reviewText":"These are a great addition to the sound bar. Like other reviewers I’d turned them up to +6. The only downside I have to these are the holes in the back used for mounting are much too small for standard speaker stands. I went through the top purchased speaker stands on amazon and I had to return them. Eventually I just settled for some I could stick on the tops. Not as secure as screwing them into the speaker but they’re just behind the couch so they should be fine."},{"reviewerName":"john sicoli","rating":"3.0 out of 5 stars","reviewTitle":"Good for the money. But wish I bought higher end.","reviewDate":"The manufacturer commented on the review below","reviewText":"These are very quite compared to the other speakers in front. You basically dont know they are there on some movies, games. The fact you have to run a wire to them from another unit that wireless connects to your existing sound bar is annoying and makes it look bad. I dont see why these speakers could not be wireless, The subwoofer is wireless and the soundbar has a wireless connection to the tv. So this just makes for a ugly install when you will see the wires going to them."},{"reviewerName":"AMZN Cust","rating":"5.0 out of 5 stars","reviewTitle":"Great LITTLE speakers","reviewDate":"February 1, 2019","reviewText":"At the time I purchased these speakers, only one reviewer mentioned how small these speakers are. They're approximately the size of an average hand from wrist to fingertips. The photos make them look much larger. In any case, they sound great. I'd encourage getting a set, especially if they're under $85. Great value at this price. Note that they are not truly wireless. The main unit, the larger rectangle in the photos, is Bluetooth connected to the soundbar, but the little satellite speakers are hardwired to the main unit. If placed right it has something of a wireless effect, just wanted you to know what you're getting."},{"reviewerName":"Joseph C","rating":"2.0 out of 5 stars","reviewTitle":"Don’t waste your money","reviewDate":"The manufacturer commented on the review below","reviewText":"I gave these two stars because they work; but not well. Even when the rear speaker volume is set to +6, i could barely hear them. I tried using other speakers with the supplied amplifier and it was unsuccessful. There is a frequency restricter in the unit that only uses the tweeters and a little of the woofer frequency. I hear verry little difference when using these. If you are looking to set up surround sound, and have recently purchased the sound bar, return it. Get a viseo system or buy a receiver and set the whole thing up yourself; don’t waste your money on this. I returned mine."},{"reviewerName":"Advocate","rating":"5.0 out of 5 stars","reviewTitle":"Compatible with my Samsung Sound Bar.","reviewDate":"December 16, 2017","reviewText":"I made sure that this worked with my model Samsung sound bar before I ordered. Once the Sound Bar was working properly I hooked up the surround system as described in the manual and voila, every thing worked great. For the price, it makes a nice improvement .\n\nJust verify that it is compatible with your model Sound Bar before getting frustrated with set up."},{"reviewerName":"CaptainInsano","rating":"4.0 out of 5 stars","reviewTitle":"Not too shabby!","reviewDate":"January 3, 2019","reviewText":"Solid little surround speakers. Easy to set up. Just follow the directions in the manual. They sound great in my bedroom with my sound bar and subwoofer. I plan to mount them on the walls, above my bed. Can’t beat the $65 price either.\nDon’t expect these to blow you out of the water in a large living room but if they’re placed relatively close to the listeners position, like they are in my bedroom, you’ll be satisfied. My only complaint is that they sound a little hollow when playing music but I know that is because it’s a small speaker in a plastic cabinet. I kind of expected that. I wasn’t searching for high quality audio, just something to fill out the rest of the system."},{"reviewerName":"Amazon Customer","rating":"2.0 out of 5 stars","reviewTitle":"Pairing issues!","reviewDate":"The manufacturer commented on the review below","reviewText":"Couldn’t not get this to pair, following instructions to the letter! Had hoped after reading other reviews it was a fluke every now and then. Nope, can’t get mine to work either"},{"reviewerName":"Karlito","rating":"4.0 out of 5 stars","reviewTitle":"Great speakers for the price","reviewDate":"February 26, 2019","reviewText":"Bought these to go with my Samsung MU8500 TV and MS650 soundbar..If you want bass, you'll need the subwoofer...Otherwise, these are not too overpowering and add a nice touch to your sound system over the standard TV speakers..Easy to install and paired almost immediately with the soundbar and subwoofer.."},{"reviewerName":"David L.","rating":"4.0 out of 5 stars","reviewTitle":"Good for the Money!","reviewDate":"October 30, 2017","reviewText":"Easy to set up. Works fine with my Samsung 3.1 m550 sound bar. Don't expect lots of volume. It just adds a bit more than with just the Soundbar and subwoofer. Purchase a pair of adjustable-height stands that you can run the wires through and you'll be set."},{"reviewerName":"Dave N.","rating":"5.0 out of 5 stars","reviewTitle":"Small size, impressive sound.","reviewDate":"August 2, 2018","reviewText":"Purchased this add on to go with my M450 sound bar. Plug & Play installation and provides the added depth to music and movies. Doesn't blow you out of the room but perfect for my listening pleasure. Can't go wrong for the price. Follow instructions carefully and adjustments will be a brease. Just takes some getting used to like any new product. I would buy again and recommend to others."},{"reviewerName":"Cisco Kid","rating":"5.0 out of 5 stars","reviewTitle":"Best Sound System So Far!","reviewDate":"September 14, 2017","reviewText":"Has the HMDI hook up that is the best if your TV has the ARC input. Really great sound and you should pair it with the\nSamsung HW-M550 3.1 Channel 340 Watt Wireless rear speakers. Once things are all plugged in the entire system works together with it all coming online when the TV remote goes on/off. Brings movies to life with excellent surround sound!"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Easy install in Samsung system - at this price it's a no brainer!","reviewDate":"September 19, 2019","reviewText":"This was designed to work with a Samsung soundbar and was a quick install but when I first tested it I got no sound. I tried a few different programs on my cable box and nothing. Then it dawned on me to try a different program that I was certain had 5.1 surround and sure enough it was plenty loud and sounds great. There is plenty of volume and the sound is very good using Dolby settings. If you have a problem after setting it up, be sure that you are watching a source that has 5.1 surround and the speakers aren't connected to the wire insulation, instead of the wire. Also the speakers are very small and stylish so we just set them on some end tables and we're good to go!"},{"reviewerName":"jsarino","rating":"5.0 out of 5 stars","reviewTitle":"Good speaker system, if you get past the paper-thin Samsung support.","reviewDate":"April 25, 2018","reviewText":"InitiallyThe speakers work just OK with my soundbar. I've tried setting it up twice, but the sound coming out is softer than the soundbar. I then took advice from John R. Hanson's review and now it works properly. He was right, Samsung should've provided better instructions and support for this."},{"reviewerName":"John","rating":"3.0 out of 5 stars","reviewTitle":"A little quiet","reviewDate":"The manufacturer commented on the review below","reviewText":"These are a nice addition to the base unit. They do seem a little quiet, so don't expect a ton of crazy sound; but they do add to the overall sound. They were easy to setup and pair with the main soundbar. Keep in mind these are still wired from the speaker to the transmitter. The only wireless portion is the transmitter to the soundbar."},{"reviewerName":"Crowkiller21","rating":"4.0 out of 5 stars","reviewTitle":"Pairing is simple once you find the “mute” button","reviewDate":"September 14, 2018","reviewText":"I have the Samsung HW M550. I finally decided to get the rear speakers and O think they work very well. Pairing the units was initially difficult, as the instructions say to press the “mute” button on the soundbar remote down for several seconds. The remote does not have a stand-alone mute button. I discovered that pressing the volume button straight down serves as the mute function. Once I figured that out, pairing was simple. For the money, I don’t think you can get a better surround sound system. Very happy with my purchase."},{"reviewerName":"William Vaughn--Author, Mentor, Dad","rating":"2.0 out of 5 stars","reviewTitle":"Just Sad","reviewDate":"The manufacturer commented on the review below","reviewText":"These speakers are just sad. While I was able to figure out they were not really wireless (only the control box and amplifier connects wirelessly), I have been unable to get them to produce enough sound to hear. Now I'll have to find the time to interact with Samsung to figure out what's wrong. I'm not hopeful based on the other reviews."},{"reviewerName":"keith457","rating":"5.0 out of 5 stars","reviewTitle":"Nice addition to Samsun Soundbar","reviewDate":"October 25, 2019","reviewText":"Very impressive sound for the price. Already purchased a Samsung Harmon Kardon HW-Q6CR sound bar. I had read a review about the speaker connections and I have to agree: Be sure you do not push the wires too far into the rear of the speakers. Other than that one small issue, I am very please with the sound, DEFINITELY SURROUND."},{"reviewerName":"Joel F. Waxman","rating":"4.0 out of 5 stars","reviewTitle":"Works a lot better than I expected","reviewDate":"August 30, 2019","reviewText":"After reading some reviews that were very negative on Amazon, I decided to look for reviews somewhere else. Many were positive and a few negatives. I took a chance and purchased the setup. The speakers work real well, but the rear volume is a bit on the low side. All in all I am enjoying my purchase, it truly pops when watching movies."},{"reviewerName":"Robert A","rating":"1.0 out of 5 stars","reviewTitle":"Second Purchase - It WILL NOT LINK.","reviewDate":"December 20, 2017","reviewText":"I purchased this item twice, having just purchased a new Samsung 8 series UHD TV and a compatible Samsung HW-M450 Soundbar. This product is compatible with both devices, and the soundbar and this device have a completely common and exact means of connection with Bluetooth link. The first product would not link, even after many attempts, seeking answers on the Samsung web site, and speaking with a Samsung tech who was excellent. I purchased it a second time, only to feel dumb when it would not link, and being determined to make it work. Again, the Samsung tech worked very hard, called in help, and it WOULD NOT LINK. Check other reviews and the web for this device and you'll see that this is not an isolated fault. Amazon should give Samsung some notice to clean up their act on this product."},{"reviewerName":"Amazon Customer","rating":"4.0 out of 5 stars","reviewTitle":"A good upgrade to a samsung soundbar","reviewDate":"July 30, 2019","reviewText":"In terms of setting things up, it was really simple. The speaker's controller quickly connected to the soundbar and I was off and running. The one thing was the speaker cable for each speaker was a little short. Sure I could have spliced more cable in, so it's not that much of an issue in reality, but if you're planning on placing the controller box on one side of the room, you might have trouble reaching the opposing wall with the included wire. Sound quality is pretty great with the exception that you have to fiddle with the volume of the satellites via the soundbar remote. By default, they're a little quiet.\n\nOverall it was a worth it upgrade to my television watching experience."},{"reviewerName":"Kevin Cole","rating":"5.0 out of 5 stars","reviewTitle":"Works with Q60R and 70R Soundbars","reviewDate":"August 24, 2019","reviewText":"Yeah there are some cables, but all I care about is sound quality. And I cannot tell a difference between the soundbar and rear speakers. Also gaming is sweet, I can actually hear things wizz past my head or clanks of enemy's throughing/shooting along with floor creaking with accuracy. I imagine many low scores are due to connectivity, or discovering a...oh god, Cable! Gasp. However works excellently for me. So it won't initially sync with the directions. When you get to hitting the reset button, just press it once and dont hold. Then when changing the sound volume. Use settings button keep pressing. Once you get to rear level, use the directional pad up or down."},{"reviewerName":"Chris Graff","rating":"4.0 out of 5 stars","reviewTitle":"Good stuff","reviewDate":"July 13, 2017","reviewText":"I bought these to work with a samsung sound bar. They work really well, but I wish you could turn them down more and or adjust the volume per side. All in all I am happy with these and running the thin wires was cake. I was able to mount these in a sanus stand. It took a little effort but it works."},{"reviewerName":"Tom","rating":"4.0 out of 5 stars","reviewTitle":"Worth your consideration","reviewDate":"November 8, 2018","reviewText":"They are what you think they are, inexpensive speakers the work pretty well...just don't expect too much. I will say the Amazon worked with me as I purchased the wrong pair for my sub, but they accepted a return and even picked up the cost."},{"reviewerName":"Guggie212","rating":"5.0 out of 5 stars","reviewTitle":"Works great.","reviewDate":"July 29, 2017","reviewText":"Works great!! Took a few times to sync. Be patient if you can't get it to sync. Keep trying. It will eventually work."},{"reviewerName":"Edmond J. (Skip) O'Neill","rating":"5.0 out of 5 stars","reviewTitle":"For the price point excellent sound, But, ...","reviewDate":"May 3, 2019","reviewText":"You must purchase the OPTIONAL ($99) rear speakers unit (wireless with the soundbar, wired 2 rear speakers to remodel module). Settings: Surround (with optional rear speakers) , Standard, Movies, Voice, Sports, \"Clear (?)\". Bass and Treble Adjustable. Use and Optical cable rather that HDMI for audio for better sound."},{"reviewerName":"Martin Towery","rating":"1.0 out of 5 stars","reviewTitle":"Terrible, totally useless. Do not purchase","reviewDate":"The manufacturer commented on the review below","reviewText":"Terrible, terrible, terrible on all levels. I have a bluetooth soundbar and this product is absolutely useless. It will not pair with my Samsung soundbar at all. Very cheap and low quality. I'm shocked that Samsung would make such a poor quality product. Sending it back for a full refund. Do not buy this useless product"},{"reviewerName":"Andreá G Cassar","rating":"5.0 out of 5 stars","reviewTitle":"Amazing sound for the money!","reviewDate":"May 13, 2019","reviewText":"If you know how to follow instructions and want a great surround system to go with your sound bar then this is a great addition. I have it set up and it really makes you feel like your in a theater. I have the curved samsung 75 tv, the samsung sound bar with subwoofer and now this. Amazing all together."},{"reviewerName":"F. Avis","rating":"4.0 out of 5 stars","reviewTitle":"How to adjust volume","reviewDate":"February 19, 2019","reviewText":"The manual is horrible as there are no instructions on how to adjust the volume.\n\nTo adjust the volume of these speakers on a Samsung N550 push the settings (gear looking button) until the rear speakers on lights then push the settings button again and rear speaker level will show and then a number, then push up in the big round button to your desired level. That's it.\nJust a note, I have my n550 connected to a qled via bluetooth."},{"reviewerName":"Rick Jamie","rating":"4.0 out of 5 stars","reviewTitle":"revised review","reviewDate":"March 25, 2019","reviewText":"I will say I am disappointed in the sound quality... great TV's, terrible sound bars....The rear speakers are flat, or I'm just spoiled by Bose.... I also have a sound bar, also Samsung, which falls way flat compared to my Bose system....There is virtually no Sub woofer despite there being a sub..... epic fail Sam sung. I returned a set that was incompatible with my sound bar... surprise. the company was not a Prime purchase, so shipping back cost me 1/3 the price of the speakers... lesson learned.They did reach out and offer a $15 credit to another purchase which I declined... nice on their part to offer. 4 stars for the customer service, NOT the quality of the Samsung product."},{"reviewerName":"Glenn Davis","rating":"5.0 out of 5 stars","reviewTitle":"Very Nice Speakers","reviewDate":"November 2, 2019","reviewText":"Completes the surround system.\nPerfect with Samsung sound bar Q80R Instantly paired, a breeze to set up"},{"reviewerName":"DKE","rating":"4.0 out of 5 stars","reviewTitle":"Four Stars","reviewDate":"May 23, 2018","reviewText":"No problems with setup. Sound is very low."},{"reviewerName":"Paul P...","rating":"5.0 out of 5 stars","reviewTitle":"Easy setup great sound","reviewDate":"October 7, 2019","reviewText":"I had purchased the Samsung soundbar prior to getting the rear speakers the soundbar work great but I really wanted that surround sound. I'm very pleased with this purchase. I only had to reference the user's guide once to figure out how to pair the control box to the soundbar."},{"reviewerName":"Rita Morgan","rating":"5.0 out of 5 stars","reviewTitle":"Excellent quality of sound.","reviewDate":"November 4, 2019","reviewText":"Speakers are small but quality of sound is great. Didn’t work at first, but I had read the other reviews and one plug was pushed in too far. Pulled it out a bit and it worked great. Couldn’t be happier. Connected right away with my sound bar and woofer."},{"reviewerName":"Glen Appleton","rating":"4.0 out of 5 stars","reviewTitle":"Nice compliment for select Samsung soundbars to enhance the sound","reviewDate":"June 11, 2017","reviewText":"Not much to say other than they work very well as a rear speaker solution for the Samsung HW-M4500 curved soundbar. I've set up these with my soundbar in the master bedroom (yes, I wanted surround sound in the bedroom), and they add that extra dimension to the movies, shows, and music I watch in that room. The main reason I got these (and the soundbar) was because I play long-running sleep meditation music videos on YouTube on my smart TV at night so I wanted to be able to better fill the room with sound at lower volumes, and they work excellent in that capacity. I'm actually quite pleasantly surprised how many music videos on YouTube (meditation or otherwise) are mixed with surround sound capabilities, and some do it very well.\n\nPros:\n- Easy setup, only 2 wires from the wireless receiver to the speakers, and color coded\n- Wireless sync worked on the first try and has been solid since setup\n- Small speakers can be placed almost anywhere taking up very little space\n\nCons:\n- Low power: Had to crank up the rear speaker volume on the soundbar settings to max to balance the soundbar and rear speaker level, and the rear speakers are much closer to me, half the distance to my ears than the soundbar."},{"reviewerName":"Compa","rating":"5.0 out of 5 stars","reviewTitle":"Surround","reviewDate":"June 14, 2019","reviewText":"Sound quality was better than expected for the size of the speakers. This set up is wireless from your sound bar to the Wi-Fi receiver that is wired to each speaker. Surround sound performance is great! I would recommend this addition to your Samsung sound bar system."},{"reviewerName":"Gingerbread Turkey","rating":"5.0 out of 5 stars","reviewTitle":"Easy to setup, sounds awesome","reviewDate":"November 12, 2019","reviewText":"Added this to my Hw-n550, which isn't listed on here but it does work fine. Plugged it in, hit 2 buttons and it was linked and working. Great addition to my entertainment system. Samsung always delivers good products. It's all my wife and I buy."},{"reviewerName":"Michael Scott Cochrane","rating":"5.0 out of 5 stars","reviewTitle":"Love it! Easy to connect","reviewDate":"December 29, 2017","reviewText":"Wow. What a huge difference adding the rear speakers for true surround sound! Love it!\nEasy to connect."},{"reviewerName":"Mustafa Er","rating":"4.0 out of 5 stars","reviewTitle":"Four Stars","reviewDate":"December 16, 2017","reviewText":"Perfect sound once you get the hang of the adjustments which are not described in the manual. I'll advise you to refer to the questions and answers section of the product, if you want to fully enjoy these pretty smart loudspeakers. You can't adjust left and right speaker volumes separately. Manual is insufficient."},{"reviewerName":"Randy","rating":"3.0 out of 5 stars","reviewTitle":"They work but I can’t say it makes a difference.","reviewDate":"The manufacturer commented on the review below","reviewText":"They definitely work, I’m going to experiment with positioning but I really can’t tell they are working unless I get right on them. Maybe that is the point though :).\n\nOther than that pairing with my sound bar was incredibly simple and the receiver has pretty good range."},{"reviewerName":"Randy Sessions","rating":"5.0 out of 5 stars","reviewTitle":"Easy set up, great sound","reviewDate":"August 13, 2019","reviewText":"This was pretty much plug and play. I now have surround sound for my TV. We recently upgraded to a bigger, 4K TV and wanted upgraded sound. Bought just the sound bar and used it for a while but decided the surround was the way to go, and it was. Sound great."},{"reviewerName":"Zac W","rating":"5.0 out of 5 stars","reviewTitle":"adds rear speakers to the sound bar","reviewDate":"July 11, 2019","reviewText":"No noticeable lag on audio, I was able to wall mount the speakers with command strips. I had to put the subwoofer in search mode while this was in search mode as well to get the soundbar to detect and connect these speakers."},{"reviewerName":"chadusps","rating":"4.0 out of 5 stars","reviewTitle":"Sound quality","reviewDate":"December 1, 2018","reviewText":"The sound quality definitely takes some \"getting used to\". Works okay when watching TV but much better with music playing through the sound bar and new speakers.\n\nWhen putting the wires into the rear of the speakers, make sure it's only the part of the wire that has been stripped."},{"reviewerName":"Frank","rating":"5.0 out of 5 stars","reviewTitle":"Nice add on to my soundbar","reviewDate":"The manufacturer commented on the review below","reviewText":"Only wish they got a little louder. I think my hearing may be starting to go. lol"},{"reviewerName":"SBates","rating":"4.0 out of 5 stars","reviewTitle":"GOOD PRODUCT!","reviewDate":"September 29, 2017","reviewText":"You can tell the difference when you install this surround sound system to your current sound bar. You can really tell when you are watching a movie or playing a video game, GOOD PRODUCT!"},{"reviewerName":"DK","rating":"2.0 out of 5 stars","reviewTitle":"Very low sound","reviewDate":"The manufacturer commented on the review below","reviewText":"Finally, I successfully paired the rear speaker set with my Samsung soundbar N450 and got it to work. However, it was disappointed that the speaker sound was too low that you could barely hear it even the volume was set to max +6."},{"reviewerName":"G. Duncan","rating":"5.0 out of 5 stars","reviewTitle":"Adjust the sound level and enjoy","reviewDate":"August 22, 2019","reviewText":"Purchased this SWA-8500S rear speaker kit to pair with my HW-N650 Sound Bar for a full surround sound experience. It was easy to setup and I was very impressed with the sound quality. I would recommend others who are looking to enhance their sound quality for an affordable price to give it a try. From the factory, the sound level is set at zero for the two speakers. You will simply have to adjust the volume to 4+ depending on where in the room you decide to mount the speakers."},{"reviewerName":"Lost Nomad","rating":"4.0 out of 5 stars","reviewTitle":"Great Surround sound for under$100","reviewDate":"February 8, 2019","reviewText":"It works! Thanks to all the 5,4,3stars comments, I read them all before buying it and install it, and refer back to these very informative and helpful tips, I have it running perfectly. BTW, a housewife w no clue of how sounds systems supposed to work."},{"reviewerName":"Parker Frontier","rating":"5.0 out of 5 stars","reviewTitle":"Nifty little speakers, HUUUGE sound.","reviewDate":"August 18, 2019","reviewText":"I opened the package and thought, WTF? These babies are very small. But pairing with my soundbar was a breeze, and they put Godzilla in my living room, let me tell you. Very happy with this purchase."},{"reviewerName":"Parker","rating":"5.0 out of 5 stars","reviewTitle":"Complete Surround Sound & Pairing Tip","reviewDate":"December 8, 2018","reviewText":"The addition of these rear wireless speakers to my soundbar & subwoofer made a huge difference in the overall sound. These speakers add the crisp, higher range that the other components lack. I’d recommend these to complete a true home theater experience.\nPairing Tip:\nI had trouble pairing the speakers at first because of the “mute” instructions. If you cannot get them to pair with your sound bar, follow the instructions to use your TV remote (which has the “mute” function). Once l did this, the speakers paired immediately! Hopes this helps!"},{"reviewerName":"M. Titus","rating":"3.0 out of 5 stars","reviewTitle":"Does the job.","reviewDate":"The manufacturer commented on the review below","reviewText":"This is an average sound setup that does the job. If you are expecting high end sound this may not be your best choice. It is perfectly fine for our living room to upgrade the tv speakers."},{"reviewerName":"Bruce Wilfong","rating":"1.0 out of 5 stars","reviewTitle":"Samsung and I do not have the same definition of wireless","reviewDate":"The manufacturer commented on the review below","reviewText":"I had to return these because Samsung and I do not have the same definition of wireless. The speakers are NOT wire the receiver is wireless. This is fine if you are setting behind a couch or something, but across and open door way just didnt work for me."},{"reviewerName":"Jose Lopez","rating":"5.0 out of 5 stars","reviewTitle":"Raise the volume on your rear speakers","reviewDate":"February 1, 2019","reviewText":"Wow if you really take time and figure out how to adjust these they work great especially with HDMI plug into arc port on your TV."},{"reviewerName":"Luis Yepez","rating":"5.0 out of 5 stars","reviewTitle":"A must have if you have the Samsung HW-M360 Sound bar w Subwoofer","reviewDate":"April 15, 2019","reviewText":"I got these and oh boy , do they make a diference! excellent sound and movie theater experience right at home without the hasle of cables. Easy install, sync is perfect with the Samsung HW-M360.\n\nA must have!!"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"For people with patience and persistence who want great surround sound!","reviewDate":"November 6, 2019","reviewText":"Difficult to get everything paired up with each other but once it’s all connected, the sound quality is great. I have a samsung smart tv and the subwoofer and soundbar."},{"reviewerName":"Joseph C.","rating":"5.0 out of 5 stars","reviewTitle":"Works great","reviewDate":"February 24, 2019","reviewText":"I read other reviews where people were complaining about the sound. Not here, I actually had to lower the sound on the rear speakers down to a 2. I am using ( all Samsung) a 55 “tv, 650 sound bar and the swa 9000 surround speakers. Sounds great after sound lowered. No complaints on my end. Sounds better than the 5.1 setup I had before"},{"reviewerName":"Steven Meek","rating":"5.0 out of 5 stars","reviewTitle":"Compatible!!!","reviewDate":"August 1, 2019","reviewText":"Great item and seller fast shipping and exactly what I expected. The great thing was I bought the Samsung HW-Q80R soundbar with just the sub woofer (the set with the rear speakers was $400 more at Best Buy) and decided to try these speakers to augment my system with rear channels. Problem was (or so I thought) that nothing including on Samsung’s web site would say that these speakers would be compatible. Guess what, paired perfectly, sounds great and saved me a ton of $$$$. Very happy with this purchase!"},{"reviewerName":"Darren Tate","rating":"2.0 out of 5 stars","reviewTitle":"No power for a name brand","reviewDate":"The manufacturer commented on the review below","reviewText":"There is absolutely no power to this add on rear speaker set. It is actually inaudible most of the time. This is a true waste of money and Samsung should fined for this product."},{"reviewerName":"Steven T.","rating":"5.0 out of 5 stars","reviewTitle":"Paired easily with my soundbar","reviewDate":"June 28, 2017","reviewText":"Paired easily with my soundbar. One thing to keep in mind is that the inputs to the rear speakers need to be inserted in a certain way; one should not insert the cables too deeply into the inputs; the metalish ends of the cables need to be clamped by the speakers ports. I initially put in the cable too deep, so that the plastic was clamped down; once I moved the cable a bit out so that the metal was clamped, the speakers turned on.\n\nThe speakers are not super loud, but they work for my purposes nicely."},{"reviewerName":"Michael &Tulay C","rating":"4.0 out of 5 stars","reviewTitle":"Not quite what I expected","reviewDate":"March 2, 2019","reviewText":"These are very tiny speakers and not too great with volume or sound. They do ok, but no ribbons. Easy to install and hook up, but just a little disappointed in the sound quality. They work, but not that great."},{"reviewerName":"Kyle Severson","rating":"2.0 out of 5 stars","reviewTitle":"I can not recommend these speakers","reviewDate":"The manufacturer commented on the review below","reviewText":"Where to begin :(..\n\nBottom Line: I can not recommend these speakers, the subwoofer or the soundbar they go with.\n\nI am unsure if I have a faulty product, and I will coordinate with Samsung and update the result of this and adjust my stars as needed but here is why it is 2 stars. Anyone who has purchased a home theatre system has learned to hear sound all around them at all times, this system is different. It only activated the rear speakers when there is an actual sound effect that the system recognizes should activate them. Depending on what your watching you will hardly hear any sound from these speakers. It is cool when they work but that leads to the other issues:\n\n1. Constantly loses connection to the soundbar, when sitting down to play xbox1 or watch a movie I am getting up no less than an average of five times to re connect everything. And if it wasnt such a pain I wouldnt even mind, however I have to pause whatever im doing. Turn the soundbar off, access the wireless receiver (no problem for me it is next to my couch in the open, *keep this in mind if you wanted to hide this under or behind your couch*) and use needle nose tweezers to activate the button to reconnect the sound bar (hold down for 10 seconds). Than goto the subwoofer flip that upside down (not light, and gently) do it to that, then hold mute button on the soundbar controller (volume button pressed down) for another 10 seconds. Turn on the Soundbar and hope they both connect again, otherwise I have to restart that all over again.. I just did this 3x in the last 20 minutes as an example while playing xbox1 shadow of war, very upset which led me to here.\n\n2. The speakers didnt even work out of the box, I had the rear speakers +6 and never heard a peep, however I updated the firmware just released in November and it seems to fixed the issue. Now the only issue is they hardly ever activate and disconnect so often that I never know when they are connected until I hear a cool sound effect, or finally realize I haven't heard anything in a long time."},{"reviewerName":"M. B. Richards","rating":"2.0 out of 5 stars","reviewTitle":"Works as advertised, but VERY quiet compared to other ...","reviewDate":"The manufacturer commented on the review below","reviewText":"Works as advertised, but VERY quiet compared to other devices. Couldn't make myself return it because it does actually work, but it's so quiet, it might as well not. :-/"},{"reviewerName":"Isaac Allen","rating":"5.0 out of 5 stars","reviewTitle":"Good upgrade.","reviewDate":"October 23, 2019","reviewText":"Give a good edge over a soundbar alone. I paired them with my q70r soundbar. Quality isnt perfect but they are also tiny speakers. They only play the sound effects which i prefer."},{"reviewerName":"Robbin M. Couture","rating":"2.0 out of 5 stars","reviewTitle":"NOT","reviewDate":"The manufacturer commented on the review below","reviewText":"Unless you have those tiny speakers right behind your head you can't hear them. We had already put the screws in the wall so they just hang there."},{"reviewerName":"Brig","rating":"5.0 out of 5 stars","reviewTitle":"Great Sounding little speakers","reviewDate":"December 9, 2017","reviewText":"These are great speakers and they work perfect with the Samsung sound bar and woofer. Best deal I have found on a system under 500 dollars. The CD player sounds great through this sysetm also."},{"reviewerName":"Julian Lazaro","rating":"5.0 out of 5 stars","reviewTitle":"Yes","reviewDate":"November 3, 2019","reviewText":"Works with any bluetooth soundbar of the past couple years, compatible model list is way too short. Excellent sound must have."},{"reviewerName":"Stephen R. Shaffer","rating":"5.0 out of 5 stars","reviewTitle":"This completes your 5.1 surround sound bar","reviewDate":"October 9, 2019","reviewText":"It pairs well with my Samsung TV no trouble setting up with Bluetooth pick them up right away. It would be nice if there was a little bit more sound volume."},{"reviewerName":"The Doctor","rating":"3.0 out of 5 stars","reviewTitle":"Very Touchy","reviewDate":"The manufacturer commented on the review below","reviewText":"The wires have to be perfect in the little speakers for it to work, and if you move them a bit too much and the wires move then the sound dies and you have to find that sweet spot again"},{"reviewerName":"Rylee LaFreniere","rating":"2.0 out of 5 stars","reviewTitle":"So quiet it's almost not worth having them.","reviewDate":"The manufacturer commented on the review below","reviewText":"I set these up in our upstairs bonus room, slightly larger than a bedroom. I positioned the speakers on the walls behind/on either side of the couch located in the center of the room. Even after reading other reviews that indicated how the speaker volume can be turned all the way up, these speakers are way too quiet. Disappointed for sure. They might do alright if set up in a bedroom but in an average living room or bonus room, they don't cut it."},{"reviewerName":"Capricorn","rating":"1.0 out of 5 stars","reviewTitle":"It does not work and no option add more components.","reviewDate":"The manufacturer commented on the review below","reviewText":"The sound is not good and the option to connect more devices is none. It has only one HDMI connector at the back.\nThe product should have more HDMI connector to connect more devices."},{"reviewerName":"Jason Hunt","rating":"5.0 out of 5 stars","reviewTitle":"Great little speakers.","reviewDate":"October 25, 2017","reviewText":"Paired well with my Samsung receiver. I'm happy with my purchase. Amazon had the cheapest prices on the rear speakers."},{"reviewerName":"bullybreed","rating":"1.0 out of 5 stars","reviewTitle":"tried 2 different one neither worked","reviewDate":"The manufacturer commented on the review below","reviewText":"tried one did not work sent it back for replacement second one did not work either, would not pair with HW-J4000,"},{"reviewerName":"Karlito","rating":"3.0 out of 5 stars","reviewTitle":"Easy to install and connect to TV...Sound could be better!","reviewDate":"The manufacturer commented on the review below","reviewText":"These speakers are little bit light, even at full volume...But they do have a nice tone to them..It was a breeze to connect to the TV once the wifi was set up.."},{"reviewerName":"Frank C.","rating":"5.0 out of 5 stars","reviewTitle":"Samsung satellite speakers","reviewDate":"December 10, 2017","reviewText":"Pleasantly surprised how well they sound, had a little trouble getting it to sync to my HW - 450 but after some Google searches got it done. Definitely worth the money"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Don’t put the wires in too far!","reviewDate":"The manufacturer commented on the review below","reviewText":"Good for football games and movies. Not so much for regular tv. For the price it was a good addition. Not very loud. Figuring out how to turn it up took a lot of research. Hidden in the speaker bar menus."},{"reviewerName":"gillian","rating":"4.0 out of 5 stars","reviewTitle":"Great surround speakers, but with a catch...","reviewDate":"September 13, 2019","reviewText":"Great addition to your existing supported Samsung soundbar. Adds a more full surround experience with minimal clutter.\n\nThe only con, I would say, is definitely the fact that it's not fully wireless. The speakers are connected via cables to a wireless receiver box. The box is then connected wirelessly to the soundbar. The cables we received were only about 10ft in length as well."},{"reviewerName":"Scott L","rating":"5.0 out of 5 stars","reviewTitle":"A great addition to the Samsung Sound Bar","reviewDate":"April 17, 2018","reviewText":"This adds I nice dimension to the Samsung sound bar. I definitely recommend this. It isn't totally wireless. The sound bar connects to the receiver wirelessly, but then you do have to run speaker wire from the receiver to the speakers."},{"reviewerName":"K&amp;S","rating":"5.0 out of 5 stars","reviewTitle":"Easy addition and sounds great.","reviewDate":"March 25, 2019","reviewText":"Great add on. I love the surround sound effect it adds to my sound bar. Like others mentioned best sound quality is through the fiber optic audio connection."},{"reviewerName":"HilLay","rating":"4.0 out of 5 stars","reviewTitle":"Decent deal for the money","reviewDate":"February 25, 2019","reviewText":"They don’t sound too clear but they work just fine. Everytime I even slightly tap the right one the wires come out and yes I correctly put them in."},{"reviewerName":"Iron-groovitude","rating":"5.0 out of 5 stars","reviewTitle":"What you need for your Samsung Soundbar","reviewDate":"September 13, 2019","reviewText":"Super easy setup, linked to my soundbar in literally seconds. Switched the soundbar from standard to surround, a little adjustment on the bias to the rear speakers, and I couldn't be happier. But I may have to glue/screw some things in my room to prevent shaking/breaking. Good things."},{"reviewerName":"Leebar","rating":"3.0 out of 5 stars","reviewTitle":"Lack of sound quality","reviewDate":"The manufacturer commented on the review below","reviewText":"In my opinion, the surround speakers do not add any sound quality to soundbar and sub-woofer. The speakers also must be hung on a nail or screw. I'd like to see a stand available for mounting with adjustable height. I might consider returning these. The vendor sent the speakers without the power cord for Wi-fi unit but sent a replacement once I reported the lack of part."},{"reviewerName":"Clyde Thurman","rating":"5.0 out of 5 stars","reviewTitle":"GREAT Speakers","reviewDate":"July 16, 2019","reviewText":"These speakers are incredible and really added to the sound bar that I purchased. It's just a shame that my neighbors stole the speakers I originally ordered from Amazon and I had to buy them again the next day at Best Buy."},{"reviewerName":"Chelsea L.","rating":"4.0 out of 5 stars","reviewTitle":"Perfect addon!","reviewDate":"July 10, 2019","reviewText":"Very nice product added on to my Samsung Q6CR soundbar... mounted with wall mounts tilt and side to side. These speakers are great!\nSee turn the rear speakers up to 4 or 5. Personally 4 is perfect.\n\nHope you enjoy them! They have changed the experience from the old vizio 45\" 5.1 to this entire setup.\nAdded to a 65\" 7 series curved Samsung TV"},{"reviewerName":"Ben","rating":"5.0 out of 5 stars","reviewTitle":"Great Sound. Easy Install. Plug and Play.","reviewDate":"October 3, 2018","reviewText":"Easy Install. Great Product. Have used for a few months with movies, sports and music. Have in combination with soundbar and audio is phenomenal. I am not a sound perfectionist but for a average person looking for a great set up this is a must have if you already own the soundbar."},{"reviewerName":"Michael L. Prinzi, II","rating":"4.0 out of 5 stars","reviewTitle":"Hard to tell if they are working sometimes, but ...","reviewDate":"March 14, 2018","reviewText":"Hard to tell if they are working sometimes, but that might be a mounting issue, I have them on a shelf of the table behind my couch, so they are a bit hidden. Set up took a couple tries but once connected no issues since."},{"reviewerName":"Daniel Castanon","rating":"5.0 out of 5 stars","reviewTitle":"Great value!","reviewDate":"October 15, 2019","reviewText":"Does what it's meant to do. Mount at ear level or point towards where you'll be sitting."},{"reviewerName":"Fer R.","rating":"2.0 out of 5 stars","reviewTitle":"Not loud enough","reviewDate":"The manufacturer commented on the review below","reviewText":"I was expecting more sound out of these speakers, you have to have them close. These only work for a small room"},{"reviewerName":"A J.","rating":"3.0 out of 5 stars","reviewTitle":"No way to increase volume","reviewDate":"The manufacturer commented on the review below","reviewText":"Really disappointed in these speakers. I have read thru the instructions, googled everything and tried everything but there is no way to increase the volume on these speakers. If you can position them 8 inches away from each ear, you are ok but other that that, not good."},{"reviewerName":"Thomas Boyd","rating":"5.0 out of 5 stars","reviewTitle":"TERRIFIC PRODUCT but instructions not complete","reviewDate":"The manufacturer commented on the review below","reviewText":"Great product for the price. THANK YOU JOHN R. HANSON FOR HIS REVIEW ON JULY 28, 2017. WITHOUT IT, I WOULD HAVE RETURNED THESE BECAUSE OF NO SOUND, Follow his instructions and you will be able to control the volume on the rear speakers. NOTE THAT THE REAR SPEAKERS MAY ONLY WORK IF THE THE MEDIA IS 5.1. I have not had the product long enough to see if other media that is not in 5.1 mode will work. Regular TV will not."},{"reviewerName":"kiwi","rating":"4.0 out of 5 stars","reviewTitle":"Cool","reviewDate":"March 28, 2018","reviewText":"I received an excellent price on these speakers from Amazon. They did not make a huge difference with my surround sound. I wanted to complete the sound. They do help with like clapping in movies or other noises."},{"reviewerName":"Don","rating":"5.0 out of 5 stars","reviewTitle":"Great surround for watching movies or Netflix","reviewDate":"June 11, 2019","reviewText":"Bought these for my soundbar to use on Plex and Netflix. Works wonderful when there's surround sound for the content being watched."},{"reviewerName":"Chad","rating":"4.0 out of 5 stars","reviewTitle":"Complete surround sound","reviewDate":"November 29, 2018","reviewText":"The product completed my home theater system. Simple and compact. Read reviews here on the way to increase the rear speaker volume (in the soundbar settings after Treble, Bass, Rear Speaker On/OFF, Rear Speaker level). The surround sound is real and wires are hidden behind the couch. Great product."},{"reviewerName":"WR300","rating":"5.0 out of 5 stars","reviewTitle":"Worked perfect up & running in 5 minutes","reviewDate":"July 11, 2019","reviewText":"Sound is great makes a huge difference. I should not have waited so long hook up was easy.\nVery happy!"},{"reviewerName":"mega408","rating":"4.0 out of 5 stars","reviewTitle":"Not much value added","reviewDate":"August 5, 2019","reviewText":"I don’t think it adds much value to the sound experience. I think the sound bar was sufficient."},{"reviewerName":"shay margi","rating":"1.0 out of 5 stars","reviewTitle":"Don't work with HW-N650 European model soundbar.","reviewDate":"The manufacturer commented on the review below","reviewText":"I didn't know if there is a difference between this kit with the European kit but I have the European hw-n650 soundbar and this model doesn't want to sync with me model it just don't work and I didn't find anyone that can help or know how to sync them together."},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Great price and quality","reviewDate":"March 11, 2018","reviewText":"Love it. If they are compatible with your samsung soundbars then you will not be disappointed. Samsung customer service was amazing. Don't hesitate to use their chat system. Here are the list of recent compatible models from Samsung\nHW-M360,HW-M369, HW-M450 ,HW-M460 ,HW-M4500, HW-M4501, HW-M4510, HW-M4511,HW-M550, HW-M560"},{"reviewerName":"GentlemanLite","rating":"2.0 out of 5 stars","reviewTitle":"Waste of money, time and effort","reviewDate":"The manufacturer commented on the review below","reviewText":"Not even loud, very small, wires all over the floor. So disappointed"},{"reviewerName":"M. Love","rating":"5.0 out of 5 stars","reviewTitle":"Once you turn the volume up they work great.","reviewDate":"February 18, 2019","reviewText":"I had some issues with the volume at first but in end I googled it I was able to rectify it. They’d should have instructions for volume control."},{"reviewerName":"Joe calvitto","rating":"4.0 out of 5 stars","reviewTitle":"Not completely wireless but awesome speakers","reviewDate":"August 25, 2019","reviewText":"The speakers are great. They sound awesome. Setup was very easy. The only reason I give them a four stars because they are not completely wireless"},{"reviewerName":"russell robinson","rating":"5.0 out of 5 stars","reviewTitle":"Great sounding speakers. Hooked up well to my sound bar","reviewDate":"December 14, 2017","reviewText":"Great surround speakers to go with my Samsung sound bar/Subwoofer. Small speakers but put out great sound. Easy hookup"},{"reviewerName":"michael cook","rating":"4.0 out of 5 stars","reviewTitle":"Make sure it's compatible with your system and adjust your audio settings for max output.","reviewDate":"March 11, 2019","reviewText":"Good little addition to my 550 sound bar combo. Sound is what I expected from tiny satellite speakers. Pairing was no problem and once I adjusted the settings everything was good."},{"reviewerName":"tommy schaub","rating":"5.0 out of 5 stars","reviewTitle":"Great surround for the money","reviewDate":"August 20, 2019","reviewText":"Needed some surround sound speakers to complete my soundbar without breaking the bank"},{"reviewerName":"Mark Bruns","rating":"4.0 out of 5 stars","reviewTitle":"Works with most Samsung Soundbars","reviewDate":"February 24, 2019","reviewText":"I used this speaker set with my HW-N400 soundbar. It was easy to setup and adds ambience with movies and shows with a lot of music. The 9000 series will work as well, but has a larger speaker. So, for the price, I am happy with them. Don't expect them to be very loud."},{"reviewerName":"Sherry Eaton","rating":"5.0 out of 5 stars","reviewTitle":"They work good","reviewDate":"August 2, 2019","reviewText":"I got these to help drown out my neighbors base. I already had the sound bar. They are easy to put up and add to the bar. I ending up really enjoying the speakers."},{"reviewerName":"Wayne","rating":"1.0 out of 5 stars","reviewTitle":"Subpar Speakers","reviewDate":"The manufacturer commented on the review below","reviewText":"Where's the sound????? Even at the max volume they put out sub par sound!"},{"reviewerName":"Byron Herrera","rating":"5.0 out of 5 stars","reviewTitle":"Awesome Speakers","reviewDate":"January 18, 2019","reviewText":"These speakers made a big change to the sound quality of my sound system. It is very easy to install and is a great product."},{"reviewerName":"ricardo albaneze","rating":"5.0 out of 5 stars","reviewTitle":"220v compatible!","reviewDate":"January 24, 2018","reviewText":"works on 220v! Loved the speakers. Easy pairing with ms750."},{"reviewerName":"Chris B","rating":"5.0 out of 5 stars","reviewTitle":"HUGE sound from small speakers","reviewDate":"October 4, 2018","reviewText":"Hi, good product, Samsung confirmed was compatable with HWMM45C instructions for sound bar and rear speakers not enough to sync found info online. Turn off soundbar and press volume button down until it says id set. Blinking light should be steady then."},{"reviewerName":"Mr. Moe","rating":"5.0 out of 5 stars","reviewTitle":"Change input source on soundbar before pairing","reviewDate":"September 16, 2018","reviewText":"Really a wonderful addition to my setup. Had some trouble pairing them with the soundbar, but solved this by changing the input source to AUX before pairing (step 4 in setup manual)."},{"reviewerName":"Mitchell B.","rating":"5.0 out of 5 stars","reviewTitle":"Works great","reviewDate":"December 27, 2018","reviewText":"You need to by sound bar, I didn’t realize that until after so make sure you buy the correct sound bar for your tv."},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"GREAT SPEAKERS!","reviewDate":"September 17, 2018","reviewText":"Bought these to add to my Samsung HW-M450/ZA 2.1 Channel Soundbar purchased earlier this year; GREAT addition that completes the surround sound system. East install, funky pairing but all done and works great"},{"reviewerName":"Barbara McMillan","rating":"5.0 out of 5 stars","reviewTitle":"Sound system","reviewDate":"August 31, 2019","reviewText":"This system offers great sound and we are very happy with it!"},{"reviewerName":"YY","rating":"5.0 out of 5 stars","reviewTitle":"These are great speakers but make sure you have a way to mount them. I opted for speaker stands.","reviewDate":"May 11, 2019","reviewText":"Very easy to install if you have a Samsung setup. They make all the difference when you already have the sound bar and sub."},{"reviewerName":"Vito Pasquale","rating":"5.0 out of 5 stars","reviewTitle":"Excellent speaker system to make a sound bar bump up to 5.1","reviewDate":"August 13, 2018","reviewText":"The quality of the 2.0 speaker system (I'm using to expand the 3.1 speaker bar and sub-woofer to 5.1) is very good. If you have a recently new Samsung TV (2017 or later) you can have the sound bar system operate the 2.1 speakers well and adjust the volume level from -6 to +6 output."},{"reviewerName":"Toyotally","rating":"5.0 out of 5 stars","reviewTitle":"Perfect match with Samsung Sound bar / woofer","reviewDate":"December 3, 2018","reviewText":"I matched it with my Sound bar, blue tooth works flawlessly . Pairs up automatically when ever TV is turned on"},{"reviewerName":"MelRay","rating":"5.0 out of 5 stars","reviewTitle":"Seamless integration with Samsung sound-bar!","reviewDate":"January 5, 2019","reviewText":"Very easy integration with Samsung sound-bar. Must have item if you have or buying Samsung sound-bar."},{"reviewerName":"Mark Geremia","rating":"5.0 out of 5 stars","reviewTitle":"Work great . Nice buy","reviewDate":"The manufacturer commented on the review below","reviewText":"These speakers are excellent work fantastic with my soundbar . Easy to pair. Samsung also has great tech service if on the rear chance you need it."},{"reviewerName":"steve woods","rating":"5.0 out of 5 stars","reviewTitle":"Love these!","reviewDate":"February 27, 2018","reviewText":"Awesome addition to the m360 sound bar. Perfect volume and simple to set up."},{"reviewerName":"SW","rating":"5.0 out of 5 stars","reviewTitle":"Good product","reviewDate":"August 23, 2019","reviewText":"Great product for surround sound for good price"},{"reviewerName":"Peter","rating":"3.0 out of 5 stars","reviewTitle":"Good except for volume","reviewDate":"The manufacturer commented on the review below","reviewText":"Too low volume"},{"reviewerName":"Jason","rating":"4.0 out of 5 stars","reviewTitle":"Worth the add on","reviewDate":"May 4, 2019","reviewText":"Great sound but there is still wire running from speakers to bluetooth base"},{"reviewerName":"Juan B","rating":"5.0 out of 5 stars","reviewTitle":"Excellent compliment for my Samsung sound bar instantly upgrade to ...","reviewDate":"November 29, 2017","reviewText":"Excellent compliment for my Samsung sound bar instantly upgrade to 4.1 surround, easy to set it up, works well I am happy with this purchase and the price unbeatable!!!"},{"reviewerName":"J.S.R","rating":"4.0 out of 5 stars","reviewTitle":"Good for price.","reviewDate":"November 2, 2018","reviewText":"This product is useful and valuable for price.\nMore cheap than buy at korea.\nThat reason I bought it amazon."},{"reviewerName":"Jody Stepp","rating":"5.0 out of 5 stars","reviewTitle":"I needed this!","reviewDate":"December 24, 2018","reviewText":"This upgraded my Samsung 3.1 system to a 5.1 system and now I know what I've been missing!!"},{"reviewerName":"Benjamin A.","rating":"4.0 out of 5 stars","reviewTitle":"Okay but not wireless","reviewDate":"The manufacturer commented on the review below","reviewText":"SWA-8500 Lacked instructions, and are not wireless as advertised. Wireless from sound bar to console wired from there. Decent sound as long as you know how to adjust rear speaker volume."},{"reviewerName":"Tony M","rating":"5.0 out of 5 stars","reviewTitle":"Nice addition","reviewDate":"July 31, 2018","reviewText":"Nice add on to sound bar for rear speakers not real loud but still a nice set of speakers for surround sound effect"},{"reviewerName":"Steve Williams","rating":"5.0 out of 5 stars","reviewTitle":"Excellent sound, easy to set up","reviewDate":"September 4, 2018","reviewText":"Works flawlessly. Five minute setup. Adjusting the volume is straightforward -- it's hard to undersstand the negative reviews."},{"reviewerName":"pw-seattle","rating":"2.0 out of 5 stars","reviewTitle":"Frequently cuts out for a couple of seconds","reviewDate":"The manufacturer commented on the review below","reviewText":"The wireless connection is not consistent enough. The speakers frequently stop working at random for a few seconds."},{"reviewerName":"Kenneth J. Giljam","rating":"5.0 out of 5 stars","reviewTitle":"nice ad-on for Samsung sound bar","reviewDate":"September 13, 2019","reviewText":"very easy to install and completes sound \"around \""},{"reviewerName":"Dad C.","rating":"1.0 out of 5 stars","reviewTitle":"Defective","reviewDate":"The manufacturer commented on the review below","reviewText":"I got everything set where I wanted them to go, then all hell broke lose. I plugged in the Bluetooth receiver and it started smoking within a couple of minutes and now it won't turn on at all. I've reached out to customer service, but haven't heard back yet."},{"reviewerName":"Nathaniel Watty","rating":"3.0 out of 5 stars","reviewTitle":"Not a bad sound for a smaller room","reviewDate":"The manufacturer commented on the review below","reviewText":"Not a bad sound for a smaller room"},{"reviewerName":"chris logan","rating":"5.0 out of 5 stars","reviewTitle":"Works amazing!!","reviewDate":"November 12, 2019","reviewText":"Works amazing!!"},{"reviewerName":"GV Rogers","rating":"5.0 out of 5 stars","reviewTitle":"Bought to give our 3.1.2 system that added rear channel, LOVE IT!","reviewDate":"November 7, 2019","reviewText":"Easy set up, easy pairing, works like a champ"},{"reviewerName":"Country","rating":"5.0 out of 5 stars","reviewTitle":"Don't let the small size fool you!","reviewDate":"November 5, 2019","reviewText":"Big sound in a small package! Like most written instructions from other countries they could be better. I found the information I was looking for in customer reviews."},{"reviewerName":"Will","rating":"1.0 out of 5 stars","reviewTitle":"No Sound Level Control","reviewDate":"The manufacturer commented on the review below","reviewText":"No sound level control which means you have to be able to place the speakers at the exact location to attain the correct sound level. In some, probably most, this is difficult, inconvient or impossible to do."},{"reviewerName":"eric kral","rating":"5.0 out of 5 stars","reviewTitle":"A++","reviewDate":"November 6, 2019","reviewText":"sounds great"},{"reviewerName":"Ani","rating":"3.0 out of 5 stars","reviewTitle":"This item only shipswith a 110V cable. Requires 220-110V transformer","reviewDate":"The manufacturer commented on the review below","reviewText":"Advt should have clearly mentioned this only comes with a 110Vpin, so I would have ordered a 220-110V Step down transformer also. Now hunting for one in Kuwait so speakers not in use.\nLuckily I realized as soon as the speaker started to sputter, so disconnected until transformer purchase"},{"reviewerName":"Jon Lodestein","rating":"5.0 out of 5 stars","reviewTitle":"Speakers","reviewDate":"November 11, 2019","reviewText":"Easy setup"},{"reviewerName":"Tumkat89","rating":"5.0 out of 5 stars","reviewTitle":"Exactly as described","reviewDate":"October 19, 2019","reviewText":"Liked item"},{"reviewerName":"Michael D.","rating":"3.0 out of 5 stars","reviewTitle":"Not a good system","reviewDate":"The manufacturer commented on the review below","reviewText":"Expected a great system and got a fair system. Bass poor no power. I had an older Samsung TV took a lot of screwing round to get things to work."},{"reviewerName":"Kevin L","rating":"5.0 out of 5 stars","reviewTitle":"Seems good for a small room","reviewDate":"December 29, 2017","reviewText":"Connected with no problem to my HW-M360 sound bar. Seems good for a small room."},{"reviewerName":"Frank A","rating":"5.0 out of 5 stars","reviewTitle":"Defenitly worth the buy.","reviewDate":"January 28, 2018","reviewText":"Perfect addition to complete my entertainment system. Speakers are a little small and by default not too loud. So you definitely want to put up the volume in the settings."},{"reviewerName":"Cruseman","rating":"5.0 out of 5 stars","reviewTitle":"Great sound quality","reviewDate":"September 27, 2019","reviewText":"Great sound, hooking them up and syncing with the soundbar was easy. Getting the volume level to change was a bit confusing, but once finished they sound amazing. 10 of 10 would recommend. Yet another Samsung purchase I'm very pleased with."},{"reviewerName":"JEB","rating":"5.0 out of 5 stars","reviewTitle":"AWESOME SOUND FOR SUCH SMALL SPEAKERS.","reviewDate":"December 19, 2018","reviewText":"These are awesome. Connection was not that long tedious.\n\nI’d like to connect four of these to my HW-MS6500 curved speaker."},{"reviewerName":"Brad","rating":"5.0 out of 5 stars","reviewTitle":"Sounds great!","reviewDate":"July 9, 2019","reviewText":"Wait there’s a remote? Otherwise 5/5 stars!\nLove the extra sound!"},{"reviewerName":"Mihaela Stoia","rating":"5.0 out of 5 stars","reviewTitle":"Works great paired with the main system without issues","reviewDate":"January 27, 2018","reviewText":"Works great paired with the main system without issues. Wish it would have more options to control the volume for it but........ Happy didn't have to run wires to the back wall."},{"reviewerName":"Byron Frank","rating":"5.0 out of 5 stars","reviewTitle":"Wnat another unit","reviewDate":"May 10, 2019","reviewText":"Totally bluetooth compatable. I want another set. Great surround sound add on"},{"reviewerName":"Customer 101","rating":"5.0 out of 5 stars","reviewTitle":"Great","reviewDate":"November 1, 2019","reviewText":"Great"},{"reviewerName":"Robert Shuble","rating":"5.0 out of 5 stars","reviewTitle":"Great clear sound quality!","reviewDate":"May 12, 2019","reviewText":"Love this surround sound! Great product at a great price!"},{"reviewerName":"David M Olson","rating":"3.0 out of 5 stars","reviewTitle":"Not really wireless speakers.","reviewDate":"The manufacturer commented on the review below","reviewText":"Like: Easy to hook up to soundbar. Sounds Great\nDislike: Not really wireless speakers. Wireless receiver that needs wires to speakers."},{"reviewerName":"Todd Smithart","rating":"2.0 out of 5 stars","reviewTitle":"Overrated","reviewDate":"The manufacturer commented on the review below","reviewText":"Not very loud and no real adjustments for it. Needs to be more powerful. Quality of sound is still good if you turn it up super loud to hear it."},{"reviewerName":"David Alexandro Caceres","rating":"3.0 out of 5 stars","reviewTitle":"Good idea. Disappointing performance","reviewDate":"The manufacturer commented on the review below","reviewText":"Don't buy. Barely makes a difference"},{"reviewerName":"Mr. and Mrs. De La Cruz","rating":"1.0 out of 5 stars","reviewTitle":"Broke!","reviewDate":"The manufacturer commented on the review below","reviewText":"Broke after 3 mos. unable to return. Returning doesn’t show as an option. Do not buy them used!!"},{"reviewerName":"Michael L.","rating":"5.0 out of 5 stars","reviewTitle":"Good value","reviewDate":"February 6, 2019","reviewText":"All great, just wish the subwoofer would be more powerful"},{"reviewerName":"David Medina","rating":"4.0 out of 5 stars","reviewTitle":"Unknown adjustment to surround volume","reviewDate":"March 27, 2019","reviewText":"I haven’t been able to find a way to adjust the speakers volume. Although it sounds great, at times & during certain shows, I need to turn the volume up on the sound bar & surround to get the full affect. Once the volume is up, the sound quality is awesome!"},{"reviewerName":"Dillon C.","rating":"5.0 out of 5 stars","reviewTitle":"Samsung HW-M360/ZA 2.1 Soundbar + these = wireless 5.1 surround","reviewDate":"February 26, 2019","reviewText":"Easy to pair to the Samsung HW-M360/ZA 2.1 Soundbar. Wireless is very nice, no messy wires running back to the unit. Sound is great when you turn them up."},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Great buy","reviewDate":"August 18, 2019","reviewText":"GlD I bought it"},{"reviewerName":"Robert Park Ku","rating":"5.0 out of 5 stars","reviewTitle":"Awesome speaker!","reviewDate":"December 16, 2018","reviewText":"Really Awesome surround speaker.\nIt's wireless but never loose pairing yet. Sound good in this price range."},{"reviewerName":"Cathy R.","rating":"4.0 out of 5 stars","reviewTitle":"a little better","reviewDate":"August 16, 2018","reviewText":"like my full surround a little better but will do for now, does add to the sound bar sound."},{"reviewerName":"John","rating":"5.0 out of 5 stars","reviewTitle":"I recommend to anybody that would like to have some good good surround sound","reviewDate":"October 13, 2017","reviewText":"The Samsung surround bar is really lovely I like it a lot it gives me more movie theater in my man cave I highly recommend to anyone that's looking for something real soundable"},{"reviewerName":"C. Gerdes","rating":"5.0 out of 5 stars","reviewTitle":"worked as expected","reviewDate":"January 2, 2019","reviewText":"Very happy with the product, connected up without issue."},{"reviewerName":"Randy Alcorn","rating":"5.0 out of 5 stars","reviewTitle":"Sounds good pair up with my sound bar","reviewDate":"March 16, 2019","reviewText":"Sounds good pair up with my sound bar"},{"reviewerName":"Sky","rating":"1.0 out of 5 stars","reviewTitle":"Didn't work","reviewDate":"The manufacturer commented on the review below","reviewText":"Not wireless, and it couldn't get it to work"},{"reviewerName":"Rene da Costa Martins","rating":"5.0 out of 5 stars","reviewTitle":"Good product","reviewDate":"December 4, 2018","reviewText":"Fast shipping... good product... amazing sound..."},{"reviewerName":"Jonny Chaps","rating":"5.0 out of 5 stars","reviewTitle":"Fantastic","reviewDate":"July 9, 2019","reviewText":"Easy set up. You must read the other review about how to adjust the volume because these rear speakers have their own volume setting and they should definitely be bumped up to +3 or +4"},{"reviewerName":"Jay","rating":"3.0 out of 5 stars","reviewTitle":"0","reviewDate":"The manufacturer commented on the review below","reviewText":"Not loud enough"},{"reviewerName":"TRENT","rating":"5.0 out of 5 stars","reviewTitle":"Perfect","reviewDate":"The manufacturer commented on the review below","reviewText":"They are a perfect addition to the Samsung soundbar I have. Don't know how i live with out them."},{"reviewerName":"Steve Leege","rating":"4.0 out of 5 stars","reviewTitle":"So far - so good. With it had more volume output","reviewDate":"October 23, 2018","reviewText":"So far - so good. With it had more volume output level"},{"reviewerName":"Verdell Edmondson","rating":"5.0 out of 5 stars","reviewTitle":"Quality","reviewDate":"The manufacturer commented on the review below","reviewText":"Outstanding for sound quality and value. I would highly recommend."},{"reviewerName":"Reader","rating":"5.0 out of 5 stars","reviewTitle":"good product","reviewDate":"August 22, 2018","reviewText":"great product. I have no problem with it. It sounds good and laud."},{"reviewerName":"Yohany Arellano","rating":"5.0 out of 5 stars","reviewTitle":"Me gusta","reviewDate":"April 18, 2019","reviewText":"Es excelente lo recomiendo"},{"reviewerName":"Rahim Malaysia","rating":"5.0 out of 5 stars","reviewTitle":"good surround speaker for soundbar","reviewDate":"The manufacturer commented on the review below","reviewText":"Tested once after bought a step down transformer 240/110Vac 100W, since this set are US spec, these speaker is so small, so cute and compact, produce very good output, just require a single input power supply (110V), both speaker wire L & R connect directly to this module, paired it to my Samsung N650 soundbar, volume adjustment via soundbar remote."},{"reviewerName":"BigBacon","rating":"5.0 out of 5 stars","reviewTitle":"Sound great for a fair price.","reviewDate":"June 21, 2019","reviewText":"Having these paired with my soundbar at giving us full surround sound made such a big difference!"},{"reviewerName":"TDi","rating":"3.0 out of 5 stars","reviewTitle":"Had to return these as they would not connect to ...","reviewDate":"January 25, 2018","reviewText":"Had to return these as they would not connect to my sound bar. I needed the SWA-8000 for ,y sound bar. Live and learn."},{"reviewerName":"Callum","rating":"4.0 out of 5 stars","reviewTitle":"Setup Difficult","reviewDate":"July 25, 2019","reviewText":"A good addition to my sound bar. Good improvement to the sound. A nightmare to set up. I had to go back to the beginning by disconnecting and reconnecting the sound bar. Took about half an hour to get it working seamlessly. Worth the money and effort in the end"},{"reviewerName":"Anthony Esser","rating":"1.0 out of 5 stars","reviewTitle":"WIRELESS SURROUND SPEAKERS DO NOT SYNC WITH SOUNDBAR","reviewDate":"The manufacturer commented on the review below","reviewText":"Even with the help of Samsung technical service who made 8 attempts and over an hour on the phone, the product would not sync because the Samsung soundbar could not ID the surround speakers. A lot of time was wasted and the product was returned."},{"reviewerName":"Robert Shelton","rating":"5.0 out of 5 stars","reviewTitle":"Small in size - large in sound!","reviewDate":"November 16, 2018","reviewText":"Love the size of the bass box, sits nicely and out of the way under the bed. Speakers are so small that you can mount on the wall with removable velcro strips."},{"reviewerName":"Mose J.","rating":"4.0 out of 5 stars","reviewTitle":"Would highly recommend!","reviewDate":"February 22, 2019","reviewText":"Was everything I expected. Did not disappoint. Had no problem with setup. Best to Google and go to YouTube to find out what you need to know for the best setup. Would highly recommend."},{"reviewerName":"Phil P","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"August 12, 2017","reviewText":"Speakers were smaller than expected and easy to hide, produces great surround sound!"},{"reviewerName":"Madcat737","rating":"5.0 out of 5 stars","reviewTitle":"Very nice add on for my hw-450","reviewDate":"January 14, 2018","reviewText":"Very nice add on for my hw-450. These do not work with walmart version hw-45. Found that out the hard way"},{"reviewerName":"Greg Beauchamp","rating":"5.0 out of 5 stars","reviewTitle":"really nice rear system","reviewDate":"July 14, 2018","reviewText":"really nice rear system. It is set up in a very large great room in the kitchen with the main stereo system on the opposite wall in living room area. fills the space nicely"},{"reviewerName":"Claudia Weinstein","rating":"5.0 out of 5 stars","reviewTitle":"Great addition to my sound bar. Surround sound is complete!!","reviewDate":"The manufacturer commented on the review below","reviewText":"Excellent addition to my Samsung HW-M550 soundbar! Sound is great, and I installed it myself with no problems."},{"reviewerName":"Joseph Martin","rating":"5.0 out of 5 stars","reviewTitle":"Works great and doesn’t cost an arm and a leg.","reviewDate":"November 7, 2019","reviewText":"Base is easy to sync with my Samsung sound bar. The only way to improve it would be to have the speakers 🔊 blue tooth to eliminate the need for wires. Sounds great."},{"reviewerName":"Antonello Supino","rating":"1.0 out of 5 stars","reviewTitle":"volume too low and not adjustable, useless item","reviewDate":"The manufacturer commented on the review below","reviewText":"The volume of the back speaker is too low which makes me think it is defective, there is no way to regulate it (apart from the +6 regulation on the remote commander) which is clearly not enough.\nThis product is a waste of money, you won't hear any sound or nearly nothing from the back speakers."},{"reviewerName":"Amazon Müşterisi","rating":"5.0 out of 5 stars","reviewTitle":"Good add.","reviewDate":"September 3, 2019","reviewText":"Installed with Soundbar-HW-R650 / TK . This add-on speakers model wasn't available in my country but they're compatible and working good. Also you need to look up to manuals' instructions for the easy setup with soundbar's remote control."},{"reviewerName":"Mauricio Londono Londono","rating":"4.0 out of 5 stars","reviewTitle":"NEAT, NICE & NEW","reviewDate":"March 27, 2019","reviewText":"NICE PRODUCT FOR PRICE PAID."},{"reviewerName":"Prontopac","rating":"4.0 out of 5 stars","reviewTitle":"Almost perfect","reviewDate":"February 2, 2018","reviewText":"A very good product, which would be even better if it was possible to adjust the sound volume."},{"reviewerName":"misti","rating":"5.0 out of 5 stars","reviewTitle":"Great buy!","reviewDate":"October 4, 2019","reviewText":"I love the enhanced sound of my movie experience with this system. Works great!"},{"reviewerName":"Jesse","rating":"5.0 out of 5 stars","reviewTitle":"Best","reviewDate":"October 24, 2019","reviewText":"Best"},{"reviewerName":"We Are 1","rating":"3.0 out of 5 stars","reviewTitle":"If speaker wires are pushed in too far, speakers will not work!","reviewDate":"The manufacturer commented on the review below","reviewText":"Be careful...if speaker wires are pushed in too far, speakers will not work!??? Speakers sound great...but if they stop working or won't work...check on the depth of the wires pushed into the receticle on the speakers... That resolved my problem...and if you check out the Q&A above...you will see it's not uncommon."},{"reviewerName":"Scott B.","rating":"5.0 out of 5 stars","reviewTitle":"Great Value","reviewDate":"February 22, 2019","reviewText":"Great value for the money. Sound great in my den. have them hooked up to my samsung hw-n650 sound bar."},{"reviewerName":"Chad M.","rating":"3.0 out of 5 stars","reviewTitle":"Three Stars","reviewDate":"The manufacturer commented on the review below","reviewText":"Work okay. Wish they were louder. My current system doesn’t hvs volume adjustsmtn For them."},{"reviewerName":"Dianne","rating":"5.0 out of 5 stars","reviewTitle":"Sound awesome","reviewDate":"June 4, 2019","reviewText":"Sound is amazing."},{"reviewerName":"PWLS","rating":"5.0 out of 5 stars","reviewTitle":"Good sound","reviewDate":"January 10, 2019","reviewText":"Looks good and set easy"},{"reviewerName":"j","rating":"5.0 out of 5 stars","reviewTitle":"Pretty good","reviewDate":"May 4, 2019","reviewText":"I like it looks good for the price and serves purpose"},{"reviewerName":"J.T. CLARK","rating":"5.0 out of 5 stars","reviewTitle":"GREAT ITEM","reviewDate":"July 13, 2019","reviewText":"EASY INSTALL, LESS THAN 5 MINUTES"},{"reviewerName":"Gregory","rating":"5.0 out of 5 stars","reviewTitle":"👍🏻","reviewDate":"January 25, 2019","reviewText":"👍🏻"},{"reviewerName":"Craig Brown","rating":"3.0 out of 5 stars","reviewTitle":"Only OK","reviewDate":"The manufacturer commented on the review below","reviewText":"lack of rear volume, there ok\nfor sound bar sound .in a very large bedroom\nNothing like my big system .ONKYO SURROUND SOUND"},{"reviewerName":"Larry Karoll","rating":"5.0 out of 5 stars","reviewTitle":"Works nicely with my HW-MM45!","reviewDate":"February 1, 2019","reviewText":"Really fills out the sound. So glad I bought it!"},{"reviewerName":"Ludwigg","rating":"4.0 out of 5 stars","reviewTitle":"Needed upgrade for my soundbar.","reviewDate":"August 10, 2019","reviewText":"Realy helps with bringing a movie to life.\nEasy set up out of the box."},{"reviewerName":"edgar fernandez RD4619","rating":"5.0 out of 5 stars","reviewTitle":"Excelente","reviewDate":"December 24, 2018","reviewText":"Excelente no quejas."},{"reviewerName":"ruffryderrrrrrr","rating":"5.0 out of 5 stars","reviewTitle":"Great speakers for the price","reviewDate":"January 4, 2018","reviewText":"Great speakers for the price. Just make sure to turn up the sound of the rear speakers through the sound bar or they might sound to quiet... 5 Stars"},{"reviewerName":"vvi","rating":"2.0 out of 5 stars","reviewTitle":"not satisfied","reviewDate":"The manufacturer commented on the review below","reviewText":"couldn't differentiate the sound (with or without the speaker) as the speaker's volume is so weak. Insufficient manual. No guides in adjusting the volume. But did make it, through internet."},{"reviewerName":"Nadia Bolalek","rating":"1.0 out of 5 stars","reviewTitle":"Bought used would not pair with soundbar","reviewDate":"The manufacturer commented on the review below","reviewText":"Item did not pair with KH550 soundbar. Samsung said it was either a result of defective soundbar or rear speaker module. I purchased it used. Perhaps it was a defective item that had been returned."},{"reviewerName":"RnEw","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"April 13, 2018","reviewText":"Great sound, easy install and compliments my other Samsung products."},{"reviewerName":"Angel Rain","rating":"5.0 out of 5 stars","reviewTitle":"Perfect for my bedroom","reviewDate":"March 3, 2019","reviewText":"Shipped quickly and in good condition.\nI got these to go with the sound bar in my bedroom. So far I’m happy with the extra sound. Easy to set up and configure."},{"reviewerName":"Evangelos Iatridis","rating":"4.0 out of 5 stars","reviewTitle":"three stars","reviewDate":"December 18, 2018","reviewText":"ok"},{"reviewerName":"KATMAN","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"The manufacturer commented on the review below","reviewText":"a little tricky to hook up but sound great"},{"reviewerName":"Michael","rating":"5.0 out of 5 stars","reviewTitle":"Nice little speakers","reviewDate":"March 15, 2019","reviewText":"Work great. Sound great. Look awesome."},{"reviewerName":"Amazon Customer","rating":"3.0 out of 5 stars","reviewTitle":"Three Stars","reviewDate":"The manufacturer commented on the review below","reviewText":"I returned the product unused."},{"reviewerName":"Snowy","rating":"5.0 out of 5 stars","reviewTitle":"Works Great","reviewDate":"March 18, 2019","reviewText":"Really does enhance the sound system, if you can afford it. I would recomend"},{"reviewerName":"Matt","rating":"5.0 out of 5 stars","reviewTitle":"Works great","reviewDate":"May 8, 2019","reviewText":"Sounds great, pairs very easily to the sound bar."},{"reviewerName":"gail nicholas flowers","rating":"3.0 out of 5 stars","reviewTitle":"Its not very loud","reviewDate":"The manufacturer commented on the review below","reviewText":"The sound bar drowns them out unless you position them right next to you"},{"reviewerName":"Dr. Ronald G. Clark","rating":"5.0 out of 5 stars","reviewTitle":"First unpair the subwoofer of the soundbar system to which you are pairing these rear speakers!!!","reviewDate":"April 17, 2018","reviewText":"The system sounds great. It interacts with my Samsung HW-M550 Soundbar. At first it didn't work; but it was the fault of the Soundbar. I could not pair it with the Soundbar. The reason: the subwoofer of the soundbar system had already been linked with the sound bar. The Subwoofer must first be unpaired by depressing its reset button with a pin on the back of the subwoofer as shown in the instruction manual. I tried this several times but instead of a blinking blue light appearing, it remained constantly on. I returned the soundbar system to Best Buy; exchanged it for a new one; waited until I paired the SWA-8500 Rear Speaker System prior to pairing the Subwoofer."},{"reviewerName":"Paul","rating":"5.0 out of 5 stars","reviewTitle":"Nice speakers","reviewDate":"March 16, 2019","reviewText":"Great speakers...documentation was scarce, but worked well with my soundbar"},{"reviewerName":"brian arnold","rating":"5.0 out of 5 stars","reviewTitle":"Very easy to hookup and install.","reviewDate":"October 6, 2018","reviewText":"Excellent product linked to my soundbar right away. Good sound!!"},{"reviewerName":"Robert B Jones","rating":"4.0 out of 5 stars","reviewTitle":"Small","reviewDate":"December 5, 2018","reviewText":"Small"},{"reviewerName":"Fidencio","rating":"5.0 out of 5 stars","reviewTitle":"Sounds great!!!","reviewDate":"February 24, 2018","reviewText":"Awesome sounds & make it wonderful watching movies & shows!!"},{"reviewerName":"Carlos","rating":"4.0 out of 5 stars","reviewTitle":"Nice","reviewDate":"August 11, 2017","reviewText":"Paired super easy with the sound bar . Good for smaller living rooms or bedrooms in my opinion"},{"reviewerName":"Stugots","rating":"5.0 out of 5 stars","reviewTitle":"Great addition to Samsung sound bar.","reviewDate":"January 13, 2019","reviewText":"Great addition to Samsung sound bar. Easy to connect and small enough to put most anywhere."},{"reviewerName":"V.lara","rating":"5.0 out of 5 stars","reviewTitle":"Love it","reviewDate":"April 8, 2019","reviewText":"These are so small but def a great add-on to my Samsung sound bar ....makes a world of difference and sound amazing"},{"reviewerName":"Momma meems","rating":"5.0 out of 5 stars","reviewTitle":"Make sure it is compatible with your sound bar","reviewDate":"August 23, 2019","reviewText":"Great sound for the price!"},{"reviewerName":"Fidencio","rating":"5.0 out of 5 stars","reviewTitle":"Awesome sounds!!!!","reviewDate":"February 7, 2018","reviewText":"Makes my surround sound much better with thus Kit Nice!!"},{"reviewerName":"Nicole Reid","rating":"5.0 out of 5 stars","reviewTitle":"Just say yes","reviewDate":"March 6, 2019","reviewText":"Definitely worth the money spent. We love the sound quality and the set up was easy enough. No complaints."},{"reviewerName":"WILLIAM J. SHAW","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"January 9, 2018","reviewText":"Excellent product."},{"reviewerName":"Steve","rating":"5.0 out of 5 stars","reviewTitle":"Easy wireless set-up","reviewDate":"January 15, 2018","reviewText":"Super easy set-up with Samsung smart TV MU6300 and Samsung 3.1 sound bar M550. Long audio cables allow for speaker placement versatility."},{"reviewerName":"gregg ebersole","rating":"5.0 out of 5 stars","reviewTitle":"Pretty nice system","reviewDate":"The manufacturer commented on the review below","reviewText":"Sound quality isn't what I expected but all in all it's a good setup"},{"reviewerName":"Matt Buchanan","rating":"5.0 out of 5 stars","reviewTitle":"Great sound, easy setup","reviewDate":"March 10, 2018","reviewText":"Great quality, sound and looks. Easy setup."},{"reviewerName":"Nana C","rating":"5.0 out of 5 stars","reviewTitle":"Great rear speaker kit!","reviewDate":"April 2, 2018","reviewText":"This rear speaker kit pairs up perfectly with our Samsung soundbar and subwoofer. The sound in our large living area is very clear and close to movie sound! We are very happy with this product."},{"reviewerName":"ZOMMBIE","rating":"5.0 out of 5 stars","reviewTitle":"Great sound","reviewDate":"January 21, 2019","reviewText":"Great surround sound system. Can easily be hidden."},{"reviewerName":"JESUS","rating":"5.0 out of 5 stars","reviewTitle":"Good quality","reviewDate":"August 11, 2018","reviewText":"Sounds good"},{"reviewerName":"Scott","rating":"5.0 out of 5 stars","reviewTitle":"Amazing!!!","reviewDate":"May 6, 2018","reviewText":"Easy to install and pair with sound bar!!\nMy new system is stellar. My old system was from early 2000’s. I’m current and have such better current sound capabilities"},{"reviewerName":"Bishop360","rating":"5.0 out of 5 stars","reviewTitle":"Easy to pair!","reviewDate":"March 2, 2019","reviewText":"No problem pairing it up with my HWM430 soundbar. I just followed the directions and was paired in no time. Sound quality is great! You do have to turn on rear surround on the soundbar and adjust the volume for the rear speakers."},{"reviewerName":"Roger L Meyer","rating":"4.0 out of 5 stars","reviewTitle":"easy to pair","reviewDate":"May 25, 2018","reviewText":"very easy to pair with sound bar. also improves the overall sound of sound bar, highly recommend"},{"reviewerName":"DF","rating":"5.0 out of 5 stars","reviewTitle":"Money well spent","reviewDate":"November 18, 2018","reviewText":"Had to call Samsung to figure out how to link to my existing samsung soundbar which took about 10 mins. Excellent sound quality!!"},{"reviewerName":"Jose Garcia","rating":"5.0 out of 5 stars","reviewTitle":"Very important","reviewDate":"June 13, 2019","reviewText":"Like"},{"reviewerName":"Dietmar Werner","rating":"5.0 out of 5 stars","reviewTitle":"Sound verry good","reviewDate":"October 20, 2019","reviewText":"Verry good Dolby soround"},{"reviewerName":"PW","rating":"4.0 out of 5 stars","reviewTitle":"Four Stars","reviewDate":"July 18, 2018","reviewText":"Supports my system."},{"reviewerName":"john","rating":"5.0 out of 5 stars","reviewTitle":"WOW","reviewDate":"August 15, 2019","reviewText":"paired with the 340 watt 3.1 samsung bar i got a 5.1 system for 218$ renewed perfect codition"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Solid","reviewDate":"July 25, 2019","reviewText":"Love these. Easy to hook up and connect to my soundbar"},{"reviewerName":"Chris B.","rating":"5.0 out of 5 stars","reviewTitle":"Worth the money","reviewDate":"September 28, 2019","reviewText":"Great speakers overall, nothing to complain about at all."},{"reviewerName":"Sgtbuck989","rating":"5.0 out of 5 stars","reviewTitle":"Works good","reviewDate":"July 17, 2019","reviewText":"Works good"},{"reviewerName":"Recon junkie","rating":"2.0 out of 5 stars","reviewTitle":"Not loud","reviewDate":"The manufacturer commented on the review below","reviewText":"Low volume, difficult to turn up. The manual isn't helpful. I asked customer support to help me figure out how to turn up the volume on them and they couldn't give me an answer."},{"reviewerName":"The Disable One","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"June 7, 2018","reviewText":"works great"},{"reviewerName":"Mike A.","rating":"5.0 out of 5 stars","reviewTitle":"Complete Sound Experience","reviewDate":"June 9, 2017","reviewText":"Rear speakers complete the surround sound experience. Wireless connection could be better if wireless receiver was in each speaker to be completely wireless,"},{"reviewerName":"Michael Jersky","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"July 19, 2018","reviewText":"sounds great"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Good stuff","reviewDate":"October 4, 2018","reviewText":"Very good"},{"reviewerName":"MidwestLady","rating":"5.0 out of 5 stars","reviewTitle":"Great product.","reviewDate":"November 4, 2017","reviewText":"Great sound. Love it. Would buy it again."},{"reviewerName":"austin","rating":"4.0 out of 5 stars","reviewTitle":"Overall good product","reviewDate":"December 27, 2018","reviewText":"Great product the sound is not the loudest but it does the kid, very easy to set up only thing is the price seems to high for what you get"},{"reviewerName":"D J RAUGLAS","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"December 30, 2017","reviewText":"Great addition to my sound bar."},{"reviewerName":"Beau C.","rating":"4.0 out of 5 stars","reviewTitle":"Sounds good and easy to install","reviewDate":"June 14, 2019","reviewText":"Very easy to install and sounds pretty good."},{"reviewerName":"Dano","rating":"5.0 out of 5 stars","reviewTitle":"It is wired on the back wall","reviewDate":"December 4, 2018","reviewText":"Love it"},{"reviewerName":"Andrew Kaldas","rating":"5.0 out of 5 stars","reviewTitle":"Buy them.","reviewDate":"October 15, 2019","reviewText":"These are amazing."},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"February 22, 2018","reviewText":"Great Product"},{"reviewerName":"Ryoji Taniguchi","rating":"5.0 out of 5 stars","reviewTitle":"Good Sound","reviewDate":"October 28, 2019","reviewText":"Good"},{"reviewerName":"Mike Gover","rating":"5.0 out of 5 stars","reviewTitle":"Great addition to my home theater","reviewDate":"November 27, 2018","reviewText":"The setup for these speakers was simple, and they have worked beautifully since day one. They add so much to the television / movie watching experience!"},{"reviewerName":"Kenny Smith","rating":"5.0 out of 5 stars","reviewTitle":"Great sound and value","reviewDate":"October 14, 2017","reviewText":"Easy setup! Quick shipping great sound for price."},{"reviewerName":"Mark C.","rating":"2.0 out of 5 stars","reviewTitle":"Two Stars","reviewDate":"The manufacturer commented on the review below","reviewText":"Sounds Ok, but definitely lacking volume."},{"reviewerName":"ARdz","rating":"5.0 out of 5 stars","reviewTitle":"Perfect!","reviewDate":"The manufacturer commented on the review below","reviewText":"Excellent"},{"reviewerName":"Jason Brandolini","rating":"4.0 out of 5 stars","reviewTitle":"Easy set-up, easy use.","reviewDate":"July 26, 2019","reviewText":"Connect it and you're good to go!"},{"reviewerName":"Angel","rating":"5.0 out of 5 stars","reviewTitle":"Links by itself easily to the soundbar.","reviewDate":"April 6, 2019","reviewText":"Works great easy set up."},{"reviewerName":"Amazon Customer","rating":"1.0 out of 5 stars","reviewTitle":"Wanted completely Bluetooth, wire free!","reviewDate":"The manufacturer commented on the review below","reviewText":"It didn’t meet expectations on sound and I didn’t know the speakers are wired? I am returning it. HOwever my UPS pickup wont be until Monday"},{"reviewerName":"Bob","rating":"5.0 out of 5 stars","reviewTitle":"LOVE IT! Good value for the money.","reviewDate":"May 23, 2019","reviewText":"Love it! Setup was easy. Sounds great for my small living room and ordered another for the bedroom."},{"reviewerName":"SERGIO AGUIRRE SERRANO","rating":"5.0 out of 5 stars","reviewTitle":"Excelente producto","reviewDate":"December 31, 2018","reviewText":"El sonido mejoró sustancialmente, fácil conexión, excelente complemento para la barra de sonido.\nRecomendable 100%"},{"reviewerName":"Rene Velazquez","rating":"5.0 out of 5 stars","reviewTitle":"Great product","reviewDate":"February 3, 2019","reviewText":"The quality is awesome and you can install it in less than 5 mins. Always make sure to check that it is compatible with your Samsung sound bar model."},{"reviewerName":"Austyn Lankford","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"April 22, 2018","reviewText":"The sound is amazing"},{"reviewerName":"Justin","rating":"4.0 out of 5 stars","reviewTitle":"... they were slightly louder but they definitely added a good amount of sound to better submerse you","reviewDate":"The manufacturer commented on the review below","reviewText":"Wish they were slightly louder but they definitely added a good amount of sound to better submerse you."},{"reviewerName":"darin foster","rating":"1.0 out of 5 stars","reviewTitle":"Doesnt stay connected","reviewDate":"The manufacturer commented on the review below","reviewText":"Well it was all good but now my rear speakers have little if any connectivity ive tried rewiring with no help not too happy right now"},{"reviewerName":"JEH","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"October 14, 2017","reviewText":"Excellent sound system. Easy to install. Full surround system fills the room. Quality product."},{"reviewerName":"David Schornack","rating":"5.0 out of 5 stars","reviewTitle":"Good sound quality","reviewDate":"March 11, 2019","reviewText":"Works amazingly well and not too highly priced."},{"reviewerName":"Rick","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"March 20, 2018","reviewText":"Make all the difference in your movie experience. A must have !!!"},{"reviewerName":"Rubie Fausak","rating":"3.0 out of 5 stars","reviewTitle":"It may take a several tyres to connect","reviewDate":"The manufacturer commented on the review below","reviewText":"Wireless? No. Ad says it is.NO It may be senile wierless the speakers still have wire to wireless system."},{"reviewerName":"RAS","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"March 8, 2018","reviewText":"Easy set up. Great sound."},{"reviewerName":"JWash1","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"March 17, 2018","reviewText":"Excellent"},{"reviewerName":"Victor Kueh","rating":"5.0 out of 5 stars","reviewTitle":"Paired with hw-n650 soundbar.","reviewDate":"August 12, 2019","reviewText":"Easy pairing with hw-n650.soundbar, sound mode has to be set to standard in order to enjoy the proper 5.1 surround sound."},{"reviewerName":"Nevada","rating":"3.0 out of 5 stars","reviewTitle":"No volume control","reviewDate":"The manufacturer commented on the review below","reviewText":"Units are much smaller than I expected"},{"reviewerName":"Psycho","rating":"5.0 out of 5 stars","reviewTitle":"Work as promised","reviewDate":"March 25, 2018","reviewText":"Work very well in my office. Easy to set up."},{"reviewerName":"JULIO A. LONGO","rating":"4.0 out of 5 stars","reviewTitle":"Buen precio","reviewDate":"October 19, 2018","reviewText":"Funcion y se echa muy bie y sin alambre."},{"reviewerName":"Richard","rating":"5.0 out of 5 stars","reviewTitle":"Rear speaker","reviewDate":"June 9, 2019","reviewText":"Needed this to hear true surround sound."},{"reviewerName":"Ray","rating":"4.0 out of 5 stars","reviewTitle":"Quick setup","reviewDate":"November 6, 2018","reviewText":"Syncs very easy to the soundbar. PRO, quick setup/ CON, speakers are not very loud and need to be close to the people in the rear of the room."},{"reviewerName":"AJ","rating":"5.0 out of 5 stars","reviewTitle":"Great sound easy setup","reviewDate":"December 13, 2018","reviewText":"Came in factory packaging and appear to have been in-opened. Easy setup and sound really good. Set up currently with a Samsung HW-MM55C/ZA sound bar and sub."},{"reviewerName":"S S","rating":"2.0 out of 5 stars","reviewTitle":"The speaker wires are way to short product screams cheap ...","reviewDate":"The manufacturer commented on the review below","reviewText":"The speaker wires are way to short product screams cheap.Wire is so thin that trying to splice is not going to happen if the wire was longer I would keep them,i think they will be going back...."},{"reviewerName":"Mike M","rating":"5.0 out of 5 stars","reviewTitle":"Great sound","reviewDate":"October 30, 2019","reviewText":"Love the product. Great bass and surround sound."},{"reviewerName":"Arash","rating":"1.0 out of 5 stars","reviewTitle":"Good luck hearing anything","reviewDate":"The manufacturer commented on the review below","reviewText":"I can’t believe this is serious. These speakers probably cost $5 to make each. The housing of the speakers and antenna make up 98% of the cost of this unit, and the actual sound drivers are literally garbage. You will never notice actual sound coming from the back. It only plays subtle ambient noises that you would be very hard pressed to notice."},{"reviewerName":"Marie R.","rating":"5.0 out of 5 stars","reviewTitle":"Good sound quality","reviewDate":"June 17, 2019","reviewText":"All in all very good speakers."},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Great Deal","reviewDate":"March 28, 2019","reviewText":"Great speakers for the price. Paired with my N650 with ease."},{"reviewerName":"Media Mogul","rating":"5.0 out of 5 stars","reviewTitle":"Portable bluetooth surround sound with Dolby!!!","reviewDate":"September 4, 2017","reviewText":"Instant 4.1 surround sound with Dolby - works great. Paired with Samsung HW-M360/ZA 2.1 Channel 200 Watt Wireless Audio Soundbar. Almost as good as mush more expensive Polk 5.1 system."},{"reviewerName":"James Patrick","rating":"5.0 out of 5 stars","reviewTitle":"Awesome!","reviewDate":"October 2, 2019","reviewText":"Installed easy love them..."},{"reviewerName":"William","rating":"5.0 out of 5 stars","reviewTitle":"Sound great. Easy setup","reviewDate":"July 11, 2018","reviewText":"Exactly as descibed"},{"reviewerName":"larry","rating":"5.0 out of 5 stars","reviewTitle":"Price","reviewDate":"October 23, 2018","reviewText":"Sounds great"},{"reviewerName":"Johnny Edgett","rating":"3.0 out of 5 stars","reviewTitle":"Not Truly Wireless","reviewDate":"The manufacturer commented on the review below","reviewText":"The receiver is wireless, not the speakers. Sound is low and just okay. Not great."},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"March 18, 2018","reviewText":"Nice speakers, works seamlessly with the matching soundbar."},{"reviewerName":"Douglas B. Davis","rating":"5.0 out of 5 stars","reviewTitle":"Good","reviewDate":"January 12, 2019","reviewText":"Easy to set up and sounds good."},{"reviewerName":"Steve","rating":"5.0 out of 5 stars","reviewTitle":"very small speakers but good for a decent size room.","reviewDate":"November 9, 2019","reviewText":"pretty nice little system"},{"reviewerName":"john schaller","rating":"1.0 out of 5 stars","reviewTitle":"One Star","reviewDate":"The manufacturer commented on the review below","reviewText":"not loud enough"},{"reviewerName":"John Flanagan","rating":"1.0 out of 5 stars","reviewTitle":"This doesn't work","reviewDate":"The manufacturer commented on the review below","reviewText":"Do not buy this !!!!! It sucks barley can hear them Samsung customer support says only for action movies like gun shots"},{"reviewerName":"Arthur A Lesser","rating":"5.0 out of 5 stars","reviewTitle":"Added effective Surround Sound to my 4k TV","reviewDate":"July 3, 2019","reviewText":"Great Sound = Modest Price"},{"reviewerName":"David D","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"March 26, 2018","reviewText":"very happy excellent fit and sound would recommend purchase to everyone"},{"reviewerName":"biju","rating":"1.0 out of 5 stars","reviewTitle":"Pairing with HW K 500","reviewDate":"The manufacturer commented on the review below","reviewText":"Product was not connecting to hw k 500 soundbar so I made a return request asuming damaged product"},{"reviewerName":"Cameljoe691","rating":"3.0 out of 5 stars","reviewTitle":"Three Stars","reviewDate":"The manufacturer commented on the review below","reviewText":"Low sound but works ."},{"reviewerName":"Matthew James","rating":"1.0 out of 5 stars","reviewTitle":"Volume too low","reviewDate":"The manufacturer commented on the review below","reviewText":"As others have said, the volume is way too low. I have the speakers about two feet from me and not behind me. I still can barely hear. They do pick up a bit of volume if what I am watching is 5.1 but still too low for real enjoyment. This is sad because the soundbar is amazing! Because repacking and shipping back is such a hassle I am keeping them, one of the disadvantages of online ordering."},{"reviewerName":"Jessop Marchbanks","rating":"2.0 out of 5 stars","reviewTitle":"My surround speakers won’t pair up to the new designated ...","reviewDate":"The manufacturer commented on the review below","reviewText":"My surround speakers won’t pair up to the new designated matched sound bar I got. Therefore I can’t give a proper review as they won’t pair no matter all the trouble shooting steps I take."},{"reviewerName":"Reido","rating":"4.0 out of 5 stars","reviewTitle":"This speaker set-up does exactly what it's advertised too do ...","reviewDate":"March 10, 2018","reviewText":"This speaker set-up does exactly what it's advertised too do; provide rear surround sound. Cordless feature is very convenient."},{"reviewerName":"Ryan","rating":"5.0 out of 5 stars","reviewTitle":"Easy to hook up and sync with subwoofer unit","reviewDate":"March 27, 2019","reviewText":"Showed up undamaged and everything was there and it works great"},{"reviewerName":"Tony","rating":"5.0 out of 5 stars","reviewTitle":"Very nice rear speaker","reviewDate":"March 19, 2018","reviewText":"Love it"},{"reviewerName":"Felix Rosa","rating":"4.0 out of 5 stars","reviewTitle":"Bueno pero esperaba mas","reviewDate":"June 11, 2019","reviewText":"Esperaba un sonido mas potente"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"July 26, 2017","reviewText":"great sound, great product"},{"reviewerName":"Greg Foltz","rating":"4.0 out of 5 stars","reviewTitle":"Met my expectations.","reviewDate":"December 29, 2018","reviewText":"Decent sound quality. About what I expected at this price range."},{"reviewerName":"Joseph A. Poquette","rating":"4.0 out of 5 stars","reviewTitle":"Great for the home entertainment room.","reviewDate":"August 23, 2017","reviewText":"Great for the home entertainment room. Working well in a newly finished basement. Love the sound."},{"reviewerName":"Simon","rating":"5.0 out of 5 stars","reviewTitle":"Worth the upgrade!","reviewDate":"July 31, 2019","reviewText":"Works well with my N650. it makes the surround sound more Immersive."},{"reviewerName":"Jeffrey Fisher","rating":"5.0 out of 5 stars","reviewTitle":"Works","reviewDate":"May 3, 2019","reviewText":"Did what was advised"},{"reviewerName":"Bennett Schwarzmann","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"February 22, 2018","reviewText":"Works great!"},{"reviewerName":"Rana Mahmood","rating":"5.0 out of 5 stars","reviewTitle":"Quality","reviewDate":"September 25, 2019","reviewText":"Great sound"},{"reviewerName":"Benaroundtheblock","rating":"3.0 out of 5 stars","reviewTitle":"good sound quality","reviewDate":"February 18, 2018","reviewText":"Good sound Quality, speakers are wired to rear receiver"},{"reviewerName":"Elizabeth Z.","rating":"1.0 out of 5 stars","reviewTitle":"FALSE ADVERTISEMENT","reviewDate":"The manufacturer commented on the review below","reviewText":"False advertisement as speakers are NOT wireless"},{"reviewerName":"Maurice Howard","rating":"5.0 out of 5 stars","reviewTitle":"Great sound and easy to install.","reviewDate":"February 5, 2019","reviewText":"Great product and great quality."},{"reviewerName":"Justin","rating":"5.0 out of 5 stars","reviewTitle":"Good quality","reviewDate":"April 29, 2019","reviewText":"If you order the optional rear Bluetooth speakers it improves the sound greatly."},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Great addition to my soundbar.","reviewDate":"July 3, 2018","reviewText":"Quick install. I got the soundbar and sub. Added th his to make a great sounding surround sound system."},{"reviewerName":"G. Natalya","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"July 23, 2018","reviewText":"Great speaker set! Easy to install."},{"reviewerName":"george blakely","rating":"3.0 out of 5 stars","reviewTitle":"Soft on volume , but makes a world of difference","reviewDate":"The manufacturer commented on the review below","reviewText":"Used in small apartment, would not work in larger space"},{"reviewerName":"GUZMAN","rating":"5.0 out of 5 stars","reviewTitle":"excelent","reviewDate":"September 20, 2019","reviewText":"very good"},{"reviewerName":"Todd","rating":"5.0 out of 5 stars","reviewTitle":"Love ‘em","reviewDate":"March 4, 2018","reviewText":"I don’t understand all the negative reviews. Do your homework and don’t let technology challenge you too much. Great addition to our sound bar and sub."},{"reviewerName":"Martin Family","rating":"1.0 out of 5 stars","reviewTitle":"NOT wireless","reviewDate":"The manufacturer commented on the review below","reviewText":"The speakers are not wireless as noted in the description"},{"reviewerName":"Michael J Curry","rating":"5.0 out of 5 stars","reviewTitle":"Great product for a great price","reviewDate":"August 14, 2018","reviewText":"Great product for the price, easy installation. Bluetooth sync is very user friendly."},{"reviewerName":"Tomas Cain","rating":"5.0 out of 5 stars","reviewTitle":"It good for sounds","reviewDate":"August 29, 2018","reviewText":"It good for sounds"},{"reviewerName":"TAI CHIU LIU","rating":"5.0 out of 5 stars","reviewTitle":"add more depth to my samsung n650","reviewDate":"April 15, 2019","reviewText":"true surround sound experience with this new edition"},{"reviewerName":"Joshua herheim","rating":"5.0 out of 5 stars","reviewTitle":"Absolutely amazing","reviewDate":"October 11, 2019","reviewText":"Yes"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Very good","reviewDate":"June 21, 2019","reviewText":"Very good"},{"reviewerName":"Abdulrahmanmadouh","rating":"1.0 out of 5 stars","reviewTitle":"not clear","reviewDate":"The manufacturer commented on the review below","reviewText":"the sound not clear with q70r"},{"reviewerName":"Khair Barhouma","rating":"5.0 out of 5 stars","reviewTitle":"Best quality","reviewDate":"November 10, 2019","reviewText":"It’s worth it"},{"reviewerName":"Tommy Cruz","rating":"5.0 out of 5 stars","reviewTitle":"Sounds great. Good addition to sound bar.","reviewDate":"April 16, 2019","reviewText":"Added to soundbar."},{"reviewerName":"Balaj","rating":"1.0 out of 5 stars","reviewTitle":"One Star","reviewDate":"The manufacturer commented on the review below","reviewText":"Do no y buy use does not work"},{"reviewerName":"ZAC","rating":"5.0 out of 5 stars","reviewTitle":"Great product, The sound is great and the range ...","reviewDate":"May 24, 2018","reviewText":"Great product, The sound is great and the range is great. I was moving my Samsung sound bar and sub into a different room for a few days for music but would leave these in the other room and they would keep playing and they were loud enough to fill that room with sound as well.\n\nI will say this I sometimes forget they are there until at 2 AM and the movie has sound come from your back left and all you hear is a child laughing behind you..."},{"reviewerName":"Nuri Acar","rating":"5.0 out of 5 stars","reviewTitle":"Great Enhancement, 220-240V AC Suported!","reviewDate":"August 8, 2018","reviewText":"Even though the label on the item says 110-120 Volt input, this kit definitely works great on 220-240V AC."},{"reviewerName":"Jambor Iuliu","rating":"5.0 out of 5 stars","reviewTitle":"The best !!","reviewDate":"October 16, 2019","reviewText":"👍👍👍👍👍"},{"reviewerName":"Cristobal J","rating":"5.0 out of 5 stars","reviewTitle":"Buen producto","reviewDate":"November 3, 2019","reviewText":"Me agradó"},{"reviewerName":"Mr D W Green","rating":"5.0 out of 5 stars","reviewTitle":"Does what it says on the packet","reviewDate":"September 20, 2019","reviewText":"Brilliant"},{"reviewerName":"willowman","rating":"4.0 out of 5 stars","reviewTitle":"good quality good sound for the size of the speakers","reviewDate":"March 30, 2019","reviewText":"nicely curved to fit the t.v, small and obtrusive"},{"reviewerName":"Chen King Wei","rating":"5.0 out of 5 stars","reviewTitle":"excellent","reviewDate":"June 18, 2019","reviewText":"Item deliver in good condition"},{"reviewerName":"ARTEM VICHURIN","rating":"1.0 out of 5 stars","reviewTitle":"To quiet sound","reviewDate":"The manufacturer commented on the review below","reviewText":"To quiet"},{"reviewerName":"Steve","rating":"1.0 out of 5 stars","reviewTitle":"Speaker volume unimpressive, seller is sketchy...","reviewDate":"The manufacturer commented on the review below","reviewText":"These surround speakers are too quiet compared to the sound bar and yes I have the rear speakers powered up as much as possible. But even more annoying/disturbing is that the vendor (Video & Audio Center) is selling/pricing these as new and they were definitely opened. Box was open, speakers had been removed, bags opened. Beware off this seller."},{"reviewerName":"John Hefley","rating":"5.0 out of 5 stars","reviewTitle":"Matches well with 2.1 sound bar!","reviewDate":"December 8, 2017","reviewText":"NICE!"},{"reviewerName":"Cristian","rating":"5.0 out of 5 stars","reviewTitle":"Satisfecho","reviewDate":"August 7, 2019","reviewText":"Buen producto"},{"reviewerName":"Travel Card","rating":"5.0 out of 5 stars","reviewTitle":"Completes the system! Is a must","reviewDate":"February 25, 2019","reviewText":"Worth it"},{"reviewerName":"Keunwoo","rating":"5.0 out of 5 stars","reviewTitle":"small speaker","reviewDate":"August 24, 2019","reviewText":"Good!!"},{"reviewerName":"Kristian","rating":"5.0 out of 5 stars","reviewTitle":"👍🏽👍🏽","reviewDate":"December 4, 2018","reviewText":"Sound Great!"},{"reviewerName":"zach","rating":"5.0 out of 5 stars","reviewTitle":"Dope.","reviewDate":"June 13, 2018","reviewText":"Great price - great sound for these rear speakers."},{"reviewerName":"Kevin","rating":"1.0 out of 5 stars","reviewTitle":"One Star","reviewDate":"The manufacturer commented on the review below","reviewText":"CANT HEAR THEM !! GOING TO RETURN THEM NOT WORTH THE MONEY"},{"reviewerName":"CWT3","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"February 26, 2018","reviewText":"Great value !"},{"reviewerName":"Ricky","rating":"5.0 out of 5 stars","reviewTitle":"Functions as advertised","reviewDate":"September 11, 2018","reviewText":"Works perfectly with Samsung HW-M360 soundbar."},{"reviewerName":"ramon alfonso","rating":"1.0 out of 5 stars","reviewTitle":"Compatible","reviewDate":"October 24, 2018","reviewText":"No es compatible con la barra k360 k"},{"reviewerName":"Joshua","rating":"4.0 out of 5 stars","reviewTitle":"Easy hook up","reviewDate":"May 19, 2019","reviewText":"They work"},{"reviewerName":"hannor01","rating":"5.0 out of 5 stars","reviewTitle":"easy to install","reviewDate":"March 13, 2019","reviewText":"I use it with HW-N660"},{"reviewerName":"Dan Olivier","rating":"5.0 out of 5 stars","reviewTitle":"Very good","reviewDate":"January 21, 2019","reviewText":"Wonderful thank you very much"},{"reviewerName":"mark turner","rating":"4.0 out of 5 stars","reviewTitle":"Now you can have Easy surround sound","reviewDate":"December 27, 2018","reviewText":"So far everything is going well."},{"reviewerName":"Arpit Agarwal","rating":"3.0 out of 5 stars","reviewTitle":"Not Great","reviewDate":"The manufacturer commented on the review below","reviewText":"Its just ok. Sound from these are really low."},{"reviewerName":"Gary","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"September 20, 2017","reviewText":"Works great"},{"reviewerName":"Louise Nicholls","rating":"5.0 out of 5 stars","reviewTitle":"Sounds","reviewDate":"October 1, 2018","reviewText":"Finished off the whole system."},{"reviewerName":"alan fisher","rating":"3.0 out of 5 stars","reviewTitle":"Cannot increase volume on rear speakers","reviewDate":"February 9, 2018","reviewText":"Speakers stopped working after 2 weeks.no sound from them.now dismantled.dissapointed is the word."},{"reviewerName":"francis","rating":"5.0 out of 5 stars","reviewTitle":"alwsome","reviewDate":"January 30, 2019","reviewText":"great beal"},{"reviewerName":"Don Walter","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"April 2, 2018","reviewText":"Easy to install and hood sound"},{"reviewerName":"Oscar Quintero","rating":"5.0 out of 5 stars","reviewTitle":"perfect","reviewDate":"November 10, 2018","reviewText":"perfect"},{"reviewerName":"hanna marie","rating":"4.0 out of 5 stars","reviewTitle":"Easy to install.","reviewDate":"June 25, 2018","reviewText":"Easy to install."},{"reviewerName":"Doney Hernandez","rating":"5.0 out of 5 stars","reviewTitle":"Perfect!!!","reviewDate":"November 19, 2018","reviewText":"Perfect!!!"},{"reviewerName":"Jang jin young","rating":"5.0 out of 5 stars","reviewTitle":"Good","reviewDate":"November 26, 2018","reviewText":"Good"},{"reviewerName":"Angel","rating":"2.0 out of 5 stars","reviewTitle":"Two Stars","reviewDate":"The manufacturer commented on the review below","reviewText":"Nothing to gloat about. Can barely tell I have additional speakers."},{"reviewerName":"Bruce D","rating":"5.0 out of 5 stars","reviewTitle":"Like many of us","reviewDate":"February 9, 2018","reviewText":"Like many of us, I've had the elaborate (and expensive) home theater set up. New house and not as interested in diving back into audiophile mode. Bought the Samsung sound bar with the sub first and was happy with it for what it is at the price point. The rear speaker kit was a Christmas gift to myself and I've been pleased. Set up was super easy and the performance good. The kit adds enjoyment to everything I watch."},{"reviewerName":"mark yankovich","rating":"1.0 out of 5 stars","reviewTitle":"One Star","reviewDate":"The manufacturer commented on the review below","reviewText":"Didnt work with sound bar as advertised"},{"reviewerName":"Arthur Kydd","rating":"4.0 out of 5 stars","reviewTitle":"Good price","reviewDate":"March 19, 2018","reviewText":"Great sound"},{"reviewerName":"Paolo Herrera","rating":"5.0 out of 5 stars","reviewTitle":"Great","reviewDate":"July 3, 2018","reviewText":"Great work."},{"reviewerName":"David Klein","rating":"1.0 out of 5 stars","reviewTitle":"Didn't work - Helpdesk unable to solve the issue.","reviewDate":"The manufacturer commented on the review below","reviewText":"I bought all brand new Samsung components. Brand new TV and Sound Bar. Went on the Samsung website to find out what was compatible with my system and this was what was recommended. Plugged it all in....sound only came out of one side. Called Samsung helpdesk....spent about an hour diagnosing the situation...which turned out to just be the part that validated if I was eligible for free customer service....I had to read the serial number off the speakers......They said they would call back in the next 24 hours and to be ready to troubleshoot....LOL like I am going to wait in front of my TV for 24 hours waiting for there call. Tried all kinds of troubleshooting and searching online. Seems the product is fairly new so not much info. I returned it...>Samsung never called back."},{"reviewerName":"stp","rating":"5.0 out of 5 stars","reviewTitle":"They work great. Now I get 5","reviewDate":"September 20, 2017","reviewText":"They work great. Now I get 5.1 sound. You need to take all reviews with a grain of salt. I think that many people do not understand how surround sound works. Like many other things..lol"},{"reviewerName":"Allen Lolz","rating":"5.0 out of 5 stars","reviewTitle":"CONNECTION and SOUNDBARS","reviewDate":"The manufacturer commented on the review below","reviewText":"Guys, just for the record, this can pair with any soundbar, I got it for my HW-MS4550, just make sure that the plastic don't touch the back clamps, just the wire, and just link it up, it should be already blinking for ID set. If it is, Hold mute while the soundbar is off the and turn up the speakers by pressing settings until you reach rear speakers.\n\nSn: forget about the wifi cable that comes with it and that magnetic thingy, just link it up."},{"reviewerName":"Ethan","rating":"5.0 out of 5 stars","reviewTitle":"Great little surround sound kit","reviewDate":"July 13, 2017","reviewText":"Great little surround sound kit. Good sound and i love the bluetooth feature so i don't have to string cords from my tv all around the living room"},{"reviewerName":"Dave in San Jose","rating":"4.0 out of 5 stars","reviewTitle":"Easy Set-up; Installation Tips","reviewDate":"October 30, 2017","reviewText":"Pairs easily with the Samsung M360 soundbar. Set-up was quick. Some reviewers have complained that this product does not pair with the M360 and/or that these rear speakers simply do not work. I suggest as follows: (1) if you connect the M360 with your TV via bluetooth, make sure the TV is off (took me awhile to figure this one out); (2) do not put the speaker wires too far into the speaker, just the exposed wire, not the plastic casing."},{"reviewerName":"Randy","rating":"5.0 out of 5 stars","reviewTitle":"Mancave TV sounds","reviewDate":"January 15, 2018","reviewText":"Nice sounds but should include the surround system with the set."},{"reviewerName":"fazmo","rating":"1.0 out of 5 stars","reviewTitle":"Have not been able to get them to connect despite ...","reviewDate":"The manufacturer commented on the review below","reviewText":"Have not been able to get them to connect despite consulting the manual and Samsung support options. If I get these connected, will update."},{"reviewerName":"Ralph C.","rating":"1.0 out of 5 stars","reviewTitle":"A big waist of money!!!","reviewDate":"The manufacturer commented on the review below","reviewText":"Could have done without these speakers. Very, very, very low volume. The only thing I can say good is the easy set-up. But, after you set them up, you don't have anything."},{"reviewerName":"Pierre Olivier","rating":"1.0 out of 5 stars","reviewTitle":"Even though I have a Samsung TV and a Samsung sound bar which work great, this set of speakers never worked","reviewDate":"The manufacturer commented on the review below","reviewText":"Never worked!!! Even with help from Samsung support they didn't work. Even though I have a Samsung TV and a Samsung sound bar which work great, this set of speakers never worked."},{"reviewerName":"West","rating":"3.0 out of 5 stars","reviewTitle":"Small, under-whelmed.","reviewDate":"The manufacturer commented on the review below","reviewText":"I Wish it had more power, the speakers a much smaller than what I expected.\nIdeally wish we could hook up our own BookEnd speakers and crank up the wattage from the Blue-Tooth processor."},{"reviewerName":"Shomang","rating":"4.0 out of 5 stars","reviewTitle":"but this is a great option.","reviewDate":"March 25, 2018","reviewText":"Overall performs well. There are ways to increase rear speaker volume and I'll not regurgitate them here. In total the Samsung seems to offer less volume than a similar Vizio option; but this is a great option."},{"reviewerName":"Frank Greenberg","rating":"2.0 out of 5 stars","reviewTitle":"Very easy to set up but audio output is almost non ...","reviewDate":"The manufacturer commented on the review below","reviewText":"Added this speaker system to my sound bar. Very easy to set up but audio output is almost non existent. Have to crank up the volume on the soundbar to unacceptable volume to be able to get any noticeable volume from the surround speakers. Basically a waste of money."},{"reviewerName":"Fabio V.","rating":"3.0 out of 5 stars","reviewTitle":"Did not pair with m360","reviewDate":"The manufacturer commented on the review below","reviewText":"I have the m360 sound bar and it is very nice,\nBut this surround sound system did not pair with it.\nPlus, it is not all wireless, only the receiver, from receiver to speakers you must deal with the wire."},{"reviewerName":"993TT","rating":"3.0 out of 5 stars","reviewTitle":"Tiny but work fine.","reviewDate":"May 27, 2018","reviewText":"They are super tiny but do the job. I have them at ear height behind sofa. Hook up to Samsung sound bar was simple"},{"reviewerName":"Kimberly","rating":"1.0 out of 5 stars","reviewTitle":"I would highly NOT RECOMMEND these , Junk save your money same goes for LG rears as ive read","reviewDate":"The manufacturer commented on the review below","reviewText":"absolute no sound or so I thought . Ill start by stating i did sync it properly and ill tell you how .\n1if you have the soundbar and woofer 1rst use the remote and turn it OFF then for 5 sec. press mute or till you see the soundbar light up with words\n2nd turn soundbar back on press the button on back of your new wireless box and it should flash blue for another 5 seconds then stay solid walla synced\nnow the problems junky old speaker wire , now pluging it into the bluetooth unit is no problem grey on 1 side blue on the other and they ony go in 1 way .\nOn to the actual rear speakers finally we connected them and heard nothing so messed with the wires to make sure only metal was touching not any wire cover . So we slightly removed all 4 wires and with all volumes on 1 and the a/c off we heard static like a radio wow so now on to setting them up in the soundbar yea =) i thought Hold the sprocket on soundbar remote for about 6 seconds or until you can change treble bass etc. Scroll thru until you get to rear speakers make sure they are turned ON then scroll one more to rear speaker adjustment we went to the max +6 and turned the soundbar up to 20 (it goes to 100 the HW-M550 and is far superior to the hw-n550 2018 system or even the 650 which is 700$ ) anyway back to the story now the set up is complete the soundbar says rear speakers on and at +6 the a/c kicked on and i heard nothing untill a song came on on a movie we watched for 20 minutes trying to get these to play to where we could hear them . Then with the speakers heald to our ears 1 to mine and the other to my husbands we heard some background music \"surround sound \"lol i had to turn the soundbar down to 5 to hear anything . I bought these for my husband because both of us wanted to heat better clarity and sound when the air or dishwasher was going without turning up the soundbar to much because after 25 the sub does have real punch and again it goes to 100 volume . so after about 30 min . we said this is a joke it was the equivalent to having the tv on volume 1 no sound system . GARBAGE NEVER AGAIN Even read the same for LG cut out no sound etc .\nOnly go bose for rear speakers (which the box clearly stated but yet no words or sound ever came out only light whispers of music with 5 to 10 min. intervals of any sound ."},{"reviewerName":"Avant McMillion","rating":"3.0 out of 5 stars","reviewTitle":"In order to really enjoy it, the volume must really be cranked up","reviewDate":"The manufacturer commented on the review below","reviewText":"In order to really enjoy it,the volume must really be cranked up."},{"reviewerName":"Danielle & Todd","rating":"1.0 out of 5 stars","reviewTitle":"Horrible trying to link it to my M550 soundbar","reviewDate":"The manufacturer commented on the review below","reviewText":"Horrible trying to link it to my M550 soundbar. Followed the directions and spent over 2 hours with Samsung to no avail. Light kept blinking blue and tried everything to sync up. Returned it. Waste of time."},{"reviewerName":"M. Evans","rating":"1.0 out of 5 stars","reviewTitle":"Dont get these","reviewDate":"The manufacturer commented on the review below","reviewText":"Seemed to pair correctly but emits no sound"},{"reviewerName":"Jimmy Stapler","rating":"4.0 out of 5 stars","reviewTitle":"Four Stars","reviewDate":"April 2, 2018","reviewText":"Nice but I added better speakers to this."},{"reviewerName":"Dreaux","rating":"1.0 out of 5 stars","reviewTitle":"Would not pair","reviewDate":"The manufacturer commented on the review below","reviewText":"Would not pair with soundbar....had to return."},{"reviewerName":"Raymond Vance Olszewski","rating":"1.0 out of 5 stars","reviewTitle":"Waste of money in my opinion","reviewDate":"The manufacturer commented on the review below","reviewText":"Very low volume and no way to increase it with these speakers. Waste of money in my opinion. Sorry I bought them."},{"reviewerName":"DG","rating":"1.0 out of 5 stars","reviewTitle":"Did not work at all","reviewDate":"December 29, 2017","reviewText":"Complete fail. Would not sync with my HW-M360 despite the fact that the documentation, website and forums said it would.\n\nContacted Samsung support and they were amazingly unhelpful.\nSupport there is a joke. Canned responses to every question and then when they decide they are going to help you diagnose the issue you get handed off to someone else.\n\nFortunately Amazon is an outstanding company and setup an RMA instantly and are in the process of sending me a replacement.\n\nI might change this review slightly if / when I get the replacement working. Otherwise, I would suggest you stay away from this item.\n\nHope you all never have to deal with Samsung support ( or lack there of ) in the future."},{"reviewerName":"HTK","rating":"1.0 out of 5 stars","reviewTitle":"Good idea... bad execution","reviewDate":"The manufacturer commented on the review below","reviewText":"Very poor documentation and would not connect to my Samsung Soundbar even though it indicated it would. Tried numerous searches to figure out how to make this work and found a ton of similar experiences. The instructions provided were outright incorrect, but even the correct steps wouldn't work. Returned via Amazon"},{"reviewerName":"Amazon Customer","rating":"1.0 out of 5 stars","reviewTitle":"Terrible product, terrible support.","reviewDate":"The manufacturer commented on the review below","reviewText":"Speakers stopped working after about a month, it was impossible to get support from Amazon or Samsung."},{"reviewerName":"Donnell Jackson","rating":"1.0 out of 5 stars","reviewTitle":"One Star","reviewDate":"The manufacturer commented on the review below","reviewText":"no good"},{"reviewerName":"Amazon Customer","rating":"4.0 out of 5 stars","reviewTitle":"Four Stars","reviewDate":"August 8, 2017","reviewText":"Great Sound Bar. Wireless bass has less kick then wired version on an older model."},{"reviewerName":"Neil Parkhurst","rating":"3.0 out of 5 stars","reviewTitle":"Three Stars","reviewDate":"The manufacturer commented on the review below","reviewText":"Needed to return, it wouldn't link to my sound bar"},{"reviewerName":"Johnson","rating":"1.0 out of 5 stars","reviewTitle":"Needs work","reviewDate":"The manufacturer commented on the review below","reviewText":"Speakers will not connect to sound bar second set don't waste your time"},{"reviewerName":"Dr. Lee-vil","rating":"1.0 out of 5 stars","reviewTitle":"Don’t waste your money and time","reviewDate":"The manufacturer commented on the review below","reviewText":"These speakers are REALLY small and barely put out any sound at all. Yes, I have them turned up to max volume and they still do very little. In addition, they were more difficult to set up than they need to be. It took several tries to get them to link to my Samsung HW-550 sound bar and the instructions leave a lot to be desired. It also took several tries to get the sound bar to the “rear speaker” setting so I could increase the volume. All in all, these were a big waste of money and my time to get them working. Save yourself the hassle."},{"reviewerName":"LuvinAMZlife","rating":"1.0 out of 5 stars","reviewTitle":"DISAPPOINTING..did not read ALL reviews in depth as i should have","reviewDate":"The manufacturer commented on the review below","reviewText":"DID NOT WORK. THE GOOD THING I FOUND IS THAT IF YOU HAVE THE RIGHT SOUNDBAR THESE ARE NOT ESSENTIAL. YAYYY..LOL RETURNED"},{"reviewerName":"Manywords","rating":"1.0 out of 5 stars","reviewTitle":"Happy to get speakers but they didn't work","reviewDate":"The manufacturer commented on the review below","reviewText":"I got my surround speakers in the mail and quickly I tried to sync them with my sound bar and it did not work. I even called Samsung to see if they could help and they couldn't. I am just waiting for a return label so I could get them fixed or replaced."},{"reviewerName":"Amazon Customer","rating":"2.0 out of 5 stars","reviewTitle":"Two Stars","reviewDate":"The manufacturer commented on the review below","reviewText":"This product adds very little to the overall performance. I wouldn't purchase again."},{"reviewerName":"M Lawrence","rating":"4.0 out of 5 stars","reviewTitle":"Not as good as the Vizio sound bar I have but it's ...","reviewDate":"November 1, 2017","reviewText":"Overall it's a decent system. Not as good as the Vizio sound bar I have but it's still good."},{"reviewerName":"grantjl47","rating":"1.0 out of 5 stars","reviewTitle":"Big letdown!","reviewDate":"The manufacturer commented on the review below","reviewText":"Couldn’t get it to connect to my HW-KM45 like the User Manual said it would. Sending back."},{"reviewerName":"DNash","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"May 28, 2017","reviewText":"Perfect compliment for the sound bar"},{"reviewerName":"Oscar","rating":"1.0 out of 5 stars","reviewTitle":"Cancelled order since the soundbar and wireless sub this would ...","reviewDate":"The manufacturer commented on the review below","reviewText":"Cancelled order since the soundbar and wireless sub this would mate too were not at all what I expected."},{"reviewerName":"Leland Bixby","rating":"5.0 out of 5 stars","reviewTitle":"... brand new Samsung Sound+ bar and I couldn't be happier! After a few attempts to pair them to ...","reviewDate":"June 14, 2017","reviewText":"I bought these wireless rear speakers to pair with my brand new Samsung Sound+ bar and I couldn't be happier! After a few attempts to pair them to the bar (I had to unplug and reset the bar) they have since worked flawlessly! The second my TV is turned on the bar turns on and the rear speakers right along with them. I was also able to put the wireless receiver under my couch and run the rear speaker wires from the receiver to the speakers under my couch against the wall so they are completely undetectable. These speakers paired with the Sound+ bar make for an incredible home theater experience and I couldn't be happier especially for the price. Everyone I have played them for has said \"WOW! It sounds like you are at the movies!\" and I couldn't agree more."},{"reviewerName":"Aaron Shaver","rating":"1.0 out of 5 stars","reviewTitle":"More trouble than they're worth.","reviewDate":"The manufacturer commented on the review below","reviewText":"I wanted to like these. They seemed like they'd be an easy way to add more channels to my 3.1 Samsung soundbar. But they have numerous problems. The wires aren't long enough. The plugs on the wires are proprietary connectors. The keyhole doesn't seem to be a standard size."},{"reviewerName":"Lucy R. Avery","rating":"1.0 out of 5 stars","reviewTitle":"One Star","reviewDate":"The manufacturer commented on the review below","reviewText":"not compatible to current system so returned for credit"},{"reviewerName":"Al Schomber","rating":"4.0 out of 5 stars","reviewTitle":"Four Stars","reviewDate":"June 21, 2017","reviewText":"Its pretty basic stuff"},{"reviewerName":"mike bruce","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"March 19, 2018","reviewText":"Did not install..."},{"reviewerName":"William R. Browning","rating":"1.0 out of 5 stars","reviewTitle":"Do not waste your Money","reviewDate":"January 8, 2018","reviewText":"Guess what these are not wireless. I own other wireless speakers and these are not wireless. Neither the seller or Samsung were of help"},{"reviewerName":"Jay","rating":"4.0 out of 5 stars","reviewTitle":"Honest Review - A Worthy Addition to a Compact Sound System","reviewDate":"January 4, 2018","reviewText":"Nice set of small rear surrounds. I received them as a Christmas gift to pair with my Samsung HW-MS650 soundbar.\n\nAfter setting everything up and updating firmware (a must), I have had no problems. Not sure if other reviews complaining about signal drops and low volume updated their firmware. I have had no issues with the volume of the speakers; they fit nicely into the mix. After updated firmware and hooking up speakers, the soundbar volume seemed higher on lower settings as well. The connection has not dropped once since setting everything up.\n\nThe speakers do their job and add that extra rear dimension when paired with your soundbar. I watched The Force Awakens after setup and the new sound experience was excellent; blaster shots and ships tracked L to R and vise versa behind me, thematic music filled 360 degrees of the room These definitely improve the cinematic experience. That being said, these are not high end speakers so don't expect that; they cost $120 bucks. Do you know how much good speakers cost?\n\nI would have deducted one-half star if I could due to design. As most reviewers note, these are not 100% wireless. You still have to hook the speakers into a small amp that receives a wireless signal from the soundbar. This was likely a cost/design decision by Samsung. Adding a power amp and Bluetooth into each separate speaker would have increased speaker size, weight and consumer cost. The power amp itself is small (about the size of a thick hardcover book) and blends into my book case fine. It could also fit under my couch if desired. The speakers are small and attractive. I like that the finish and grills match the soundbar perfectly.\n\nOverall I am satisfied with sound quality/product for the price point. Movies and Music sound even better on my compact living room sound system. If you are going to purchase these, just be aware you will still have speaker cable on your rear wall and the power amp requires an outlet. Additionally, make sure to update your firmware!\n\nAre there better sounding speakers for the price? Yes, but these allow me to have a full sound stage with NO floor standing speakers and subtle rear speakers. If you are an audiophile and/or have room for a large system these are likely not for your. If you want a decent sounding system with a small, clean footprint give these and the Samsung HW-MS650 Soundbar a try."},{"reviewerName":"Amazon Customer","rating":"2.0 out of 5 stars","reviewTitle":"Not at all what was expected","reviewDate":"July 25, 2017","reviewText":"Cheaply made, barely have volume, do not recommend. There are better products out there for this price. Regret buying this speakers completely. Will be returning them."},{"reviewerName":"Paladin","rating":"4.0 out of 5 stars","reviewTitle":"Beware","reviewDate":"October 8, 2017","reviewText":"It helped improve the sound but the 650 sound bar itself has a problem with volume. Is either need update or it could be that I do not have a new Samsung TV. I expected more from Samsung. I am now cautious about whether to purchase the sub-woofer for the system"},{"reviewerName":"todd leitte","rating":"1.0 out of 5 stars","reviewTitle":"One Star","reviewDate":"The manufacturer commented on the review below","reviewText":"could not pair up with the samsung soundbar and subwoofer. (not compatible)"},{"reviewerName":"Walter J.","rating":"1.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"September 8, 2017","reviewText":"I also sent this back because it was not what I expected."},{"reviewerName":"Cody","rating":"4.0 out of 5 stars","reviewTitle":"Be careful what sound bar you pair these with or you won't get REAL surround sound!","reviewDate":"February 16, 2018","reviewText":"These actually aren't bad speakers for what they cost and being wireless. The connection is solid and I had no issues. But make sure your soundbar supports more than two audio channel decoding. My soundbar, the samsung M450 doesn't. It only supports 2 channel DTS and DD. , You will just hear a simulation of surround sound which does an OK job but its nothing compared to a real dedicated 5.1 channel setup with individual channels. Check the specifications on the soundbar you want to purchase to make sure. I know the Samsung M550 DOES support dolby digital 5.1 channel decoding, so I think with that soundbar you will get a true surround experience rather than a simulated one. Not Samsung's fault, just have to be careful with the specs of what you're buying. It is not an HDMI or Optical issue either, its simply a limitation of certain soundbars such as the M450. If you want real surround, make sure the soundbar supports it because I don't believe adding these speakers will magically increase the audio decoding ability of the soundbar."},{"reviewerName":"blue MCbludyblue","rating":"1.0 out of 5 stars","reviewTitle":"Was reffered the wrong speaker set","reviewDate":"The manufacturer commented on the review below","reviewText":"Was linked to the wrong sound bar model so i returned because i could not use"},{"reviewerName":"Alex Guerrero","rating":"4.0 out of 5 stars","reviewTitle":"Long Review, but worth the read if on the fence.","reviewDate":"February 7, 2019","reviewText":"Okay so for starters yes these are rear speakers so you place them behind you (I mention this because in the Samsung video it shows them being installed in front of you but if you do a bit of research behind you is the correct place). Second they are complementary speakers they aren’t meant to make whatever you’re listening to louder it’s more for it to give you that surround sound affect (for example a helicopter flying by). Third the module that links to the sound bar is wireless you can place it in the back of the room plug to an outlet and it’ll link wirelessly to the sound bar BUT the speakers themselves are not wireless, each speaker runs 1 wire (speaker wire, yes it’s provided) back to the wireless module. Install is pretty easy you just set the sound bar in ID SET mode and it’ll link right away (heads up the instructions say go “volume down” in order to place your sound bar in ID SET mode but you literally push the volume down button down as in toward the remote many just like myself don’t realize that’s the mute and that’s how you go into ID SET mode, if you go volume down it will put you in SHOP1 mode). Lastly once they are all plugged in I would do a little research on sound direction cause if you just place them but don’t have them pointing towards where you are going to be sitting you won’t really be able to experience these speakers. I bought some $8 speaker wall mounts here from Amazon and I really noticed the difference after that.\n\nNow for the product itself I have it paired with the MW360 sound bar which is the base model and the base model sub woofer. When these three components are tied together they are great and sound really good I mainly use it for movies and it truly gives you that surround sound affect."},{"reviewerName":"Kindle Customer","rating":"2.0 out of 5 stars","reviewTitle":"NO SOUND, CAN'T GET IT TO WORK!! ...","reviewDate":"The manufacturer commented on the review below","reviewText":"NO SOUND,CAN'T GET IT TO WORK !!!"},{"reviewerName":"Novarox71","rating":"4.0 out of 5 stars","reviewTitle":"Great little speakers","reviewDate":"November 20, 2018","reviewText":"Bought these little guys to get the surround sound Experience and let me tell you they sound great. they do what they are supposed to do, they add depth and dimension. These Speakers are not huge so they don't add super low bass but they do sound nice. I've got the 10\" sub-woofer so i don't really need them for bass. now for the cons, as many have stated they are not full wireless, both speakers connect to amp box. for me this wasn't a issue as i have places to hide the equipment. 2nd con which in retrospect should be grouped with my soundbar, I have the MS-750 Sound +. your soundbar controls every speakers volume evenly but if you want to fine tune the rear speakers as to make them louder or quieter you can do it, but it's both at the same time, you cannot adjust them independently. now i run my sound bar in the smart mode and so far it seems to be able to output sound evenly across all the speakers. overall i would recommend. watching movies with surround sound is awesome!"},{"reviewerName":"Christian Merchan","rating":"1.0 out of 5 stars","reviewTitle":"One Star","reviewDate":"The manufacturer commented on the review below","reviewText":"i can't link with my sound bar. I tried everything and still not working"},{"reviewerName":"John Dzurilla","rating":"1.0 out of 5 stars","reviewTitle":"One Star","reviewDate":"The manufacturer commented on the review below","reviewText":"Returned didn't work as expected"},{"reviewerName":"Paul","rating":"1.0 out of 5 stars","reviewTitle":"I don’t understand if these speakers are wireless why do ...","reviewDate":"The manufacturer commented on the review below","reviewText":"I don’t understand if these speakers are wireless why do I have wires . This is not what I exspected"},{"reviewerName":"UsedandAbused","rating":"1.0 out of 5 stars","reviewTitle":"Had to send back. Would not pair with my ...","reviewDate":"The manufacturer commented on the review below","reviewText":"Had to send back.Would not pair with my Samsung soundbar."},{"reviewerName":"Ryan","rating":"3.0 out of 5 stars","reviewTitle":"Finicky, but you dont got any other options","reviewDate":"The manufacturer commented on the review below","reviewText":"These speakers get the job done if you want a 5.1 setup to go along with your Samsung soundbar. They're not *exceptional* in sound quality, but then again i wouldn't know what good satellites are supposed to sound like.\n\nThey were quiet out of the box, but with the helpful reviews here, putting it to +4/3 is a good bet\n\nThere is a bit of lag going to the speakers when playing things like dolby atmos demos, but its only noticeable in said demos. in regular 5.1 content, you dont even notice it.\nAnother thing to note is that every 15-20 minutes or so, the rear/subwoofer will cut out for like 3 seconds and then keep playing like its nothing. I'm assuming this is because the soundbar is handling too many wireless inputs at one time and resets or something just because.\n\none flaw that may steer people away is that if you hide the reciver box behind something like a couch or a wall, expect it to cut out a lot. Line of sight is pretty much required for this thing to function without hearing it cut out / studder every 15 seconds.\n\nBottom line: read other reviews for instructions on how to set the volume if you do buy it. Wait for a sale or buy from ebay or something because even at less than $100, they arent that worth it, but if you want a 5.1 setup with your Samsung soundbar, i dont think 3rd party satellite speakers even exist, so they do the job well enough."},{"reviewerName":"vtmiller","rating":"5.0 out of 5 stars","reviewTitle":"Great Sound & Smaller Than Expected!","reviewDate":"July 4, 2018","reviewText":"These are rear specific speakers for certain sound bars. I was at first dissapointed in the small size when opened the box; but gained appreciation for the small size and big sound once hooked up. My MonoPrice banana clips (for speaker wire) were too big to use, and the speaker wire that cane with them is thin & has clips on the end that go into the power box (plugged into wall/not wireless) so these are a great choice (got refurbs) for the money but having once had a real 5.1 Surround / Stereo receiver setup) they are more of a good Tv sound bar-Easy setup for families. Not quite the full movie theater room experience - but pretty amazing sound and easy setup since they connect to soundbar with a wireless dongle (provided). I’d buy again or a second set given the chance."},{"reviewerName":"F. D. Toolan","rating":"3.0 out of 5 stars","reviewTitle":"it seems to be the ONLY place you can get good user info when you cant figure out how to ...","reviewDate":"The manufacturer commented on the review below","reviewText":"Read the REVIEWS, it seems to be the ONLY place you can get good user info when you cant figure out how to make these speakers work! I called GeekSquad and spoke with no one after waiting 2x for 15-20 mins. I downloaded the manuals for the Samsung soundbar (HW450) and for these 8500 speakers because speakers came with NO instructions. Even the user manual gives very little detailed info! The reviewers who had the same problems were the BIG help and I always read reviews b/4 making a tech purchase. Volume was my issue and not totally resolved. The whole system is VERY low volume. As to the sound quality, still \"muddy\""},{"reviewerName":"LizE","rating":"1.0 out of 5 stars","reviewTitle":"Disappointing","reviewDate":"May 29, 2018","reviewText":"I wanted to love these! The family got a new TV, a soundbar, and these to go with it. Everything was going great so I decided to get these rear speakers going. I see from the wireless module that it says it's connected, but I don't hear sound. I look it up and see many people saying sound it too low so I pick up the speaker and hold it to my ear. Sure enough there is sound, but it's very quiet. I can control it with the remote but by the time the rear speakers are loud enough, the soundbar is blasting. No they can't be controlled independently. With the advise from many reviews and forums I adjusted the levels to +6 and yes it helped but it was still too quiet.\nPerhaps if I had paid $40 for these I'd be okay, but I paid $100.\n\nThey were returned, along with the soundbar because these are the only reason we bought the one that we did. I am now looking into other set ups. I expected better from Samsung."},{"reviewerName":"mittim13","rating":"2.0 out of 5 stars","reviewTitle":"Cannot adjust these at all","reviewDate":"January 7, 2019","reviewText":"These speakers are *not* adjustable in fade or balance as Samsung may have you believe. I spent half an hour on chat with a Samsung representative according to the Samsung Ambassador who replied above and they were unable to locate any fade or balance settings. Not worth it for the money, pick a different brand that actually implements this incredibly simple option"},{"reviewerName":"Bob","rating":"5.0 out of 5 stars","reviewTitle":"These are actually great speakers! Read the reviews!","reviewDate":"December 15, 2018","reviewText":"Took me less than 2 minutes to set this up. Regarding issues with low sound, i have the opposite problem! i have them at -4 and they are still very loud. I have the N550 Soundbar and with these it just makes the movie extremely freaking awesome to hear! You need these! And someone said it earlier,but the correct way is to go to settings,rear speakers,rear speakers level, wait for the number zero to appear then you can raise or lower the audio of the rear speakers. THEY ARE LOUD!"},{"reviewerName":"Tech Friendly","rating":"5.0 out of 5 stars","reviewTitle":"amazing atmosphere","reviewDate":"March 12, 2018","reviewText":"Turn the rear speakers on via soundbar menu and volume to highest level 6. Make sure to plug in soundbar via hdmi not optical cable to enable bitstream audio (aka more than 2.1 audio now that you have 4+ speakers). Also don't select 5.1 in whatever audio source you are using because it will lower the volume or you may be missing channels. With that said, these speakers will automatically separate sounds and the volume is great."},{"reviewerName":"WestTxLeanin","rating":"3.0 out of 5 stars","reviewTitle":"Not truly wireless, but they are plenty loud. Other reviewers simply mistaken.","reviewDate":"The manufacturer commented on the review below","reviewText":"The issues most of the negative reviews have with this besides it not being truly wireless (both speakers connect to wireless box by rather short audio cables) is that it isn’t loud enough.\n\nThe issue is not with the speakers or the settings it’s that cable boxes don’t support surround sound. When you’re on cable, you won’t get a true digital surround sound. This is a bummer. But I’ve found I can use my cable account to download apps for most channels, even for sports games, and watch them that way. Those have digital surround sound."},{"reviewerName":"Deeman","rating":"4.0 out of 5 stars","reviewTitle":"Yes they sound great, nice addition","reviewDate":"December 13, 2017","reviewText":"So I bought the Samsung HW m550 Soundbar with wireless subwoofer sounds great easy to set up I had no issues with the amount of Base the subwoofer puts out I even have mine turned up only to level 3 sounds great I think a lot of people are having issues because of their placement anyway I caught a great deal on the rear speakers so I thought I'd give it a shot as far as setup my setup didn't work you're supposed to hold the volume button down for five or six seconds and then the ID pops up on the the Soundbar that did not work for me after reading some forums you have to make sure shop 1 is turned off and you do that by holding the volume button down towards - minus meaning lower volume for a few seconds shop will pop up and display as off once I did that I held the volume button straight down the ID popped up then you turn the sound bar on and they sync no problem. So I turned on a 5.1 surround movie I chose Captain America winter warrior because it's got a lot of action immediately I noticed the difference in the sound placement I have a open abnormal shaped room so sound escapes easily but it was a huge difference they were a little low in volume but it's still sounded great helicopters going from left to right people talking in the back it was pretty cool and I have mine just set up on a little stand on one side and on the other side actually sitting only a foot from the ground because I haven't got my mini stands yet, so not the most optimal setup but it works for now I thought I would attempt to turn the volume up on the rear speakers and if you go through settings on your Soundbar you'll get to rear speaker level you could go up to 6 or down 6 I put it at 4 and it's even louder all in all for the price I got from them it's great plus the wires on the speaker side are regular wires so you can use any speakers that you have hope this helps some people have a great holiday"},{"reviewerName":"Sterling A.","rating":"1.0 out of 5 stars","reviewTitle":"I have had a very expensive Samsung Pro 850 SSD fail on me because of a bad firmware update from those idiots","reviewDate":"The manufacturer commented on the review below","reviewText":"Most frustrating product I have ever (briefly) owned. Returning it already and it just came today. Will not sync with my Samsung soundbar from Costco the HW KM45C.\n\nSamsung has led me around with faulty products for too long. I have had a very expensive Samsung Pro 850 SSD fail on me because of a bad firmware update from those idiots. And now my rear speakers wont sync out of the box, despite the fact the instructions included were WRONG! And I had to press the MUTE button not the VOLUME button for ID SET.\n\nThese speakers are going back. My Samsung sound bar is going back. Everything Samsung I own is being returned or destroyed. I am utterly dissatisfied with them and will not ever buy a single product from them again."},{"reviewerName":"Geokinski","rating":"5.0 out of 5 stars","reviewTitle":"Great value for money, good build and sound quality.","reviewDate":"October 18, 2018","reviewText":"Excellent value for money. Installation is easy enough, syncing with a compatible Samsung sound bar. Lacks instructions on adjusting rear speakers volume though as many people have also noticed.\n\nWhile there are many comments about the low volume but they are OK for me, postioned behind the sofa. So I'm guessing it's due to positioning, unsuitable content or misconfiguration.\n\nTested with various DTS demo discs and the surround speakers did well."},{"reviewerName":"Mray","rating":"5.0 out of 5 stars","reviewTitle":"Great surround sound","reviewDate":"September 9, 2019","reviewText":"Really like these speakers. Add the perfect rear sound for my Samsung HW-KM45C soundbar. Installation and set-up was a breeze. A must add to your Samsung soundbar."},{"reviewerName":"Tom Hightower","rating":"4.0 out of 5 stars","reviewTitle":"I love the sound","reviewDate":"August 1, 2018","reviewText":"I received this as a B-day present from the Mrs. in addition to the Sound bar. Setup was extremely simple, and I love the sound. I think the kids like it more than me for playing their games etc. Pairing was really effortless."},{"reviewerName":"Gamer Till Death","rating":"3.0 out of 5 stars","reviewTitle":"Please be aware, THIS IS NOT A SOUNDBAR!!","reviewDate":"December 6, 2017","reviewText":"Please be aware, This is not a sound bar itself.\n\nI bought this thinking this was a sound bar, therefore had to return.\n\nThis is a rear speaker kit for a Samsung + Surround Bar.\n\nCompatible with the following:\n\nHW-MS750\nHW-MS650\nHW-MS6500 Curved"},{"reviewerName":"Reakoe","rating":"5.0 out of 5 stars","reviewTitle":"Hw n650 Samsung sound bar with swa 8500 rear speakers","reviewDate":"January 17, 2019","reviewText":"I must say I dreaded getting these to work on this hookup based on reviews I read. This don't work, I had to do that, then unhook this ----I followed the directions and in 5 min I was up and running. Used the cog button to select rear speakers and volume to turn up. Be sure you have the right model rear speakers matched to you bar...movie must be recorded so that you can have surround"},{"reviewerName":"M&M","rating":"3.0 out of 5 stars","reviewTitle":"Ok sound quality","reviewDate":"The manufacturer commented on the review below","reviewText":"Surround sound is good but misses some sounds and echos alot. Decent quality and pretty easy hook up."},{"reviewerName":"Theresa a Robinson","rating":"1.0 out of 5 stars","reviewTitle":"One Star","reviewDate":"The manufacturer commented on the review below","reviewText":"Item shipped 3/9/2018 for refund."},{"reviewerName":"Monty","rating":"5.0 out of 5 stars","reviewTitle":"Works well but read instructions","reviewDate":"September 13, 2019","reviewText":"You need to increase volume of rear channels to get best results."},{"reviewerName":"Vince","rating":"4.0 out of 5 stars","reviewTitle":"Would be PERFECT... except...","reviewDate":"August 5, 2019","reviewText":"Great addition to a great soundbar!! Wish the wires to the satellites were a bit longer. At least 15-20 ft. would be GREAT!!"},{"reviewerName":"pinefire","rating":"5.0 out of 5 stars","reviewTitle":"Love 'em!","reviewDate":"April 23, 2018","reviewText":"Outstanding home theater sound system when paired with 340w 3.1channel Soundbar w/ Wireless Subwoofer (HW-M550/ZA)."},{"reviewerName":"Mike","rating":"1.0 out of 5 stars","reviewTitle":"Garbage","reviewDate":"The manufacturer commented on the review below","reviewText":"These speakers are garbage. The speaker wire it comes with is short and cheap and the clips are cheap too! And on top of it the are not loud enough. I would not recommend buying these. If anyone has any suggestions on what speakers to get for the Samsung soundbar HW 450 would be great."},{"reviewerName":"Jason D Sparks","rating":"4.0 out of 5 stars","reviewTitle":"Awesome speakers!","reviewDate":"June 23, 2017","reviewText":"I just bought these at Best Buy for $65. They were on sale because the box was opened. Nothing touched inside. Everything works beautifully. I've read a lot of the negative comments but I really like these speakers. If they seem quiet or not putting out much sound, it's because you have to raise the level of the rear speakers on the sound bar menu. If you do, you will be pleased with the result."},{"reviewerName":"Mike","rating":"4.0 out of 5 stars","reviewTitle":"so good. Not much sound out of the rears","reviewDate":"February 21, 2018","reviewText":"So far, so good. Not much sound out of the rears, but it works as advertised."},{"reviewerName":"Erwin","rating":"1.0 out of 5 stars","reviewTitle":"Fancy worthless paperweight","reviewDate":"November 22, 2018","reviewText":"Doesn’t connect to my Samsung soundbar that Samsung itself says is supposed to be compatible with these wireless speakers. The Link light just blinks blue no matter how many times I repeat the instructions in the official manual AND Samsung support."},{"reviewerName":"Mr. Independent","rating":"1.0 out of 5 stars","reviewTitle":"Returned-Tried Two Units","reviewDate":"July 27, 2017","reviewText":"Received my first set. Paired it to my Samsung M550 sound bar which was connected to my Samsung 75\" Smart TV. Only right speaker would worked. Returned for another and this time neither speaker would work. Then the blue connection light went out and the red (trouble indicator) illuminated and wouldn't go out. Returned for a refund. Also noticed when the right speaker was working on the first unit, the sound was very weak. Disappointing. Do not recommend."},{"reviewerName":"kmart007","rating":"5.0 out of 5 stars","reviewTitle":"Great speakers","reviewDate":"November 12, 2019","reviewText":"Great speakers. Some comments don’t understand how 5.1 surround sound is supposed to work"},{"reviewerName":"Matthew Felten","rating":"5.0 out of 5 stars","reviewTitle":"Me likey!!","reviewDate":"February 12, 2019","reviewText":"Very nice and easy to link up. The sound is great. I just brought another for my sound bar upstairs."},{"reviewerName":"Jazz Guy","rating":"3.0 out of 5 stars","reviewTitle":"Samsung’s Good Products Dimished By Horrific Tech Support","reviewDate":"The manufacturer commented on the review below","reviewText":"Samsung electronics are ok, maybe even great, but tech support is horrific. For that reason alone I will never buy another Samsung product as long as I live. Beware. If you need assistance, you’re up the creek without a paddle."},{"reviewerName":"Hyeongkyu Park","rating":"5.0 out of 5 stars","reviewTitle":"sound","reviewDate":"August 8, 2019","reviewText":"sounds good"},{"reviewerName":"Henri","rating":"5.0 out of 5 stars","reviewTitle":"Best sound rear choice for gamers","reviewDate":"August 25, 2019","reviewText":"Excellent product."},{"reviewerName":"annonymous","rating":"5.0 out of 5 stars","reviewTitle":"It was good. Purchased this add on","reviewDate":"May 25, 2017","reviewText":"Purchased the Sansumg sound bar. It was good. Purchased this add on, sound became great!!!"},{"reviewerName":"Dan","rating":"1.0 out of 5 stars","reviewTitle":"NOT Compatible with MOST Samsung soundbars","reviewDate":"November 24, 2017","reviewText":"Despite the hype these are NOT compatible with all or even most Samsung soundbars. Mine is barel 3 years old and not compatible."},{"reviewerName":"moondriver","rating":"1.0 out of 5 stars","reviewTitle":"Wireless Surround Speakers That Require Wires?","reviewDate":"The manufacturer commented on the review below","reviewText":"First, I bought the SWA-8000s as an included module in the Samsung Soundbar and Surround System from Costco. It's the same product sold here, bundled into the Costco package.\nSo, I'm setting it up and everything is truly wireless, the subwoofer and the soundbar. But when I set up the 'wireless' surround speakers, the SWA-8000 package, the instructions tell me to connect the wires. BTW, no wires are in the package.\nI've been on Samsung support and they can't believe a wireless surround package needs wires. Someone help me: shouldn't a wireless system not require wires????"},{"reviewerName":"Amazon Customer","rating":"1.0 out of 5 stars","reviewTitle":"This product does not link to my brand new Samsung ...","reviewDate":"The manufacturer commented on the review below","reviewText":"This product does not link to my brand new Samsung sound bar. Returned the first set to find out the second wont link as well. Very frustrating. Not worth it ! Stay away from this product. Me and my wife tried everything we could however they don't link to the sound bar 3 series KM36."},{"reviewerName":"timothy arbogast","rating":"5.0 out of 5 stars","reviewTitle":"... these or the sound bar to work your just stupid","reviewDate":"December 17, 2017","reviewText":"If u couldn't get these or the sound bar to work your just stupid"},{"reviewerName":"Bryan","rating":"5.0 out of 5 stars","reviewTitle":"Easy install","reviewDate":"May 29, 2019","reviewText":"Just what i needed"}]}