{"title":"Grace Digital Mondo+ Wireless Smart Speaker and Internet Radio with Wi-Fi + Bluetooth and 3.5” Color Display","manufacturer":"Grace Digital","currentPrice":"$148.12","rating":"3.8 out of 5 stars","totalRatings":"437 ratings","features":["\n         Make sure this fits\n                by entering your model number.\n        \n","Listen to over 30,000 internet radio stations from around the corner to around the world including iHeartRadio, CBS radio, BBC, NPR, and SiriusXM (Subscription sold separately by SiriusXM). Control the music via the front panel, included remote control, or free iPhone or Android remote control app.","Play Amazon Prime music, iTunes and any other music via the integrated Bluetooth V4.1 chip. Works with all 802.11b/g/n routers. Supported streaming protocols: HTTP, RTSP, WSMP, Shoutcast, Supports 11 audio formats: AIFF, AIFC, WAVE, CAF, NeXT, ADTS, MP3, AAC, Ogg Vorbis, FLAC, WMA","Via your smartphone or Chromecast Browser cast Pandora, TuneIn, Google play, Spotify, YouTube music, BBC, NPR and hundreds of others to your Mondo+! Control a Mondo+ with a Google Home (sold separately). Group multiple Mondo+ for multi-room audio synchronized playback.","Make your Mondo+ portable with the optional rechargeable battery (sold separately).Clock is auto synched via the internet. 5 individual alarms","What’s in the box: Mondo+, 100-240V, 12v 2 amp power adapter, manual, infra-red remote control"],"reviewsAspects":["grace digital","sound quality","sleep timer","alarm clock","stopped working","easy to set","easy to use","factory reset","clock radio","remote control","great sound","mondo plus","good sound","internet radios","highly recommend","digital mondo","bluetooth speaker","battery pack","fall asleep","user interface"],"productInformation":[{"Product Dimensions":"10.5 x 5.8 x 5.4 inches"},{"Item Weight":"3 pounds"},{"Shipping Weight":"3.96 pounds (View shipping rates and policies)"},{"ASIN":"B071L8XYGD"},{"California residents":"Click here for Proposition 65 warning"},{"Item model number":"GDI-WHA6001"},{"Batteries":"2 AAA batteries required."},{"Customer Reviews":"3.8 out of 5 stars\n    437 ratings\n3.8 out of 5 stars"},{"Best Sellers Rank":"#5,609 in Electronics (See Top 100 in Electronics)\n#1 in Internet Radios\n#40 in Amazon Launchpad Audio & TV\n#59 in Portable Radios\n"},{"Date first listed on Amazon":"April 30, 2017"}],"productDescription":["The Home Audio System that you will love. The Mondo+ connects to your Wi-Fi network in 2 minutes via the 3.5” color display, no special app required to set up or play!","While no app is required, we do have a cool iPhone/Android app. Control every Mondo+ from any room in your home! Play different music on each Mondo+ or the same music perfectly synchronized all through your house.","The Mondo+ supports over 30,000 direct access AM/FM/HD internet radio stations and podcast, including BBC, NPR, CBS, or stream directly directly from the hundreds of Chromecast enabled apps via Wi-Fi or use Bluetooth when you are away from home.","Do you use a premium music provider? Check out our list of partners below.","Listen to SiriusXM, Spotify Connect (contact SiriusXM or Spotify for subscriptions) as well as stream Chromecast enabled apps directly from your smartphone such as Pandora, iHeartRadio, TuneIn, Google Play Music, YOUTUBE Music, NPR One, Tidal, Slacker, Deezer and hundreds more.","And while we have an extensive station and podcast database, if we don’t have your favorite station, just let us know and we will add it for you!","The Mondo+ also supports Chromecast mirroring – any audio you are playing in your Chromecast browser can be mirrored and cast to a Grace Mondo+! We even support playing your music saved on any standard UPnP media server or thumb drive.","The Mondo+ even integrates Bluetooth 4.1 for music streaming when you are away from your Wi-Fi connection.","The large color 3.5” display makes for easy navigation through the menus, settings, and apps on the Mondo+. While streaming music, view the channel or album artwork, song title, and artist name.","Don’t have your smartphone handy, no worries, control your Mondo+ directly from the front panel or included infrared remote. Save and play up to 10 presets, set the alarm, sleep timer, snooze bar, back light settings. Even change the name of your Mondo+ to a name like Bedroom, Kitchen, Den for a whole home multi-radio experience.","The optional rechargeable Lithium Ion battery, sold separately, makes the Mondo+ portable. Move it into various rooms or even to listen to music in your backyard without having to plug in. The optional battery allows for up to 12 hours of portable play via normal listening levels (5 hours at max volume). Battery specs: 7V, 5200 mAh."],"reviews":[{"reviewerName":"Jay","rating":"3.0 out of 5 stars","reviewTitle":"Good radio with some drawbacks","reviewDate":"The manufacturer commented on the review below","reviewText":"Nice display, very good sound. The Mondo+ utilizes Google Chromecast which is a plus for many, but also has it's drawbacks. As an owner of a previous Logitech and Mondo, there are apps missing from the plus that are worth pointing out to new potential buyers. Keep in mind this may change with a software update, but as I write this, these apps are not included:\n\n*No Pandora\n*No Tunein Radio\n*No Live365\n*No Slacker\n*No Spotify\n*No AccuRadio\n*No ShoutCast\n*No RadioTunes\n\nThe Mondo+ does offer the following out of the box:\n\n*Sirius\n*iHeart Radio\n*NPR and Public Radio\n*BBC\n*CBS Radio\n*Podcast by Audiosear\n\nThe other negative to this radio involves the internet radio. On my previous Logitech UE radio, I would select music, then type of genre and it would bring up a list of stations local and around the world that matched the music I was looking for. On the Mondo+, there are more steps involved in finding your music using search by genre. For example, if you want to find Rock stations here is what you have to do if you do not know the name of the station you are searching for:\n\n1) Select Internet Radio\n2) Select Search for Station by Genre\n3) Select the genre you like - Example - Rock\n4) Select the Region and scroll through the list and select one - Asia, Europe, Middle East, North America, South America and Oceania\n5) If you select North America, you now have to scroll through the list of countries or territories and select one like the United States for example\n6) If you selected the United States, you now have to select the state or zip code and it will bring up the list of stations that match your genre search\n\nAs far as I'm concerned, this requires too many added steps to find genre stations without knowing the name. The short cut to this is to search by name and just type in 'Rock' and it will bring up a list of rock stations and this makes it easier than doing a genre search.\n\nIn addition, there are music genres that seem to be missing from the genre list on the Mondo+. My previous Logitech had more music options in the scroll list. For example, missing from the genre list of the Mondo+ is the following:\n\n*60's\n*Ambient\n*Bluegrass\n*Blues\n*Bollywood\n*Children's Music\n*Christmas Music\n*Classic Hits\n*Classic Rock\n*College Radio\n*Decades\n*Easy listening\n*Eclectic\n*Indie\n*Live Music\n*New Age\n*Reggae\n\nThese genres will have to be searched for. There is an option for 'other music' but I did not find any folders that contained any of the music listed above. Perhaps Grace will add these back in a later date. Until that happens, you will have to rely on the search feature.\n\nI will assume that future updates will make this radio better and perhaps Grace Digital will add the apps that now missing. If you don't care about any of those missing apps I listed above, this is a very good radio with great sound, but it's not as feature rich as the older Logitech UE radio and requires some more input to get what you are looking for. For that reason, it's two steps forward and a big step back."},{"reviewerName":"Marjorie Cunningham","rating":"5.0 out of 5 stars","reviewTitle":"Easy Set-Up, Great Sound","reviewDate":"January 1, 2018","reviewText":"What a great Internet Radio! The sound is very, very good, my stations are programmable, it has 10 presets and a remote, and best of all, this is a quality unit. I bought this to replace an aging Squeezebox, which is slowly having more problems, but I also own two other Internet radios, and the Mondo+ is the best of the lot. I love the large readouts, and the time shows when the radio is off. This radio also gets Sirius XM (I have that in my car only at this time), and with Bluetooth and a USB slot, I can't think of what else it could need.\n\nI found this was easy to set up, used the Internet to add stations to \"My Stuff,\" and Mondo+ connected easily to my Wi-Fi using the onboard Wizard. My current passion is Old Time Radio and most of those broadcasts sound great with the radio's speakers, no difficulties at all. There is one small complaint, and that is the preset buttons do not light up and that would be helpful as I like to listen at night, but the other attributes make up for it. I would not hesitate to recommend this radio to anyone looking for a fine Internet Radio."},{"reviewerName":"Phazyme the guitar guy","rating":"5.0 out of 5 stars","reviewTitle":"Excellent internet radio","reviewDate":"November 2, 2017","reviewText":"This radio will play Sirius subscription satellite radio and most everything else that is free or subscription on the internet. We connect via WiFi. When my long term Sirius radio died and I discovered that Sirius no longer has a radio I found this radio. The people on the phone at Sirius did not know that the their radios were out and there were other options such as this. The Grace radio has a full sound for a small radio and has a user friendly LED screen user interface. And you can tune in most anything with crystal clear sound by way of the stations web site which most stations support. It does not tune in the traditional way by frequency. Our house keeper who is employed by us listens to Poland. I listen to the Beatles channel and our Mobrella Cockatoo blooms out in full color at rock and roll and hangs upside down singing. The extra $ rechargeable battery dies too quickly. And some times some strange screens come up that puzzles me on the led. When I first got it it took me a half hour to find the volume control which is this big cylindrical protrusion out the top that looks like a big snooze button. It is actually very handy. So bottom line is so far so good. Actually great. Needs a better rechargeable battery which by the way is an extra $ option. There is a buffer time period which the user can choose in the settings to avoid sudden cut outs. The odd side to that if you too hurriedly turn the radio on and then wish to suddenly turn off you may not be able to if it is buffering. I would say that anyone having had a Sirius internet in home radio that was dedicated only to Sirius and had a number of problems will love this. It handles\nthe world and appears to be reliable and much more user friendly with the LED screen. Surprising that Sirius operators know nothing about this. Didn’t have a clue."},{"reviewerName":"R. M. Miller","rating":"1.0 out of 5 stars","reviewTitle":"Really nice...for a week! No support from Grace Digital!","reviewDate":"The manufacturer commented on the review below","reviewText":"Received and radio did not work at all, display would light up but was full of vertical lines of pixels. Returned for refund and as usual Amazon was on top of it from the get go. I did get another radio (unfortunately not from Amazon) and it quit working after 1 week. Grace Digital customer service is non-existent. 3 emails have gone unanswered and phone calls to them were either cut off after \"transferring\" me or no answer at all. So much for standing behind their products."},{"reviewerName":"E Austin","rating":"1.0 out of 5 stars","reviewTitle":"Sound keeps cutting off. Crickets from their support.","reviewDate":"August 15, 2018","reviewText":"I bought this radio for my daughter as a gift. She loves to have classical music playing while she sleeps. This radio provides an great number of stations for her to listen to. Unfortunately the sound in this radio cuts out most nights. To get the sound to return I have to change the station, or sometimes power off/on the radio. My network is very reliable, I only have a problem with this product. I sent in a query to support and haven't heard anything after four days. I really want to like this product, but I expect better reliability and support for the price paid. I've looked on the support site and I see mention of this issue, but the radio always says it doesn't have a firmware update when I check."},{"reviewerName":"Chip Ahoy","rating":"1.0 out of 5 stars","reviewTitle":"If you want a good radio that dies in 2 days . . .","reviewDate":"January 4, 2019","reviewText":"If you want a good radio that dies in 2 days then this is the one for you. Out of the box two evenings ago, the evening spent setting it up. It worked and sounds great. It died in two days. Grace Digital support had me factory reset, wiping out all I'd accomplished setting it up. Still didn't work, so I was advised to contact Amazon for a replacement. Amazon will ship me another, arriving in another two days and I can start all over, be back where I was two evenings ago. Not a happy Mondo+ customer, to say the least. Maybe I should have cancelled the replacement, taken a straight refund until Grace Digital works the bugs out, gone with another brand. Time will tell, apparently."},{"reviewerName":"Joseph M.","rating":"5.0 out of 5 stars","reviewTitle":"Love it, but with some reservations, read my comments and decide for yourself","reviewDate":"August 17, 2017","reviewText":"I love it with some reservations. The firs thing is that I really liked it from the first I got it. i have had it for more than a few years now. The first thing that went wrong was the battery went dead. It is a rechargeable pack that helps the radio work if the power goes out, so you are not late for work. That battery pack is not cheap. ait appears that they could have allowed the Mondo to use batteries that can be bought anywhere, but they did not. This may bean extra cost that they worked into the product.\nI got past the battery replacement and went a couple of years later before I bought a sound bar for my TV with a subwoofer. It had a remote that would interact with the Mondo. That should not happen, shame on you Grace Digital for not making sure that the Mondo would not interact with other remote controls from other devices. That was a Vizio sound bar.\nNow i am retired, and I like to fall asleep listing to iHeart radio, The Vinyl Experience, it is a great station to listen to. I plug headphones into my Mpondo, and after so many times of doing that, the headphone jack went bad. It still puts audio out, it is just that if you remove them, the speaker does not come back on. Grace Digital wants $32.99, plus i have to pack it up and ship it. So add another $10 to that. I am a technician, so I took the Mondo apart and am now looking for a replacement headphone jack that will fit the radio. If i don't find one, I will use what i have and epoxy it to stay where i need it to be. All in all, if i lost this Mondo, i would buy another. I have other Internet radios that have features that make them great, but the Mondo feels at home at the bedside as an alarm clock that will play anything.\nLastly, the Mondo has RCA jacks on the back, so you can feed the sound to your stereo system. The Wifi on it works very well from one side of my home, all the way to the other."},{"reviewerName":"Gino","rating":"5.0 out of 5 stars","reviewTitle":"New functionalities to an almost perfect device!","reviewDate":"October 17, 2017","reviewText":"This review is of the new digital Mondo PLUS.\nI am changing my original review after talking with the company as I was explained about the issues I mentioned. I had a problem with the display that was not perfectly aligned but the Company will sort out the issue.\nSince the product was completely re- engineered in terms of software, some of the functionalities that i mentioned before will be modified in next updates (specifically the sleep mode and station browsing).\nFrom what regards using the radio as a Sonos speaker, it cannot. Although the device could be integrated into a home audio system and used as a zone/room speaker with its chromecast functionality. The sound quality is quite good for up to a medium sized room.\nI still would like to be able to play music from my amazon music account.\n\n----\nI have been using the original mondo for several years. Great product, no problem, working flawlessly after more than 3 years. When the new mondo plus came out i decided to go for it immediately, mainly because it had bluetooth and the chromecast feature so I could use spotify.\nThe radio is still great product but my experience have some drawback compared to the original mondo:\n- When the screen is dimmed, on standby, you cannot see the time when you are facing the radio horizontally (at the same height). i.e I have it on my nightstand and i have to stand up to see the hour. This does not happen on my previous mondo.\n- The sleep function cannot be used from the smartphone app.\n- The internet radio search function has no hierarchy inside the countries, you look for stations from a certain country and you get hundreds of radio station with no filter.\n- I read somewhere that the radio in addition to bluetooth could be uses as a sonos speaker, so far I have not been able to add it to my sonos system. Also the mondo plus has no am/fm receiver, contrary to what I thought by reading the description."},{"reviewerName":"Logan","rating":"1.0 out of 5 stars","reviewTitle":"Garbage. And hard to use. Want to return.","reviewDate":"September 17, 2018","reviewText":"Absolute garbage.\nNot user friendly at all. I'm pretty tech savvy and it is STILL a pain to program and navigate the menus. It's always disconnecting from wifi which forces you to wake up to annoying beeping instead of music and most times just doesn't even go off. I want to return it but of course the return window is closed."},{"reviewerName":"Andrew F. Cullen","rating":"1.0 out of 5 stars","reviewTitle":"Big disappointment!","reviewDate":"August 30, 2018","reviewText":"I bought this radio to use primarily as an internet tuner using RCA audio out ports in a home stereo system. It replaces a previous Grace tuner only device that failed after about four years and which Grace no longer markets or supports and now seems to be the only device on the market that can function in this task.\nThe radio is an update of a previously marketed Grace radio. It works OK for tuning wifi stations but does not have built in apps for Pandora, I-Heart, Spotify or Google Play so those venues must be \"cast\" from a phone or tablet to the device using a built-in Chromecast. Herein lies the problem. Not only do you need another active device but the Chromecast is unreliable. Google Play works OK but I have yet to be able to receive Pandora.\nGracetech's answer to this was to reboot the various devices several times and, when this didn't work, to say that sometimes the Mondo+ radios don't work well with Apple products."},{"reviewerName":"Leigh 46137","rating":"4.0 out of 5 stars","reviewTitle":"Would be perfect if it still had the Pandora app actually on the radio itself","reviewDate":"October 21, 2017","reviewText":"This is my third Mondo radio purchase--I had previously bought one for myself and one for my mom. My most recent purchase is my first Mondo + , and I'm disappointed that the new one has no Pandora app. Reading the comments here I see that Pandora is to blame for this, not Grace Digital. Pandora now requires new devices to use a streaming technology such as Chromecast. Reading the comments here, I also see that some see using Chromecast as a plus. To me, this is more of a bug! But it's a matter of perception, I suppose. I use the radio only for Pandora, so this is just an unnecessary layer of complication for me with no improved functionality. Sigh. I'm off to install what I need on my phone to make it work.\n\nEdited to add: obviously, I do like Mondo and Mondo+ radios—I’ve bought three. I hope this issue with the Pandora app can be worked out eventually. The new radio is working fine using my phone to control it. I didn’t have any trouble getting Chromecast to work. But I’m not one to keep my cell phone with me all the time when I’m home—especially when I’m upstairs, for instance. I’d rather use an app and control Pandora from the radio itself. C’mon, Pandora."},{"reviewerName":"Charles L. Gfeller","rating":"5.0 out of 5 stars","reviewTitle":"Best ever","reviewDate":"January 6, 2018","reviewText":"If you want a internet radio this is the one to buy. Word wide radio at the touch of a button, More stattions than you knew existed. Great sound quality and easy to use. . I am addicted to nught radio and this was the perfect answer."},{"reviewerName":"Kev","rating":"4.0 out of 5 stars","reviewTitle":"Great little box","reviewDate":"January 15, 2018","reviewText":"Bought mine refurbished from Grace Digital for a fraction of the cost of new. Arrived like new and packaged like new. This is a great little box. I use it as a clock radio in my bedroom. I keep reading that the sound is sub-par...but I don't see it. Maybe if you turn the volume up all of the way but mine rarely sees anything higher that 1/4 of the available volume. It could come down to what source audio people are listening to. Some internet radio stations broadcast low quality streams.\n\nPros:\n-Great sound\n-Color Screen with lots of info\n-Alarm with 5 alarms being able to be saved.\n-Large station list\n-Has iHeartRadio access, Live 365 and Shoutcast.\n-NPR access from all over the USA\n-Has Chromecast built in. Once you start the cast from your phone/PC you can control track selection and play/pause right on the mondo+. The best sound quality seems to be when you are using the Chromecast. I haven't tried the built in audio player yet, but I'm sure FLAC files sound excellent on here as well.\n-Bluetooth streaming uses HD AAC codec...so bluetooth audio is pretty high quality\n-USB Port for local music storage or charging devices. I have a flashdrive with nature sounds loaded on it. It's perfect to fall asleep to when combined with the sleep timer function.\n-Line in and also line out if you want to use an external amp and speakers.\n-Has the ability to play music from a local DNLA server on your network\n\nCons:\n-The control scheme is a bit cumbersome. A touch screen in a future hardware version would help.\n-The dimmer doesn't really get dim enough for my taste. I like a dark room at night, it is completely off on the lowest setting. On the next to lowest setting it is illegible, on the next highest setting it is fine but the LCD screen has sub-par contrast ratio so a lot of light bleeds through what should be a black screen. This would be fixed by using an OLED screen, but then it would cost more to produce.\n-Even though they have a large list of stations, I found some locals missing. They say you can email and request stations to be added, I'm going to try this and update later on how that goes.\n-Battery not included. You have to buy a Lithium Ion battery pack to make this portable or to even have any form of battery back up for alarm clock use. The original from Grace Digital is pretty expensive. There is a 3rd party one available on Amazon that is about half the cost. I ordered it and have yet to receive it so IDK what the quality is like but the reviews on here look promising. EDIT: Got the battery and it seems to work fine.\n-When I used my android cell phone as my alarm if I woke up early I had the option to cancel the alarm for that day and it would reset for the next day, the only option on the mondo+ is to turn the alarm off completely...then you have to remember to turn it on again before you go to bed that night.\n-I missed an alarm one day because my WiFi was out so the station would not load...I feel like the software should realize this and use the buzzer as a backup...luckily I still have my cell phone alarm set as a backup alarm so I didn't miss work. This really needs to be addressed in the next firmware update...EDIT: This is actually how it already works. If the internet is out when the alarm is supposed to go off it will default to the buzzer...HOWEVER, if it begins to buffer the station and the internet goes out during that process it will just give up and display an error message.\n-Wish I didn't have to buy a dongle for ethernet support....it takes up the USB port.\n\nUPDATE 5/20/18: I built a PFSense router/firewall and suddenly I started having issues with certain stations not working, CBS Radio and iHeartRadio stopped working all together. Support was able to tell me what ports were needed but port forwarding didn't fix the issue. I started to have problems with my Xbox One at about the same time. When I began to research the xbox issues I found that by default PFSense has pretty strict outbound NAT rules. In order to get the Xbox One working I had to create a new outbound NAT rule. After doing that I figured why not try making a similar rule for my Mondo+ and viola...it finally works right. You can find a tutorial by searching youtube for \"PFsense xbox\". Substitute the IP for your Mondo in for the Xbox one in the tutorial."},{"reviewerName":"Edgar Poe","rating":"5.0 out of 5 stars","reviewTitle":"I listen to my favorite radio stations and podcasts without having to use my ...","reviewDate":"December 28, 2017","reviewText":"The main reason I originally purchased this radio was because it worked with SiriusXM; but this radio does a lot more. I am able to listen to about anything. I listen to my favorite radio stations and podcasts without having to use my laptop. I take it to work with me and listen to it there as well. There is just not enough time in the day to listen to everything. The sound quality is really great as well.\n\nAnother plus for this unit is the customer support. I had a few issues early on and was amazed at how quickly and accommodating the folks at Grace Digital were. They worked with me and eventually got things to where I am quite pleased. They also keep me updated on new software releases. The only real negative for me is that I cannot save my internet connections since I travel back and forth to work and have two different internet connections. But once I put in the password credentials I'm good to go."},{"reviewerName":"nerdgirl","rating":"5.0 out of 5 stars","reviewTitle":"Excellent replacement for Squeezebox Radio","reviewDate":"March 10, 2019","reviewText":"It was time to replace the ailing Logitech Squeezebox Radio we’d had and loved for years (and which had started acting wonky). I did a lot of reading up and settled on the Grace Mondo+. Emailed tech support ahead of time to find out whether it would work with our home NAS (where we store all our music) and they replied promptly and coherently that it would (I liked that the reply didn’t read like boilerplate or someone’s attempt to pass text through Google Translate). Bit the bullet and purchased the Mondo & Ethernet dongle/battery combo. Setup was extremely easy; the wireless wizard worked like a champ (although we will primarily use wired Ethernet). The iOS app is slightly lacking (crashes occasionally and isn’t quite as intuitive as I’d like), but the OSD is extremely straightforward. The sound quality is quite good; certainly good enough for a bedside clock radio. I wish there were more bundled apps; the nature sounds are a bit tinny. Calm Radio was a nice surprise and I ended up getting a paid subscription.\nThe Mondo has pretty much all the features I liked about the Squeezebox, with a much better/intuitive OSD and it sounds like there’s a lot of active support/development. I was sad when Logitech bought & then essentially scrapped Squeezebox, but the Grace Digital is an overall improvement. Additionally, it’s red, just like the old one. :)"},{"reviewerName":"M. FUSCO","rating":"5.0 out of 5 stars","reviewTitle":"great product and service from Grace","reviewDate":"October 8, 2018","reviewText":"I have owned quite a few internet radios over the last 10 years. Grace Digital is certainly at the top of the list, along with Pure. They make a great, straightforward, and intuitive product which is easy to manage, set up, and operate. I have two older model Mondo's, so I decided to try this Mondo+ and I am glad I did, for several reasons. First, because the radio is a decided improvement over older models: nice, bright color display; clear, transparent sound; large, intuitive buttons. Second, because there was an issue with the radio's access to stations: I wrote to Grace customer service and heard back within the hour -- on a Sunday! We exchanged a couple of emails and I was told they would look into the matter. I heard back first thing Monday morning, confirming that there had been a glitch in the web-access which had been solved. I could now add all the stations I wanted, and was most pleased that Grace's customer service equaled the quality of their products. I value the portability of this model, adding a lithium battery to it, but it is quite a bit larger than other models and can't as easily be put into a suitcase, or carry around. But, other than that, this is a first-rate, quality product with customer care to match. Listed as refurbished, but looks and acts like new."},{"reviewerName":"Bruin69","rating":"4.0 out of 5 stars","reviewTitle":"Nice Streaming Radio","reviewDate":"December 11, 2017","reviewText":"Radio works well. I purchased it to replace my Livio Radio because my favorite station moved to iHeart from CBS. I'm into streaming broadcast radio stations, not the streaming music services, This is a must have if you don't like AM noise on the distant stations. Streaming is FM quality. Best features are the 10 station/stream quick presets, USB for a thumb drive (can holds entire music collection), audio line out, and battery option for mobile use. Build quality could be a better, housing feels like cheap plastic, and could use a folding handle because the hand indent slot isn't a secure way to carry it. The remote is good quality, has real buttons, not one of those cheap bubble button remotes. Produces good sound for one room. The Grace Digital MyRadios+ website needs to have the ability to add folders (currently doesn't work) for stations for better organization, like Reciva Internet Radio has, this website needs some work. Google Play and the blue tooth speaker option work well with my iPhone 6s. I do have a Grace Solo Streaming Radio, which has held up well and outlasted the Livio because it supports iHeart streams. Always worry about the radio's built in streaming apps not being supported in the future, Grace not providing updates, or a mega media company taking their stations to a unique app. Anyone who has an iPhone or iPod touch can relate to that experience. If Grace stuffed this radio into an Ecoxgear like quality case, they'd get 5 stars out of me."},{"reviewerName":"AuthorByNight","rating":"5.0 out of 5 stars","reviewTitle":"This Is The Internet Radio You Want!","reviewDate":"November 5, 2018","reviewText":"I shopped around for a long time before choosing this particular Internet radio and it is so much more than I ever expected. I was connected to our wifi and listening to music within minutes. I'm not big on reading user manuals but if you are thinking about this radio, go to the GraceDigital website and download the pdf manual. It is well laid out, easy to read, and clearly explains how to use the many features. It is by far the best user manual that I have ever read.\n\nAccess tens of thousands of Internet radio stations from Grace Digital's database, Shoutcast, Radio.com, iHeartRadio, NPR & Public Radio, SiriusXM, BBC, Calm Radio, and Live365. Those are just what's built in. You can also play your favorites from TuneIn, Pandora, Google Play Music, and Deezer as well as any other audio service or app that supports ChromeCast. The Mondo+ also supports Bluetooth so you can use it as a speaker. If that isn't enough, plug your mega digital music collection into the built-in USB port or access a UPnP or DLNA server. Your options for content are virtually unlimited. Sound quality is excellent and it is loud enough to fill a large room. It won't rattle your windows but is quite loud for a table radio.\n\nNote: You need a streaming SiriusXM subscription to access that feature. One other plus on the XM portion of the radio, if you miss your favorite show you can \"rewind\" up to five hours and catch up on what you missed. There is also an option to start a song at the beginning when you tune to an XM music channel.\n\nThe IR remote control is easy to use, the Android app is great, and you can even register your radio on their website and manage your collection of favorite radio stations and podcasts. There are 10 user-programmable preset buttons on the radio that you can also access from the phone app. Set a sleep timer and up to five custom alarms. Wake up to a different station on weekdays or weekends if you want. You can even set the wake-up volume and number of minutes you want to snooze.\n\nThe Mondo+ is a well-designed, comprehensive package with excellent user experience in mind. I can't think of a single feature that is missing from this radio. Well done, Grace. Well done.\n\nNow if they only made a handheld portable version of this, I'd buy it in a heartbeat! As it stands, I am now considering other home or outdoor audio products that they offer. They've got to be good and I am sure they are."},{"reviewerName":"Inssomniak","rating":"4.0 out of 5 stars","reviewTitle":"Simple yet powerful audio streaming radio.","reviewDate":"November 5, 2018","reviewText":"I bought this Internet radio after purchasing the Sonicgrace K2 radio, which was more or less a terrible product, despite it presenting as a nice tablet/speaker combo, but old software and slow CPU make it frustrating.\n\nThis radio is far and wide a better radio, dedicated to streaming stations directly from the Internet, from thousands of stations built into the radio itself, but what makes it really appealing, is the online portal that allows you to add your own streams that are not available in the database! It plays virtually anything, from anywhere. Love the quick access to 10 presets. Robust firmware will do its best to resume disconnected streams. Sound quality is nice, given its size, and with the optional battery, there is many hours of play time. Ethernet option may be handy for some. Clock radio alarm is a nice touch. Feels like an actual radio. Use it every day.\n\nSadly it won't remember different Wifi networks, and requires you to manually connect to each wifi again, even if you've connected to it before. Might be an issue if you move the radio around frequently to different networks. Perhaps a firmware update will address this. There is a remote control app for your phone, but sadly it never detects my radio.\n\nOverall a very strong 4 stars."},{"reviewerName":"Nana","rating":"4.0 out of 5 stars","reviewTitle":"Love this radio","reviewDate":"January 16, 2019","reviewText":"We are in a location with very poor radio reception so I needed to find something that would work in a block construction home up in the desert. This radio is perfect for getting an incredibly clear signal. Before, I had to use my cell phone and the iheart app, and with the tiny phone speaker, it was not ideal. I love the fact I can get stations from anywhere. We only use the radio feature and sleep timer, and haven't used all the programs/apps that are available.\nThere are a few things that if fixed or were different, would have pushed my rating to 5 stars:\n\n1. I wish the buttons down the left side (home and those used to pre-tune a station) were lit, or at least a contrasting color so they could be seen easily.\n2. When the radio is turned off and then turned on again later, the volume resets all the way to silent. We didn't realize that at first, and thought the radio was defective.\n\nTwice we couldn't get it to work, but that could have been our error in pushing buttons that we couldn't see in the dark....(see #1 above), or, it just got a quirk and stopped working. A simple fix was to unplug, wait 20 seconds and replug it in.\n\nEven with those minor issues, we love the Grace Digital radio, and will be ordering a second one. Highly recommend to anyone who loves AM radio but can't get a clear signal, or to those wanting to get a wifi connected / internet radio."},{"reviewerName":"Soupy","rating":"1.0 out of 5 stars","reviewTitle":"Major WIFI connection problems","reviewDate":"February 12, 2019","reviewText":"So this is my 3rd Grace Digital Radio, all have had problems connecting to WIFI and on two I have overcome the problems with adding an older router to my internet. At this house it will connect for maybe 5 minutes then not again for weeks at a time.\n\nIt clearly is a manufacturing issue as it keeps happening at all 3 of my different places with different internet providers.\n\nOnce it works it is a very nice radio, the real problem is getting connections to WIFI that stay connected. Very irritating."},{"reviewerName":"Joe Zietz","rating":"5.0 out of 5 stars","reviewTitle":"No Pandora without a cell phone or Ipad.","reviewDate":"December 23, 2017","reviewText":"I've had several internet radios for the past 10 years or so. This by far is the best one I have\never had the pleasure to own. It does lack Pandora, but for me this was not an issue\nin its selection. Pandora can be received with the built in Chromecast or Bluetooth\nand a cell phone, tablet device."},{"reviewerName":"HackZaw","rating":"5.0 out of 5 stars","reviewTitle":"Never minds the extras--it's an excellent Internet Radio","reviewDate":"September 17, 2018","reviewText":"The description talks about smart speakers, Bluetooth, Chromecast, smartphones, etc. All these extras tend to obscure the fact that this is an excellent internet radio. Turn it on, connect to your WiFi, and that's it--you have access to hundreds of free internet radio stations. This includes many local radio stations that you can listen to even if you live out of their town. (I like WWOZ from New Orleans).\nI already had a SiriusXM account for my car, so I upgraded to All-Access for $5 more per month so I can also listen to the SiriusXM stations, like Classic Vinyl and Grateful Dead.\nOne other feature important to me is the presence of RCA line out jacks on the rear of the unit. I used these to connect the Mondo to a receiver and two large stereo speakers for great sound. I would not have purchased the Mondo if it did not have this feature as I wanted music for a large room.\nOverall, I am very happy with this radio as it is exactly what I wanted, it is simple to set up, and it works."},{"reviewerName":"Expressed Reviews","rating":"5.0 out of 5 stars","reviewTitle":"Great little radio ~ I connected it to external speakers for better sound","reviewDate":"April 24, 2019","reviewText":"I had the previous version of this, but it broke after 5 years. The only difference between the original and this one, is bluetooth capability. While the sound from the speakers is decent, it's much better when hooked up to external speakers. If you listen to Pandora a lot, try to purchase the older version, as that one allows you to set preset buttons for Pandora channels, whereas this one doesn't."},{"reviewerName":"Bookshelf","rating":"4.0 out of 5 stars","reviewTitle":"Pretty cool device","reviewDate":"December 30, 2017","reviewText":"This machine makes it easy to listen to NPR anywhere in our house on the wireless network for free. It was easy to set up, connect, and set our favorite stations as presets. The one caveat is the power button. We bought two of these - one for a friend - and while our power button puts the machine into standby mode, her's will only power down by holding it for 3 seconds or more. Tapping the power button SHOULD go to standby. We have tried changing settings and restarting the setup from default but still no standby option. It is not so annoying that we would return it. It is still a really cool machine and we recommend it."},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Robust solution for wireless audio connection, from Bluetooth to paid subscription provider and of course Internet Radio","reviewDate":"December 7, 2017","reviewText":"It’s a complete and good audio device to listen wirelessly to a lot of radio and. Using providers\nIt has built in Chromecast that it’s really a plus, SiriusXM, 30000 channels of internet radio available, 10 presets, Bluetooth, remote control, good cel app and a battery pack (sold apart) that makes it portable\nIt’s easy to setup and it has a good sound, when I need some power sound I plug it on my receiver. In my opinion it’s the most robust solution available in the market for less than 180 us$"},{"reviewerName":"J. Fish","rating":"2.0 out of 5 stars","reviewTitle":"This 2-year old tech is unusable as a Bluetooth speaker for TV; only marginal as a \"clock radio\"","reviewDate":"June 13, 2019","reviewText":"Not an adequate Bluetooth speaker for TV:\n\nThis first shortcoming is likely due to the fact that this is 2-year-old tech, using BT 4.1 with no aptX or other Low Latency capability.\n\nThere are times when I want to wear headphones when watching TV in bed, and there are times when I prefer using a speaker. And at night, so as not to disturb others in the house even when using a speaker, I landed on using a smallish BT speaker bedside instead of the TV's full-on soundbar.\n\nPrior to buying the Mondo+, I'd been using a really old, rechargeable/portable Aukey Bluetooth speaker when I wanted a speaker, and a set of Sony Bluetooth headphones (with BT 4.2 and aptX-LL ability), each tied to an Avantree Oasis transmitter (also with BT 4.2 and aptX-LL ability) that's connected to my TV via optical cable. When it pairs to a BT device, the Avantree Oasis picks the highest quality/speed codec/protocol/something-something. Even so, I had a little bit of a latency problem with my older Aukey BT speaker: maybe a half second off (which is understandable, given that speaker's old age).\n\nI was hoping that replacing my old Proton clock radio set AND ditching the older BT speaker was going to simplify things and allow me some additional bedside table space. But nope. While I had a little latency with my really old Aukey speaker (and a little more than could be corrected with the Audio Sync feature on my TV, maybe a half second off, the Mondo+ is in a whole different league... bordering on 10 to 15 seconds behind the TV. Way outside the range of correction that my TV's audio sync allows (and probably outside the range of every TV out there... what TV is going to build in extra memory to allow for ridiculous delays like that?).\n\nThe latency problem is really so bad that it's quite useless as an Bluetooth speaker for my use. Considering a complete return if I'm able to find an Internet Radio with up-to-date BT. But if I can't find one of those that I like, I guess my fall-back will be to keep the Mondo+ and (a) get an aptX-LL speaker, or (b) buy an Avantree or other brand of aptX-LL receiver and hook it into the AUX input (and pray Grace hasn't slowed that input down somehow)... either way, I'm back to more stuff on my bedside table. Darn.\n\nThe interface makes this only marginal as an Internet radio; problems with their Portal:\n\nSecond major category of shortcomings: The Grace Portal and the radio's Interface both fall far short of expectations. I group these together because the portal could make up for some of the interface shortcomings, and vice versa, but nope. I was expecting the portal would let me set up stations for Presets. Nope.\n\nAnd why would I think that? Well maybe because the marketing mentions of the portal read like the Grace portal makes setting up stations, podcasts, etc. easy, so you don't need to futz with the radio's interface directly. Except presets, apparently. So the some of the top-most user interface controls on this radio (the physical preset buttons sitting right there, on the outside, requiring nothing more than a push) are not addressable in the portal. Wow.\n\nAnd what little the portal does seem to do is pretty poorly executed. Because on top of the portal's general useless-ness, it's also slooo-oooww-ww and seems pretty buggy (2 years after this radio's introduction, mind you... plenty of time to \"work things out\"). My attempts to save a station were greeted with fairly cryptic popups saying that you can't save a station and can only save podcasts or streams or something to that effect (which made me immediately wonder why would you put \"save\" buttons in the station section/tab if you can't save stations, esp. when there's a separate podcast section/tab?).\n\nThen, despite the popups, stations I was told I couldn't save were actually saved as stations, apparently... so the popups were in error? But that's about the end of that potential positive: whatever you've saved in My Stuff is then literally *stuffed* several dial turn / dial click / dial scroll / dial clicks down in the My Stuff of the radio interface. Not in a preset button as I've said, but also nowhere near the top of the interface's Home screen entry. This is a multi-step process you'd probably not want to perform late at night or early in the morning, certainly, all the while asking yourself \"now where did they stuff that?\"\n\nAs it is, I consider trying to use their portal and the paltry results a complete waste of my time.\n\nWhat would help immensely and actually make the portal useful: allowing users to actually customize the \"home\" screen (via the Portal), moving items not used (to a second screen?), and surfacing actual favorites (the number could be limited to 4 or 6 maybe?) to the top two rows of the Home screen. And, of course, give the portal the ability to set up and manage presets.\n\nJust to be clear: Given that the Mondo+ is now 2 years old, I actually don't expect any of these problems to be addressed, especially the BT latency. I would expect that Grace has moved on to the next great thing, and this is all a low priority for them. So when I say \"they need to do X\" in this review, I really don't expect any of that to happen. Which is now one of my new, more realistic, much lower expectations for the Mondo+.\n\nUPDATE (just 2 days later): And... yep. the buggy, slow portal is now completely down. Wow."},{"reviewerName":"bill in NC","rating":"5.0 out of 5 stars","reviewTitle":"About as good as it gets for internet radios","reviewDate":"July 26, 2018","reviewText":"This is the third Grace radio that I have purchased. Grace seems to be the leader in actively seeking to provide the features customers want in their products and will even upgrade software to add wanted features. The only hiccup in the purchase was having to program the device from scratch as the prior radios used Reciva for their portal and Grace now runs their own portal. This took some time but was not difficult to do. I like having the increased number of presets (increased from 5 to 10), and the remote control means not having to use the manual scroll dial very often, which had ceased to function on my old radio and\nled me to purchase this unit. The price was reasonable, and shipping time was terrific!"},{"reviewerName":"mark wainer","rating":"4.0 out of 5 stars","reviewTitle":"Great product and going to get even better","reviewDate":"August 3, 2017","reviewText":"I purchased this product to use in my office at my desk. I have a SiriusXM subscription and was looking for an internet radio I could connect to my account. SiriusXM used to have a desktop internet radio, but have since discontinued it. I also have Spotify Premium, so those two abilities were my primary focus. While it doesn't have the native spotify connect app built in yet, you can use your phone, computer, or tablet, to launch Spotify and cast to the mondo. From there, you can change tracks via the included remote, which is great. Grace digital told me that Spotify connect will be added in a future update which I'm excited about. Added bonus for me, I can stream music from Italy using the internet radio stations. It's lightweight, well built, and sounds AMAZING!"},{"reviewerName":"S. Hildebrand","rating":"1.0 out of 5 stars","reviewTitle":"DO NOT BUY","reviewDate":"December 15, 2017","reviewText":"What you will have is a radio that works well for 5 to 10 days. After that, it decides that you don't live in America and stops working until you factory reset it. Then it decides you live in America, after all. Now you get to spend your time putting your channels back in. Until next week, when this pos decides that you don't live in America.\n\nI've been around with the company, got a song&dance.\n\nDON'T BUY"},{"reviewerName":"Steven R. Fisher","rating":"5.0 out of 5 stars","reviewTitle":"Great built-in apps! Love this radio!","reviewDate":"November 12, 2018","reviewText":"This radio does everything I wanted: a stand-alone radio with a wide choice of content and, especially, with presets. I’m very happy with this!\n\nBefore ordering, I spent a lot of time trying to determine the built-in “apps.” Amazon, various pictures, and even gracedigital.com are inconsistent. I ordered it and here are the out-of-the-box apps:\nGrace Digital Internet\nIHeartRadio\nNPR and Public Radio\nSiriusXM\nRadio.com\nSHOUTcast\nBBC\nCalm Radio\nLive365\nPodcasts\nSleep Sounds\n\nYes, I know I can use my iPhone to get more, but I like the idea of using this as a stand-alone Radio. I’m very satisfied with this selection of stations!"},{"reviewerName":"Zamfield","rating":"5.0 out of 5 stars","reviewTitle":"Much Better Than Expected And HUGE Sound!","reviewDate":"October 1, 2018","reviewText":"This is a great radio... Wifi, Bluetooth and a mass of internet radio stations.\nThe sound is very good and I was blown away by the sound from this relatively small unit.\nColor screen that shows time, station and song being played.\nYou can alter the brightness of the screen so that when it's turned off it doesn't blind you, either bed side or under my TV.\nWhen you connect the included rca plugs, it doesn't cut the music from the machine... Great, as sometimes I want to listen using the built in speaker and other days I want to crank it out through the sound bar!\n\nWhat's even better is that you can have another Mondo+ in another room and connect them together so it plays the same channel throughout the house!\nThink it sounds good with one unit, wait till you get another going!!\nZero lag and they sound amazing together.\n\nVery happy with my purchase.\nThe app is a huge help too.\nMakes searching and adding / changing features much easier.\n\nYou'll not be disappointed with this radio.\nI can't believe I've lived without internet radio for this long!!"},{"reviewerName":"Eileen C.","rating":"5.0 out of 5 stars","reviewTitle":"BETTER SOUND THAN BOSE!","reviewDate":"November 11, 2018","reviewText":"This was an early Christmas gift to myself. The sound from this radio I believe is better than Bose and I owe two Bose products. I subscribed to Serius XM and have been enjoying the Hallmark music everyday. The remote that came with unit did not work, I called the company and spoke to Linda who apologized and immediately sent out a new remote. It came cross country in two days and it works perfect. DO NOT HESITATE TO PURCHASE THIS RADIO. You will be enjoying great sound from the start."},{"reviewerName":"Amazon Customer","rating":"1.0 out of 5 stars","reviewTitle":"Chrome cast does not work with Pandora, and no one cares!","reviewDate":"July 19, 2018","reviewText":"Works fine as an internet radio. Completely nonfunctional for streaming Pandora. Chrome cast works about 10 percent of the time, and Bluetooth about 50 percent of the time. As usual, Grace says it’s Pandora’s fault, and Pandora pretends to not understand what the complaint is. Deeply regret the purchase."},{"reviewerName":"Jim McHenry","rating":"5.0 out of 5 stars","reviewTitle":"this radio is the best! Well","reviewDate":"November 17, 2017","reviewText":"this radio is the best! Well, since I haven't tried all radios it's the best this 67-year old has ever experienced. Full list of features, regular software updates to improve the product and excellent HMI. Great radio."},{"reviewerName":"megmize1212","rating":"5.0 out of 5 stars","reviewTitle":"Mondo+ is an Awesome internet radio!","reviewDate":"November 20, 2017","reviewText":"I've had the Grace Digital Mondo+ Internet Radio for over a month now. I am extremely happy with this radio. It is easy to use, the Wi-Fi connection is smooth and the sound quality of the internal speakers is great for a desktop radio. Scanning for local stations and setting presets was easy. Setting up a My Folder on my Grace Digital web account was simple and the stations I saved there are easy to access via the Mondo+ user interface. Chromecast is also very easy to use.\n\nI'm using the Line Out signal to a Grace Digital BTAR512N integrated amplifier and muting the internal speaker. This configuration is a awesome package!"},{"reviewerName":"jerake","rating":"2.0 out of 5 stars","reviewTitle":"Great internet radio, great sound, seriously awful software","reviewDate":"The manufacturer commented on the review below","reviewText":"I have been wrangling with Bose over their implementation of SiriusXM, which hasn't worked correctly for over a year - outages, cuts/drops, absolutely terrible. SiriusXM is my go-to for news and music, so I finally decided to find a radio that performed the same functions - I use this in my bedroom and it fits my needs exactly.\n\nPros:\n+ Very easy to set up - I didn't have a problem with the dial-type input for username/password etc.\n+ Good choice of music services available - some find it limiting but it covers just about everything I use, and I have access to my local digital radio stations.\n+ Sound quality is pretty darn good. Some Sirius stations pop a bit but its not too bad, wish that didn't happen, but for what I need it to do, its great.\n+ For a tiny little speaker its got some good features (sleep timer, alarm, play from USB, aux-in, stereo audio out). I'm pretty pleased overall with what's available to me given the price.\n\nCons:\n+ Software seems iffy to me - I hooked it up in one spot for initial setup, then once I had presets configured, I unplugged it and moved it across the room. After it powered up and was at the Home screen, I pressed P1 - it went to the SiriusXM channel but then gave an error, something like \"unable to play preset\" and the screen froze. I had to power cycle the unit, and all my presets were gone.\n\nOverall - really happy with the unit. I will keep an eye on the software, am hoping to keep this unit operating for a long time.\n\nUPDATE 10/2: The software on this unit has the tendency to frustrate me - for example, after it moves to the clock/idle display, if I hit home, sometimes it gets stuck on the Alarms page, and I cannot get back to the home screen. I have to try about 5 or 6 times, pressing Home and Power before it will actually show me the Home screen. Also, it keeps saying the Sirius server is unreachable...when I can play Sirius on all my other devices.\n\nOur power went out, this evening, and the time on the radio is wrong...BUT THERE IS NO OPTION TO MANUALLY CHANGE THE TIME. I go to Settings --> Alarm, Clock and Time but...no option to change the time. I try playing Sirius, but it keeps telling me the server is unreachable. Save your money, this software is too much of a hassle to deal with if something goes wrong. Knocking off two stars because I will never get these moments of my life back just spent trying to get this thing to work."},{"reviewerName":"Edward Piekarski","rating":"1.0 out of 5 stars","reviewTitle":"Unreliable. Don't waste your money! STEER CLEAR OF THIS JUNK!","reviewDate":"September 21, 2019","reviewText":"I purchased a previous version of this radio in mid 2014 and it died in early 2018. Figuring that electronics are flaky, and that there really weren't many other choices offering similar features, I bought the same radio again.\n\nBig mistake.\n\nIt's now September 2019 and the radio is acting up.\n> In the last week, the radio has missed several alarms. It recognizes the time, processes a bit and then reverts back to a clock, indicating the next alarm time.\n>Lately it randomly stops streaming/playing.\n\nThe software is up to date and rebooting does not help, so I'm writing off this purchase.\n\nWhen the radio worked, it worked well with nice sound and display but there are clearly quality issues. I have had a Sangean DDR-63 table radio with similar features since 2013 and it has been rock solid.\n\nSave your money and steer clear of this junk."},{"reviewerName":"chris larson","rating":"5.0 out of 5 stars","reviewTitle":"Elated! I've never seen a radio like this.","reviewDate":"November 11, 2019","reviewText":"This radio is awesome. I'm out in the middle of the Pacific, (outer island of Hawaii) and I can FINALLY get great radio. Not just good, great.\n\nPros:\n\nVery well made. Great display for station search. The display font is very appealing. Very clean sound quality. Ease in setting up. ( I did it in about 15 minutes without opening the book.) Ease in station search. The sleep timer is very easy to set in 10 minute increments. Just push a stand alone button once for every 10 minutes. If you want minutes turn the big knob. Volume is the stand alone knob on top. The display light is controlled with the big knob which changes in increments down to off. I think the sound fades to almost nothing right before the sleep timer shuts off the radio but I'm not sure yet. That puts me right to sleep. The remote is easy to tell which way is up in the dark. The down side has the batteries and the up side is thinner.\n\nCons:\n\nWhen on sleep timer I can turn the display light all the way off. When the radio shuts off the display light comes back on with the time displayed. Maybe if I open the book I can figure out how to keep it off all night. ( I don't need to know what time it is until next year.) I prefer darkness all night until the Hawaiian birds wake me up.\nThe station buttons on the face of the radio are hard to feel in the dark, making it difficult to change stations while laying in bed. I think the remote will be good for that once I have that memorized.\n\nI can't tell you how the alarm works because I'll never need it. With how well this radio is made and the thoughtfulness they put into its use I'd bet it's close to perfect.\nI was advised to just use my phone for internet radio and boy am I glad I forked out the money for this instead. I bought it mostly because of the sleep timer and that exceeded all my expectations.\nNext, I'll buy a FM transmitter to transmit ANYTHING to my shop.\n\nAll in all, I'm thrilled with this radio. I think I've never been so pleased with any other Amazon purchase. (can you tell?) I'd highly recommend this radio to everyone outside a big city's range. Kinda hard to fork out the money, kinda spendy, but now that's the farthest thing from my mind.\nI'm listening to Australia, Los Angeles, San Fransisco and Seattle. MSNBC too. My search for more continues. I'm so over small town radio. Finally!\nBuy it and enjoy."},{"reviewerName":"L. Swanson","rating":"1.0 out of 5 stars","reviewTitle":"They changed something that was was working fine to something that doesn't","reviewDate":"June 24, 2019","reviewText":"They changed the original model which I own and works as advertised. I needed a second radio for my studio so I bought this. Thinking it would function the same. It didn't. I am computer savvy( I.T. at large 911 Comm Center) and I could not get this device to connect to the outside world. I made several calls to their support center and they didn't have any useful suggestions so I returned it. I am just going to buy a very good transistor radio. Very disappoint that they felt they had to muck around with something that worked and changed it into something that doesn't."},{"reviewerName":"Sir Buy a lot","rating":"5.0 out of 5 stars","reviewTitle":"Beautiful looking radio","reviewDate":"July 28, 2017","reviewText":"Beautiful looking radio.\nI've bought several internet radios over the years.( I use a squeezebox myself.) This was for my wife and she really loves it. The sound is better than my squeezebox, higher volume and a richer sound. I don't quite see the fuss about the navigation, just not happening on our radio. Its better than the squeezebox but then it should be as it is later in the development world. I think the looks are very similar. My wife is not using some of the features that others are complaining about so can't comment on those. Another great feature is the battery. I bought the generic battery (seems to work fine) and you can move he radio around and use wherever you like. I find it a but pricy, but the radio is a lot of value. My wife is quite happy with it."},{"reviewerName":"Steven_Carmel_Ny","rating":"1.0 out of 5 stars","reviewTitle":"A nice radio when it's willing to play.","reviewDate":"September 28, 2019","reviewText":"I purchased a refurbished Mondo+ from Grace in May, when my Sangean (and all Frontier-Silicon based radios) lost the ability to store and access favorite channels and podcasts. I was amazed in that I received what could only be described as a brand new radio and was very happy with my purchase. The radio is a very nice design that was a pleasure to use. A few firmware updates were automatically applied with no noticeable impact. There is no way to turn that off I could find.\n\nThe first sign of trouble was on 7/20/19 after 6 weeks of ownership. A “Network timeout error” displayed on the screen and play stopped. I called the support number and was directed how to do a soft reboot which worked. The radio played well for a few weeks following this incident. Since then however the radio will at times simply stop playing. The play icon changes from the triangle to the egg timer and no changing of channels, playing with the menu or normal powering off will get it to recover. A hard reboot (unplug, wait, replug) will bring it back to life.\n\nThe frequency of these stop-playing incidences is increasing and finally when it happened only a couple of hours after the latest hard reboot, I decided to query support by email. The response was communication with the router had failed and pointed me to the warranty-return form. Being out of warranty it's $33 plus shipping to give them a third shot at this radio. (Recall it is refurbished.) Considering how often I see this problem listed by other reviewers, I have little confidence that I will get a long lasting functioning radio in return. I think I stand an equal chance that this is simply a firmware problem that they might eventually get right or if it is hardware related a recall might be in order as I am not alone. I also have a now working with favorites Sangean WFR-28C that does not stop playing on it's own, so doing without the Mondo+ isn't painful. (Thank you Frontier-Silicon!)\n\nI will continue to use the Mondo+ connected to a convenient power switch often enough to test whether a future update corrects the stop-playing problem and will update this review should that occur. At this time I would not recommend this radio to friend or foe.\n\nUpdate: 10/23/19. I used the radio sparsely since the original review but it continues to simply stop playing and shows the hour-glass icon when that happens. I've included a picture. You might notice that the wifi icon shows a strong signal which causes me to doubt what the support person suggested. The only way to get it going again is to remove the power adapter. For as little as I now use it I was still surprised the problem showed up again so soon. I have therefore lowered the rating to one star, because a radio that just stops playing regularly doesn't deserve anything above the minimal rating."},{"reviewerName":"ernie75","rating":"5.0 out of 5 stars","reviewTitle":"What's not to like?","reviewDate":"June 18, 2019","reviewText":"After losing access to my favorite net radio stations (Yamaha decided to eliminate something that was working well), I contacted Calm Radio to discuss alternatives and they recommended Grace Radio. After much research, I decided on the Mondo+. The product reviews and questions posted on Amazon were very informative but I had a couple of questions that were not answered so I sent email to Grace support on Saturday. Much to my surprise, I got a reply with answers a short time later and I submitted an order Saturday afternoon. I received my radio Monday morning and had it up and running Monday afternoon with access to everything I lost and much more. Again, customer support was very responsive and helped me with a couple of issues I encountered with setup. The radio itself has amazing audio quality and volume but my plan was to connect the radio to an AV input on my Yamaha to use my existing amp and speaker setup, and that was easy to do and works very well. I now have an additional remote in my pile of AV remotes but net radio is my primary source of entertainment and that is a very small price to pay for a great solution to a significant problem."},{"reviewerName":"Dan","rating":"3.0 out of 5 stars","reviewTitle":"Technically a great product, but the station selections are more limited than previous versions","reviewDate":"July 9, 2019","reviewText":"I love the technical aspects of this radio. Grace Digital obviously listened to their previous customers and made the interface smoother and easier to use. If we look only from that perspective, I love this radio. Of course, I bought it because I own an earlier model and liked it. However (and this is a big deal to me), the available stations are not as plentiful as they were on older versions. I don't know why or how, but stations that I routinely listen to on the old radio (which still works) are simply \"not found\" on this one! That limits my selection significantly. And then there's the \"Pandora issue.\" The previous version has a Pandora app that I use all the time. This one doesn't. In order to get Pandora on this radio, I have to sort of \"channel\" it through my desktop to this radio. However, the reason I bought these radios in the first place was so that I could listen to internet radio without my desktop, so this kind of defeats the purpose. And then there's the \"registration issue:\" Instructions say you can register it to get all kinds of control over loading stations. Except the instructions don't work, and the website for the Mondo+ doesn't exist. Pretty sloppy if you ask me. Technically, it's a great product. But it's significantly more limited than previous versions in that what I listen to on it is significantly more limited. That's why I (reluctantly) only give three stars to this radio. I doubt if I would have bought it if I had known. But your experience may vary."},{"reviewerName":"Joseph Barrera","rating":"5.0 out of 5 stars","reviewTitle":"Surprised at the Quality","reviewDate":"November 3, 2018","reviewText":"I had heard about internet radio, and wanted to give it a try. What a nice job this radio does. I plugged it in and it asked for my modem password, which I did not have, called Cox Cable, entered the Modem Password, and off in running. I just have it running a few days, but the stations are almost limitless. I am hung up on a station in Texas that plays oldies and takes requests all day, and I suggest everyone give it a try. You will not be disappointed."},{"reviewerName":"Race Easy","rating":"4.0 out of 5 stars","reviewTitle":"Happy with this internet radio!","reviewDate":"September 1, 2017","reviewText":"Wow! It is really nice to move to internet radio. I found this radio to have excellent connectivity to the nursing home WiFi, to be reasonably easy to program, and to have excellent sound.\n\nI purchased this for my 87-year-old mother, who is in a nursing home with limited eyesight and hand flexibility. I set up the radio for her, and she mainly just adjusts the volume. She really listens to only one radio station, an AM local.\n\nWhat keeps me from giving this 5 stars is that the snooze/sleep bar is right in front of the volume control on the top of the radio. My mother often bumps this bar when she's adjusting the volume, and then the radio turns off automatically in 10 minutes. My mother then has to call an aide to help her turn the radio back on.\n\nOther than the snooze/sleep bar issue, we've been very happy with this radio. The clarity of sound, no more static on the AM station, is really fantastic."},{"reviewerName":"M. Arthur","rating":"1.0 out of 5 stars","reviewTitle":"MAJOR LIMITATIONS AS A TRUE INTERNET RADIO","reviewDate":"The manufacturer commented on the review below","reviewText":"Although this radio is well made and of good quality I gave it only one star because of its severe limitations as an actual internet radio.\nIt cannot connect to Pandora, Spotify, or any other streaming music service.\nNor does it recognize all NPR stations despite having a dedicated \"NPR/Public Radio\" channel on their menu. There are individual stations such as WCAI which simply do not exist on this radio.\nCustomer support is perfunctory.\nI feel this product is described in a misleading fashion which nowhere states its inability to connect to music streaming services.\nIf this matters to you then do not buy this radio."},{"reviewerName":"stan","rating":"5.0 out of 5 stars","reviewTitle":"Excellent radio","reviewDate":"September 16, 2018","reviewText":"I love the ability to pick up stations from all over the world. It works great as a bedside clock radio and is portable to make it easy to use anywhere in the house. There are 2 relatively minor points that could use improvement. First, there are 10 buttons for favorite stations. They also have a file called \"my stuff\" where you can store additional stations. But to do that you to register on their web site and do the search and store on the site. I t would be much more convenient to be able to do this directly on the radio. Second, the radio can serve as a Bluetooth speaker to stream from an app on your smart device. But it doesn't work the other way around. The sound quality is reasonably good, but given all of the music stations available it would be nice to have the ability to stream to a more advanced Bluetooth speaker. Despite these relatively minor points, this is a great product and I highly recommend it."},{"reviewerName":"Doctor J","rating":"2.0 out of 5 stars","reviewTitle":"False Advertising - No Pandora App pre-installed","reviewDate":"November 1, 2017","reviewText":"I was looking for a device with apps built in so i could play streaming music, primarily Pandora without draining my phones battery. I saw the ad on Amazon showing the device with a PANDORA app icon on the display screen. I was sad when I got the radio and found out that it didn't have the Pandora App built in, but only works with Pandora if you stream it there via ChromeCast. So, after figuring out how to stream it from my phone, which was what I was trying to avoid, I get an e-mail from Pandora telling me that I was streaming from more than one device at a time, my phone and chromecast, and if I continued to stream it from multiple devices, I would need to pay for another yearly subscription, so I can't even stream Pandora to the mondoplus without paying a higher fee and still draining my phones battery. Kept the device for regular radio streaming, but extremely dissapointed in the less than honest advertising from GraceDigital. Paid $175 but only consider it worth about $99."},{"reviewerName":"EM","rating":"4.0 out of 5 stars","reviewTitle":"Great for Sirius/XM","reviewDate":"April 23, 2019","reviewText":"The system is easy to set up and works wonderfully, but I do have two minor issues:\n1. When setting up user names and passwords, the alphabet reverts back to \"A\" after each input rather than staying\nwhere the last letter entered was. No big deal; it just takes longer to enter the data.\n2. There are a lot of inputs into the system, but only one output (I play this unit through my amplifier/speaker system\nfor better sound). The only output is the headphone jack. An adaptor for this was provided so I could connect to the\namplifier with the RCA jacks, but there was no clue given that this adaptor could be used in this matter (there was\nalso a 3.5 MM input in the back of the unit so I assumed this was for another input rather than output). Perhaps\nanother RCA OUTPUT would be helpful and give better sound quality. Regardless, even without the amplifier, the\noutput of the unit is quite good on its own."},{"reviewerName":"Mehdi Heidarian","rating":"1.0 out of 5 stars","reviewTitle":"One Star","reviewDate":"The manufacturer commented on the review below","reviewText":"the stations already programmed in the radio suddenly vanish and won't show up on the search anymore."},{"reviewerName":"Emily Benekos","rating":"5.0 out of 5 stars","reviewTitle":"Easy to use","reviewDate":"January 5, 2018","reviewText":"Easy to use. Great features-- like dimming screen at night . So many internet radio channels, and much clearer reception than with conventional radio."},{"reviewerName":"Debbie","rating":"5.0 out of 5 stars","reviewTitle":"Great sound!","reviewDate":"December 31, 2017","reviewText":"I love this radio! I just got it today and so easy to set it up. I also ordered the rechargeable battery to make it portable. I can't wait for the warmer weather to bring it outside!"},{"reviewerName":"jay meiswinkel","rating":"1.0 out of 5 stars","reviewTitle":"can't hold a channel","reviewDate":"February 12, 2019","reviewText":"i bought this item because my other table wifi siriusxm radio screen went out after 10 years and it still worked. i buy this item and it cannot hold a channel to save it's life. i am constantly having to reset it. when headphones are in the alarm only works through headphones. the screen is so bright at low level my wife complains. i want to return this piece but i cannot due to the deadline."},{"reviewerName":"Digimc","rating":"3.0 out of 5 stars","reviewTitle":"Loses connectivity","reviewDate":"November 18, 2018","reviewText":"I purchased this radio in May, 2018. With technology, I always wait to post reviews to see how it performs over time. Initially I would have given this unit 5 stars. However, in the past several weeks the radio, regardless of station chosen, loses connectivity and requires a reboot. Since I only listen at night in bed, this is a royal PIA. I have enterprise level wifi equipment and am an IT guy. This is the only, of very many, connected devices that is problematic. I have not contacted the manufacturer and the firmware is current. Unfortunate as it is a pleasure to use otherwise. I don't think I would have purchased this unit had I known.\n\nUpdate 7-18-2019: New issues for several months now.\n1) The volume of each station varies up and down as you listen requiring a reboot to rectify.\n2) At times the station appears on screen but there is no audio at all. It then requires a reboot to return the audio.\n3) Newest and latest issue - All presets disappear and the screen says empty on each preset number. It then requires a reboot to get them back.\n\nAll in all, a problem prone device. Having said that, when it works it is wonderful. If I was aware of a superior radio without problems I would buy it now."},{"reviewerName":"Paul Bogenrief","rating":"3.0 out of 5 stars","reviewTitle":"Will Not Stream Pandora Directly","reviewDate":"March 5, 2019","reviewText":"I have had Grace Mondo radios for years. But the new Mondo+ doe not offer Pandora. To receive Pandora you have to stream it via Chromecast through your computer or phone. Since I use these radios as clock radios using the timer feature, and use them to receive Pandora exclusively, having to stream just makes life too difficult. On the positive side, it does offer SiriusXM if you have an online subscription."},{"reviewerName":"D. Stoner","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"November 27, 2017","reviewText":"A great device! Perfect for adding tunes to the bedroom."},{"reviewerName":"Vincent Bartoloma","rating":"5.0 out of 5 stars","reviewTitle":"Great product","reviewDate":"February 25, 2019","reviewText":"For several years I had the Logitech Squeezebox. For about 5yrs it would inevitably have problems about once a month. Usually it would disconnect with my wi-fi completely out of the blue and then my alarm wouldn't come on the next morning. At first I thought it might be my wi-fi, but it wasn't. Another annoying aspect of that radio was the interface. It was just a total pain to maneuver, showing you one line at a time as you turned the knob. There were other little things which were very annoying.\n\nI finally gave up on it and took a chance with this - and I'm very very glad I gave them a chance. This radio has everything I wanted. First of all, it's much more reliable with the wi-fi. It doesn't just all of the sudden go offline. Next, the interface is much more intuitive. Granted, it also is reliant upon a knob which you rotate to maneuver, but the 3.5\" screen makes a big difference. Scrolling through a menu and a list make a huge difference than a single-lined dot-matrix screen. Finding internet stations is much easier.\n\nAnd another huge addition is the Bluetooth. Being able to control it with another device (phone, pad) adds a bunch to its value. The Squeezebox only had an aux cable - and you need to manuever to the right spot to allow it to be controlled by your other device. This just automatically skips over to your device when you choose it on your phone and start playing. It's basically a wireless speaker at that point.\n\nAnd it's also got a bunch of little settings which had to convenience, such as the ability to adjust the brightness of the screen. You can even make the screen display at different brightness at different times of the day.\n\nI'm happy for Grace. They sound like a great little company. I hope they're able to continue for a while. I have a feeling the internet radio market is about to start getting more players."},{"reviewerName":"Tom F.","rating":"4.0 out of 5 stars","reviewTitle":"Really cool radio!","reviewDate":"The manufacturer commented on the review below","reviewText":"I was getting tired of my trusty old Sony clock radio from high school. It's obnoxious BEEP BEEP BEEP BEEP BEEP BEEP was wearing thin and I was over being jolted awake.\n\nSo, I gave this radio a try. So far, I'm pleased. I really like that I can set various stations as favorites. For example, you could have an iHeart Radio station as favorite 1. Or an XM station as favorite 2, so on and so forth. I especially love how configurable the alarms are. You could wake up to anything from XM's BPM to an Alaskan Wind Storm!\n\n2 things I wish were better:\n*I wish the display wasn't so bright at night. Even on its lowest setting, the unit lights up the room like crazy. It would be nice if I could configure the color of the clock to, say, red. And turn down the back light so it isn't so blinding.\n\n*I wish the feet were a little stickier. Having it on a night stand which has a million coats of poly urethane on it it will tend to slide to the point you need a hand to hold the radio every time you push a button.\n\nIt'd also be nice if it came with a battery backup pack included.\n\nSetup took a little longer than a few minutes. But it was super easy."},{"reviewerName":"Lets Play","rating":"5.0 out of 5 stars","reviewTitle":"Easy setup out of the box","reviewDate":"June 5, 2019","reviewText":"I've only had it for a couple of days now, but so far it's been working fine. All I had to do so was enter the Wi-Fi password, update the software and start listening to music. I searched for local channels and it found my usual go to local station. The Dove WDUV. I'm still learning the user interface. The only problem I've experienced was the Android remote control app. It doesn't work at all. It will not find the radio on the same local Wi-Fi network. It seems a lot of people have the problem if you read the reviews. I really wanted to use the phone app."},{"reviewerName":"Boz from Oz","rating":"3.0 out of 5 stars","reviewTitle":"Very Nice Radio Design but no ethernet jack","reviewDate":"April 11, 2018","reviewText":"I only gave it 3 stars since it is missing an ethernet jack. The WiFi connection is not that great. I like the interface. It would be nice to have night lights on the 10 station presets, but adding felts to keys 1, 3 and 5 made key access easy in the dark. Be sure to get a Grace Digital online account since this allows you to find stations online and then create directories such as Comedy, News, Old_Time_Radio and Music with your favorite stations. Now you have access to much more than the 10 presets. The Clock and Alarm features were easy to set. I moved the radio away from my bedside night stand to receive less WiFi radiation.\n\nNow I get free and sometimes clear radio stations from all over the world. They should add an ethernet jack."},{"reviewerName":"David Lida, author of First Stop in the New World: Mexico City, Capital of the 21st Century","rating":"4.0 out of 5 stars","reviewTitle":"I'm very happy with this radio","reviewDate":"May 29, 2018","reviewText":"For years I had a Logitech UE Smart Radio, which died a few months ago. Logitech no longer makes or repairs these, so I wanted to buy a new internet radio. After a little research, I chose the Grace Digital Mondo due to what I consider its reasonable price and all the good reviews and press it received. I'm very happy with it. It's easy to set up and program. You can choose up to ten \"favorite\" stations that you get with the press of a button or two, and many more if you register with them on the internet. It's lightweight and therefore easy to carry from room to room. I have one tiny complaint, and this is something that should only concern people who, like me, live outside the U.S. -- the battery cannot be shipped everywhere via Amazon. I had to get it shipped to a friend in the U.S. who came to visit me. This was not a huge inconvenience, but it's something to take into account if you don't live in the U.S. Again, I'm very happy with this radio."},{"reviewerName":"Scott","rating":"5.0 out of 5 stars","reviewTitle":"Listen worldwide with clarity","reviewDate":"July 1, 2018","reviewText":"Great radio to have to hear radio stations from around the world with ease. I do have a shortwave radio and still enjoy that, but there are much less international broadcasters on shortwave than years past, and this does have digital quality. Also works great with SiriusXM capability if you have a subscription. Regardless, an excellent and fun radio to have. Highly recommended to get the ACC-IRCLI rechargeable battery with it as that is the only wan to make it portable. If you get this radio, make sure to let it get its occasional firmware updates to keep its feature set up to date. You also might want to look at the book \"The Worldwide Listening Guide.\""},{"reviewerName":"The Pathfinder","rating":"5.0 out of 5 stars","reviewTitle":"Great Internet Radio!","reviewDate":"June 29, 2017","reviewText":"This radio is much improved over the previous version, sound is much improved, feature set is better, and with the built in Chromecast music service choices are almost endless. Top that off with the fact that they have announced that new features are yet to be incorporated in future firmware releases. This is a great internet radio."},{"reviewerName":"Ongeblozzen","rating":"4.0 out of 5 stars","reviewTitle":"Excellent radio with many features, although a little complicated","reviewDate":"April 26, 2019","reviewText":"An upgrade after ten years with my previous Logitech Squeezebox radio, although very similar in look and features. In many ways this is a superior design, with the ability to use other apps such as Sirius, etc. Programming is less than intuitive, but once you have set your presets (a doubling up using the shift key for buttons of favorite stations ) it is relatively straightforward for daily use. A few shortcomings have been ably described by previous reviewers and, annoyingly, it does not appear to memorize WiFi login passwords, but in my experience, this is the best table top Internet radio of its kind out there right now. The Tivoli units look sharp but are more for looks and not sound and feature-laden advantages of the Grace Mondo+."},{"reviewerName":"Scott K","rating":"1.0 out of 5 stars","reviewTitle":"Crap don't buy","reviewDate":"The manufacturer commented on the review below","reviewText":"Device would constantly reboot with updates, and interface stopped working within a few months of owning"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Crystal clear sound and convenient digital radio","reviewDate":"December 8, 2018","reviewText":"For many years my wife and I had a regular AM/FM radio in our kitchen that we listened to a lot. It always had some buzzing and crackling. When I changed out our overhead lighting it got even worse so I set out to find a solution. The Mondo+ solved our problem. I found it fairly easy to set up and find my radio stations that I wanted. I thought that I might have to go through an app (you can go this route), but that wasn't the case. I can search and save radio stations straight from the Mondo+ search software. If you register the Mondo+ on your computer you can also save stations and podcasts via your computer so I tried it. Afterwards I went to my Mondo+ and they were magically there. I couldn't be happier. We now have nice clear sounding radio."},{"reviewerName":"Mark Rorabaugh","rating":"5.0 out of 5 stars","reviewTitle":"I found this radio during my research and it appeared to be the best radio for what I wanted to do with it","reviewDate":"February 14, 2018","reviewText":"I did a lot of research when I was looking for a radio or Bluetooth speaker for my new garage. I found this radio during my research and it appeared to be the best radio for what I wanted to do with it. I was especially interested in the SiriusXM capabilities via WiFi and Bluetooth. Upon receiving it I set it up and hooked it up to my WiFi and my Sirius account and it works as advertised. I love it and it has far exceeded my expectations. I also found that I like the internet radio and I heart radio capabilities it has. As far as the sound it sounds great and more than fills up my 30-32 foot garage. I would highly recommend this radio."},{"reviewerName":"Rango","rating":"5.0 out of 5 stars","reviewTitle":"Does it all without a subscription","reviewDate":"February 22, 2018","reviewText":"Absolutely awesome! This device does it all and you dont even need to purchase a subscription to get your favorite stations! Who needs satellite radio? Stream your own from your iphone or scan the thousands of selections available for free. Forget about AM/FM it doesn't have it and you don't need it with this thing. Only drawback is if you want to position it somewhere without a/c power you will need to buy the optional lithium rechargeable battery pack but that is a minor inconvenience. Five stars plus!"},{"reviewerName":"D Tbury","rating":"5.0 out of 5 stars","reviewTitle":"Excellent sound and convience","reviewDate":"May 20, 2019","reviewText":"The product is an addition to our Grace Digital unit which we still use. We use both. I like the bluetooth feature that allows streaming from a phone or tablet. The remote can be used or you can control it with an app. I only wish both units were controlled from the same web site. The streams are from different sources which do not give you sinked radio if you listen to the same station in two rooms. I definitely like the newer Mondo + model."},{"reviewerName":"M. Crestwood","rating":"2.0 out of 5 stars","reviewTitle":"Great when it worked ... then it didn't.","reviewDate":"September 7, 2018","reviewText":"Bought this 08/17/2018 for my office. It is now 09/07/2018. The radio at my home (same) works perfectly. This one started getting glitchy; freezing for a few seconds, then a few minutes, then this morning it glitched it's last. Nothing I did could bring it back. Tried several open wi-fi networks ... logged into my own three times. Then I unplugged it for a few minutes and lugged it back in. That was the death of it. The date on the home screen reads 12/31/1999. Wi-fi shows connected but there is no internal activity. Oh well. As I mentioned, the radio at my home works well. Maybe I just got a lemon."},{"reviewerName":"Amazon Customer","rating":"4.0 out of 5 stars","reviewTitle":"Just OK Internet radio","reviewDate":"June 8, 2019","reviewText":"It's not very good looking, but not really ugly. I really wanted something more than over the air radio since I hate trying to stream from my phone or computer to a bed side radio. This unit works fine, but to find the stations you want can really tax your patience. And you can get to only a limited range of stations, so unlike on your computer or phone. And as some other viewers have said, you can't use services such as Tunein to locate them either. The sound is pretty good. The price is higher than its worth but not terribly so. I just wish there were better alternatives."},{"reviewerName":"P. Young","rating":"4.0 out of 5 stars","reviewTitle":"Works great as an alarm clock. Customer service not be found.","reviewDate":"December 7, 2018","reviewText":"I really like the ability to dim the display to various levels. Great when it's by your bedside. Wish the sound quality was better. Also wish I could easily add my Slacker account directly onto the radio. I guess I could broadcast it from my iPhone, but I like to turn my iPhone off at night, so this means I can't fall asleep to music from Slacker.\n\nThe instructions weren't the best, but I eventually figured everything out. When I tried to call for tech assistance, I got a recording telling me that all operators were busy and to try and call back later. I tried several times, to no avail. I wouldn't count on customer service. I was not calling during Black Friday or Cyber Monday, so no idea why they should be so busy."},{"reviewerName":"ice cream man","rating":"5.0 out of 5 stars","reviewTitle":"Our Second Grace Audio Product","reviewDate":"January 21, 2018","reviewText":"Bought one of these for our master bath a year ago and just got another for the kitchen. I'm a bit of an audiophile and these sound great. The new model uses casting so you start the apps on your phone and \"move it\" to the radio. A little different than the older model works which has the apps built in but once we got used to it are very happy."},{"reviewerName":"R Pearse","rating":"5.0 out of 5 stars","reviewTitle":"A whole new world","reviewDate":"September 5, 2019","reviewText":"The past ten years I have been living in a valley with weak radio reception. The one station I could receive played a good selection of Classic Rock. They changed format and then there were none. I researched the Amazon offerings and this one met most of my requirement. It will receive local Internet Radio, I Heart Radio and Sirius XM but not Pandora. The setup is a little funky in that you have scroll through letters and number to log onto the internet and the subscriptions. But it was not hard. The sound is fabulous! I have 10 presets defined and enjoy a variety of channels.\nIt is a whole new world from that one static filled station to the robust sound and the variety available now."},{"reviewerName":"M. Hardwick","rating":"4.0 out of 5 stars","reviewTitle":"Audio output line level is too low.","reviewDate":"March 14, 2018","reviewText":"Generally works well and sounds good, although the PC interface is confusing. The location of the volume control knob (on top) is annoying, especially if the unit is placed on a high shelf. The audio line output level is way too low for compatibility with conventional stereo systems. I had to add an outboard line amplifier to fix this last problem. The radio died once, but came back to life after cutting and restoring power."},{"reviewerName":"MOMMA MIA","rating":"5.0 out of 5 stars","reviewTitle":"GREAT RADIO","reviewDate":"November 2, 2017","reviewText":"I have had the Crane Cc Wi-Fi radio for several years, but recently they stopped streaming my favorite stations due to Clear channel stations license running out. I purchased this radio as I found I can stream my stations thru I heart, which this radio has. I just got it set up and also find that the quality of the audio sound exceeds my expectations. Glad I made the switch."},{"reviewerName":"Pataba","rating":"5.0 out of 5 stars","reviewTitle":"Love, love, love this radio.","reviewDate":"April 27, 2018","reviewText":"I have had this radio for about six weeks now and enjoy it regularly. I also bought the battery because I wanted to listen to it while working in the garden and around the pool.\nThe good:\n1) Sound is excellent for a small radio. While it is unlikely to please a true audiophile, I find it to be very good. I added a pair of external speakers that improves the quality even more.\n2) WiFi range is very good. I can take it anywhere inside the house and about 100 foot radius outside. Past that range it gets spotty.\n3) I can find a radio station by locality, genre or name. Once I find a station I like, I can add it to my favorite stations on the Grace Digital website. I don't know if there's a limit to the number of stations that can be added, but I have added several with no issue.\n4) I can listen to mp3 or ogg files using the USB connection. I think it recognizes other formats, but those are the only ones I have confirmed. I am using a powered 4-port USB hub to connect more than one USB device. It recognizes both the portable USB drive and thumb drive that I have connected and I can choose from either to listen.\n\nThe bad:\n1) The only complaint I have about this radio is the handle. It is only an open area at the top of the radio and is not balanced at all. My hands are large enough to fit around the entire radio, but someone with smaller hands might have difficulty carrying it.\n\nConclusion: If you are looking for an internet radio, buy this one. You won't be disappointed."},{"reviewerName":"Robert Plotkin","rating":"5.0 out of 5 stars","reviewTitle":"Great radio with good features","reviewDate":"September 20, 2018","reviewText":"I have been using this radio with both a wired cat6 connection and WiFi and both work very well. The feature that I appreciate most is the ability to go back to specific shows that I missed that day. My only comment is that if this radio is used on a nightstand next to the bed, the screen is pitched backward and it makes the black selector bar on the screen is very hard to read while laying in bed. I was able to resolve this by building a tray for the radio which corrects the screen pitch angle to vertical and the screen selector bar is now readable."},{"reviewerName":"EEF","rating":"4.0 out of 5 stars","reviewTitle":"Works as advertized, but one little complaint","reviewDate":"February 1, 2018","reviewText":"This is a handy little device to pick up radio stations through wifi, and can pick up stations from all over the country. My wife likes to listen to particular radio programs at particular times, and I was able to find stations that carry those programs exactly when she wants. Some of the stations are over 1000 miles away and come in perfectly through the magic of the internet!\n\nProgramming stations is not too hard because you can use the knob to select radio station call letters.\n\nMy only complaint is that sometimes it doesn't work and I have to turn it off and on to make it work again."},{"reviewerName":"Tom Carty","rating":"4.0 out of 5 stars","reviewTitle":"Works as expected with pretty good sound","reviewDate":"June 30, 2018","reviewText":"I bought this Mondo to replace a previous one that I bought a few years ago. The old radio's volume control became very erratic making it impossible to set the volume to a desired level. Works as expected with pretty good sound. I use it almost exclusively by feeding the line level audio to an FM transmitter allowing me to broadcast the programs to any room in the house having an FM radio, and to a headset radio when I'm on the lawn tractor. Sometimes there are buffering issues but I've never been able to conclusively cite the Mondo as the problem because my son sometimes stresses the network playing video games. Also, the performance of my internet service is sometimes in question. So overall I'm pleased with the unit."},{"reviewerName":"Stephen C.","rating":"1.0 out of 5 stars","reviewTitle":"poor quality","reviewDate":"The manufacturer commented on the review below","reviewText":"First one that I purchased worked for a month or so, then would not connect to wifi or receive chromecast. Replacement didn't work at all. This, after my last Grace product stopped working after about three years. No more Grace products for me. Three strikes, as they say."},{"reviewerName":"sean riley","rating":"1.0 out of 5 stars","reviewTitle":"Google cast completely stopped working after 6 months","reviewDate":"June 18, 2019","reviewText":"I really enjoyed this radio for about 6 months. The programmable buttons let us play our favorite stations easily and the Google Cast feature allowed it to integrate with my other google speakers. I could cast to just this radio or to the speaker groups that this belonged too, which was awesome. But after about 6 months, the cast feature completed stopped working. I factory reset it a couple times and began engaging with support (following their steps) but there has been no response for 3 weeks now and the radio still cannot be cast too. All other devices in my home still cast fine. The casting was the main reason we bought this so it is basically now just a \"dumb\" radio for us now, and not nearly what we want. I'll keep trying, but this has been very unfortunate."},{"reviewerName":"toyman","rating":"4.0 out of 5 stars","reviewTitle":"Sleep Timer adjustable - Battery not included - Extended coverage","reviewDate":"March 19, 2019","reviewText":"Grace Digital Mondo+ is a great internet radio! My wife and I listen to talk shows on the Mondo+ at night. The radio has a very good sound and was easy to set up. One of my concerns was the sleep timer. We turn on the radio at night in the sleep setting, but, most radio's I looked into had a 10 minute, or a timer button you need to keep pressing to increase times by 10 minute increments. Since we leave the radio run for 2 to 4 hours the 10/15min would not work well for us. I took a chance on the Mondo+ and was very happy to find that I could set the timer to start where ever I wanted. I set the start of the sleep mode for 2 hours (could modify later if I wish) and if I want more sleep time every press of the button add's another 10 minutes. I would have liked if this 10 minute increments could be adjustable too, but so far I have not found that as an option. There are a lot of stations and going through them takes time. The way the radio stations are found requires a lot of menu work. I would have preferred just turning the tuning knob to get the next station. Maybe there is a way to do that but I haven't found it yet. In the future I will explore the options and take a better look at programming from the web site for the Mondo+. The only thing that I find frustrating, is the battery needs to be bought separately and is expensive. To me a battery case should be provided with the basic radio that can use standard batteries. If a rechargeable battery is preferred, that could be purchased separately. The purchase of the radio was easy and the Amazon Prime worked great getting the radio to me on time. The added insurance I purchased separately to add a few years of repair coverage is confusing. I never received any type of document saying I am covered for an extended time **** (see UPDATE at end of review). I didn't use tech support so I could not put a grade on them. Over all, I highly recommend the Grace Digital Mondo+ for a great internet radio.\n**** UPDATE: The added insurance I purchased, DID arrive in my email on time. I overlooked it by accident! I was expecting something in snail-mail but the information WAS in my email."},{"reviewerName":"G. P. Aigen","rating":"5.0 out of 5 stars","reviewTitle":"Hooked it up, selected the stations I wanted and never looked back","reviewDate":"August 19, 2019","reviewText":"This replaced a LogiTech wifi radio that I had for many years. I always had problems with the LogiTech as it would lose the signal from my router or mesh network and it would be a big pain to get it back online. This Grace Mondo has been in use for a couple of weeks now without a single disconnect or other problem. It just works like an FM radio would (if an FM radio could get stations from around the world). I haven't tried to cast to it or any other connection, just wifi and I am happy as can be."},{"reviewerName":"Amazon Customer","rating":"4.0 out of 5 stars","reviewTitle":"Awesome little radio. Great sound. Buy Grace Digital's battery.","reviewDate":"May 27, 2018","reviewText":"We love this little radio. The sound it produces is such quality that you would think you have a bigger system.\n\nFYI - Do not buy the battery that is \"usually purchased\" with this item. The battery burnt up twice for me. Grace Digital had a battery and they sent me one and it fits great and does not burn up.\n\nI am giving 4 starts only due to that you can't install Pandora on the radio. You can Chrome Cast Pandora all day while using the battery though."},{"reviewerName":"Radbuster","rating":"3.0 out of 5 stars","reviewTitle":"Nice but has bugs","reviewDate":"December 27, 2018","reviewText":"I upgraded from a early Reciva model. They are played thru my own amp and speakers, so no review on sound quality. I like the screen and other features. I just have trouble with searching for stations, and especially for Sirius channels. The thing hangs up and sits there. I don't see the hour glass; its not searching. Its not doing anything. I often have to pull the power cord (power button is also frozen) and start over. Very frustrating. I expected more."},{"reviewerName":"grandma","rating":"3.0 out of 5 stars","reviewTitle":"When it works, it's fine.","reviewDate":"November 21, 2018","reviewText":"Too bad it doesn't work more often. Just found I've only had it 4 months. About 2 months ago, it wouldn't connect to the internet, but after being unplugged for a day, it worked again - until 4 days ago. Tried 'factory reset' as last resort, now it says it's connected, but does nothing. No radio. No time. Gives the date as Jan 3, 2000. Customer service acknowledged my email 3 days ago, but that's it, so far. NOT a happy purchaser!!"},{"reviewerName":"Lisa Jones","rating":"5.0 out of 5 stars","reviewTitle":"This is the best evolution of their product","reviewDate":"July 28, 2018","reviewText":"Been using Grace WiFi radio's for many years. This is the best evolution of their product. Connects to stations across the world and many other services. Easy logical format to use. Has the quirps of all WiFi radios. If you want a good package that has good sound and intuitive tuning this will work for you. Can store an infinite number of stations through the Grace WWW location and all your grace products can use your list of stations.Listen to the world via this grace radio. Sleep timer, alarm, and many usable functions."},{"reviewerName":"groundguy","rating":"5.0 out of 5 stars","reviewTitle":"Great Buy","reviewDate":"March 11, 2019","reviewText":"This was purchased as a gift for me, but the entire family loves it. Small, portable and easy to use. Love having the convience of a remote. Also like not having to turn on the T.V. to listen to music anymore. Sound quality is great."},{"reviewerName":"Patrick Erbeck-McKinnion","rating":"5.0 out of 5 stars","reviewTitle":"Nice radio, (and problems solved!)","reviewDate":"October 20, 2018","reviewText":"It's a nice little radio, very easy to set up and use.\n\nThere was one problem, a defective remote control. It took a while to get a replacement, mainly due to the post office messing up my deliveries. Finally got a new one, and it works like a charm. I edited my review to reflect this.\n\nI'm happy with this product"},{"reviewerName":"JA30528","rating":"5.0 out of 5 stars","reviewTitle":"Works great. Hooked it up to send audio to my ...","reviewDate":"February 18, 2018","reviewText":"Works great. Hooked it up to send audio to my stereo receiver and output to my B&W speakers. Sounds great. Best of all no more interference when listening to radio! Nice features and build quality. I little pricey but worth it for the features and ease of use."},{"reviewerName":"Chroma","rating":"4.0 out of 5 stars","reviewTitle":"Good sound, useful if you already have stations in mind.","reviewDate":"March 5, 2018","reviewText":"I like listening to music on this device. It sounds good and plays one of my favorite internet stations (Album 88 Atlanta).\n\nHowever, discovery of good stations to listen to is lacking. There's a lot of navigational dead ends. Only 10 presets. There are \"favorites\" folders, but apparently no way to use them from the device itself, or even the smartphone app. Entering letters for search is tedious.\n\nOverall, I don't regret buying this, but if the interface was easier to use, I'd be a lot happier."},{"reviewerName":"Thomas K.","rating":"4.0 out of 5 stars","reviewTitle":"A nicely designed and fully functional internet radio","reviewDate":"December 31, 2017","reviewText":"After my Logitech Squeezebox went belly up I looked for something to replace it. After doing some research the Digital Mondo+ looked like a good replacement. It is! There are more stations available than I imagined. I liked the way the stations were organized. I found a few local stations right away and added them right away. It is easy to set and change alarms. The sound is pretty good for a small device. The sleep timer feature comes in handy. The remote control is a bonus. It would be even better if the keypad had some kind of backlight to be able to use in a dark room.\nI don't like the way the screen brightens when a change is made to the volume, station selection etc.. This is really distracting in a darkened room. It also takes a while to get use to using the push buttons when selecting a saved station. The station may take a while to play because of buffering. If you hold down the button too long you've saved the station as a preset."},{"reviewerName":"Harold R. Mchugh","rating":"5.0 out of 5 stars","reviewTitle":"Great radio.","reviewDate":"January 25, 2018","reviewText":"This is the second unit that I have purchased. Very pleased with these radios."},{"reviewerName":"Jeff Howard","rating":"5.0 out of 5 stars","reviewTitle":"Everything I was looking for","reviewDate":"July 7, 2019","reviewText":"Needed something to play lullabies and classical music for our baby, and got really tired of cheesy repetitive music and light projection systems pushed out to parents these days. Did a good bit of research and decided on the Mondo+ and it was everything I hoped it would be, wanted and needed; tons of free internet radio genres and channels to chose from, iheart radio stations, plus the pay music services all in a very easy to set up and use device.\n\nThe sound clarity is really good, and gets plenty loud. It even has a sleep function if you don't want it on all night. The display can dim down quite bit, which is great for us to not disturb our little one with unwanted light. All in all I'm very pleased with it and pleasantly surprised. Haven't had any connection issues what so ever. Wish the buttons could have backlight, but it's definitely not a deal breaker. Great internet radio!"},{"reviewerName":"Miss. Carol","rating":"5.0 out of 5 stars","reviewTitle":"I LOVE this radio","reviewDate":"November 22, 2018","reviewText":"I can wake up to any internet radio station, buzzers, birds, waves, whatever. It has a sleep timer that can be set to any duration which can also play any internet radio, I heart radio, bbc, npr, podcast, even a wide selection of 'white noise and nature sounds. This little radio can sync to the larger Encore + system, or another of the same Mondo +, in another room so that the radio's play on the same beat; if one is hooked up to ethernet cable and the other on wi-fi, they do not play in sync and the wi-fi radio will be a few beats, or half a sentence behind. Both must be wi-fi for them to sync. The sound is ok. It has an equalizer so podcasts can have more vocal ranges. Was going to buy the Bose internet radio, but I am VERY happy with both of my Grace Digital products."},{"reviewerName":"L. Vandeveer","rating":"5.0 out of 5 stars","reviewTitle":"Love, love, love these radios!","reviewDate":"September 13, 2019","reviewText":"So much so that I bought four of them. I would have purchased five, but they wouldn't let me! I have one in my bedroom, one in my office, one in my kitchen and one in my living room. I would have put the fifth in the bath.\n\nThe sound quality is excellent. Plus, obviously, since it's internet, you can listen to stations all over the world. So much to explore!\n\nThis is such a great product. Treat yourself. You won't regret it!"},{"reviewerName":"Tytania891","rating":"5.0 out of 5 stars","reviewTitle":"Awesome radio","reviewDate":"January 30, 2019","reviewText":"I love this radio. Picks up local stations using their internet streams so the sound is always clear. You can also set up iHeartRadio, Sirius XM or other accounts and play them on here too. It also acts as a Chromecast device so you can cast audio from apps on your phone or other device to the radio. It’s great!"},{"reviewerName":"Firewire300","rating":"5.0 out of 5 stars","reviewTitle":"Overall this a very good Streaming radio","reviewDate":"February 10, 2018","reviewText":"Overall this a very good Streaming radio. Has not dropped out once yet from buffering problems. Just keeps playing from my Wireless Internet connection. I have only used the built in stations so far and very happy with the selection to choose from. Setting up your internet connection will take a few minutes to enter the password but it scans to find the available networks. No issues with staying connected on a network or WiFi range. The more you play around with it, the more features you will find. It even has some Live ATC feeds saved by location in the USA. No hesitation in recommending this product. I am using this to feed a Low Power FM broadcast station at my rural property. That way I can listen to the stream on any FM radio. Cheers VE3 OPD"},{"reviewerName":"Shaked","rating":"5.0 out of 5 stars","reviewTitle":"Best product you can get...","reviewDate":"November 26, 2017","reviewText":"Perfect if you are looking for the best internet radio do not think twice also great support =)"},{"reviewerName":"Daniel W.","rating":"2.0 out of 5 stars","reviewTitle":"Radio buffers frequently","reviewDate":"The manufacturer commented on the review below","reviewText":"worked great for about 3 weeks, then came two firmware updates and that's when it stopped working great. I have an older Grace radio that works well, wanted to upgrade to a newer model with more features, I'll continue to use my old radio until it is completely obsolete. If it would work like it is supposed to it would be a five star rating."},{"reviewerName":"Fire&ice","rating":"1.0 out of 5 stars","reviewTitle":"very poor electronic device. my worst.","reviewDate":"October 11, 2019","reviewText":"Difficult to setup. customer s upportwas just pln rude. nothing is intuitive about using it volume was adequate or me, usinhearing\naids. i can type apple ipad is causiing all these errors and i am worn out fixing.\ndont buy it just quit t 9 months and only 30days to see f it wrks. it t\noo longer than 30 days to get it working. I did enjoy te birds chirping alarm. verypeaceful\nDO NOT BUY THIS. SORRY FORR apple’s sloppy typing. $18/ month to use. $200 in agravation."},{"reviewerName":"Forgiven","rating":"5.0 out of 5 stars","reviewTitle":"A VERY HAPPY CAMPER...","reviewDate":"October 26, 2019","reviewText":"This is one great radio. Sounds great and has great features and their support team helped me get started and find stations I like. Can't ask more than that...\n\nUPDATE: Had a power failure and the radio screen became unreadable and so they replaced it so bought the extended warranty just in case. No other TV's or appliances had a problem... concerned it is too sensitive so it is plugged into my UPS with computer..."},{"reviewerName":"Rob","rating":"4.0 out of 5 stars","reviewTitle":"Excellent overall.... could be improved","reviewDate":"November 18, 2018","reviewText":"Superb radio in every category worth mentioning. Nice rich sound to it. I use the radio, and clock/alarm functions on my nightstand.\n\nFor my uses I REALLY wish the pushbuttons all had a dim LED dot under them to find the controls easier in the dark.\n\nNeeds an easier/quicker method to turn off the snooze function when done using it.\n\nFirst one I received had a defective display that would occasionally pixilate along with unresponsive buttons.... which I returned. Hope this one lasts."},{"reviewerName":"Jack Bayes","rating":"5.0 out of 5 stars","reviewTitle":"Works beautifully on internet radio","reviewDate":"June 18, 2019","reviewText":"We listen to Serious music stations -Suisse Radio Classique, etc., and this little radio works very well for a kitchen unit. It delivers a remarkably well-balanced, clear sound for its size and cost. We do have local fm stations, but we do not use them because there is NO static on internet radio, and we get clear, noise-free music from solo to symphony that is very listenable."},{"reviewerName":"Trainer Lady","rating":"5.0 out of 5 stars","reviewTitle":"REALLY great radio!","reviewDate":"November 30, 2018","reviewText":"I had two older Grace internet radios, the black box models, like 8 years old. I'm way out on a remote ranch. They started being quirky, knobs not working, signal lost, one would tell me KFI station in LA doesn't exist. So I popped for one new one, and all I can say is it's amazing! It's pretty, easy to tune, the remote is neat. It turns right on fast! I have this one in a bedroom with poor signal but the radio works fine. I will get another one to replace the living room radio."},{"reviewerName":"org_xena","rating":"5.0 out of 5 stars","reviewTitle":"A Must Buy!","reviewDate":"July 9, 2017","reviewText":"I have to have noise to sleep! We have tried several different radios, but in a room the reception was deplorable! We installed (which was easy) our Grace Mondo and love it the reception is super clear and we can listen to any genre of music we want! I have had it installed for 3 days and I have never slept so good. I have slept through the nights in a long time. Thank you so much Grace for making a fantastic product. Wish I would have bought it sooner!"},{"reviewerName":"Reggie B","rating":"5.0 out of 5 stars","reviewTitle":"Great radio for Sirius XM internet account","reviewDate":"July 29, 2018","reviewText":"My old radio died I bought for Sirius XM. They no longer sell it and representative mentioned this radio. I bought it, it offers more features of other online radio stations and Sirius. Sound is okay. The old radio had better sound speakers."},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"I Bought 2 !","reviewDate":"February 15, 2019","reviewText":"I purchased this radio as a Christmas present for a friend who liked to listen to late night talk radio but found the stations often faded out throughout the evening. This radio when locked into a wifi signal never fades out and opens up a whole new world of stations. I was so impressed with the results that I purchased a radio and battery pack for myself."},{"reviewerName":"Robert G. Wood","rating":"4.0 out of 5 stars","reviewTitle":"But inside our home or other private locations it does fine.","reviewDate":"November 30, 2017","reviewText":"The radio is extraordinary. As promised, it allows high quality reception from all the Sirius XM channels (if you have a subscription), countless iHeart stations and many others by genre or location And that's just domestic; many other countries can be accessed if you wish. It's a godsend for us living in rural Wyoming. High quality speakers too.\nMy only dissatisfaction comes from the inability of the radio to access the internet inside hotels, motels or other public places. It can't get to the 'Net through the \"Accept Terms of Service\" screen.\nBut inside our home or other private locations it does fine."},{"reviewerName":"Seth","rating":"3.0 out of 5 stars","reviewTitle":"Good quality overall but has Bluetooth issues","reviewDate":"October 4, 2018","reviewText":"Easy to set up, good sound quality, lots of connectivity options. Main issue I have seen is when playing a book on Kindle via Bluetooth, after pause the Mondo will lose connection, and can be difficult to restore, occasionally requiring a reboot. No response from tech support after 4 days. Other than this, satisfied with the unit."},{"reviewerName":"Gerard Perna","rating":"1.0 out of 5 stars","reviewTitle":"very dissapointed with the new Mondo","reviewDate":"June 30, 2019","reviewText":"the reason for my poor rating is not the radio I love Grace Digital I own five of their radios,The reason Im so so disappointed is I bought them for listening to my Pandora radio I love my music but when I received my new mondo it told me I have to use my phone and the wifi it to the mondo like a Bluetooth speaker,that made no sense to me at all what do I need their radio for I will just buy a speaker so all I can ask is Grace digital make your radios pandora ready or its time to find a new Company.So if your looking for a radio to pick up Pandora move on"},{"reviewerName":"cliffw","rating":"5.0 out of 5 stars","reviewTitle":"Nice internet radio with a clear sound","reviewDate":"February 19, 2018","reviewText":"Nice internet radio with a clear sound, a lot of nice feathers. You can receive radio stations the world over. Only one problem, not that easy to set up, not user friendly."},{"reviewerName":"Lepcs","rating":"4.0 out of 5 stars","reviewTitle":"Sound quality","reviewDate":"June 8, 2019","reviewText":"I previously owned a Squeeze Box radio and was disappointed that I could not replace it. The Grace digital Mondo has features which are superior to the squeeze box. For example, I am able to bookmark 10 stations and It is easy to get information about the piece of music which is being played. My only disappointment is that the sound quality of the Mondo, which is pretty good, is inferior to that of the Squeeze Box. We were always amazed at the sound quality of that Squeeze Box."},{"reviewerName":"J. Nichols","rating":"5.0 out of 5 stars","reviewTitle":"Exactly what I wanted","reviewDate":"May 25, 2019","reviewText":"Finally made the switch from regular am/fm clock radio to this bad boy. The clock radio functionality is perfect. For example programming wake up times differently for week days and weekends. Having internet radio station access is a whole new world. To ease finding and selecting internet radio stations a web site is provided for use with a PC. Then my stations selections are automatically assigned to my radio. Try it - you'll like it!"},{"reviewerName":"D. Hagemeier","rating":"1.0 out of 5 stars","reviewTitle":"Great radio, when it works","reviewDate":"June 15, 2019","reviewText":"I've purchased nine to provide background music in nine small retail locations. The radios sometimes shut themselves off mid-day for no apparent reason. Some iHeart stations drop out for no apparent reason. Grace Digital support promises to follow up, but they don't. I love the design and user interface. But poor reliability and lack of support from the manufacturer = 1 star."},{"reviewerName":"Reinhard Margies","rating":"5.0 out of 5 stars","reviewTitle":"I need a battery for moving the radio from room to room.Detailsfor battery reqprice","reviewDate":"December 10, 2018","reviewText":"I baught the internet radio Grace Digital Mondo+ Wireless Smart Speaker & Internet Radio with WIFI+Bluetooth and 3,5\"Colour Display for $ 149,99.\nI want also the matching battery, but apparently the battery cannot be shipped to Barbados, so I want it be shipped to an address in USA. Unable to find the item number and exact description for the battery.Pls. advise urgently battery details,which I have to send to my friend in USA. Thanks for immed.help. Regards, Reinhard Margies,Barbados BB26085"},{"reviewerName":"Jankmeister","rating":"5.0 out of 5 stars","reviewTitle":"Great sound, super easy setup.","reviewDate":"September 18, 2018","reviewText":"Love it! Set up super easy, hundreds of pre set channels by genre. 5 minutes after opening the box it was on and working. Very easy XM set up."},{"reviewerName":"clhodg","rating":"5.0 out of 5 stars","reviewTitle":"Super Powerful & Great Speakers!","reviewDate":"October 24, 2018","reviewText":"I love this radio. I have been able to find radio stations that I couldn't get before without using my computer! Great buy & worth every penny!!"},{"reviewerName":"MauiBu","rating":"5.0 out of 5 stars","reviewTitle":"Excellent Internet Radio!!","reviewDate":"July 15, 2017","reviewText":"Firstly, I love love love this radio! Did I mention that I LOVE this radio...?! :)) In fact, I just ordered a second radio for my sister.\n\nI love the aesthetics of the radio, I love the warm sound, I love the remote, I love the iPhone app, I love the push buttons, I love the sleep timer and alarm clock, I love that so many functions are easily adjustable!! Mostly, I love being able to listen to Sirius (and hopefully at some point, Pandora), without having my iPhone turned on!! I am one of those people that likes to shut down their iPhone at the end of the day and disconnect. So, being able to use the radio as a standalone player is really important to me. Until Pandora becomes a built in app, using Chromecast to connect is super simple.\n\nMondo + is exactly what I was looking for in a standalone tabletop WiFi Radio. Many of the other more expensive tabletop radios are mostly streaming radios. Mondo + filled nearly everything on my checklist!\nAnd oh by the way, WiFi connectivity and radio functions have worked flawlessly for nearly a month. This is a solid internet radio.\nBravo to Grace Digital!"},{"reviewerName":"Smort","rating":"5.0 out of 5 stars","reviewTitle":"Excellent Internet Radio","reviewDate":"The manufacturer commented on the review below","reviewText":"An excellent radio. Sound is decent (not stereo -- unless you hook it up to a receiver that is), and though it takes a while to figure out the controls and where everything is, it does an excellent job. I wish there were more presets (there's so much good material on the Internet), but it's just a wish-list item, not a drawback."},{"reviewerName":"Jose A.","rating":"5.0 out of 5 stars","reviewTitle":"Amazing","reviewDate":"June 1, 2019","reviewText":"Bought this for my mom. Installed the update and got her radio stations programmed in. She’s one happy lady now. Haven’t had issues and I keep getting thanks from her every time I go see the parent units."},{"reviewerName":"TJ Johnson","rating":"5.0 out of 5 stars","reviewTitle":"Great wifi radio","reviewDate":"February 19, 2019","reviewText":"I love this wifi radio. It's well built and works great."},{"reviewerName":"AL","rating":"1.0 out of 5 stars","reviewTitle":"seems to be dead after just over a year","reviewDate":"August 14, 2017","reviewText":"After just over a year, the item no longer syncs to house wifi (which is strong). I have an email into GraceDigital to see what they are willing to do. Since it is beyond the year warranty, the fee to fix is $32.99. We'll see."},{"reviewerName":"Johnathon","rating":"3.0 out of 5 stars","reviewTitle":"sounds good & very useable receiver","reviewDate":"July 26, 2018","reviewText":"When it works it is awesome, I have had this SiriusXM speaker receiver for a month now & it works & sounds good I have it going through my Onkyo receiver, now the bad part , used on a daily basis but about once a week it locks up & I'm unable to change stations or even turn it off so I unplug the power & do a reboot then I'm good for another 5 days, this happen on Siriusxm and other sources it doesn't matter, possible software bug ?"},{"reviewerName":"Bobby R.","rating":"1.0 out of 5 stars","reviewTitle":"DON'T BUY IF YOU WANT A PORTABLE RADIO","reviewDate":"January 25, 2019","reviewText":"Battery changed out twice WILL NOT HOLD A CHARGE WHEN UNPLUGGED FROM HOME CURRENT AND THE RADIO OFF. VERY SAD I PURCHASED THIS PRODUCT AND DID FIND OUT WITHIN THE 30 DAY WINDOW.,"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Enjoy radio again!","reviewDate":"April 13, 2019","reviewText":"Love this radio! My fiance's from the Philippines and she loves listening to familiar music in her native language; and I get to listen to my own hometown stations 500 miles away! Easy setup, soooo many stations. Sound quality very good. I purchased the internal battery so we could move it easily from room to room. Great fun."},{"reviewerName":"Terry Cole","rating":"1.0 out of 5 stars","reviewTitle":"Its very Buggy... no Customer Response to Emails...No Thank you!!!","reviewDate":"October 7, 2019","reviewText":"Its Buggy sometimes have to do a full Reboot , it says I am not in USA and have to do a Total Reboot to update software to get it to work....I have it a full year and not happy with it....And doesnt pull in internet Radio Station Magic Oldies Florida.....it did once but no longer.....sent the multipple emails asking for an update and got no response from Grace Digital... I am buying another Internet Radio but steering clear of this company...."},{"reviewerName":"SAB","rating":"5.0 out of 5 stars","reviewTitle":"So glad I bought this one.","reviewDate":"February 1, 2019","reviewText":"I have been struggling with a CC WiFi internet radio--very labor intensive and cumbersome to use. I was leary to try\nanother one but took a chance on this one. Wonderful!! Sounds great--very easy to use and program. All the features work great--"},{"reviewerName":"pH","rating":"3.0 out of 5 stars","reviewTitle":"Good sound; Firmware is a work in Progress","reviewDate":"The manufacturer commented on the review below","reviewText":"Buggy firmware. Buttons are poorly responsive, often requiring more than one push. Trying to set preset stations for P6-9 simply does not work. Should be SHIFT+button according to manual. Otherwise, network setup was easy, including SIRIUS. Sound is excellent. Battery is worth getting for mobility and long lasting outdoor plays."},{"reviewerName":"Kindle Customer","rating":"4.0 out of 5 stars","reviewTitle":"Ok but watch the packaging","reviewDate":"November 9, 2018","reviewText":"Works ok for satellite radio. Local (Chicago area) stations are mostly available. Lost points for packaging. The radio arrived in the mfrs box with no tape to hold the box shut and the box falling apart."},{"reviewerName":"AC","rating":"5.0 out of 5 stars","reviewTitle":"Like an alarm clock, but better.","reviewDate":"July 5, 2018","reviewText":"Great sound, no stream glitches, and alarm works properly, even with wifi down. Some incompatibility with streams like Broadcastly (for NOAA), but not a major problem."},{"reviewerName":"C. Stock","rating":"1.0 out of 5 stars","reviewTitle":"Does NOT play pandora","reviewDate":"April 30, 2019","reviewText":"The last one I bought from them plays Pandora, the new one does not. What's the point?"},{"reviewerName":"Richard Billings","rating":"1.0 out of 5 stars","reviewTitle":"No quality control","reviewDate":"May 9, 2019","reviewText":"Radio was a piece of junk. Would not even turn on. Had to return it. I would rate Grace Digital's quality a \"0\" You would think they would at least turn it on , to make sure it works, before they ship it."},{"reviewerName":"John V. Green","rating":"1.0 out of 5 stars","reviewTitle":"Had To send it back it was defective kept freezing ...","reviewDate":"April 14, 2018","reviewText":"Had To send it back it was defective kept freezing on me"},{"reviewerName":"edison1135","rating":"1.0 out of 5 stars","reviewTitle":"Drops WiFi and freezes","reviewDate":"August 1, 2019","reviewText":"The radio kept dropping the WiFi, and when it didn’t drop the WiFi, it froze so I would have to perform a factory reset. The company must know this is a fault because they even include the factory reset as one of the choices in the menu. I returned this radio and purchased the grace encore. I don’t know why amazon is selling this item."},{"reviewerName":"NetAdmin","rating":"5.0 out of 5 stars","reviewTitle":"Pretty good device","reviewDate":"September 8, 2019","reviewText":"I USe this via line outs into a stereo system. Via the USb - ethernet dongle it works well and gets services such as Radio.com that others, such as the Bluesound ecosystem, don't support. App is a little clunky (still haven't figured out how to set presets in the app.) Would have preferred a tuner-version without integral speaker, for my purposes. But it does the job nicely."},{"reviewerName":"BDavidson","rating":"5.0 out of 5 stars","reviewTitle":"Great Radio","reviewDate":"December 6, 2017","reviewText":"Just received this and I found it very easy to set up. I have been able to play music and listen to podcasts easily. A little present for me for the holidays! I would not hesitate to buy!!!"},{"reviewerName":"J. D. Beischel","rating":"4.0 out of 5 stars","reviewTitle":"Nice radio, good audio, can be connected to external stereo. Needs better user interface and remote support.","reviewDate":"March 7, 2018","reviewText":"I bought this because my older Grace Digital Radio is no longer capable of receiving Sirius XM and iHeart radio stations. So kind of forced into buying a new unit.\n\nFirst, what I like. the sound though mono is excellent for a small radio. Price through Amazon is fair, Color screen is nice. I also like that it has RCA audio jacks on the back so you can feed the audio to a stereo system. It will provide stereo externally, it just cannot with the built-in mono speaker.\n\nWhat I don't like. It no longer has Pandora like my older generation Grace radio. I really don't like have to Chromecast unsupported streaming content since it adds yet another device into the mix.\n\nSecond, I do not like that you cannot use the remote control to scan through the channels for Sirius XM. This seems like something they can fix. I would like to be able to use the up and down arrows on the remote to control the channel selection instead of having to go back to a menu and select that way. Not very user friendly in my opinion."},{"reviewerName":"Katherine","rating":"5.0 out of 5 stars","reviewTitle":"Any radio station in the world","reviewDate":"May 5, 2019","reviewText":"My sisters and I got this digital radio for my dad and he was able to find the radio station his family grew up listening to in Greece!"},{"reviewerName":"James Brownlow","rating":"5.0 out of 5 stars","reviewTitle":"great internet radio!","reviewDate":"December 6, 2017","reviewText":"My 8-year old Logitech Boombox quit, and there is no repair facility. I got this as a replacement and I couldn't be more pleased. Excellent unit, particularly at the 'refurbished' price"},{"reviewerName":"Determined 2 Learn","rating":"5.0 out of 5 stars","reviewTitle":"Third One We’ve Purchased - That Says It All!","reviewDate":"September 2, 2019","reviewText":"We bought this as a gift for friends. We’ve had this in our home for years and love it. They are thrilled, too!\n\nWe bought one for other friends several years ago so this is our third purchase. That says something about the product!"},{"reviewerName":"Sallyann","rating":"3.0 out of 5 stars","reviewTitle":"Nice Sound. Has Chromecast. Does Spotify, Pandora and SiriusXM","reviewDate":"December 7, 2018","reviewText":"1) High Level output on RCA outlets won't allow App to change audio volume. Must use Earphone outlet.\n2) Often can't be reached from App on phone\n3) Can't set to pushbuttons, nor Favorites, and Chromecast music services or their channels.\n4) It often chooses weak WiFi APs, causing dropouts in programs."},{"reviewerName":"daveonbass","rating":"5.0 out of 5 stars","reviewTitle":"Great product. Highly recommended.","reviewDate":"August 7, 2019","reviewText":"I bought this to get my two sports channels through the internet instead of using an antenna, and wow - it works great for that. As a bonus, Sirius/XM also included. Sounds great, easy to use. I'm looking at buying another one for the office."},{"reviewerName":"Joan","rating":"2.0 out of 5 stars","reviewTitle":"No longer includes Pandora","reviewDate":"August 19, 2019","reviewText":"My previous Grace Digital Internet Radio broke so I ordered this one to replace it. Unfortunately, my favorite feature of the previous radio was Pandora which is no longer included in their current crop of internet radios. Wah. Forced to return it."},{"reviewerName":"William A.","rating":"4.0 out of 5 stars","reviewTitle":"This is an excellent clock radio","reviewDate":"February 3, 2019","reviewText":"Access to internet stations is very good but it would be even better if Grace Digital would partner with Accuradio and/or Pandora to bring to the listener some very good music channels."},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Very happy with this purchase","reviewDate":"September 3, 2019","reviewText":"Item came as advertised and on time. Very happy with the unit itself. I'm not putting heavy demands on the product like some might need but it sounds great and never cuts out on me. I have a Bose Sound Touch 10 that this unit replaced."},{"reviewerName":"Praganator","rating":"5.0 out of 5 stars","reviewTitle":"and sounds great. Highly recommended","reviewDate":"June 17, 2018","reviewText":"Kicks the Logitech Squeezeboxes butt. I used the Squeezebox for soooo long, but grew tired of constant network drops, so I tried this device. It never drops connections, I can stream BT from my phone, etc, and sounds great. Highly recommended!"},{"reviewerName":"Eivind B. Jensen","rating":"5.0 out of 5 stars","reviewTitle":"Excellent internet radio","reviewDate":"February 16, 2019","reviewText":"Living in the Rocky Mountains with no conventional radio reception, our only need was for basic, good quality and reliable internet streaming of our favorite FM station. The Grace Digital Mondo+ provides this superbly. Not quite the sound quality of a Bose radio, but not nearly the price either. Very satisfied, and I am buying another unit for another room."},{"reviewerName":"Paul","rating":"3.0 out of 5 stars","reviewTitle":"It’s memory is even worse than mine","reviewDate":"The manufacturer commented on the review below","reviewText":"I love the radio, but the hate that it won’t even save my programmed stations long enough for me to move it from one side of the room to the other.\n\nAny brief loss of power means that I have to choose and save all my presets again."},{"reviewerName":"Chris","rating":"4.0 out of 5 stars","reviewTitle":"nice radio","reviewDate":"January 27, 2019","reviewText":"I have an older grace radio, wanted to add this one too. Works fine, my only disappointment is that it does not work with the iphone remote control app, and I mainly got it too add the ability to view cover art but it does not do that for me anyway but overall works ok."},{"reviewerName":"Larry Hawkins","rating":"5.0 out of 5 stars","reviewTitle":"The mondo is easy to use","reviewDate":"February 17, 2018","reviewText":"The mondo is easy to use, and to see up favorite stations. When you pair it with a,Grace speaker you have quality sound for music. It is expandable by adding more Chromecast speakers if desired. The cost is about one half Bose or Sonos with little difference."},{"reviewerName":"Lanie51","rating":"5.0 out of 5 stars","reviewTitle":"Great radio","reviewDate":"January 24, 2019","reviewText":"Bought it for my husband for Christmas and he loves it! Great sound, size, & ease of use."},{"reviewerName":"andrew","rating":"5.0 out of 5 stars","reviewTitle":"Exceeded expectations.","reviewDate":"June 3, 2018","reviewText":"Fantastic table radio. Great sound and access to thousands of stations. The customer service is amazing if you have questions. I also bought the Encore + and have been listening in two rooms."},{"reviewerName":"vincent buonora","rating":"1.0 out of 5 stars","reviewTitle":"When it worked-very nice; but has same problems as others noted","reviewDate":"October 5, 2018","reviewText":"Had same problems as others who gave it a 1 star; Simply shuts done, does not connect, manual or remote does not solve problem; can not accept a radio that becomes inoperable after 2 months. Would not want a replacement."},{"reviewerName":"David Cendejas","rating":"5.0 out of 5 stars","reviewTitle":"Great replacement for my old Squeezebox radio","reviewDate":"February 9, 2019","reviewText":"Really like the option of 10 presets. So far haven't had the problem issues I had with the Squeezebox either - no buffering problems or losing presets if I happen to hold the button too long. Love it!"},{"reviewerName":"TV Lover","rating":"5.0 out of 5 stars","reviewTitle":"Worth the extra money.","reviewDate":"June 16, 2019","reviewText":"This is our second grace for a couple of physician offices. We tried the ocean ones and they sucked (good customer service but the device was no good). The grace one is great because it connects to our internet well and has something like 20,000 stations. There is something for everyone. You can avoid ads you can get pretty much everything."},{"reviewerName":"Alestes","rating":"5.0 out of 5 stars","reviewTitle":"You can buy rfurbished!","reviewDate":"December 18, 2017","reviewText":"As good as new. Great product. Easy set-up"},{"reviewerName":"Jon Piecka","rating":"3.0 out of 5 stars","reviewTitle":"Still in the process of trying it.","reviewDate":"November 18, 2018","reviewText":"My previous review should be ignored because I was setting everything the day after I received it and didn't understand what I was doing. Although I now have some understanding, my final review will be entered after a few more days of testing it. When that will be, I'm not sure, yet. People who are giving it a bad review were probably in the same situation I was in regards to trying to set everything too fast without reading and studying the owner's manual first."},{"reviewerName":"S. Jensen","rating":"5.0 out of 5 stars","reviewTitle":"Great internet radio","reviewDate":"April 21, 2019","reviewText":"This is the only way my wife, who is a bit computer challenged, can use internet radio. I just set the pre-set buttons for her choice of music and talk and she can now use it all the time."},{"reviewerName":"poolskater","rating":"5.0 out of 5 stars","reviewTitle":"This is the best internet radio ever!","reviewDate":"March 24, 2019","reviewText":"Simple to set up, simple to use. Good sound quality. Good features. Additional battery pack works well. I would definitely recommend this product."},{"reviewerName":"William D.","rating":"5.0 out of 5 stars","reviewTitle":"Amazing radio","reviewDate":"July 22, 2017","reviewText":"Alarm clock radio on steroids. Everything promised and more. Found wonderful internet stations with few commercials. Alarms work great. And we're easy to set."},{"reviewerName":"Gore Tanner","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"January 27, 2018","reviewText":"Better than expected, many more features than advertised. Something you will grow in to, not out of."},{"reviewerName":"Richard Engel","rating":"5.0 out of 5 stars","reviewTitle":"Really good sound.","reviewDate":"June 19, 2019","reviewText":"We use the radio almost every day to catch up on news and a little entertainment. The sound quality is amazing."},{"reviewerName":"Dante H. Ventriere","rating":"2.0 out of 5 stars","reviewTitle":"Could not figure it out. Manual is impossible","reviewDate":"December 10, 2018","reviewText":"Wanted to use for Bluetooth but the could not get blutooth to work. Tried for days with no luck. The manual that comes with it is in American Chinese and next to impossible to read. If anyone knows how to connect blue tooth please let me know. I gave up."},{"reviewerName":"Point Bob","rating":"5.0 out of 5 stars","reviewTitle":"10 PLUS Customer Service!","reviewDate":"The manufacturer commented on the review below","reviewText":"10 PLUS Customer Service\nHad a minor performance issue on a Sunday morning with a new radio.....e-mailed and had resolution within 30 minutes...can't do any better than that!"},{"reviewerName":"Randy Palmer","rating":"1.0 out of 5 stars","reviewTitle":"Bad Product","reviewDate":"The manufacturer commented on the review below","reviewText":"First one I received was not working. Now the second one has stopped working and it is past the return date. This product sucks. This is my second review. I returned the second, but the first one was past the return date. So I lost my money on that one. Product does not work for very long, and sometimes not at all."},{"reviewerName":"Joek","rating":"5.0 out of 5 stars","reviewTitle":"I am very pleased with this radio and it performs exactly as expected","reviewDate":"July 26, 2017","reviewText":"I am very pleased with this radio and it performs exactly as expected. I had been looking for a great internet clock radio for quite some time and came across the Mondo- it looks great, it functions well, does everything it supposed to do and it sounds wonderful; worth every penny."},{"reviewerName":"Cedar Creek","rating":"5.0 out of 5 stars","reviewTitle":"Gift for my husband and he loves it! It ...","reviewDate":"February 4, 2018","reviewText":"Gift for my husband and he loves it! It kind of scares me that he found & listens to a channel that plays Gregorian chants.\n1st one turned out to be defective, had no problem replacing it."},{"reviewerName":"Patrick Martin","rating":"5.0 out of 5 stars","reviewTitle":"Great radio. But I do wish it had software ...","reviewDate":"May 14, 2018","reviewText":"Great radio. But I do wish it had software that I could go to a state and find the cities where all of the AM & FM stations are shown. My old UE Radio had this feature."},{"reviewerName":"George","rating":"5.0 out of 5 stars","reviewTitle":"It works!","reviewDate":"May 22, 2019","reviewText":"The internet radio connection with SiriusXM has been working flawlessly since connecting after I received the delivery. Happy listener 😀."},{"reviewerName":"Daniel E. Beeman","rating":"4.0 out of 5 stars","reviewTitle":"Easy setup. Great Sound","reviewDate":"December 26, 2017","reviewText":"This was a gift to my wife. Easy setup. Great Sound. The battery pack I ordered for this unit had a meltdown! I would recommend that Grace pre-install a reliable battery pack."},{"reviewerName":"L Gonzo","rating":"4.0 out of 5 stars","reviewTitle":"WiFi Radio with options","reviewDate":"August 5, 2019","reviewText":"Bought one for the job. Other employees want one. If the WIFI drops.\nMy memory stick is ready with music.\nI already recommended it."},{"reviewerName":"Rebecca Hovan","rating":"2.0 out of 5 stars","reviewTitle":"Broke","reviewDate":"December 4, 2018","reviewText":"The display is gone/broke after only 4 months :(\nAlthough the company is sending my a refurbished one at no cost I am a week with no radio at my business and I am very disappointed with this product."},{"reviewerName":"Jim Barker","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"May 27, 2018","reviewText":"very good sound"},{"reviewerName":"David A. Knapp","rating":"5.0 out of 5 stars","reviewTitle":"great radio","reviewDate":"July 10, 2019","reviewText":"Use in back computer shop"},{"reviewerName":"sylvie Leroy","rating":"5.0 out of 5 stars","reviewTitle":"Not far to be the ideal Internet radio","reviewDate":"February 22, 2019","reviewText":"We bought this product 5 years ago and it braked down this year. We ordered a new one and we noticed a lot of improvements.\nNo breaks in sound unlike the previous model. Adjustement of the brightness of the screen with the possibility of modifying it."},{"reviewerName":"Rudy R.","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"January 25, 2018","reviewText":"Nice radio. Love the ability to pair off with the mobile phone"},{"reviewerName":"H.Richard B.","rating":"5.0 out of 5 stars","reviewTitle":"Sirius radio in the office yay me","reviewDate":"May 23, 2019","reviewText":"This thing rocked I really like it"},{"reviewerName":"Wray E. Holan","rating":"5.0 out of 5 stars","reviewTitle":"Excellent satellite radio","reviewDate":"The manufacturer commented on the review below","reviewText":"Excellent satellite radio. I was looking for a specific station and the search worked perfectly to find the station by its FAA identification code letters; IE KWAZ etc. I am very pleased. This radio is worth every cent!"},{"reviewerName":"Gary D. Chamberlain","rating":"5.0 out of 5 stars","reviewTitle":"Gradce Digital Mondo++++++++++","reviewDate":"June 22, 2019","reviewText":"This was the easiest internet radio I have ever used...It was a piece of cake to set up and had all the functions that I required. I replaced an Ocean Digital that was a real piece of sh*t. Very happy with this purchase."},{"reviewerName":"Harvey J. Paulin","rating":"5.0 out of 5 stars","reviewTitle":"love it.","reviewDate":"July 2, 2018","reviewText":"Have three of these radios... love it..."},{"reviewerName":"Lawrence Hollman","rating":"5.0 out of 5 stars","reviewTitle":"Pleasantly surprised!!!","reviewDate":"January 16, 2019","reviewText":"Well worth the price! The sound is pretty good for the size and good selection of stations. Not super easy to use but you'll figure it out...."},{"reviewerName":"Jason","rating":"5.0 out of 5 stars","reviewTitle":"Great gift","reviewDate":"August 29, 2019","reviewText":"My dad loves his radio we were disappointed it doesn’t have pandora on it but all in all he’s happy and sounds good too"},{"reviewerName":"James N.","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"April 18, 2018","reviewText":"easy to set up for Sirius xm"},{"reviewerName":"Global American Enterprises Inc.","rating":"4.0 out of 5 stars","reviewTitle":"Very reliable, No TUNEIN App?","reviewDate":"January 17, 2018","reviewText":"Arrived on time as usual for Amazon. The product works as advertised. My only comparison is to the Logitech. I like the features on the Logitech much better than the Grace. Unfortunately the Logitech is no longer manufactured. Mostly I like the Tunein feature on the Logitech that is missing on the Grace. Yes, you can listen to Tunein by paring the Grace to your Phone but that does not provide the Metadata.Overall the grace is more clumsy to program, but not difficult, just extra steps. The Grace does work well with the wireless internet and does stay connected in many places in my home the Logitech did not. If fact the Grace has not had any internet issues at all. The Grace has nine presets, the Logitech only had six. The one I purchased did not come with a battery, but you can purchase one from Amazon for under $20.00. Yes, It is an improvement over the Logitech other than the lack of Tunein. I would say two steps forward one back.Yes, I will purchase additional units. Hopefully they will fix the Tunein."},{"reviewerName":"Fernando","rating":"4.0 out of 5 stars","reviewTitle":"An Improvement","reviewDate":"November 7, 2018","reviewText":"Much easier setup than on the earlier model. Better screen too."},{"reviewerName":"Phillip Dalton","rating":"4.0 out of 5 stars","reviewTitle":"Mondo","reviewDate":"August 8, 2019","reviewText":"I have 2 early Mondo radios and they still work. So I tried the new one. It works best with a direct internet hookup.\nall seems to work great."},{"reviewerName":"Sara J. Smiley","rating":"5.0 out of 5 stars","reviewTitle":"It was pretty easy to set up and she can listen to ...","reviewDate":"May 15, 2018","reviewText":"We give this to my mom for Christmas. It was pretty easy to set up and she can listen to her favorite radio stations including National radio in her kitchen. The sound is good and it's easy to use. It was a great investment"},{"reviewerName":"Mary","rating":"3.0 out of 5 stars","reviewTitle":"not like the Squeezebox","reviewDate":"September 28, 2017","reviewText":"Unless you have a mobile device, you will be unable to receive Pandora. Not everyone has a smartphone. Returned."},{"reviewerName":"russell mclean","rating":"5.0 out of 5 stars","reviewTitle":"Very pleased that the radio was received in the post about ...","reviewDate":"January 28, 2018","reviewText":"Very pleased that the radio was received in the post about two weeks earlier than expected. The sound quality is excellent. My only complaint is that the configuration of the included power adapter was not suitable for Australian power outlets. Fortunately, I had a spare adapter at home which did fit."},{"reviewerName":"Mark D","rating":"5.0 out of 5 stars","reviewTitle":"Not sure why good internet receivers are so hard to come by these ...","reviewDate":"May 1, 2018","reviewText":"Bought this unit to replace a Myine IRA that we'd been loving for years but which finally gave up. Needed another unit to plug into our old school stereo system via RCA connections. Not sure why good internet receivers are so hard to come by these days but this one really fits the bill. Highly recommend it to anyone who wants to tie into the infinite number of great radio stations broadcasting on the internet."},{"reviewerName":"John Sessa","rating":"5.0 out of 5 stars","reviewTitle":"Nice little \"internet\" radio with big sound","reviewDate":"June 24, 2018","reviewText":"Nice little \"internet\" radio with big sound, and with the battery bought seperately, I'll see how long it lasts.\nIf you have internet access and Wi-Fi, you have more stations then you'll ever need.\nOnly critique; No real handle, :(\nGrace Digital Mondo+ Wireless Smart Speaker and Internet Radio with Wi-Fi + Bluetooth and 3.5\" Color Display"},{"reviewerName":"Kindle Customer","rating":"5.0 out of 5 stars","reviewTitle":"Great for finding your kinda music anytime","reviewDate":"July 22, 2019","reviewText":"I love this wifi music machine! So many channels and places to explore, haven't gotten through a quarter of them yet."},{"reviewerName":"Lawrence L. Jaffe","rating":"5.0 out of 5 stars","reviewTitle":"Radio is easy to use","reviewDate":"February 7, 2018","reviewText":"Radio is easy to use. The interface to Sirius/XM easily brings my automotive experience to my home with a great interface. Great sound. Wonderful radio."},{"reviewerName":"Kenneth E. Jones","rating":"5.0 out of 5 stars","reviewTitle":"Grace Mondo Internet Radio","reviewDate":"June 22, 2018","reviewText":"Have had Logitec internet radio's and one went bad so I replaced it with the Grace unit. Radio works great and has some features that were lacking on the Logitec units. Great product, easy to program and sound is good...."},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Great sound","reviewDate":"March 22, 2019","reviewText":"Works great , Sound is pretty good lots of great features."},{"reviewerName":"Tony","rating":"5.0 out of 5 stars","reviewTitle":"Love","reviewDate":"The manufacturer commented on the review below","reviewText":"I love my Grace Radio. I have 2 older models and wanted a newer model. I got the mondo+ I think it is a great value, and the sound quality is great. It also buffers so fast so it it is almost instant on."},{"reviewerName":"Stephen Schuldenfrei","rating":"5.0 out of 5 stars","reviewTitle":"A Hit!","reviewDate":"October 28, 2017","reviewText":"Works very well. Easy to program. Great sound."},{"reviewerName":"andreW","rating":"5.0 out of 5 stars","reviewTitle":"looks nice, sound is good for internet radio","reviewDate":"January 20, 2019","reviewText":"easy to recall 10 preset stations with a remote control. Programming is umbiguous, but bare in mind there are thousands of stations to choose from, so first you need to get familiar with network radio provider"},{"reviewerName":"TM","rating":"3.0 out of 5 stars","reviewTitle":"Just okay...","reviewDate":"August 23, 2019","reviewText":"Some channels wont stream now and then. Not always the same channels just seems to always be the one i happen to want to listen to. Good signal strength but the constant pause for buffering is so annoying! When it works its great and there are times it works great for days on end but i would never buy it again. Im going to look for another one..."},{"reviewerName":"Jim","rating":"5.0 out of 5 stars","reviewTitle":"Incredible radio value!","reviewDate":"November 8, 2019","reviewText":"I love this radio! You can get radio stations from all over the world!"},{"reviewerName":"Mark Buckley","rating":"5.0 out of 5 stars","reviewTitle":"Sound great for a table top radio","reviewDate":"April 15, 2018","reviewText":"This unit was easy to set up and there are tons of available stations or enter your own. I connected it to my stereo amplifier and it sounds great. For the price this is a nice versatile radio."},{"reviewerName":"jiquin","rating":"5.0 out of 5 stars","reviewTitle":"Perfect","reviewDate":"January 31, 2019","reviewText":"Met all expectations and is made with quality materials and details."},{"reviewerName":"Alberto O. Alves Fh","rating":"5.0 out of 5 stars","reviewTitle":"Very good internet radio","reviewDate":"September 8, 2017","reviewText":"Very good internet radio. I have two (the old and the new model). I recommend it to everyone in the world."},{"reviewerName":"HMM","rating":"5.0 out of 5 stars","reviewTitle":"Fantastic Radio (and Improving)","reviewDate":"July 28, 2017","reviewText":"This is a fantastic internet radio. The sound coming from a speaker this size is phenomenal. Admittedly, it's not the same as a large home theater system, but if you have this in your bedroom, you will be pleased with the sound. It can play quite loud, too, so you can easily hear it in the bathroom if your radio is in the bedroom (I don't recommend playing it a full volume with bass heavy tracks, though, because I do get some distortion). Some other reviewers commented on the sound being \"flat.\" Well, it IS by default, but that is a quality of a good speaker. I find that vocals sound very live and accurate. Acoustic music is fantastic. I have made some adjustments in the equalizer settings which have tailored the sound to my preference (try setting Treble at 5 and Bass at 3). I really like the interface overall, and having an iPhone app to control it is really handy. I can start the radio playing from anywhere in the house. You can also access most of the functions of the radio through the app, including setting the alarm clock.\n\nI like that there are so many options for listening to music on the device. You can stream from pretty much any internet music service (SiriusXM is my favorite, but there are tons of free services, too). You can save music to a USB thumb drive and play from there (look at the SanDisk Cruzer Fit if you want a drive that won't stick out very far on the back of the radio). I have also been able to stream my entire iTunes music collection from my Mac by installing the Twonky Media Server on the Mac and using the UPnP interface on the radio.\n\nOne of the main reasons that I bought this particular radio was the ability to set multiple alarm clocks with different alarms on different days (you can set up to five). Previously, I used a Sony Dash, and Sony decided not only to stop supporting the service, but to kill the device entirely. With the Mondo+, you can wake up to an obnoxious buzzer sound (great for heavy sleepers) or any of your presets. Super tip: Download some nice alarm sounds to a USB thumb drive, set one of those sounds as a preset, and choose that preset for your alarm. Then, you can wake up to any sound you like. Of course, you can wake to internet steaming or anything else you can make a preset.\n\nNow a couple negatives. The iPhone app locks up and crashes sometimes, but it is improving. The radio interface still has some bugs in it, and acts unpredictably at times. I will say that in the short time I've had the radio, the company has already issued two firmware updates which have squashed some of the initial bugs I was experiencing. They seem very committed to releasing very regular (every couple weeks) firmware updates, too. This is a new product, so you would expect a few minor issues.\n\nFinally, the customer support from the company is nothing short of amazing. I e-mailed them with some concerns and suggested improvements, and they e-mailed back very quickly. They even made some of the changes I recommended in their recent firmware updates. They listen and they want their radio to be the best on the market. Any company that is so committed to improvement and customer satisfaction has my business!\n\nIn summary, buy this radio! You won't regret it. It's a fantastic device that is improving with time."},{"reviewerName":"X","rating":"2.0 out of 5 stars","reviewTitle":"Great features. Poor sound quality","reviewDate":"The manufacturer commented on the review below","reviewText":"Great features. Poor sound quality. (Maybe bad unit?)"},{"reviewerName":"kuma57","rating":"5.0 out of 5 stars","reviewTitle":"It works!","reviewDate":"August 5, 2019","reviewText":"I can get local stations as well the internet stations. Great!"},{"reviewerName":"ML","rating":"5.0 out of 5 stars","reviewTitle":"Great radio","reviewDate":"April 2, 2019","reviewText":"This is our second radio from these folks!\nThis unit performs a well as the predecessor unit & the quality is very good..."},{"reviewerName":"Cracker1951","rating":"5.0 out of 5 stars","reviewTitle":"perfecto","reviewDate":"February 15, 2019","reviewText":"perfect for internet radio & goid quality."},{"reviewerName":"Arthur E. Hays","rating":"1.0 out of 5 stars","reviewTitle":"Almost Impossible to Use","reviewDate":"July 13, 2019","reviewText":"Could NOT connect to Sirius XM, Grace Mondo said it was a Sirius problem & Sirius said it was a Grace problem. Finally gave up & sent it back. Not recommended if you want to use it for Sirius XM."},{"reviewerName":"Jim","rating":"5.0 out of 5 stars","reviewTitle":"GREAT PRODUCT","reviewDate":"November 27, 2018","reviewText":"Great buy"},{"reviewerName":"Barbara","rating":"5.0 out of 5 stars","reviewTitle":"Great sound. Easy set-up.","reviewDate":"February 25, 2018","reviewText":"Great sound and looks good too. It was easy to find the stations I was looking for. I recommend this radio."},{"reviewerName":"Unhappy customer","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"December 6, 2017","reviewText":"Great product, great customer service."},{"reviewerName":"C. Cox","rating":"4.0 out of 5 stars","reviewTitle":"Bring back some of the old way of doing things","reviewDate":"March 4, 2018","reviewText":"Pros Great receiver with optional battery to backup network settings and channels selected. Cons only TWO major music severs apps available\nbuilt in unlike older models. Requires another device for Chrome streaming ."},{"reviewerName":"Max747","rating":"5.0 out of 5 stars","reviewTitle":"Works great..","reviewDate":"February 28, 2018","reviewText":"Works great...use it in the workshop where if you run power tools, it causes problems with AM radio stations. So this provides a great option to be able to listen to favorite talk radio programs."},{"reviewerName":"Sharty Fresh","rating":"5.0 out of 5 stars","reviewTitle":"Wifey likey","reviewDate":"October 10, 2019","reviewText":"Easy to use. Wifey uses it everyday."},{"reviewerName":"Red Onorato","rating":"2.0 out of 5 stars","reviewTitle":"Not impressed.","reviewDate":"The manufacturer commented on the review below","reviewText":"Sorry, but this doesn't compare to the Logitech Squeezebox. Before you're influenced by my review, keep in mind that I only listen to the radio when I get in bed. I set the timer for an hour and play around until I'm out. I don't blast it so the sound doesn't have to fill a room but I want some quality to it. I've been using the same Squeezebox for seven years and that's the only thing I can compare the Mondo to.\n\nFirst thing I noticed about the Mondo was how cheaply made it feels.The square buttons for the preset stations wobble a bit and give me the impression they're snapped into place. The big round knob doesn't turn smoothly. If you make more than one complete turn, you'll feel resistance. It feels out of round.\n\nI tried many of the stations loaded on the Mondo and found they were not what they said they were. I would choose something like Germany - News and it would be a station in the USA playing rock music. Too many times this happened. I would pick a genre or a location and then the station and it would be nothing close to what it said it would be. And there were too many instances where there was nothing broadcasting on that particular station.\n\nDidn't like the sleep timer. On the Squeezebox you could set the timer to turn the radio off and in the mean time you could still change the channel you're listening to. Not the Mondo though. If you set the timer to turn the radio off in an hour, you better be happy listening to the same station until the radio turns off. I change channels a lot so this doesn't work for me. I don't want to turn the timer off, change the channel, and then turn the timer back on. The placement of the volume button on top of the radio seemed odd. Should be on the right side and not so big.\n\nThe sound was good. I had no problem with that. It compares favorably to the Squeezebox. I knew the only way I'd get Pandora was by casting it from my phone with Chromecast. I thought I could live with that but I was wrong. That was a chore. I like that Pandora is in the Squeezebox and you can preset one of their stations like any other station. I do like that using SiriusXM is easy with the Mondo.\n\nI returned the Mondo after a week or so. I think I got spoiled by having the Squeezebox as my first WiFi radio. That's a quality radio and very intuitive to use. The buttons all seemed to be in the right places. The way they cataloged all the stations made it so easy to find things to listen to and save. I also didn't realize how important is to have Pandora built right into the radio.\n\nIf all you need is to turn the radio on and listen without changing channels too much, this might work for you. It does sound good."},{"reviewerName":"PussyCatJustice","rating":"5.0 out of 5 stars","reviewTitle":"Super cool!","reviewDate":"August 26, 2018","reviewText":"This is great. It’s nice to have a radio in the house again and get stations that aren’t local to my specific area."},{"reviewerName":"William Batta","rating":"5.0 out of 5 stars","reviewTitle":"Mondo performs better than expected.","reviewDate":"September 5, 2017","reviewText":"Mondo performs better than expected."},{"reviewerName":"Larry Briar","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"July 5, 2018","reviewText":"NICE LITTLE RADIO. Especially love those old radio mysteries, SUSPENSE, INNER SANCTUM ETC. GREAT CUSTOMER SERVICE."},{"reviewerName":"James Gaffney","rating":"5.0 out of 5 stars","reviewTitle":"Is a GREAT combination!","reviewDate":"February 25, 2018","reviewText":"Just received. Took about 1/2 hour to update radio and load SirriusXM. Bought this on sale and an Insignia table radio on sale for $200 total. Is a GREAT combination!"},{"reviewerName":"Charles M.","rating":"5.0 out of 5 stars","reviewTitle":"Extremely well thought out and designed!","reviewDate":"July 28, 2019","reviewText":"Audio quality is superior. Just has a nice, mellow sound. Operation is smooth and stable. User Interface is excellent. Congrats to the developers of this product! I highly recommend.\n\nCharles"},{"reviewerName":"Juan","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"January 31, 2018","reviewText":"Love the unit ! One of the best radio audio streaming gear in the market"},{"reviewerName":"Joseph L.","rating":"1.0 out of 5 stars","reviewTitle":"Worst menu system I've seen in a long time","reviewDate":"September 10, 2019","reviewText":"The most arrogant unhelpful customer support I've encountered for a residential product. IR is touchy, entering account info is a nightmare...resets to letter \"A\" after every entry. Poorly constructed. A $30.00 Roku will do most of what this unit will do."},{"reviewerName":"Amazon Customer","rating":"4.0 out of 5 stars","reviewTitle":"Four Stars","reviewDate":"August 7, 2017","reviewText":"Better than my last Grace digital Internet radio in ease of use and sound quality. Graphic screen is cool."},{"reviewerName":"Douglas Beyer","rating":"5.0 out of 5 stars","reviewTitle":"Great radio","reviewDate":"July 6, 2019","reviewText":"Everything I wanted in a Internet radio it replaced my logitech radio which I liked but this is 10 times better. I only wish their website could be put into an iPhone app"},{"reviewerName":"SANTOS","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"February 15, 2018","reviewText":"good radio easy to use"},{"reviewerName":"Jeffery R. Witt","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"September 3, 2017","reviewText":"Awesome product, works great over Wi-Fi."},{"reviewerName":"Ilana","rating":"4.0 out of 5 stars","reviewTitle":"Works well","reviewDate":"December 11, 2018","reviewText":"It is very good but didn’t get to one station I wanted over seas"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"best customer service","reviewDate":"June 20, 2019","reviewText":"This is the radio we've been waiting for. Perfect replacement for a household radio in an area with poor radio receptivity. we had an issue with the remote. I called and a replacement arrived within days. Very capable Customer Service!"},{"reviewerName":"boodan","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"April 1, 2018","reviewText":"0 so cool"},{"reviewerName":"C. Jonkoski","rating":"5.0 out of 5 stars","reviewTitle":"Nice little radio","reviewDate":"June 25, 2019","reviewText":"I wanted to be able to listen to regular radio as well as Sirius XM. This fit the bill perfectly. Easy to set up."},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Will lose signal on a Sirius program from time to time. A minor annoyance, usually.","reviewDate":"March 9, 2019","reviewText":"I like the variety of stations and programs, and sports, but can no longer get MLB games!"},{"reviewerName":"MacKenzie Kavanaugh","rating":"5.0 out of 5 stars","reviewTitle":"WQXR Lives!","reviewDate":"August 9, 2018","reviewText":"And now my wife can listen to the best radio station in the world, even when in her office."},{"reviewerName":"ravioli","rating":"5.0 out of 5 stars","reviewTitle":"Love it!","reviewDate":"April 6, 2018","reviewText":"Old AM/FM broke replaced with this. Thousands of channels, wish had more than 10 memory presets."},{"reviewerName":"len","rating":"5.0 out of 5 stars","reviewTitle":"Work well","reviewDate":"October 2, 2019","reviewText":"Good radio,exactly what I expacted"},{"reviewerName":"S. L. Clemens","rating":"5.0 out of 5 stars","reviewTitle":"Addictive little machine","reviewDate":"July 9, 2019","reviewText":"You can spend hours surfing all the available world radio stations. Great unit with nice clean sound."},{"reviewerName":"JEKEWE","rating":"5.0 out of 5 stars","reviewTitle":"Grandioso","reviewDate":"November 12, 2018","reviewText":"Gran recepción de múltiples países"},{"reviewerName":"Anthony Salemme","rating":"3.0 out of 5 stars","reviewTitle":"Limited Built in Aps.","reviewDate":"June 30, 2019","reviewText":"This radio does not have a Pandora AP. In order to use Pandora you have to Bluetooth it from another device to the radio."},{"reviewerName":"coastal hair","rating":"5.0 out of 5 stars","reviewTitle":"Great sound, easy set up","reviewDate":"February 19, 2018","reviewText":"This internet radio is so intuitive and easy to use. I love it!"},{"reviewerName":"Happy Camper","rating":"5.0 out of 5 stars","reviewTitle":"Perfect Solution for AM static!","reviewDate":"June 25, 2018","reviewText":"I bought this for my dad because he can't get his favorite AM station without static. He was so happy when he heard the radio for the first time! I added some oldies stations, a station from his hometown, and he is very happy with the product. It was easy for me to set-up for him."},{"reviewerName":"Charles M. Prooth","rating":"5.0 out of 5 stars","reviewTitle":"Great Radio.","reviewDate":"October 6, 2019","reviewText":"Sometimes it seems to do weird things but, on the whole, it is a great device."},{"reviewerName":"A. Machlis","rating":"2.0 out of 5 stars","reviewTitle":"Too many issues.","reviewDate":"October 6, 2019","reviewText":"Too many issues with this item. Remote broke from minor fall. Functionality issues. Buttons don’t always respond. Shuts off all the time. Not reliable. No Apple Music except with Bluetooth."},{"reviewerName":"michael","rating":"5.0 out of 5 stars","reviewTitle":"GREAT RADIO","reviewDate":"January 22, 2019","reviewText":"BEST WAY TO HEAR INTERNET MUSIC"},{"reviewerName":"Bert Rogers","rating":"4.0 out of 5 stars","reviewTitle":"better sound than I expected","reviewDate":"March 2, 2018","reviewText":"ez set up.better sound than I expected. Would like to have more presets."},{"reviewerName":"JSilva","rating":"5.0 out of 5 stars","reviewTitle":"Good radio, good sound","reviewDate":"April 7, 2019","reviewText":"I have used this radio to listen my prefered wordwide radios. The sound is very good. It remains \"On\" night and day"},{"reviewerName":"mcduffic","rating":"4.0 out of 5 stars","reviewTitle":"Great sound!","reviewDate":"October 26, 2017","reviewText":"We love the quality sound! Although we had one disappointment in not being able to pick up a couple of our favorite local stations."},{"reviewerName":"Joe Mc","rating":"1.0 out of 5 stars","reviewTitle":"Won't ever buy another one.","reviewDate":"October 15, 2019","reviewText":"Defective from day 1.\nI had the original Mondo and it had problems also.\nThis Mondo+ had problems so I'm done with Mondo.\nCould just be my luck,"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"May 27, 2018","reviewText":"very good \"sound\" and support from Grace digital is great"},{"reviewerName":"Sarno, Jorge","rating":"4.0 out of 5 stars","reviewTitle":"The one I bought had to be replaced by Amazon","reviewDate":"November 8, 2019","reviewText":"The one I bought had to be replaced by Amazon for free because of sound isues. Great features, practical user interface and a very wide range of radio stations to choose among."},{"reviewerName":"Sue Z","rating":"4.0 out of 5 stars","reviewTitle":"small radio, good sound","reviewDate":"August 25, 2018","reviewText":"Nice compact size, good sound."},{"reviewerName":"Kindle Customer","rating":"1.0 out of 5 stars","reviewTitle":"Thats one small step behind for GraceDigital, one giant leap into the past for customers","reviewDate":"The manufacturer commented on the review below","reviewText":"No. You're better off just buying a Bluetooth speaker for much less since every decent station/app requires a smartphone anyway. I have an older grace digital that works great and is exactly what customers like me want; it at least allows you to add apps! As for the Mondo, not ready for prime time...not even close. I don't know what they were thinking with this revision. It has about four \"apps\": NPR, CBS, Sirus and I don't remember the other one because it was lame. Their solution for the lack of apps is Chromecast support. So now instead of just pressing a button on the radio and listening to music, now you can press a button on the radio, then unlock your smartphone, then open the app on your smartphone, then hit the chromecast button and hope it works...in other words, if you buy this you get an overpriced speaker with an alarm clock."},{"reviewerName":"Maria E Chavez","rating":"5.0 out of 5 stars","reviewTitle":"The quality of the sound and the wide variety of music","reviewDate":"July 13, 2019","reviewText":"I absolutely love it! My Ex Boss had an older model in the office and I loved the fact that It played Pandora, your phone playlists and it has an extreme amount of internet radio stations!"},{"reviewerName":"nflady","rating":"1.0 out of 5 stars","reviewTitle":"We have a Mondo and a Mondo+","reviewDate":"August 11, 2017","reviewText":"Our second Mondo, now we have two. Our Mondo + stopped working within one month.Had to keep rebooting it. returned it in time. Don't know what would have happened if it failed a month or two later. The regular Mondo has been working perfectly for two years."},{"reviewerName":"William Nall","rating":"3.0 out of 5 stars","reviewTitle":"In for repair after six months.","reviewDate":"May 16, 2018","reviewText":"Purchased as a gift on 12/22/17 and now on 5/16/18 it's going back for repair. Radio will not boot up or get past an all white display. Have had problems in the past with it losing connection or taking a long time to start and assumed it was related to a software update. Now however it it totally unresponsive. Followed the reset instructions on the Grace Digital site and am unable to get it to factory reset. When it was working sound quality was good and the features were just what I had in mind. Very disappointed that it only lasted six months. The people at Grace are issuing a return authorization and paying the return shipping but it's up to me to get it there. Disappointed to say the least that I now have to return a Christmas gift and wait for a repair on something that should be pretty straight forward."},{"reviewerName":"C. C. Mackerell","rating":"4.0 out of 5 stars","reviewTitle":"Sounds really good, and the display is good quality","reviewDate":"September 2, 2017","reviewText":"Works well, except being very US-centric in terms of the genres and station categories used. Sounds really good, and the display is good quality."},{"reviewerName":"Tim Dasenbrock","rating":"5.0 out of 5 stars","reviewTitle":"HD radio for a gift.","reviewDate":"April 2, 2018","reviewText":"Given as a gift.Recipient loves it."},{"reviewerName":"Scott Miller","rating":"5.0 out of 5 stars","reviewTitle":"I love these things","reviewDate":"February 10, 2018","reviewText":"My second Mondo. I love these things, and the + even slicker than the original Mondo."},{"reviewerName":"Sharon E. Miller","rating":"1.0 out of 5 stars","reviewTitle":"Horrible. Do not buy this radio","reviewDate":"March 2, 2018","reviewText":"Horrible. Do not buy this radio. I purchased this for my father and after using it only once, stopped working. The radio will not turn on at all.\nI purchased this radio back in 2015 and it works perfect.\nThis \"upgraded\" version is poorly made. It does not come with the same amount of choices.\nMost importantly, it stopped working after using it only a few times. My father hasn't had this radio for 2 months.\nHorrible, Horrible product!"},{"reviewerName":"J. R. FRANCIS","rating":"5.0 out of 5 stars","reviewTitle":"really glad i found this radio.","reviewDate":"November 3, 2017","reviewText":"I have 5 other internet wifi radios. All from c crane. This mondo+ is by far the best as to quality of sound, reliable reception across many different platforms, looks, ease of use and availability of a variety of different stations or sources. All the way from Sirius satellite radio to small country stations. But the best part is the outstanding customer service that they willingly offer. Clearly one of the top three that I have run across. I am glad I found this radio. For the price point, it can,t be beat."},{"reviewerName":"ben","rating":"1.0 out of 5 stars","reviewTitle":"not working","reviewDate":"August 12, 2018","reviewText":"stop working after six months"},{"reviewerName":"Luis A. Rivera-Lleras","rating":"3.0 out of 5 stars","reviewTitle":"Pandora is not part of the radio. It has ...","reviewDate":"The manufacturer commented on the review below","reviewText":"Pandora is not part of the radio. It has to be access thru the phone and the use the radio Bluetooth speaker."},{"reviewerName":"Jane Halasz","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"February 14, 2018","reviewText":"Easy to set up once you learn the UI. Works great. Good sound quality."},{"reviewerName":"Timothy E.","rating":"5.0 out of 5 stars","reviewTitle":"Does what is expected","reviewDate":"September 7, 2017","reviewText":"It does exactly what it's supposed to do. It has a nice display and also good sound for a small unit."},{"reviewerName":"David L Combs","rating":"3.0 out of 5 stars","reviewTitle":"wanted ststations","reviewDate":"The manufacturer commented on the review below","reviewText":"was hoping it would have had some of the stations I listen to. Other then that product is fine"},{"reviewerName":"Upendra Patel","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"February 21, 2018","reviewText":"Easy to use and ideal for home use in the current digital age"},{"reviewerName":"kwvogel","rating":"1.0 out of 5 stars","reviewTitle":"NO PANDORA!","reviewDate":"The manufacturer commented on the review below","reviewText":"Pandora is NOT built in! I don't carry a cell phone around with me all day, don't want to deal with ChromeCast, just want pandora now that my UE SmartRadio is a brick. Will be returning."},{"reviewerName":"Brightst","rating":"4.0 out of 5 stars","reviewTitle":"Great as a clock radio, there are probably better options for music playback","reviewDate":"November 5, 2017","reviewText":"I purchased this after owning both a Logitech internet radio (piece of crap), and a Roku Soundbridge (when it worked,was OK, but have had multiple failures so finally gave up). I use this mainly as a clock radio, streaming NPR stations as an alarm since the area I live in has very spotty FM reception. And this radio is the best I've used so far. Internet streaming is very good (a slight delay while connecting, as it buffers, but once connected works fine). Also, the controls are very intuitive- easy setup, ability to have multiple alarms (I especially like the repeating weekday and weekend settings). Overall, a great radio for use as a clock radio with internet streaming capability. I have no use for this as an audio device, so can't really comment on its capabilities for this. Audio is adequate for news broadcasts, certainly not the best for music but as background audio would be fine. If you're looking for a device for streaming and enjoying music, move on, there are certainly better options out there. But as a high quality clock radio, I think it's a winner."},{"reviewerName":"William Boland","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"June 23, 2018","reviewText":"This is a wonderful wi-fi radio, and, contrary to another review I read, sounds great for it's size."},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Perfect. Do you have a slim on that I ...","reviewDate":"April 13, 2018","reviewText":"Perfect.\nDo you have a slim on that I can put on wall in my room to use as a clock-internet clock"},{"reviewerName":"ester silvers","rating":"1.0 out of 5 stars","reviewTitle":"Terrible customer service!","reviewDate":"November 10, 2019","reviewText":"Customer service is terrible! No return calls from the manufacturer!"},{"reviewerName":"Suzin Rossin Eberz","rating":"1.0 out of 5 stars","reviewTitle":"complicated to set up and operate!","reviewDate":"November 8, 2017","reviewText":"Difficult to set up"},{"reviewerName":"Laurie Kommer","rating":"5.0 out of 5 stars","reviewTitle":"I am very happy with my item","reviewDate":"August 20, 2017","reviewText":"I am very happy with my item. Was very easy to set up."},{"reviewerName":"Pierre A Merzius","rating":"5.0 out of 5 stars","reviewTitle":"Easy to set up and it's something good to have in the house.","reviewDate":"September 6, 2019","reviewText":"Nothing to dislike. This is exactly what I was looking for."},{"reviewerName":"Mike","rating":"2.0 out of 5 stars","reviewTitle":"Good for Internet radio, but speakers are very sub par at best","reviewDate":"January 18, 2018","reviewText":"Although this works just fine for Internet radio, the sound has a lot to be desired. For the price, I was expecting a much better, fuller sound. Though there is an option to tweak the bass/treble and select a profile (jazz, rock, etc), it's still very unimpressive and I have cheaper speaker that sounds much better. I am not sure it's a limitation of the speakers on this unit or whether they can update the software but please be aware the sound is not that good and just feels like a glorified clock radio."},{"reviewerName":"lloyd deem","rating":"4.0 out of 5 stars","reviewTitle":"Four Stars","reviewDate":"July 3, 2018","reviewText":"the amount of content is excellent. this could be overwhelming to some."},{"reviewerName":"JR","rating":"5.0 out of 5 stars","reviewTitle":"Great product worked like it should","reviewDate":"September 9, 2019","reviewText":"Really love this and it's the second one that I have bought"},{"reviewerName":"charles j smith","rating":"3.0 out of 5 stars","reviewTitle":"I like the radio but I cant seem to get Spotify ...","reviewDate":"The manufacturer commented on the review below","reviewText":"I like the radio but I cant seem to get Spotify or Pandora on it that is mainly why I bought it"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"August 23, 2017","reviewText":"Excelente Radio 📻"},{"reviewerName":"Malcolm E Gunnell","rating":"2.0 out of 5 stars","reviewTitle":"Playing Pandora","reviewDate":"August 4, 2019","reviewText":"Cannot connect with my Pandora account. Tech support no help"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"September 4, 2017","reviewText":"Great, I recommend it"},{"reviewerName":"Timothy Miller","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"July 20, 2018","reviewText":"Third one I have. They are great"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"great value","reviewDate":"January 23, 2019","reviewText":"easy to set up great sound"},{"reviewerName":"Ron Gulrich","rating":"5.0 out of 5 stars","reviewTitle":"works ok","reviewDate":"May 5, 2019","reviewText":"works ok"},{"reviewerName":"Warren Mccloud","rating":"5.0 out of 5 stars","reviewTitle":"Extremely easy to set up","reviewDate":"July 3, 2019","reviewText":"Great product one of my best investment ever"},{"reviewerName":"Peter","rating":"1.0 out of 5 stars","reviewTitle":"works till update","reviewDate":"March 5, 2018","reviewText":"worked for about 6 months. had trouble taking automatic update and now nothing on display anymore. must be manufature fault releasing faulty update. warranty states that I’m responsible for shipping to and from them. will post more if they give me more problems. this is my 3rd grace in 20 yrs and 2nd that broke."},{"reviewerName":"Martin","rating":"5.0 out of 5 stars","reviewTitle":"Perfecta!!!","reviewDate":"January 22, 2019","reviewText":"Lo que buscaba, completa!!"},{"reviewerName":"Manuel Diaz Espino","rating":"5.0 out of 5 stars","reviewTitle":"Friendly use","reviewDate":"July 10, 2019","reviewText":"Easy use"},{"reviewerName":"CLH","rating":"3.0 out of 5 stars","reviewTitle":"Look for something else","reviewDate":"December 13, 2017","reviewText":"This unit a total pain in the neck as far as functionality and set up.\nIf the power is shut done other than standby mode, you have go thus long restart up process. Forgot get it if you hsve long complicated passwords, that wheel dial will drive you crazy trying to input the character.\nIf you have and elderly person who is not electronically savvy and the unit is powered down, they are out of luck. I, returning it."},{"reviewerName":"Aristolea","rating":"2.0 out of 5 stars","reviewTitle":"Keeps dying","reviewDate":"The manufacturer commented on the review below","reviewText":"Don't get me wrong, it's a nice radio, but...it just stops working all the time and I have to do a hard reset. This would not be a huge problem, but I have the lithium battery, which, because it's so difficult to take out (poor design), I have to wait til the battery discharges (10 hours) before being able to do a hard reset. They need to get this right before I could recommend purchse."},{"reviewerName":"Neal","rating":"5.0 out of 5 stars","reviewTitle":"Great Internet Radio!","reviewDate":"December 7, 2017","reviewText":"This is a quality product! Simple to use and set up with lots of features. Plus they have excellent customer service too! This Internet Radio is really in a class of its own!"},{"reviewerName":"R. Boegel","rating":"5.0 out of 5 stars","reviewTitle":"Love it","reviewDate":"January 9, 2018","reviewText":"Love it"},{"reviewerName":"C W Dycus","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"January 10, 2018","reviewText":"AWSOME!"},{"reviewerName":"Amazon Customer","rating":"1.0 out of 5 stars","reviewTitle":"Will not play pandora on wifi.","reviewDate":"June 22, 2018","reviewText":"Will not play pandora on wifi."},{"reviewerName":"John","rating":"1.0 out of 5 stars","reviewTitle":"A waste of money","reviewDate":"November 8, 2017","reviewText":"NO PANDORA APP! That is the reason I bought this radio. A waste of money."},{"reviewerName":"G. Mac","rating":"5.0 out of 5 stars","reviewTitle":"Made a great gift.","reviewDate":"January 12, 2018","reviewText":"Bought as a gift. I'm quite certain they loved it."},{"reviewerName":"Val F. De Guardia","rating":"5.0 out of 5 stars","reviewTitle":"until the headphone jack went bad (this internet radio is now discontinued)","reviewDate":"July 30, 2018","reviewText":"I have owned for years the Logitech Internet Radio, until the headphone jack went bad (this internet radio is now discontinued). The Grace Digital is far better. It has everything you have wished for. The only thing I don't like is that you cannot install TuneIn app. (Maybe you can, but I have not find how to)."},{"reviewerName":"veronica pagenel","rating":"1.0 out of 5 stars","reviewTitle":"Defective remote control","reviewDate":"July 6, 2018","reviewText":"Remote is not working. I have been trying to come match the seller but without any luck."},{"reviewerName":"rheumrg","rating":"3.0 out of 5 stars","reviewTitle":"Controls need a revamp","reviewDate":"June 27, 2018","reviewText":"Replaced a Grace Mondo which died prematurely. Sound is good but the software controlling alarms and radio is very glitchy\n(the radio sound resets itself to maximum volume after turning off the morning alarm; you can't access the home setting to change input when in sleep timer mode). Hopefully a software upgrade in the future will remedy the problem(s)."},{"reviewerName":"Bob","rating":"4.0 out of 5 stars","reviewTitle":"Great little radio","reviewDate":"The manufacturer commented on the review below","reviewText":"Great little radio. Many nice features good sound. It will stream hundreds of channels and even local channels. I would have given 5 stars the only problem is it won’t Comcast Pandora from my iphone. I can Comcast to my smart tv but not to the mondo."},{"reviewerName":"Charles G.","rating":"5.0 out of 5 stars","reviewTitle":"Great internet radio option for Sirius","reviewDate":"July 29, 2017","reviewText":"Great internet radio option for Sirius, hundreds of radio stations. Multiple radio apps (like Pandora and others) by casting through speakers...Cable connection to iPod. Great WiFi reception; capable to internet cable connection w adapter(not included). Battery provides handheld portability within WiFi network range."},{"reviewerName":"Bergram","rating":"1.0 out of 5 stars","reviewTitle":"Display Brightness Setting Needs to Go Back where the Mondo Use to BE!","reviewDate":"The manufacturer commented on the review below","reviewText":"Through the years I owned and enjoyed 3 Mondos, and I like them. But, now that I have the Mondo+, something is not right. The Mondo had 3 Display Brightness Setting: \"Active\", \"Inactive\" and \"Standby\" modes as does the new Mondo Plus. Unfortunately, however, unlike the old Mondo, in which one can set the brightness level, for example: Standby=0, \"Active\" and/or \"Inactive\" set to any number above \"0\" (depending on one's choice of brightness) and when it comes to go to bed, the \"Standby\"=0 setting would work wonders in conjunction with the \"Sleep\" timer if one may have some hard time falling asleep with brightness. The result is one would fall asleep listening to news, talk show, music or what have you in COMPLETE darkness. Then when the timer is up, the \"Inactive\" setting takes over the \"Standby\" mode; and the CLOCK on the radio is clearly visible as it should. The weird thing is that while the Mondo+ has those same 3 settings, the \"Standby\" setting OVERRIDES any of the other settings whether the radio is \"ON\" or \"OFF\" after the Sleep Timer is timed \"OFF\". Yes, the radio would be always DARK regardless what the \"Active\" and \"Inactive\" settings may have been set to!. Of course, one can manually rotate the selector wheel and get the desired brightness level, but not the programmable auto settings as the old Mondo used to do. That was very frustrating and Greg and company know about this issue. Not sure if they are going to correct them through their coming software update?\nAnother odd thing I noticed in their latest database is the (BBC, CBS, NPR and Public Radio) channels are now placed on the \"MUSIC Player\" folder as opposed to the \"Internet\" folder, with sub folders of \"News\", \"News talk\"! For the life of me, I couldn't understand why \"BBC World News\", for example, be placed on a \"Music Player\" folder! They are 24/7 News and Newstalk only. No I did not get a lemon radio. This is a replacement radio that is acting the same as the one I returned.\nThink about it, why would Grace Digital engineers provide the 3 settings, if the \"Standby\" setting is going to override the \"Active\" & \"Inactive\" settings?\nLastly, I am hoping that I have a lemon radio as far as the following issue goes:\n1) Strangely my Radio froze and I could not turn off the radio using the shutoff button or anything else. The only way to turn off was to do a hard stop by unplugging the power cord.\n2) While I was so happy with the speed in which the radio was able to connect to my WiFi network, this couple of days it is taking longer to seek, find and connect with the WiFi, while my other electronic stuff didn't have any problems.\nBut, again my biggest gripe remains with the display brightness settings.\nUPDATE!\nThe Screen Display Setting WILL NOT CHANGE even manually once the radio is \"ON\". The manual change of the setting is possible ONLY when the sleep timer is activated.\nI think with some people expressing desire for AUTO dimming, Grace would to a favor to its customers by providing that option."},{"reviewerName":"Prodromos Theosoglou","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"January 13, 2018","reviewText":"I like it very much it’s excellent"},{"reviewerName":"Amazon Customer","rating":"4.0 out of 5 stars","reviewTitle":"Why pay monthly for internet radio subsciption.","reviewDate":"April 7, 2018","reviewText":"Wait a couple days for all the updates to fully work. Tech support is helpful but not knowledgeable. Seems to work after updates. Why pay monthly for radio."},{"reviewerName":"Elizabeth Boccio","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"September 16, 2017","reviewText":"Love this radio !!! Great international music, clear audio, best purchase"},{"reviewerName":"William Skeffington","rating":"1.0 out of 5 stars","reviewTitle":"Very Poor...awaiting a replacement for a final try.","reviewDate":"July 30, 2017","reviewText":"Failed to perform properly after approximately 1 week. Awaiting a replacement...will pass along further information when replacement arrives"},{"reviewerName":"AP","rating":"2.0 out of 5 stars","reviewTitle":"did not like the construction","reviewDate":"March 7, 2018","reviewText":"did not like the construction , less options with channels... like Logitech better,\nlonger connection time getting signals..\nI returned the set after 2 weeks., will be looking for something better."},{"reviewerName":"m lucy","rating":"5.0 out of 5 stars","reviewTitle":"A birthday present he was very happy with!","reviewDate":"August 7, 2017","reviewText":"My husband LOVES his radio! A birthday present he was very happy with !"},{"reviewerName":"VIVIAN LIDDLE","rating":"4.0 out of 5 stars","reviewTitle":"How to find a station you want that just doesn't appear on the list","reviewDate":"July 25, 2018","reviewText":"I like listening to radio stations I know and i hear on my old Grace Digital but on this new one I am unable to time into them all. Very strange"},{"reviewerName":"mtbiker","rating":"2.0 out of 5 stars","reviewTitle":"Spend you money anywhere else","reviewDate":"October 25, 2017","reviewText":"First of all, you can NOT play Pandora on this radio. You can play Pandora on another devise and bluetooth the \"sound\" to the radio, but there is not Pandora on this devise. There is iHeart Radio and the XM internet APP, so you can listen to the XM and iHeart Radio.\n\nSecond, this connection to the internet on the radio is subpar. It is constantly being booted off the network or in the middle of a song it starts buffering. SO do not expect to be able to listen to your music without interuptions.\n\nWhen the radio does work, it's OK at best. The sound quality is not great. My computer speakers work just as good and sound just as good. I would not buy this again or recommend any purchase it."},{"reviewerName":"G. Lynde","rating":"2.0 out of 5 stars","reviewTitle":"This Clock/Radio is Not As Advertised!","reviewDate":"July 29, 2017","reviewText":"I owned a previous radio from Grace and was incredibly happy with it. The Mondo isn't as advertised and users will be severely disappointed in the model and firmware at this time.\n\nPros: The sound quality is terrific for a small clock-radio. It's compact and the design is attractive. The build appears to be reasonably solid.\n\nCons: The software features are severely limited. They advertise Pandora, Amazon streaming, etc. This is only if you use Chromecast. I still don't understand all the technical details of what this means, but as an iPhone guy, it essentially means that you have to manually choose on your iPhone what station you want to listen to after linking your phone to the radio via Bluetooth and selecting your device on the radio. Three or four steps to listen to Pandora. Now for the \"awesome\" news... forget using Amazon Music or Pandora as your alarm clock. You aren't allowed to set up any of these stations as your presets, so no Pandora or Amazon Music in the morning.\n\nThe other serious con to this radio is Grace Digital's customer support. They are only open until 4:30 Pacific time Monday-Thursday and until Noon on Friday. Unfortunately the product manual is poorly designed and is not designed as a step-by-step how-to for various features, and the website is buggy with a lot of old information for even older products."},{"reviewerName":"EVK","rating":"1.0 out of 5 stars","reviewTitle":"Horrible","reviewDate":"October 21, 2017","reviewText":"I live in Canada and have two other Grace Digital radios, as well as a Squeezbox. I am perfectly happy with them but the Mondo+ turned out to be the biggest mistake imaginable. Let me explain. I opened a new account for the Mondo+, registered the radio and started looking in the website for my favorite stations to add. Finding stations is ridiculously difficult. In many cases neither the radio nor the website find the station at all and I know the station exists because I have it saved in my other radio account. Then, when I found some stations and saved them in the Favorites \"Saved stations\" directory, I couldn't access them on the radio because no matter how many times I restarted the radio, the \"Saved stations\" folder remained empty. Maybe I have to wait for 24 hours or something. Then, when I tried to play the stations from the general directory, most of them wouldn't play at all and the Mondo+ would display the same message again and again: \"Internet streamer error\". I want to point out that all those stations play perfectly well on the other two Grace radios (older versions) as well as on my computer, so there is nothing wrong with the streaming of the station itself. Then, when I found the stations in TuneIn and tried to send them to the radio via Chromecast, the Mondo+ blurted the following message:\"This radio stream is incompatible with Chromecast. Please, contact the radio station to request a compatible stream.\" Are you kidding me??? And this is supposed to be a radio that leads the way?? Then I tried the iHeart Radio app. I was greeted by the message : \"This service is not available outside the United States\". You are not even allowed to browse the stations, let alone listen to them. I know many iHeart radio stations are geo-restricted to the US only but not all of them. Why can't I try my luck at least with some of them? The other service, CBS Radio (Radio.com) - same story. I am not allowed to listen to them from Canada. Another thing that annoyed me about the Mondo+ is that you do not have the option to choose your home city. In the older version, if I chose Miami, at least I would have all southern Florida radio stations huddled together in the Local stations directory, which I love! With the Mondo+ you can only choose a country, a state (in the US) and then you get several hundred stations and good luck browsing them. In this respect the Logitech Squeezebox is simply perfect! In it the stations are grouped by city even when you browse small countries like Bulgaria. On the Mondo+ website, if you click Reciva search you do not even have the option to look for stations by country, only by genre. And if you click Station search, it finds only 2-3 stations out of available 9 for a country like Cuba.I thought some stations wouldn't play because I might have a problem with the wifi signal strength. Unfortunately on the Mondo+ I could not find the option to check my wifi signal strength. The little icon on the screen showing the wifi strength never changed the bars no matter where I put the radio.I own three Internet radios, two of them Grace Digital. I look at my new purchase in dismay and don't believe my bad luck. The radio will go back where it came from. The boast that it has a database of 30 000 stations is irrelevant to me since it bluntly refuses to play most of the ones I want to listen to because I am in Canada or the streaming is incompatible with I don't know what. When you pay 289 Canadian dollars for a radio, you expect a bit more. In my opinion the Mondo+ is a serious downgrade from its predecessor, Chromecast or not. To me it is a little more than a loudspeaker. With all this said, I admit that I absolutely LOVE my other two Grace radios. I am returning this one and will try to buy another Grace Mondo from the older version. Everything in it works flawlessly."},{"reviewerName":"Jeri Maxwell","rating":"3.0 out of 5 stars","reviewTitle":"Three Stars","reviewDate":"November 30, 2017","reviewText":"quality was not as expected."},{"reviewerName":"Harry Devonish","rating":"4.0 out of 5 stars","reviewTitle":"Four Stars","reviewDate":"February 17, 2018","reviewText":"Ability to receive clear worldwide transmissions.\nNot enough presets."},{"reviewerName":"Picture and Sound Productions","rating":"1.0 out of 5 stars","reviewTitle":"Doesn't actually play Pandora","reviewDate":"October 16, 2017","reviewText":"First one that arrived didn't even turn on. Second one, I spent an unbelievable amount of time trying to set it up (the serial number on the unit is not the real serial number, etc) only to find out it DOES NOT play Pandora. You can only access Pandora thru a mobile device then stream it to this unit. FAIL. I had a Sungale internet radio that worked OK for about a year and then it became unbearable with a constant barrage on ads and apps it simply stopped working. I just want something that plays Pandora and doesn't involve any of my other devices. How hard it that?"},{"reviewerName":"Bj","rating":"2.0 out of 5 stars","reviewTitle":"Bad Search Interface.","reviewDate":"The manufacturer commented on the review below","reviewText":"As a owner of the previous model, I thought this model would be a improvement. I was wrong as this radio has flaws like: incomplete genre list, bad search interface, overall too many steps to get to a station. This is not a good internet radio."},{"reviewerName":"Schirmyver","rating":"5.0 out of 5 stars","reviewTitle":"Great cast enabled internet radio","reviewDate":"November 22, 2017","reviewText":"I purchased one of these during the kickstarter campaign and love this little radio. I use it as my bedside alarm clock and just love that I can wake up to any number of internet radio stations. I live just far enough away from the majority of radio stations making a standard clock radio useless. I purchased the unit with the battery pack so I can move it around the house while listening to podcasts or media on my own server.\n\nAs it is chromecast enabled as well, you have all of those benefits. I have it part of a whole home group so I can have synchronized music throughout the house all controlled by a few Google Homes or my cellphone. This gives you access to Pandora, TunedIn, Spotify, etc simply by casting to the Mondo+.\n\nGrace Digital is a smaller company and they are constantly are adding features to the radio. Their support and communication is better than most big names. I am looking forward to their future radios like the Encore+."},{"reviewerName":"nshyne52","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"December 23, 2017","reviewText":"great radio"},{"reviewerName":"skippy","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"September 25, 2017","reviewText":"very Good George"},{"reviewerName":"Kindle Customer","rating":"2.0 out of 5 stars","reviewTitle":"Not recommended.","reviewDate":"July 18, 2017","reviewText":"Built OK, could feel more solid. Software seems stable. --\n\nHere's the bad. 1) Pandora. If you like to wake to your favorite Pandora station in the morning, you are NOT going to do it with Mondo+. Some marketing genius thought Chromecast was a good end all feature to incorporate. All it ended, was Pandora. Mondo+ does not allow Pandora to be used as an alarm source. This is a major design defect and frankly, quite upsetting. While Chromecast works well, it reduces Mondo+ to a somewhat smart wireless speaker. You will need some other external Pandora source, like your phone to even play Pandora, and it can ONLY be done through Chromecast. Why do that? What is the point? I don't even see a way to side load Pandora to return this most valuable functionality to the unit. 2) Sound quality. Flat flat flat. Nothing but a treble and bass control. I have an looking for a replacement for my Logitech Squeezebox Boom, and Mondo+ is not it. The Squeezebox makes Mondo+ sound like an AM radio, instead of a high fidelity audio system. Maybe the Encore will sound better, since it has a tiny sub-woofer, and still plays Pandora without external devices. The Mondo+ needs a better amplifier and a beefier speaker with a larger magnet and longer throw cone. This will also add heft giving the feeling of a more solid product. I do not recommend this product."},{"reviewerName":"tc","rating":"1.0 out of 5 stars","reviewTitle":"Not ready for prime time","reviewDate":"July 13, 2017","reviewText":"Unable to listen to favorite radio station that I am able to listen to on previous model. The \"add to my stations\" button does not work. Called Grace Digital customer support and they had no solution. Looks like this new model was rushed to market without working out the bugs first. Returning this for a refund. I purchased this new model for an extra radio to listen to upstairs, but will have to get by with just one radio (the previous model)."},{"reviewerName":"flg","rating":"5.0 out of 5 stars","reviewTitle":"A fantastic internet radio!","reviewDate":"October 10, 2017","reviewText":"The Grace Digital Mondo+ is an excellent internet radio with an extremely active support team, the radio has really been improved in functionality since it was lunched. Grace has added many additional features since the radio was first lunched, and the Mondo+ development team are unbelievably dedicated and even proud of their new radio. This dedication and level of support is not very common nowadays, you will not regret your purchase.\n\nI'm an experienced user, I've owned several internet radios for more than ten years. Lately many stations have been changing their streams to incompatible formats, but the Mondo+ amazingly has played almost everything I've attempted to play, except BBC MPEG-DASH streams.\n\nIf you cannot find a station in the Grace Radios+ database, you can now also access the extensive and well maintained Reciva database and add stations directly from there. The individual saved station stream HTTP addresses are fully displayed in your My Stuff favorite's folder. Each individual station saved is fully configurable including the associated image and HTTP address, really a fantastic favorite's implementation with no equal. To top it off, and contrary to most other current internet radios, the Mondo+ is fully compatible with the new hls live streams, including any m3u8 station URLs that you may want to add manually.\n\nYou do not need to be an expert to use this radio, as it comes with an easy to use interface, an exceptional updated printed manual, and a US based wonderful support team."},{"reviewerName":"llott0","rating":"1.0 out of 5 stars","reviewTitle":"I'm only keeping it because the rep was great, and the hassle of returning","reviewDate":"July 18, 2017","reviewText":"This doesn't work with Pandora, despite description. Took an hour with the Grace Digital rep to discover that their Mondo+ is not compatible w Pandora. I'm only keeping it because the rep was great, and the hassle of returning."},{"reviewerName":"JJ","rating":"1.0 out of 5 stars","reviewTitle":"3 days of use and it no longer works.","reviewDate":"August 23, 2017","reviewText":"Seriously - 3 days of use and the speaker has stopped working? I was so excited to get this and now - nothing. So - it will be returned and now I'll have to pick something else. Garbage."},{"reviewerName":"SomeGuy","rating":"1.0 out of 5 stars","reviewTitle":"Do Not Buy!","reviewDate":"September 6, 2017","reviewText":"First the customer service dept. lied to me in an email and said that it had built in Spotify and Pandora apps. IT DOES NOT. Then the speaker quit in a week. Ordered a replacement and it quit in a week. Ordered a third radio and it quit in 2 days. This is a piece of garbage. Just buy a Bose Soundlink you need a seprate device to cast or pair with anyway"},{"reviewerName":"SS","rating":"5.0 out of 5 stars","reviewTitle":"Who says you can't get no satisfaction? With this radio from Grace Digital you get just that. Satisfaction. And more!!","reviewDate":"November 28, 2017","reviewText":"As the happy and deliriously satisfied owner of three, count 'em, 3(!) Grace Digital Internet radios I am happy to report that the Mondo+ I recently purchased for my older brother is, per his own words, FANTASTIC!!!!\n\nAnd while my brother has not yet begun to explore all the facets of this fabulous device, he is totally satisfied with it to date! It is portable! It is robust! It's sound is very, very, good!!!! And he is looking forward to discovering even more of its features as well as favorite new stations from around the globe.\n\nHe is now a BIG fan of internet radio and one might say an eager owner of Grace Digital's Mondo+. Eager for more music which provides more memories of a wonderful past and new songs to attach to new memories from today. You will not be disappointed with this gem of an internet radio from Grace Digital.\n\nI have personally visited their offices and can say that they are among the most passionate and polite people in business today. With a product like the Mondo + it is easy to see why."},{"reviewerName":"Charles T. Bell","rating":"5.0 out of 5 stars","reviewTitle":"A top notch clock radio.","reviewDate":"November 29, 2017","reviewText":"I needed an alarm clock that allows multiple alarms for multiple days and this does the job very well. I can also pick different Radio Tunes stations to load from the presets. The volume is good and the sound is very good, although not HiFi. If I have a problem the staff at Grace is very responsive. They also present updates in the software. You can't go wrong with this clock/radio. I highly recommend it.\nIt allows 5 different alarm settings so you can set it and forget it, with settings for the weekdays and different ones for the weekends. You can also have 1-time alarm for a special occasion."},{"reviewerName":"Ed R.","rating":"5.0 out of 5 stars","reviewTitle":"I love this Internet radio","reviewDate":"November 28, 2017","reviewText":"I love this Internet radio! In addition to many stations from around the world, what sold the Grace Mondo+ to me is the fact that my Sirius XM radio subscription for my car extends to this radio for a small additional monthly fee. The sound is rich for the relatively small footprint. One suggestion is that if you want to record to an external device (such as a Crane CC Witness Plus, which I use), that you should attenuate the output (I use a Sound Professionals SP-ATEN-1-8-12513) in order to \"clean\" the heavy bass output. Grace is very willing to support this product. Don't be surprised if you see an update download to the Grace Mondo+ in the middle of the day!"},{"reviewerName":"r.a.comunale","rating":"1.0 out of 5 stars","reviewTitle":"UNFORTUNATELY THIS WAS A DUD I HAVE HAD GOOD LUCK WITH OTHER GRACE MONDOS","reviewDate":"July 18, 2017","reviewText":"UNFORTUNATELY THIS WAS A DUD\nI HAVE HAD GOOD LUCK WITH OTHER GRACE MONDOS."},{"reviewerName":"Philip E Larimore","rating":"5.0 out of 5 stars","reviewTitle":"Wonderful all around service and quality. Nobody beats Grace Digital!","reviewDate":"November 17, 2017","reviewText":"This company has the best, highest quality wireless radios of any company I have purchase radios from in the last 20 years. They have sincere and caring customer service personnel that are quick to respond to any questions or concerns. In this age of ripoffs and dishonest business practices, you can depend on GraceDigital.com delivering a product and experience that will give you satisfaction and peace of mind. This is why Grace Digital will never have to worry about being shut out by Walmart or Amazon.\nThe Mondo+ offers everything you could ever want in a radio. Regardless of what genre you are looking for, there are thousands of choices. I especially like late night talk shows, oldies, standards, and sports talk stations. In addition to the 10 preset buttons, you can register on their website that allows you to save a limitless list of stations stored in your custom made folders and shown on the full-color radio display screen."},{"reviewerName":"S. Davitt","rating":"5.0 out of 5 stars","reviewTitle":"Great internet radio!","reviewDate":"October 20, 2017","reviewText":"Got my Mondo+ almost a week ago for a birthday present and so far, so good! I really like it. I got it as a replacement for my slowly dying Logitech Squeezebox radio. The Mondo+ has been chugging along for hours per day perfectly playing my saved stations, streams and podcasts. It was super simple to set up and it connected to my wireless internet on the first try. The sound is very good and it gets plenty loud. The alarm has worked perfectly and you can either have it wake you up to a station or a classic alarm clock type buzzer sound. I've had several questions and the Mondo+ team, especially Lynda and Greg, have been very helpful and very timely in getting back with answers. You can tell they care and it's nice to have a properly supported product again unlike the Squeezebox Logitech discontinued and stopped supporting a long time ago."},{"reviewerName":"Drat","rating":"1.0 out of 5 stars","reviewTitle":"This may be a good product if one can figure out how to make ...","reviewDate":"February 19, 2018","reviewText":"This may be a good product if one can figure out how to make it work. I've rarely seen an instruction manual so horribly inscrutable as the one that comes with this, and the manufacturer's customer support is unacceptably poor assuming one can even get through to them."},{"reviewerName":"garatoro","rating":"1.0 out of 5 stars","reviewTitle":"I don't recommend you to buy this radio","reviewDate":"February 21, 2018","reviewText":"This mondo+ was broken in two month. I don't recommend you to buy this radio.\nThis radio is too cheep body. Body weight is very light.\nIt is lighter than Logitech Squeezebox Radio and lighter than it looks.\nI guess that Mondo+ is made by insufficient parts.\nGreat job, Great company.\nGrace Digital Mondo+ Wireless Smart Speaker and Internet Radio with Wi-Fi + Bluetooth and 3.5\" Color Display"},{"reviewerName":"Mike Snigur","rating":"1.0 out of 5 stars","reviewTitle":"Unable to connect to wifi- also was unable to locate ...","reviewDate":"The manufacturer commented on the review below","reviewText":"Unable to connect to wifi- also was unable to locate local stations. Let's just say it was a waist of my money 👎🏻"},{"reviewerName":"J. Palaima","rating":"4.0 out of 5 stars","reviewTitle":"A connected internet streaming radio with chromecast and more..","reviewDate":"July 17, 2017","reviewText":"Chromecast built-in, both 5 and 2.4ghz radios, larger display than Logitech... Sirius XM is built in.. .. Also can be used as a BT connected speaker...\nHave used other Grace Digital devices... this is a much more rounded and connected product ...\nIn general.. it is quite a useful replacement for my aging Logitech Squeezebox Radios.... the original mondo.. just didn't think it checked enough boxes for me... Just being able to connect and use Chromecast apps and Spotify on it made a big difference... The sound is good... but you must go in and tweak the settings a bit, not just use the default... Am interested to seeing how it performs doing multiroom like the Squeezebox used to do...\nThe slight cons...\nSort of dissapointed they left out a physical ethernet jack... though its avalible as an accessory... Already has gotten a few updates and fixes via firmware updates... Yes its primarily wireless but still.. theres something said about just plugging it into a wired connection...\nAlso would have liked to see some of the buttons backlit... with options for dimmability, Like the idea of using it on my nightstand possibly in semi-darkness.. Also the native spotify app is not avalible yet, but the chromecast is pretty seamless and you still see song art and titles on the display as well as controls..... Also could use a little more bass.. and bass isnt my thing..\nPurchased this via their crowdsourcing campaign vs Amazon...\n\nFolks dissapointed in the lack of built in app support for Pandora and Spotify and Amazon... Pandora seems to refuse to play with hardware vendors nowadays and wants to insist on streaming by phone app lately... Pandora is worse that Spotify about this... Pandora wants to shutter their device based apps and ONLY allow app streaming from a phone or tablet..\nNative Spotify is supposedly in the works....\nBBC is native\nWould like to see Tunein and Accuradio in addition to the infamous Clearchannel offering (Iheartradio)\nSupposedly theres also work on native Radionomy (sp)...\n\nChromecast however is pretty seamless and is vastly superior than just BT streaming from a phone....\n-J"},{"reviewerName":"Lawrence M. Carpenter","rating":"2.0 out of 5 stars","reviewTitle":"This unit did not meet my expectations. I, ...","reviewDate":"August 5, 2017","reviewText":"This unit did not meet my expectations. I,m frequently unable to connect to radio stations that I've entered into the search function even though these stations stream online. I'm very skeptical of their claim to have access to 30,000+ stations. The Bluetooth connection is lost every time I switch to another podcast or song."},{"reviewerName":"Bryan Adams","rating":"5.0 out of 5 stars","reviewTitle":"Great features and value. Keeps getting better with updates.","reviewDate":"November 17, 2017","reviewText":"It's an excellent internet radio and chromecast enabled smart speaker. The manufacturer has been very responsive to suggestions and has continually been making improvements since I got it. Having the ability to add a battery to it to allow fully wireless use is also very handy for use around the house and yard."},{"reviewerName":"Danny E.","rating":"5.0 out of 5 stars","reviewTitle":"Ease of use and reliability","reviewDate":"November 28, 2017","reviewText":"Easy to setup and use, and it sounds great! It also is reliable and retains settings. I listen to WFSO."},{"reviewerName":"Cal5150","rating":"5.0 out of 5 stars","reviewTitle":"Fantastic Internet Radio!","reviewDate":"September 11, 2017","reviewText":"I relocated from the Bay Area to the Austin area. I found myself missing my favorite radio stations. Hearing about something called a wireless internet radio, I investigated. I purchased one from another company and was not very happy with it and gave up on the prospect of hearing my favorite stations again.\nThen I started hearing about the Grace Digital Mondo+ Radio. It looked promising so thought I would give it a try.\nNow this radio gets the job done! Not only can I now listen to the Bay Area radio stations I miss, but the radio just plain looks good. It is very sleek and modern with a display that is large and easy to read. The sound is very good and can be adjusted to your taste. If you like more bass, you can have it. If you prefer more treble, adjust away.\nI had no idea what Chromecast was but found out that I can use that to stream music from my iPhone to my Mondo+, and Chromecast in built-into the radio....no additional attachments necessary.\nNot being a technical person, I did have to contact Tech Support once. They responded quickly and I was on my way to completing the set-up. Strictly Operator Error on that one.\nI did purchase the optional USB to Ethernet connector as that made the connection even stronger. The reception for all stations has been strong.\nI find this radio to be well worth the money and it does everything it said it would. I am very glad I decided to take a chance and try internet radio again.\nI hope that this helps you to decide."},{"reviewerName":"William D. Fusfield","rating":"1.0 out of 5 stars","reviewTitle":"Resetting every time the power goes off is too much for me!!","reviewDate":"September 12, 2019","reviewText":"This is a fine radio but I would never buy another one since every time it loses power, which happens frequently where I live, partly because our power supplier has problems, and partly because our cleaning woman tends to unplug the radio every time she cleans the room it's in, one has to laboriously re-enter a long code message to get the thing to work again. Why all of that information is not simply stored in the unit's memory is beyond me, but, at least unless they have since fixed the problem, it isn't. So I often turn on the radio, see the request for the elaborate \"code\" to make my own damn radio work again, get a bit annoyed, and turn on my regular, no code requiring, FM radio instead. All in all the various stations it allegedly allows one to listen to, -- and many remain unavailable! -- do not outweigh the cumbersomeness of the design. Clearly internet radio needs to correct such problems if it ever is to catch on!"},{"reviewerName":"Rebecca L. Arthur","rating":"5.0 out of 5 stars","reviewTitle":"I love Grace radios","reviewDate":"November 17, 2017","reviewText":"I love Grace radios, and this is the best yet...easy to use and lots of apps like Iheart radio, Sirus/XM, and live365...and they are constantly updating the software to make it even better. This is great for an old fart like me, who wants to access internet radio, in a way that feels like the radios of old...love it"},{"reviewerName":"Nicholas Lemonakis","rating":"5.0 out of 5 stars","reviewTitle":"I really Love The Mondo+! The New Mondo+ is fantastic! I love it and will be purchasing more! Holidays are coming! A great gift!","reviewDate":"July 5, 2017","reviewText":"I love my Mondo +! This radio connects quicker and does more than the original. The Chromacast function is something that opens many other doors or options to stream broadcasts as well as music apps. The display is beautiful and easy on the eyes as well! The engineering on this unit is superb! Another feature is The portability with the battery(sold separately) on Amazon at a very reasonable price by the way! The Mondo + also has Bluetooth which is another way to stream music,radio or podcasts. So many options there's always a way to get what you want! I also like the new software updates and the addition and integration of iTunes on the Mondo+!\nAnother thing I wanted to mention was that when I go into the local search mode I get many more local stations than on the older model! The key here is you have real access with the Mondo+! Bottom line the Mondo+ is a winner!"},{"reviewerName":"Craig M.","rating":"2.0 out of 5 stars","reviewTitle":"Not What I Expected","reviewDate":"February 7, 2019","reviewText":"I bought this as a replacement for a Grace Mondo I'd had for years n dearly loved. I was expecting access to Pandora and the Receiva data base for station selection. Pandora is inaccessible on this unless you do some work around using a smart phone which I do not have. Grace now uses their own station data base which i find vastly inferior to the selection I had on Receiva. Up to a third of the stations listed turn out to be dead links. I love Classical music, that genre has a pathetic selection, many play movie soundtracks or new Age stuff. I wound up buying a refurbished Mondo which does have Pandora and Receiva access. The Mondo plus works fine and sounds great. It just doesn't have the coverage I wanted and I feel Grace wasn't honest in their descriptions of what it does."},{"reviewerName":"Jack Dharma","rating":"5.0 out of 5 stars","reviewTitle":"Changing from OK to Excellent.","reviewDate":"September 14, 2018","reviewText":"I had originalIy written a mediocre review of the Grace Digital Mondo (not plus), which died after a few years. However, I plugged it in one last time before throwing it out (I'd plugged and unplugged it multiple times prior to this), and it worked. It's been working ever since (more than a week). I now believe that it was not a defect in the radio, but in the cable/wireless system in my house. Hence, I've changed my rating. I have three other Grace Digital Internet radios in the house, older models, and they've been working fine right along (in different rooms). I now recommend the brand without reservation."},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Love My Mondo+","reviewDate":"January 1, 2018","reviewText":"What’s easy to set up, sounds great, and delivers all that it promises? You guessed it. I’m talk about my Mondo+ from Grace Digital. This internet radio is a great affordable product. As long as you have internet in your home you’ll be able to listen to hundreds of stations on the internet. Music, talk, news, sports and more. The presets are easy to set up, the sound coming from the speaker is great. I keep my Mondo+ beside my bed and the original Mondo I moved to bathroom so I can catchup on news from around the world when I’m getting ready for work. I don't always listen to internet radio, but when I do it’s on my Mondo+ or my original Mondo. No, I don’t work for Grace Digital. I’m just a happy consumer."},{"reviewerName":"Stuffing Boy","rating":"1.0 out of 5 stars","reviewTitle":"Paper weight function is only operational part!","reviewDate":"July 6, 2019","reviewText":"Purchase this product if you need a large paper weight. It weighs in around one or two pounds and can keep a limited amount of paper in place against moderate wind. If you intend to listen to music, I would recommend you look elsewhere. Radio function is limited, or in my situation not working at all. Based on my product: It is nicely designed black radio that cannot tune into any internet radio station. Don't be mislead by description calling thinking it can play audio from internet radio stations, that part doesn't appear to work, or stops working shortly after being plugged in. Product support is unavailable from manufacturer."},{"reviewerName":"Rod","rating":"5.0 out of 5 stars","reviewTitle":"Great wifi radio/alarm clock!","reviewDate":"July 14, 2017","reviewText":"If you are looking for a great wifi radio and alarm clock, look no further. The Mondo+ is THE answer. This updated version of the original Mondo from Grace Digital has great features and great sound.\n\nThe alarm clock feature is the best I have ever encountered in an alarm clcok. The alarm settings are extremely customizable and anyone or any couple should have no issues.\nThe built-in Chromecast is great. Another reviewer noted that the Mondo+ does not have Pandora. While the Mondo+ does not have the Pandora choice directly in it as the original Mondo did, anyone can cast Pandora to the Mondo+ from their phone and/or tablet via Chromecast. Chromecast works great with the Mondo+ and has worked flawlessly thus far.\n\nThe updated Mondo+ is a great music source via wifi, chromecast, or even your own pc. It is economical for the high-end quality you are receiving. It is certainly a step up from the original Mondo and I give it my highest recomendation for currently available wifi radios!"},{"reviewerName":"RSC","rating":"5.0 out of 5 stars","reviewTitle":"Best Internet Radio Alarm Clock","reviewDate":"The manufacturer commented on the review below","reviewText":"Previously bought a Sony Dash, using the Chumby firmware (as Sony abandoned the Dash) and found that it did not support encrypted HTTPS audio streams. Using this mostly as an alarm clock, I found it easy to find a news radio station (MSNBC, CNN or FOX News) and map it to one of the 5 pre-set buttons. Once a station is pre-set, its automatically added as an option to select when setting the alarm audio source. Alarm lets you choose Weekday (M-F), Weekend (Sat-Sun), All Week (M-S) or a specific day of the week. Each can be configured using different radio stations to wake up to. You can also choose to have the alarm volume gradually rise over 10 seconds, or even 60 seconds, which is ideal for a gentle wake up instead of having the radio instantly blast you with high volume music.\n\nNOTE: I own a HDHomerun Prime and it actually finds cable channels, but wont play anything back, be it 720p, 480i or even an re-transmitted local radio station. MPEG2 appears to not be supported on the Mondo Plus."},{"reviewerName":"Morteza G Alaei","rating":"1.0 out of 5 stars","reviewTitle":"No sound! A total waist of money. I ...","reviewDate":"December 21, 2017","reviewText":"No sound! A total waist of money. I received a second unit from Grace Digital and it still had no sound."},{"reviewerName":"John Henriksen","rating":"5.0 out of 5 stars","reviewTitle":"Great Internet Radio!","reviewDate":"November 27, 2017","reviewText":"Great unit! If you want to enjoy streaming music as simply as you have with your traditional clock radio, this one is the one for you! With so many additional features, the Mondo+ will do it all!"},{"reviewerName":"Leslie","rating":"4.0 out of 5 stars","reviewTitle":"Great sound. Cumbersome as an alarm clock","reviewDate":"April 10, 2019","reviewText":"Feel like sleeping in and want to turn off the alarm clock for tomorrow morning? No problem.\n1. Press ON/OFF\n2. Press BACK\n3. Turn menu wheel to \"ALARMS\"\n4. Press selector wheel\n5. Navigate to the desired alarm (one of 10)\n6. Navigate to DISABLE\n7. Press the selector wheel.\n8. Press ON/OFF\n\nNow, on my other basic alarm clock, I just need to press the Alarm On/Off button and I'm done.\n\nThis is the price one has to pay in order to be able to wake up to any radio station, any music from any source. If I want to sleep in, it's easier to just unplug the entire device."},{"reviewerName":"Jerry Gorman","rating":"5.0 out of 5 stars","reviewTitle":"A great product, poised to get even better","reviewDate":"July 14, 2017","reviewText":"The Mondo and the Mondo+ are outstanding products. The sound is great, the Sirius XM connection works great, finding local radio stations around the USA is easy, the presets work. They are great products to have. The Mondo+ definitely needs some updates as not all the features are yet operational, and some of the features that are in the Mondo are not yet in the Mondo+. Most bothersome features not available to me are: a) can't get the USB player to play in the Shuffle Mode on the Mondo+ when the feature is available in the Mondo, and b) certain pause, rewind, and forward controls do not work. However, I'm very pleased to have both radios and use them extensively. Love to listen to radio stations from around the country. Virtually all are available. I look forward to having all potential of the Mondo+ realized in the near future. (For sports radio fans, there is a feature that is quite unique and valuable: It's quirky to get to, and I'm not sure how I did it, but I did it once. Say a baseball game, available on SiriusXm starts at 7pm and you want to listen to it beginning at 9pm. There is a way to turn on the radio at 9pm, and play the game from the beginning which started two hours earlier. Absolutely great if you are into such things.) Battery works great too. A must to have as the radio is quite portable. Service folks in California are very helpful too and anxious to please."},{"reviewerName":"mdog002","rating":"5.0 out of 5 stars","reviewTitle":"Very Good InterNet Radio","reviewDate":"December 29, 2018","reviewText":"got the radio hooked up quickly. Only rarely does it lose the WiFi connection, but it easy to reboot. I use the radio to listen to several Old Time Radio stations with the old detective radio shows, westerns among others. Very entertaining. The radio has a timer so you can set it and fall asleep to the programing. The only issue is that the sound is only OK and really needs a satellite speaker for the other nightstand. Also, illuminated buttons for station selection would be nice to have. Otherwise a great investment."},{"reviewerName":"Gramercy Galleria","rating":"5.0 out of 5 stars","reviewTitle":"...improves my mood!","reviewDate":"November 29, 2017","reviewText":"This radio lights up my life... in fact it was so wonderful that we bought a second one. The Grace customer support also deserve similar rave reviews. Sounds good, looks good, and improves my mood!"},{"reviewerName":"Rick H.","rating":"1.0 out of 5 stars","reviewTitle":"Not worth it","reviewDate":"April 23, 2019","reviewText":"I got this years ago. Before the Echo was on the market- was frustrated with it then, put it in a box in my closet, found it the other day, & decided to give it another shot. I feel that this product is very overrated. If you like podcasts, this is not for you, they claim you can add podcasts via their website, but I have not been able to get them to play on the unit. It’s nice that now you could stream BBC podcasts with IPlayer, but the radio disconnects from WiFi a lot, so good luck doing that. If it kept a WiFi connection, it still would not support music services like prime music, Spotify, or google play.\nPlus the battery is hard to instal\n\nIf you are thinking about buying this I would highly suggest looking at an echo first. Most models are cheaper, they are much better internet radios. If you want an internet Radio that is portable like this, but that actually works, I would recommend buying a Bluetooth speaker with good battery life and support for OX and USB, plus an old, or cheap android phone, and just connecting them"},{"reviewerName":"Thomas M. Youchak","rating":"1.0 out of 5 stars","reviewTitle":"One Star","reviewDate":"The manufacturer commented on the review below","reviewText":"Terrible product."},{"reviewerName":"W. D. Koenig","rating":"5.0 out of 5 stars","reviewTitle":"Mondo +","reviewDate":"June 30, 2017","reviewText":"Extremely happy with my new radio! I was part of the kickstarter program for the Mondo+. the radio's software needed updates out of the box but Grace Digital had informed all about that so it could comply with Google requirements. once the software updated, my radio had an issue that Grace handled quickly told me to factory reset and start anew. once that was accomplished all was good; if you were familiar with the Mondo menus - forget about 'em because the Mondo+ uses a new menu system and website! I'm extremely happy with the customer service and the company in general. the Mondo+ is my go to audio device in my office."},{"reviewerName":"PC","rating":"5.0 out of 5 stars","reviewTitle":"I own the original Grace Digital Mondo","reviewDate":"June 19, 2019","reviewText":"I have owned one of the original Grace digital mondo units for several years now and it's an excellent device and perfect in my bedroom. What I like is since mine is older it has padora radio on it (not sure the newer chrome cast version does). But the sound is solid for a small room and the alarm clock has many features like waking up to your favorite music. Another thing I like is that it can stream music from my music server. Works very well. It also can play the 50 or more mp3 albums I have on my USB thumb drive. I don't own the plus (newer model) mine is the first generations. And it's worked perfectly for years. A+rating"},{"reviewerName":"Steven D. Behrens","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"November 29, 2017","reviewText":"I loved my previous Mondo, but this Mondo+ is a vast functionality improvement"},{"reviewerName":"Chuck R","rating":"3.0 out of 5 stars","reviewTitle":"Bought this radio to get Radio.com","reviewDate":"December 20, 2018","reviewText":"After owning a Logitech radio and losing radio stations because they mover the radio.com, I purchased this radio because they did receive radio.com. I registered the radio and started looking up and saving the stations(some radio.com) that I listen to. Now after 6+ months, the radio.com stations no longer play, even though the stations say they are radio.com. I went online and had a chat from someone at grace who told me that I needed to register them on Grace. He gave me a link, I went to the link to find and save the station, the stations were not in the list. So back on to chat and had to provide info for them to open a ticket. It seems like every time a new company starts up there are issues after you buy the product. FRUSTATED!"},{"reviewerName":"Paul G.","rating":"5.0 out of 5 stars","reviewTitle":"Great Internet Radio and much more","reviewDate":"July 18, 2017","reviewText":"There isn't much that the Mondo + is missing. I like the audio quality. It has an equalizer one can adjust but I've stayed with the default...lots of base but clean.\n\nI also like the connectivity options the Mondo + offers. If I want I can \"cast\" a tab from my desktop chrome browser to the radio. Or I can cast a radio station playing on my Google Home/Google Assistant to the Mondo +. And it can function as a bluetooth speaker!\n\nI like how \"instant on\" it is. There is almost no waiting at all for a station to start playing...even the SiriusXM ones.\n\nI haven't tried out the Android app for the radio yet...it comes with a hand held remote which I use. The Mondo + is the best of the internet radios...and firmware is being upgraded all the time, so it can only get better! (not a verified customer on amazon but I purchased the radio via their kickstarter campaign)"},{"reviewerName":"mm","rating":"5.0 out of 5 stars","reviewTitle":"easy to use","reviewDate":"December 28, 2018","reviewText":"My father passed away and we had to move my 80 year old mother to another state. She listened to the radio most of the time and missed her hometown radio stations. I purchased this Mondo+ internet radio for her for Christmas because it had a large display and big preset buttons. She just loves it, I programmed her stations for her and she has no problem using it. A couple of her stations were not available on Grace Digitals site but they added them for me in about 2 days. I also bought the battery so she could move it around, It plays all day on the battery. The radio has wonderful sound with good bass. My moms smile was worth every penny. Thanks Grace Digital for your great product and excellent customer service"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Good and solid product I can","reviewDate":"November 28, 2017","reviewText":"Works flawless. Sound is OK for the size of the Radio. Good and solid product I can recommend"},{"reviewerName":"javanbooks","rating":"4.0 out of 5 stars","reviewTitle":"great little streaming device!","reviewDate":"October 25, 2018","reviewText":"ive had tgis for a few years now and i love it, granted i have it in my kitchen and using it while cooking etc. i can listen to pandora, live local radio stations and many more apps. The set up was a bit of a pain but once its up and running its a great little gadget! it came with a remote too but ive never used it."},{"reviewerName":"John","rating":"4.0 out of 5 stars","reviewTitle":"Mondo+ is a Winner","reviewDate":"November 29, 2017","reviewText":"I have been a long time customer of Grace Digital. I love the the new Mondo+. They are constantly updating the software through firmware that provides new features and better performance. I also own three older Mondo units and love them all.\n\nThe only problem I have is that it no longer supports Pandora without using Chromecast. I am not a big fan of wanting to use my phone to connect to the radio to stream music. The whole reason I have a dedicated internet radio is to listen to radio without any additional devices.\n\nBut, overall I love the radio and would purchase it again."},{"reviewerName":"Michael H","rating":"5.0 out of 5 stars","reviewTitle":"Great internet radio depending on the functions you want.","reviewDate":"July 24, 2017","reviewText":"Others have commented on the features and limitations of this device, so I won't repeat that. Bottom line - the Mondo+ is a great device if you are satisfied with it functions. I wanted an internet radio that is very portable, that could save lots of \"favorite\" internet stations, and could also stream audio from other devices. This meets all those requirements very well. As others have noted, the firmware is still a work in progress, and there are music genres that aren't included in the search list (I don't understand how they could have left out the Blues). But it works well for what I want, looks great, and has terrific technical support."},{"reviewerName":"Jessica","rating":"5.0 out of 5 stars","reviewTitle":"Great radio, and service","reviewDate":"October 27, 2017","reviewText":"I love the radio, and the sound quality. It is easy to use (I’m not one to read manuals). What really impressed me was the tech support! Whenever I had a slight problem Greg immediately responded with simple solutions, like check for updates. Today a favorite station had no sound. Greg wrote back saying the station had 2 listings, and suggested I try one that worked. It feels great to support a business based in the USA that is working hard to provide excellent service."},{"reviewerName":"Adam Orden","rating":"1.0 out of 5 stars","reviewTitle":"Very poorly engineered","reviewDate":"October 30, 2018","reviewText":"I have had this product for about 2 years. when it works it works. However, it is really poorly engineered and the software is cr*p. It has a great deal of difficulty connecting to existing wifi. Entering passwords is a pain. Editing them or deleting them is more of a pain and almost never works. You will find yourself continually frustrated. Unplugging, replugging it in. Oh my gosh its unbelievable. I put up with it until now. It is going in the garbage where it belongs. Spend more money and save yourself a ton of time and frustration."},{"reviewerName":"Revbeej","rating":"5.0 out of 5 stars","reviewTitle":"I love my mondo+","reviewDate":"June 30, 2017","reviewText":"I too was a part of the kickstarter program. I actually ordered 2 of them. One for me and one for my best friend. I have at least 3 other Grace radios and 2 other brands and I like my Grace radios the best. I signed up for the kickstarter pledge because of my previous experience with Grace. Anyway, the radio sounds great and looks cool too. I ordered an external battery and received it today. If you are looking for a quality internet radio, I suggest you consider a Grace brand radio."},{"reviewerName":"jmstwo","rating":"5.0 out of 5 stars","reviewTitle":"Great radio","reviewDate":"November 28, 2017","reviewText":"Call it a radio, but it is much more and very convenient. Program podcasts as well. I’ve bought and gifted several Grace radios."},{"reviewerName":"southshore74","rating":"4.0 out of 5 stars","reviewTitle":"Awesome Radio","reviewDate":"December 14, 2017","reviewText":"Great Radio if you have High Speed Internet. You must have at least 25/25 mbs, in order for the full functionality of this Radio. Don't blame the Radio for your sucky Internet speed. This Radio will load and find your wifi in under 30 seconds. My only gripe with the radio is that you can program your alarm for the entire week, however it will not memorize your alarm settings for every week of the Month, it is not set and forget. Sound and bass is very good. There is no daylight savings on/off setting."},{"reviewerName":"Viktor Masnyy","rating":"5.0 out of 5 stars","reviewTitle":"Best internet radio","reviewDate":"October 24, 2018","reviewText":"It is best internet radio for me. I listen it all the time when I am at home.\nTo like:\n-sound quality\n-Includes local and internet radio stations\n- Up to 20 memory presets\n- Nice color screen\n- great wireless range\n- Can be used a clock alarm\n- Includes headphone jack and USB port\n- smartphone app available\n\nTo dislike:\n- missing touch screen\n- 6 month optional battery life"},{"reviewerName":"R. Klavan","rating":"5.0 out of 5 stars","reviewTitle":"Great radio","reviewDate":"November 30, 2017","reviewText":"I come out of radio, worked in radio, even wrote a novel about radio (\"Schmuck,\" still available on Amazon). This is a terrific internet radio, easy to use, beautiful sound quality. Even if you use your IPod (and I still do) there's something about having a radio that looks and acts like a radio...and doesn't get email. Buy it, you won't be sorry."},{"reviewerName":"kingsprof","rating":"2.0 out of 5 stars","reviewTitle":"Stopped working","reviewDate":"April 20, 2018","reviewText":"Sound was good, and it was easy to operate until it died. I bought this item four years ago, and used it very sparingly. Now retired, I looked forward to using it more. I turned it on and it was unusable. I kept getting a “loading” note on the screen. I tried factory reset, to no avail. Does not work and I am reluctant to spend the $40 plus to send it back for repairs. Live and learn."},{"reviewerName":"David","rating":"5.0 out of 5 stars","reviewTitle":"Great Product from a Great Company.","reviewDate":"July 7, 2017","reviewText":"I am really enjoying my new Mondo+ Internet Radio. Attractively designed with superb sound and simple navigation. But more than that I am extremely impressed with the Grace Digital customer service care. My first Mondo+ had an issue with buffering and I was sent a replacement unit immediately. I couldn't be more satisfied. It's rare in today's competitive market place to find a company that cares. And at the risk of sounding like a commercial Grace Digital seems to be very concerned that you (the buyer) are happy. Good for me and good for them."},{"reviewerName":"Philico","rating":"3.0 out of 5 stars","reviewTitle":"Third and most annoying, it has wifi connectivity issues if you set ...","reviewDate":"November 2, 2017","reviewText":"I have a unit for over 5 years now and unlike others who write a hastened review, I'm well qualified to do so. It plays well but has a few issues: First, the volume knob is not working anymore and tends to always make things louder no matter which way you turn it. Second it drains the battery even if you turn it off. So if you forget to put it back to charge, it will die in a couple of hours. Third and most annoying, it has wifi connectivity issues if you set it up to connect to multiple wifi sources. If you only have one wifi in the house that might be no issue but in my case I have several hot spots and it tends to hop from one to another for no apparent reason and constantly interrupting the internet connectivity. It really becomes annoying and there is no way to selectively \"forget\" connections and instead you have to reset things to factory standards and start all over again. The people who designed it should stop the automatic scanning / hopping to registered networks and should also add functionality to forget a registered network!"},{"reviewerName":"BP Bob","rating":"5.0 out of 5 stars","reviewTitle":"A wonderful purchase","reviewDate":"July 13, 2017","reviewText":"I bought the MONDO Radio about 1.5 yrs ago. I liked it so much that I bought their ENCORE Radio last Christmas. Both radios work great, I use this one (Mondo) in my bedroom. I listen to Sirius Stations at night when I can't sleep. The sound and reception is excellent. After reading the manual, setup is simple.\nMy only complaint is the optional battery that I bought for $39.95. It just doesn't work. When the power goes off, the battery powers the radio for about 15 minutes."},{"reviewerName":"Chris","rating":"5.0 out of 5 stars","reviewTitle":"Customer service is second to none!!! had ...","reviewDate":"December 7, 2017","reviewText":"Customer service is second to none!!! had an issue with a battery not holding charge, I called and straight to the point replacement battery in route to me practically before I finished the phone call! I have and will continue to support and brag to friends and family this product line!"},{"reviewerName":"isp76","rating":"1.0 out of 5 stars","reviewTitle":"Wouldn't buy again","reviewDate":"January 31, 2019","reviewText":"Volume control and earphone plug don't work well. Volume control has to be turned and turned and turned and turned etc., you get the point, to get it to change the volume. The earphone is VERY intermittent. If you have the patience you can get it to work for a few seconds, and on a good day, a minute. Factory reset won't fix it and Grace wants me to pay to send it in. Very disappointed. Use a new or used cellphone and listen to iheart radio and you'll be happier."},{"reviewerName":"HDTVJeff","rating":"5.0 out of 5 stars","reviewTitle":"Customer Support is amongst the best anywhere","reviewDate":"The manufacturer commented on the review below","reviewText":"Love this, had it sitting in its box over a year and just opened it. Blown away. The company has tech support/Customer support which is the best I have ever come across. I even got replies the day before Easter on a weekend. Buying soon their higher end product All I can say is WOW !! Way to go Grace Digital !!"},{"reviewerName":"Old Judge","rating":"5.0 out of 5 stars","reviewTitle":"... the previous version of this radio and it was fine. The new Mondo+ is a moderate upgrade that ...","reviewDate":"July 17, 2017","reviewText":"The Grace Mondo was the previous version of this radio and it was fine. The new Mondo+ is a moderate upgrade that adds a few useful features and updates the firmware substantially.\n\nBasically the Mondo is a high quality, well designed radio that is very easy to use. It's controls are sensible and intuitive. It's remote works well. In short, it is well made, simple, elegant and reliable."},{"reviewerName":"Robert","rating":"5.0 out of 5 stars","reviewTitle":"Thanks to the good people at Grace Digital","reviewDate":"July 18, 2017","reviewText":"Thanks to the good people at Grace Digital, I received a gray Mondo Plus today. The exterior, as far as I can tell, is identical to the past Mondo. In the box were the familiar Grace remote and an RCA-to-3.5mm jack “Y” cable. I may order the optional battery later if I decide to use this Mondo as a clock radio, as a precaution against oversleeping due to power outages.\n\nI plugged the Mondo Plus into the wall and pressed the “power” button. It sprang to life and asked whether I wanted a wired or a wireless connection and I selected “wireless.” Then it asked whether I wanted to scan for a network or to enter it manually and I did a scan. It found my network and asked for my password. On the first attempt it said “network not found” but it worked on the second try.\n\nThe scrolling on the Mondo Plus is a bit odd. After selecting a number or letter, it resets to “A” each time rather than remaining on the selected letter. This might make entering a long password annoying but I was fine with it. Another criticism is that it is hard to see the black scroll bar against the dark blue background screen, but I managed that. Once my Mondo Plus accessed the network it wanted to update its firmware. The update took about 5 minutes. The firmware version the radio loaded is 142.36. The radio then came to life.\n\nThe main screen gives the following menu: internet radio, music services, media player, radio settings, aux in and equalization. Under internet radio the menu choices are: search for local stations, history, my stuff (my streams, my podcasts and my stations), search for station by name, search for station by genre and search for station by location. The music services available are Sirius XM, iHeartRadio, NPR and Public Radio, BBC, CBS and Podcasts by Audiosear.ch.\n\nI decided to test the ability to add a station, Jazz24, to my streams using the portal to the radio which is at myradiosplus.gracedigital.com. One just goes to “my streams” clicks on “add new” then pastes the streaming url in a box. The site also asks for the url for station art, which I didn’t know. The stations played on the radio from “my streams” without any problems.\n\nI then decided to cast to the radio from my phone using Chromecast built-in. I went to the Google Home app and the Mondo Plus showed up as a Chromecast device. From my Pocketcasts app I clicked on the Chromecast icon and the Mondo Plus appeared in the “cast to” list. It was then simple to cast the podcast from the Pocketcast app to the radio.\n\nI also used the “media player” function. The radio asked for “UPnP” or “USB.” I selected UPnP\nand it found the music stored on my NAS without any delay or fuss.\n\nA couple of minor drawbacks: the Android Grace Controller App available through Google Play Store needs further work. It cannot fully search a list of internet radio stations for each country; it only searches the country that appears first in the alphabet for each continent. That needs to be fixed. Also, I tried adding a podcast to “my podcasts” but it wouldn’t play on the radio. I understand that Grace is fixing this in an upcoming firmware update.\n\nSo far, I can say I’m very impressed with Mondo Plus."},{"reviewerName":"debbie ward","rating":"5.0 out of 5 stars","reviewTitle":"Great customer care!","reviewDate":"June 9, 2018","reviewText":"I bought the Eco boost speaker last summer for our bay house. It is awesome and we used it a lot for the beach and just outside at the house. After the winter months of not using it very much it no longer would play unless it was plugged into an outlet. I decided to take a chance and reach out to the company who makes it and ask what we could do to make it run on the battery again. Within a few hours of my email they got back to me with suggestions on things to do to reboot the battery and went on to say if that didn’t work they would be happy to replace the battery. It didn’t work so I have a new battery on it’s way now!!! It was such a delight to work with a company who actually cared about their customers!! 😍"},{"reviewerName":"Mark","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"November 28, 2017","reviewText":"I don't know why everyone doesn't have an internet radio. I am on my second Mondo and loving it."},{"reviewerName":"Boatguy","rating":"2.0 out of 5 stars","reviewTitle":"Grace Digital Internet Radio","reviewDate":"November 14, 2018","reviewText":"This radio has good sound and volume...when it decides to play something. Long delays in startup, sometimes it won't start a station for 45 minutes. Buffering is terrible sometimes. Station selection is not very good. I tried to get local LA stations and they are not available. I'd rather use a Google Home or Amazon Alexa product than this radio."},{"reviewerName":"Katharina E. Patience","rating":"1.0 out of 5 stars","reviewTitle":"Cheap and shoddy -- buyer beware!","reviewDate":"September 20, 2018","reviewText":"I bought this radio in December 2017. It up and quit on me nine months later, September 2018. Seems to me this piece of electronics should have lasted a bit longer, especially as my radio sat in the living room and was never moved, shaken, taken outdoors, or exposed to damp. Customer service did (finally) send me a new one that seemed to operate more efficiently, and now in November, the replacement has quit as well. I will simply mail back the item and swallow the loss. But -- buyers -- beware! Put your $150 elsewhere and avoid Grace Digital products."},{"reviewerName":"Yousri Okasha","rating":"5.0 out of 5 stars","reviewTitle":"New Amazing Radio from Grace Digital","reviewDate":"July 11, 2017","reviewText":"very good sound quality. The Mondo+ utilizes Google Chromecast which is a plus for many additional features. As an owner of a previous Mondo, this device is one of the top radios i have ever seen and used so far, but some apps and features missing from the plus that Grace Digital are currently working on them, with a software update.\nLove to see an update to have the streaming possibility from YouTube live audio streaming as well."},{"reviewerName":"Esophoria","rating":"5.0 out of 5 stars","reviewTitle":"Better connectivity with 80211ac","reviewDate":"June 29, 2017","reviewText":"Grace Digital Mondo+ Wireless Smart Speaker and Internet Radio with Wi-Fi + Bluetooth and 3.5\" Color Display\n\nThis new radio is a improvement than the previous model in so many ways: Better connectivity with 80211ac, much richer fidelity, along with a bevy of stations to connect to. Sirius Radio is also supported along with other music and podcast services. Bluetooth works well."},{"reviewerName":"Bob Smith","rating":"1.0 out of 5 stars","reviewTitle":"NOT really a \"Smart Speaker\" and has no APPS !","reviewDate":"November 25, 2018","reviewText":"What's going on here is that big brother Google doesn't want you doing ANYTHING they don't know about. So to use Pandora, Tunein, Spotify, or Slacker- all the apps that get you the customized music or talk SHOWS you want, you have to go through an Android device. Tunein will NOT let WiFi radio manufacturers offer the app built in (a Grace rep Told me). Why not ? You tell me"},{"reviewerName":"Amazon Customer","rating":"1.0 out of 5 stars","reviewTitle":"Stopped working","reviewDate":"May 28, 2019","reviewText":"Kinda had the weird hour glass thing in the top corner that usually went away after a few minutes it did not go away after 30 minutes and now the POS thinks I am outside the US and after multiple factory resets it does nothing."},{"reviewerName":"Michael Nolan","rating":"5.0 out of 5 stars","reviewTitle":"I love it! It worked exactly as advertised","reviewDate":"November 7, 2017","reviewText":"I love it! It worked exactly as advertised. One suggestions, though, is that I would buy the battery."},{"reviewerName":"R. Atkinson","rating":"4.0 out of 5 stars","reviewTitle":"great radio but was born out dated","reviewDate":"June 30, 2018","reviewText":"i have the logitech UE internet radio and the mondo and mondo+ all these radio's are very similar to each other and may feel a little dated because none are touch screen and feels much like old technology .... but i still love them .... the truth is you can use your smartphone and a bluetooth speaker and get the same or better results"},{"reviewerName":"Laura Geist","rating":"5.0 out of 5 stars","reviewTitle":"What a GREAT sound out of this system","reviewDate":"December 11, 2017","reviewText":"What a GREAT sound out of this system. When I called I actually got a live person to answer questions I had. Their customer support staff also reach out to me a few days later to ensure there were no more questions. I am very pleased with this US based and local company."},{"reviewerName":"Eileen Kelley","rating":"5.0 out of 5 stars","reviewTitle":"I just received my new Mondo and I love it! Beautiful design","reviewDate":"December 5, 2017","reviewText":"I just received my new Mondo and I love it! Beautiful design, great sound and smart snappy color. What a treat to listen to this as I prepare dinner or while having a family dinner or dinner party. It all exceeded my my expectations! Best of all, it is so easy to use! I wasn't sure how much I would use it but now I realize it's the first thing I turn on at the end of a busy day."},{"reviewerName":"J.J. Anderson","rating":"4.0 out of 5 stars","reviewTitle":"Almost perfect...almost.","reviewDate":"November 30, 2017","reviewText":"This radio is great. It's feature-rich and offers great sound. The one thing that prevents me from calling this radio \"perfect\" and giving it 5 stars is that it does not seem to support a crescendo alarm. When the alarm goes off (radio/buzzer), the volume comes on full blast at whatever level you preset. My previous Grace Digital radio had fewer features but it allowed you to set the alarm to crescendo so you that if you mistakenly set the alarm volume too loudly, it would induce a heart attack when it goes off each morning."},{"reviewerName":"DnD","rating":"5.0 out of 5 stars","reviewTitle":"Fantastic sound","reviewDate":"June 20, 2019","reviewText":"It works with current SiriusXM account. No additional fees. Beautiful clear sound. Portable. Made the perfect gift for my dad. He loves it."},{"reviewerName":"Thomas Meringolo","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"October 3, 2017","reviewText":"Reception problem solved by Grace Techs very fast!"},{"reviewerName":"Howard Mclaren","rating":"3.0 out of 5 stars","reviewTitle":"Volume Control Problems","reviewDate":"November 16, 2018","reviewText":"After two years the volume control packed up and I can only change volume by the remote. I also have the previous model and the volume control stopped working on that too."},{"reviewerName":"Edward Drago","rating":"5.0 out of 5 stars","reviewTitle":"The Best Clock Radio I've ever owned","reviewDate":"May 9, 2018","reviewText":"The Best Clock Radio I've ever owned, They thought of Virtually every feature I could ask for and then some. I highly recommend this product and feel its extremely high quality. Customer service is excellent as that it very important to me as well."},{"reviewerName":"M. Malone","rating":"3.0 out of 5 stars","reviewTitle":"Mimics the Squeezebox Radio . . . almost.","reviewDate":"The manufacturer commented on the review below","reviewText":"Looks like a rough knockoff of the wonderful (and now discontinued) Squeezebox Radio, but with limited ability to stream local library content, and no indication of relative audio quality to the great SB machine. And it's not cheap.\n\nAdd more than Chromecast support and it might be a worthy successor. With a Chromecast plug in, this Grace player may be able to tie into Logitech Media Server (the heart of the Squeezebox ecosystem). But client control may be quite limited compared to a native player on that platform.\n\nSo for now, we will stick with our trusty stable of SB Radios, as we have nearly 75,000 local tracks."},{"reviewerName":"Darren Pinto","rating":"5.0 out of 5 stars","reviewTitle":"The best internet radio has seen.","reviewDate":"September 29, 2017","reviewText":"Brilliant display, loads of clean sound that full even a large room, very slick user interface and plenty of stations that work. This version even adds Bluetooth and chromecast making it even better. And this is backed by a really quick service team incase of any issues"},{"reviewerName":"Paul J. Mallon","rating":"1.0 out of 5 stars","reviewTitle":"Not reliable; lack of customer service by manufacturer","reviewDate":"July 12, 2018","reviewText":"I bought two of these internet radios. The second one died the other day after a power fluctuation. I wrote customer support and got a delayed response that basically said to just unplug it and plug it back in and it will work....nope. This was not a power surge. All other applicances, computers, clocks, and the other Mondo ratio were fine after the 'flicker'. Due to the lack of customer service and reliability, I have to give the unit a 1 star rating. I will just get a smarphone dock and stream audio/radio direct vs getting another dedicated Internet radio."},{"reviewerName":"Richard E. Griffiths","rating":"1.0 out of 5 stars","reviewTitle":"Non-portable without extra $$ battery, which dies permanently after a few hours use","reviewDate":"January 24, 2019","reviewText":"Good quality sound, very versatile on station selection.\nWhy make such a small, compact radio if it is not portable ? A battery can be purchased separately,\nfrom a different supplier, but the battery is a complete waste of money and dies permanently\nafter a total use of a few sessions of a few hours each"},{"reviewerName":"Diana D.","rating":"5.0 out of 5 stars","reviewTitle":"With patience, it's a big hit","reviewDate":"December 26, 2018","reviewText":"Takes a while to get it set up because the method of entering passwords for your subscriptions is clunky. Once you're good to go, though, it's wonderful!"},{"reviewerName":"drksd4848","rating":"2.0 out of 5 stars","reviewTitle":"If you already have a Mondo, don't bother to upgrade. Not worth it. DO NOT buy it if you're looking for a reliable alarm clock","reviewDate":"July 14, 2017","reviewText":"I had high hopes for the Mondo+.\n\nI owned the original Grace Mondo. I bought it as a replacement for my Squeezebox. While it was decent enough, it is still a poor number two to the Logitech. The Mondo lacked the all the apps available on the Squeezebox, as well as much of the versatility and functionality. I hoped that that Grace would fix all that with the Mondo+, but if you'll read the answered questions, Grace says \"Nope\". All the Mondo+ really is, is an original Mondo with a Chromecast dongle and a bluetooth receiver; no new apps, no new functionality, no new nothin'.\n\nFor one (and this is a BIG one for me) although it is advertised as a functional clock radio, it really isn't. If you are someone who likes to fall asleep with the headphones plugged in, it will negate the alarm. The Mondo plays the alarm though the headphones - you will sleep right though your wake up time! On the other hand, the SB had a nice feature where if you fall asleep with headphones plugged in (like a lot of people do), the alarm would bypass the headphones and play through the speaker, ensuring that you WILL wake up on time with the Squeezebox.\n\nBut not with the Mondo OR the Mondo+. With those two, you'll be late to work.\n\nIf you already have a Mondo, it ain't worth upgrading to the Mondo+. If you are hell bent on getting a smart radio, do this and save yourself some money:\n\n- Buy a used original Mondo\n- buy one of these: http://a.co/aRA47Rs\n\nBoom... You have a Mondo+ for far less. Or buy a used Squeezebox. Either way, I'd skip over the Mondo+ It's just not worth it. The lack of apps, lack of functionality, lack of versatility, AND the alarm issue is a big sticking point.\n\nAlso, Grace Digital customer support is very poor as well."},{"reviewerName":"VJP","rating":"1.0 out of 5 stars","reviewTitle":"It does not last long.","reviewDate":"September 7, 2019","reviewText":"It is a great radio, but it does not last long. This is the second radio, and Grace is no help."},{"reviewerName":"John E","rating":"5.0 out of 5 stars","reviewTitle":"This is a great radio. The sound is fantastic","reviewDate":"November 30, 2017","reviewText":"This is a great radio. The sound is fantastic. I listen to it every day and I love it. It's my favorite radio ever.You won't go wrong if you purchase it."},{"reviewerName":"Daniel zembrodt","rating":"1.0 out of 5 stars","reviewTitle":"Doesn't work","reviewDate":"The manufacturer commented on the review below","reviewText":"Got this for Christmas, wasn't shipped in a box, just the package, won't stream pandora, and the speaker doesn't work, can't get it to make any sound"},{"reviewerName":"Lester Cox","rating":"3.0 out of 5 stars","reviewTitle":"Great radio, worthless battery!","reviewDate":"July 8, 2017","reviewText":"Love the radio, can't say the same for their customer service. My new radio came with a battery that holds a charge for less than 12 hours while turned off. Have written grace digital and so far have not had the courtesy of a return call or message. All but eliminates the portability of the radio. I may return and initiate a charge back with my cc company."},{"reviewerName":"KB","rating":"5.0 out of 5 stars","reviewTitle":"The Best!","reviewDate":"February 27, 2018","reviewText":"The Best!"},{"reviewerName":"moises rivera","rating":"3.0 out of 5 stars","reviewTitle":"What I liked the most is the easy manner in which the ...","reviewDate":"February 1, 2018","reviewText":"What I liked the most is the easy manner in which the internet radio stations are found and the quality of the sound. What I liked the least is the handlle in the back to carry it around .It is ackward and hard to keep it in balance if you want to take it from one place to another."},{"reviewerName":"Robert L. Haff","rating":"5.0 out of 5 stars","reviewTitle":"Chromecast is great.","reviewDate":"December 7, 2017","reviewText":"It makes a lot of claims, and it does them well. Make sure to have a good WIFI signal."},{"reviewerName":"Jabberwocky","rating":"1.0 out of 5 stars","reviewTitle":"Useless, digital irritation machine that will send you back to regular radio","reviewDate":"August 3, 2017","reviewText":"This drops out and constantly looses stream. Our wifi router is 10-15 ft away--we don;t have problems with any other wifi equipment. We use this mostly in the kitchen. when we use the microwave, the radio losses it's connection. It frequently just stops playing at random and cannot reconnect successfully without disconnecting the battery (turning the unit off does not work--you have to unscrew the battery cover, disconnect / reconnect the battery pack in order to reset the OS. This works for a day or two until it looses the signal again. Can;t believe I spent this much money for this junk.\nBuy a Tivoli PAL, they are higher quality, reliable and sound great and are actually less expensive"},{"reviewerName":"E. Phillips","rating":"1.0 out of 5 stars","reviewTitle":"No Pandora app and casting is broken.","reviewDate":"The manufacturer commented on the review below","reviewText":"I'm taking the effort to update this post and drop it to 1 star. Casting still doesn't work (it's been 3 months). Bluetooth drops out regularly and only 1 device can be paired. Just not a good product. Time to look for something else and relegate this to an little used location.\n\nDoesn't have a Pandora app anymore. You must cast it from another device. But casting isn't working (they are aware of the issue and have told Google). So all this can do is play internet radio stations. The old version of this was great because it was a standalone internet radio and Pandora player. Everything you need for the kitchen and not tied to your phone. Disappointed. Wish I had looked at Sonos or Bose now."},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"November 29, 2017","reviewText":"Great quality and value. Best internet Radio I have owned. Great features and outstanding service."},{"reviewerName":"Teresa","rating":"5.0 out of 5 stars","reviewTitle":"It works with SiriusXM well","reviewDate":"July 31, 2019","reviewText":"It has a keyboard that makes it easy to put in your username and password."},{"reviewerName":"Susan Garman","rating":"2.0 out of 5 stars","reviewTitle":"Buyer beware. Support SUCKS!","reviewDate":"The manufacturer commented on the review below","reviewText":"We own 2 Grace Mondo ( not + ) radios. We are very unhappy with their customer support. Their reply to our issues were basically, we don’t support the 2x$170 radios you bought a few years ago. So too bad. This company will not be able to survive when I can more easily use an Anker speaker ($30 rave reviews) & just stream music from my iPhone. Too bad their support sucks."},{"reviewerName":"BookLover","rating":"2.0 out of 5 stars","reviewTitle":"Huge disappointment -- problems with the remote and with finding/adding stations","reviewDate":"August 13, 2017","reviewText":"We own two other Grace digital radios (the original and a Mondo), use them all the time and love them so much that we wanted a third one. The Mondo Plus is disappointing for a number of reasons. Here are the main ones. Firstly, to increase or decrease volume with the remote, you have to press a button hard/firmly multiple times to make small incremental increases or decreases in volume. As a result, this sometimes means 5 or more sequential firm presses to adjust the volume (The remote with earlier models only needs one press of a button that you hold for as long/much as you want the volume to increase or decrease). This is annoying to say the least, and because of this, the Mondo Plus remote is a problem for people with painful hand/finger conditions such as arthritis, rheumatoid arthritis, repetitive strain injury, etc. Secondly, the on/off button on the radio is problematic because you have to firmly press and hold it, but if you hold it too long, the radio reboots! Thirdly, I can't find most of the stations we like, despite searching on the radio as well as on the web."},{"reviewerName":"Benjamin","rating":"3.0 out of 5 stars","reviewTitle":"Disappointed! The Mondo+ I received from Amazon will not ...","reviewDate":"June 24, 2018","reviewText":"Disappointed! The Mondo+ I received from Amazon will not play any of my favorite local radio stations, though they are listed among many of other local stations that the Mono+ will play. I bought it because the AM reception in my area has declined and my old radios are no longer audible, mostly loud static. After reading the description and reviews online, the internet radio seem like a good alternative. Not so.This is not an easy radio to use as are the over the air type. I would not recommend buying one unless you like spending lot of time messing around with stuff. If the interface functions become easier to use, the it is a good buy."},{"reviewerName":"MD, Cal","rating":"1.0 out of 5 stars","reviewTitle":"Disposable wifi-radio.","reviewDate":"September 22, 2017","reviewText":"Failed 13 months after light use, which was just after the warranty expired. Disposable wifi-radio. Expect to re-buy one every year."},{"reviewerName":"Fiddler","rating":"2.0 out of 5 stars","reviewTitle":"Not great - use an amazon fire to listen to iheart stations","reviewDate":"February 17, 2018","reviewText":"They do not have lots of stations - I heart radio - nope - they aso do not respond to my customer emails"},{"reviewerName":"George","rating":"1.0 out of 5 stars","reviewTitle":"Stay away from GRACE products.","reviewDate":"The manufacturer commented on the review below","reviewText":"As other have reported... I purchased a Grace radio about 2 years ago and it suddenly stopped working. They offered a $35 repair (I pay for shipping there) and viola 3 weeks later I get a \"repaired\" radio in the mail.... with the SAME issue as when it left.\n\nStay as far away from GRACE \"radio\" as you can."},{"reviewerName":"Daoist58","rating":"2.0 out of 5 stars","reviewTitle":"Fine while it lasted","reviewDate":"October 15, 2017","reviewText":"Had an older version of this, for about 2 years. It stopped recognizing my network one day, even sitting it right next to the router. Even after doing a factory reset. I noticed the side of the unit was very hot. Now it is trash. I’m not sure if people don’t care if their electronics last longer than 2 years anymore, but I do."},{"reviewerName":"Ira G. Megdal","rating":"2.0 out of 5 stars","reviewTitle":"Grace suddenly is not compatible with NPR podcasts.","reviewDate":"August 28, 2017","reviewText":"I purchased this device primarily to listen to NPR podcasts. Initially it was fine. However, for reasons not clear to me, it became incompatible with NPR podcasts. It simply can't receive them. Customer service at Grace was of no help to me, other than to tell me that this was a Grace issue, not an issue with my radio.\nIn other respects it works fine, although sound quality is only adequate compared to another wi-if radio that I own."},{"reviewerName":"Felix Vandyk","rating":"1.0 out of 5 stars","reviewTitle":"Terrible. I got mine two years ago and had ...","reviewDate":"The manufacturer commented on the review below","reviewText":"These Grace internet radios are so shoddily built. Terrible. I got mine two years ago and had nothing but problems with it. After the first week the speaker stopped working. The aux output stopped working and I went into settings and did a factory reset. Now the damn thing won't even power up. You are better off not buying their products."},{"reviewerName":"Bulltwinkle","rating":"2.0 out of 5 stars","reviewTitle":"Two Stars","reviewDate":"June 26, 2017","reviewText":"If it is anything like Grace Digital's other products, it sucks."},{"reviewerName":"William l.","rating":"5.0 out of 5 stars","reviewTitle":"Thousands of great radio stations just waiting for you !","reviewDate":"January 23, 2019","reviewText":"It's the best internet radio on the market for price and quality! Large 3.5 screen,I heart,calm radio,live 365, shoutcast,BBC, radio . com, Chromecast and more great features. Excellent sound from the 2 speakers. Nice remote control and many other great features. Buy one and you tell me it's not a great internet radio. Nice customer service also if you have any questions!!"},{"reviewerName":"joanna","rating":"5.0 out of 5 stars","reviewTitle":"☺","reviewDate":"March 25, 2019","reviewText":"👍"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Even better than previous models","reviewDate":"January 21, 2019","reviewText":"Unless it explodes after purchase, this radio is great. Does everything a digital radio is supposed to do, more conveniently than just using a phone app or your laptop. The sound is obviously much better too.\n\nOne new feature is that you have to save favorites to the website rather than to the radio itself. BUT: if you want a station that doesn’t show up in searches and seems like it’s unavailable, you can edit URLs on the website. Just copy the steaming feed’s address from the HTML on the webpage for the station you want, and paste it in."},{"reviewerName":"JayE","rating":"1.0 out of 5 stars","reviewTitle":"Very Disappointed - unit kept freezing","reviewDate":"The manufacturer commented on the review below","reviewText":"The unit kept freezing even after I did a firmware upgrade with customer support. Ultimately their best answer for me was to reset the unit after it freezes. Not something I want to continue to do"}]}