{"title":"Certified Refurbished Echo Plus (2nd Gen) - Premium sound with built-in smart home hub - Sandstone","manufacturer":"Amazon","currentPrice":"$109.99","rating":"4.4 out of 5 stars","totalRatings":"112 ratings","features":["A Certified Refurbished Echo Plus is refurbished, tested, and certified to look and work like new.","Echo Plus has a built-in Zigbee hub to easily setup and control your compatible smart home devices, and an improved sound for streaming music.","New premium speakers powered by Dolby play 360° audio with crisp vocals and dynamic bass response. You can also use your voice to adjust equalizer settings or pair with a second Echo Plus (2nd gen) for stereo sound.","Ask Alexa to play music, answer questions, read the news, check the weather, set alarms, control compatible smart home devices, call almost anyone, and more.","Set up your smart home without a separate hub. Ask Alexa to control compatible smart lights, switches, sensors, door locks, and more. Echo Plus also includes a built-in temperature sensor.","Ask Alexa for a song, artist, or genre from Amazon Music, Apple Music, Spotify, Pandora, SiriusXM, and more. With multi-room music, play music on compatible Echo devices in different rooms.","Call or message almost anyone hands-free. Instantly drop in on other rooms in your home or make an announcement to every room with a compatible Echo device.","With seven microphones, beamforming technology, and noise cancellation, Echo Plus hears you from any direction—even while music is playing."],"reviewsAspects":["sound quality","works great","echo plus","plus gen","refurbished echo","certified refurbished","really good","echo dot","great sound","group","smart","speaker","device","app","audio","assistant","base","bulb","hub","save"],"productInformation":[],"productDescription":[],"reviews":[{"reviewerName":"Nate-G","rating":"1.0 out of 5 stars","reviewTitle":"The entire Echo system has changed for the worst...","reviewDate":"September 19, 2019","reviewText":"I changed my review from 5 stars to 1 star because of a software update that now forces me to specify which light, power strip, and/or other devices I want to turn on/off. All of my rooms, lights, power strips, etc... are in various groups for a reason. Each light, outlet, and other devices have a unique name (IE: The upstairs hallway lights are named UH-Light, UH-Light2, and UH-Light 3, my smart power strip has unique ports like TV, Monitors, etc..).\n\nYESTERDAY (9/18/2019) I was able to walk into a room and say \"Alexa, turn the light on\" (in my home office for example) and it turns the light on, Today (9/19/2019) I'm sitting in my home office and I say \"Alexa turn the light off\" and I get the response \"There are multiple devices that share that name, which one do you want\".\n\nThe master bedroom - Setup with only lights (MBR-light, or something like that so I can identify it later when adding other stuff), the wife used to say \"Alexa, turn the light off\" because that's what she has always said before going to sleep. Today she can't do that because of Amazon's development team.\n\nSo I say \"Alexa turn the office light off\" and it turns the ENTIRE OFFICE GROUP OFF. So now I have to go to the app to turn the light off.\n\nI reached out to Amazon customer support who tells me I have to be specific when asking the echo to turn the light off as in \"Alexa, turn the office light off/on\" and that it has always been this way. When I tried to tell them that yesterday I was able to say \"Turn the light off\" they said it wasn't possible and I have always had to be specific.\n\nI set up groups for a reason, that being I can go into a room, say \"Alexa, turn the light on\" without having to remember each light bulb name or what I named the room/group. Yes, I know what the group names are, I don't expect everyone in my house to remember the group names.\n\nThere was a software/firmware update overnight that broke all of my Echo's and Amazon's customer support will not acknowledge it.\n\nI will not recommend this device to anyone else until they put it back to the way it was.\n\nUpdate 9/20/2019 - Amazon Customer support says I have to be specific when telling it which light to turn on, but the Help section of the Alexa APP says:\n\n\"You can also add your Alexa-Enabled device to a smart home group and control without having to remember the group name. For example, to control the lights in the \"Living room,\" you can say:\n\n* \"Alexa, Turn on the lights\"\n* \"Alexa, set the lights to blue\"\n* \"Alexa, dim the lights\"\n\nUpdate 10/23/2019 - Amazon still hasn't fixed the problem, I still cannot say \"Alexa, turn the light off\" like I was able to do since I set up my first echo. It's probably been 2 years now (maybe only one, I don't remember exactly). I still haven't heard from Amazon tech support, I haven't heard from Customer support, come to think of it, I only hear from Amazon when they don't deliver on time and I have to call them about something else. They were advertising it as a selling point on their echo devices. As long as you have an \"echo\" device in the room you are in and it's in a group with the same echo, you should be able to say turn the light off...\n\nAfter watching some videos, I am more tempted to scrap all of my Echos and move to Google Home assistant because Amazon just isn't keeping up with the other stuff Google is doing.\n\nJust like Apple, Amazon is more worried about putting out new products rather than fix their current products.\n\nYOU'RE FAILING AMAZON! YOU'RE FAILING."},{"reviewerName":"Don F.","rating":"1.0 out of 5 stars","reviewTitle":"How to get the bulb?","reviewDate":"March 5, 2019","reviewText":"I didn’t get the bulb with the speaker, what do I need to do to get the bulb?"},{"reviewerName":"That Guy","rating":"5.0 out of 5 stars","reviewTitle":"Refurbished","reviewDate":"March 17, 2019","reviewText":"This was like new, the quality of the refurbished echo is really good and the packaging was well done. The product is like new and I have had no issues with it. Glad I was able to save a few bucks and still get a quality product. Thanks!"},{"reviewerName":"G. Family","rating":"5.0 out of 5 stars","reviewTitle":"Great sound quality and has been a fun addition to the family home.","reviewDate":"September 21, 2019","reviewText":"I have been itching to get an Echo for quite a while. I was a little hesitate due to the worries of Skynet taking over some day in the future. At this point if it is going to happen it will have. So figured it was a great time to get into the good gracious of Amazon and Alexa.\n\nI have a family of 6. We spend alot of dad's off days in the kitchen. So when shopping around I wanted an Alexa with Premium Sound quality as we all love music. My biggest question about this product was will the sound quality meet my expectation. I was worried due to some reviews.\n\nTesting the sound quality I was more than impressed. The Echo/Amazon app allows you to adjust bass and some other sound options. Sound volume can fill a room quit easily.\n\nThere is still a lot I am learning about how much I can utilize Alexa. But she is used enough to where she is definitely an assistant to the family. She is like that robot from the Jetsons lol. Family music trivia, setting alarms and reminders, music and news, and wife loves the weather noises to help sleep \"Alexa, turn on Thunder Storm sounds.\"\n\nThere is a learning curve. And a few months later I am still learning as I want to fully utilize the technology. So far I have added two Echo Dots. It is quite fun to her Echo avaiable when hands are full. For example, if I am home alone and getting dressed for work, why not say \"Alexa, shuffle Tupac.\""},{"reviewerName":"K. Kurtz","rating":"2.0 out of 5 stars","reviewTitle":"Audio Good While It Worked","reviewDate":"April 1, 2019","reviewText":"Too many glitches and bumped my other devices offline. Do not order unless you have wifi the speed of sound. I stream on my Fire TV, love my Echo 1st Gen and my Echo Dot 2nd Gen. The group fell out of love very quickly, so we're forgetting using the Echo Plus- it's not worth the running all over the house reconnecting everything and doing resets:-("},{"reviewerName":"G. Fox","rating":"5.0 out of 5 stars","reviewTitle":"Love my Echo's","reviewDate":"April 25, 2019","reviewText":"While I love my Echos I think they are a little overpriced. I got a refurbished product and works great. I thill think it needs some more work, on software and apps used with it."},{"reviewerName":"Becci","rating":"5.0 out of 5 stars","reviewTitle":"I love it","reviewDate":"March 10, 2019","reviewText":"I just bought this and had it set up for 3 days and I love it! I've never bought anything refurbished before but this sounds great! I wonder about the price because I see a $69 one too did i get the wrong one?"},{"reviewerName":"Adrian","rating":"1.0 out of 5 stars","reviewTitle":"Crackled distorted speaker","reviewDate":"April 21, 2019","reviewText":"As soon as I turned it on the speaker was distorted and crackles. I started the return process within an hour of receiving it and immediately bought a brand new one that was not refurbished. Don't try to save a few bucks, 20$ is not worth it."},{"reviewerName":"TT Tum","rating":"5.0 out of 5 stars","reviewTitle":"Refurbished is the way to go!","reviewDate":"March 8, 2019","reviewText":"Can’t tell that it was refurbished. Works excellent. I will be adding more echos soon."},{"reviewerName":"Danny Castillo","rating":"5.0 out of 5 stars","reviewTitle":"Great personal assistant","reviewDate":"May 18, 2019","reviewText":"Pros: great sound quality, modern look, great voice rec.\n\nCons: commands are a little tricky, sometimes alarm/timer won’t shut off until i unplug it, slight delay in bluetooth audio"},{"reviewerName":"Ms. Shawn","rating":"5.0 out of 5 stars","reviewTitle":"Loving This Echo","reviewDate":"November 14, 2019","reviewText":"Oh I just love it so. The sound is rich and crisp. My little echo wasn't cutting it in terms of sound volume. I was tired of connecting speakers to my old device; and, decided to give this one a try after reading reviews. Boy am I glad I followed my instinct in trusting my fellow Amazonians. This speaker is GREAT. The volume generously covers the entire first floor of my home; and, can also be heard upstairs. Setup was painless using the Alexa app; and I'm now back to enjoying the full benefits of my Music Unlimited subscription. I bought a refurbished unit and it looks and performs like brand new. I almost ended up paying significantly more on a Bose and so glad I decided on this Echo Plus."},{"reviewerName":"K.I.S.S","rating":"2.0 out of 5 stars","reviewTitle":"Where's the bundle deal?","reviewDate":"July 31, 2019","reviewText":"The sound is really good. It has base and loudness, two things I was looking for. Very similar to my Bose system. That being said, I wish it was freaking wireless! I'm assuming that will happen in the future. So, for now I am enjoying it in my kitchen and I suppose if I want to hear it in my backyard, I'll place it by the open window. Set up was a little jenky but I got it to work sooooo!\n\nP. S. Best Buy has/had new Echo2 w/ smart bulb and plug for $109. 99."},{"reviewerName":"mbmbbost","rating":"2.0 out of 5 stars","reviewTitle":"Not reliable","reviewDate":"November 8, 2019","reviewText":"After setting everything up, and using the Echo plus smart hub feature, I suddenly lost control of my devices. After much time wasted, I reconnected the devices (they still showed up in the Alexa app, even though that couldn't control them either), and they work again. But wasting all that time, and not being able to count on Amazon to make these things work consistently, is really annoying. My Google device in another house seem more reliable and user-friendly."},{"reviewerName":"Clifford Peterson","rating":"3.0 out of 5 stars","reviewTitle":"Certified Refurbished Echo Plus (2nd Gen)","reviewDate":"October 5, 2019","reviewText":"Seems to work well But not enough installation information for a beginner like me. What I thought might take a few days is turning into a few weeks. Amazon doesn't make it easy to get to the Echo Support Group. They apparently think everyone is smart enough to set things up like you had been doing it all of your life."},{"reviewerName":"Thomas C. Bowlby","rating":"5.0 out of 5 stars","reviewTitle":"Not bad.. but she is constantly listening","reviewDate":"June 27, 2019","reviewText":"She works, she sounds good and she doesnt talk back"},{"reviewerName":"Warren","rating":"5.0 out of 5 stars","reviewTitle":"Great combination of Alexa Echo and Zigbee controller","reviewDate":"November 8, 2019","reviewText":"When purchased refurbished at $99, they make an awesome value, combining Alexa functionality, audio player and Zigbee home automation hub. Will buy another."},{"reviewerName":"Anthony Spires","rating":"4.0 out of 5 stars","reviewTitle":"It’s good but the cord was a problem","reviewDate":"March 28, 2019","reviewText":"I love the speaker but when it came in it came with the wrong power cord so I had to call them to get that fixed but other than that it’s great."},{"reviewerName":"Archie","rating":"3.0 out of 5 stars","reviewTitle":"Could be better","reviewDate":"October 14, 2019","reviewText":"It has a problem where out of no where the audio becomes distorted and the only way to fix it is to restart the device. Since there is no \"Alexa, restart echo\" command, I have to unplug and replug the device back in."},{"reviewerName":"Makenzie Kelly","rating":"2.0 out of 5 stars","reviewTitle":"Really disappointed","reviewDate":"October 31, 2019","reviewText":"Doesn't stay connected to the internet while all of my other devices do. It will play music for maybe an hour at a time and cut out making this awful repetitive sound, I have to unplug it to make it stop. Sending back"},{"reviewerName":"Ed","rating":"5.0 out of 5 stars","reviewTitle":"Great product.","reviewDate":"May 22, 2019","reviewText":"I just plugged it in and it connected to my WiFi without me doing anything. Having an Echo Dot previously helped. Sound quality is better than the Dot. Not muffled at all."},{"reviewerName":"EyeBallChief","rating":"5.0 out of 5 stars","reviewTitle":"My wife and I love it. Deep sound without spending a lot","reviewDate":"March 27, 2019","reviewText":"Works as it should"},{"reviewerName":"Azeral1000","rating":"5.0 out of 5 stars","reviewTitle":"Love the echo's","reviewDate":"June 28, 2019","reviewText":"This is our 3rd one, we like these better than the dots. The dots are good but the audio is better with these than them, lol!"},{"reviewerName":"Gork5000&#34;","rating":"5.0 out of 5 stars","reviewTitle":"Good speaker!","reviewDate":"November 7, 2019","reviewText":"Sounds great. Good base and treble. I put it in a small room and it fills it with good sound."},{"reviewerName":"Chris","rating":"2.0 out of 5 stars","reviewTitle":"Waste of money","reviewDate":"July 19, 2019","reviewText":"Echo dot worked just fine for an 1/12 of the price, honestly was not any better then the little one"},{"reviewerName":"Erielack","rating":"5.0 out of 5 stars","reviewTitle":"Great product. Great price.","reviewDate":"October 27, 2019","reviewText":"Works perfectly. Has a beautiful rich sound. It fills the room."},{"reviewerName":"Daniel Perez","rating":"5.0 out of 5 stars","reviewTitle":"Great Buy","reviewDate":"October 29, 2019","reviewText":"Really happy with my purchase. Works great easy to set up. Sound quality is really good for a small speaker"},{"reviewerName":"katieblondie","rating":"1.0 out of 5 stars","reviewTitle":"Never Turned On","reviewDate":"August 9, 2019","reviewText":"I usually prefer to buy refurbished products and I never really have a problem with them. This one really missed the mark. Directions say to plug it in and wait for alexa to acknowledge you. It never turned on. I tried multiple wall outlets thinking it was something wrong with the particular outlet I chose. Very disappointed."},{"reviewerName":"Emalee Mckinney","rating":"5.0 out of 5 stars","reviewTitle":"Works just as great!","reviewDate":"May 31, 2019","reviewText":"I saved a little by getting the refurbished and it works just as great! No problems at all, I can play my same song all throughout the house now!"},{"reviewerName":"carmen","rating":"5.0 out of 5 stars","reviewTitle":"Mi hermano está encantado con Alexa 😂🤗🙏","reviewDate":"September 18, 2019","reviewText":"Era para un regalo a mi hermano. Está encantado y no deja a Alexa quieta jajaja..gracias"},{"reviewerName":"Kyra McDonough","rating":"5.0 out of 5 stars","reviewTitle":"Amazon speaker just very suspicious","reviewDate":"June 22, 2019","reviewText":"I ordered this a day before I got mine. And I’m absolutely in love with it. It’s got high quality sound and it’s fun to mess around with but the only thing I wish wasn’t true was that my voice is being recorded all the time when I activate Alexa, at least that’s what I hope ,she’s not invading my privacy."},{"reviewerName":"Darrel C Mendoza","rating":"5.0 out of 5 stars","reviewTitle":"What a value","reviewDate":"July 3, 2019","reviewText":"First timer. Love the sound when you play music !"},{"reviewerName":"Richard A Haskins","rating":"5.0 out of 5 stars","reviewTitle":"Good as a new one","reviewDate":"May 27, 2019","reviewText":"Works as good as the new unit I bought a while back."},{"reviewerName":"Kindle Customer...gramma","rating":"5.0 out of 5 stars","reviewTitle":"Great item!","reviewDate":"May 3, 2019","reviewText":"So happy with this Echo plus!"},{"reviewerName":"Kevinwj","rating":"5.0 out of 5 stars","reviewTitle":"Works perfect","reviewDate":"October 21, 2019","reviewText":"Works perfect"},{"reviewerName":"Alexa","rating":"5.0 out of 5 stars","reviewTitle":"Money well spent","reviewDate":"November 3, 2019","reviewText":"Money well spentArrived on time what can I say? I absolutely love it"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Echo plus","reviewDate":"October 12, 2019","reviewText":"Works great"},{"reviewerName":"Phil Shelp","rating":"5.0 out of 5 stars","reviewTitle":"Love this product!","reviewDate":"August 21, 2019","reviewText":"Everything was awesome. Great product, great service!"},{"reviewerName":"Thomas Rockwell","rating":"5.0 out of 5 stars","reviewTitle":"Great sound quality.","reviewDate":"October 12, 2019","reviewText":"Amazed at the sound quality in such a small package. Sound quality at low frequencies rivals that from 12-inch and larger speakers and the Echo is only 4\" in diameter and 7\" high!! Extremely pleased."},{"reviewerName":"valtohigh","rating":"5.0 out of 5 stars","reviewTitle":"it works as intended","reviewDate":"May 25, 2019","reviewText":"read headline"},{"reviewerName":"Kai","rating":"2.0 out of 5 stars","reviewTitle":"It's OK","reviewDate":"March 12, 2019","reviewText":"Not what I expected. Thought it can do more."},{"reviewerName":"Amazon Customer","rating":"4.0 out of 5 stars","reviewTitle":"Good sound, fun to use","reviewDate":"March 15, 2019","reviewText":"Nice to make lists, listen to music"},{"reviewerName":"Vincent M. Liberto","rating":"5.0 out of 5 stars","reviewTitle":"Great sound for a small speaker","reviewDate":"August 12, 2019","reviewText":"The new generation Echo has much better sound than its predecessor. It is richer and clearer and smaller besides."},{"reviewerName":"jennifer cason","rating":"5.0 out of 5 stars","reviewTitle":"Great addition to my studio.","reviewDate":"March 31, 2019","reviewText":"I love the hands free aspect. I can talk to Alexa and keep working. Makes my life much easier."},{"reviewerName":"Tomcat69blood","rating":"4.0 out of 5 stars","reviewTitle":"Good","reviewDate":"June 9, 2019","reviewText":"Good"},{"reviewerName":"Edmund H.","rating":"5.0 out of 5 stars","reviewTitle":"The best option","reviewDate":"May 4, 2019","reviewText":"The best option"},{"reviewerName":"MS","rating":"5.0 out of 5 stars","reviewTitle":"Great product","reviewDate":"June 6, 2019","reviewText":"love it works great, very easy to use."},{"reviewerName":"Craig P.","rating":"5.0 out of 5 stars","reviewTitle":"Sounds great","reviewDate":"March 14, 2019","reviewText":"Love it!"},{"reviewerName":"Jona Marquez","rating":"5.0 out of 5 stars","reviewTitle":"Product was like new","reviewDate":"March 30, 2019","reviewText":"Excellent"},{"reviewerName":"Jake7","rating":"5.0 out of 5 stars","reviewTitle":"Good response/clarity","reviewDate":"July 26, 2019","reviewText":"She responds well to requests - and she whispers good too! I wish there were more activation words that could be programmed into her..."},{"reviewerName":"Mitch Cassman","rating":"5.0 out of 5 stars","reviewTitle":"Certified Refurbished Echo Plus (2nd Gen) - Premium sound with built-in smart home hub - Sandstone","reviewDate":"July 31, 2019","reviewText":"Works great!"},{"reviewerName":"A Robinson","rating":"5.0 out of 5 stars","reviewTitle":"Buy it!","reviewDate":"May 5, 2019","reviewText":"I love it. Refubished is the way to go."},{"reviewerName":"Dan Gall","rating":"5.0 out of 5 stars","reviewTitle":"To early to tell","reviewDate":"November 1, 2019","reviewText":"To early to tell. Still customizing. Will come back to write a review."},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"It works","reviewDate":"March 30, 2019","reviewText":"Connected to my smart devices link nest, lights ext."},{"reviewerName":"Louis Liberante","rating":"1.0 out of 5 stars","reviewTitle":"Did not work period","reviewDate":"June 8, 2019","reviewText":"It would not connect to the wifi. Even with help from support. Nothing worked"},{"reviewerName":"Tomer Nuni","rating":"5.0 out of 5 stars","reviewTitle":"I’m in love with Alexa!","reviewDate":"May 8, 2019","reviewText":"Great product. Love it."},{"reviewerName":"BiancaBrown062","rating":"4.0 out of 5 stars","reviewTitle":"Overall its worth it","reviewDate":"September 5, 2019","reviewText":"I didn't like that it wasn't sent with the original packaging and I also didn't like that it didn't have more instructions but I do love the product itself and the sound quality is amazing"},{"reviewerName":"Kindle Customer","rating":"5.0 out of 5 stars","reviewTitle":"Sound with capital S","reviewDate":"July 2, 2019","reviewText":"Great for everyday"},{"reviewerName":"DBgolf","rating":"5.0 out of 5 stars","reviewTitle":"EZ of use","reviewDate":"August 23, 2019","reviewText":"What it does, in the kitchen"},{"reviewerName":"William B Shook","rating":"4.0 out of 5 stars","reviewTitle":"Certified Refurbished Echo Plus (2nd Gen)","reviewDate":"November 12, 2019","reviewText":"Echo works fine, deep base sound. Echo has performed as well as a non refurbished Echo Plus. Pleased with purchase."},{"reviewerName":"A Better You","rating":"5.0 out of 5 stars","reviewTitle":"So Cool!","reviewDate":"August 28, 2019","reviewText":"Excellent Product!"},{"reviewerName":"Shawn Garcia","rating":"5.0 out of 5 stars","reviewTitle":"Save some money","reviewDate":"May 20, 2019","reviewText":"Good deal and save some money. Brand new condition."},{"reviewerName":"Damien Jefferson","rating":"5.0 out of 5 stars","reviewTitle":"great sound","reviewDate":"March 20, 2019","reviewText":"great sound"},{"reviewerName":"Frank the man","rating":"4.0 out of 5 stars","reviewTitle":"Adding devices and making them work","reviewDate":"November 13, 2019","reviewText":"Use it for music use it for lighting I don’t quite understand how to use it with the fire stick can somebody help me with that"},{"reviewerName":"Chris T.","rating":"5.0 out of 5 stars","reviewTitle":"Great recognition!","reviewDate":"June 18, 2019","reviewText":"VR is awesome. With volume high voice is recognized from across the room without yelling at her!"},{"reviewerName":"Jim C","rating":"5.0 out of 5 stars","reviewTitle":"Echo Plus","reviewDate":"April 7, 2019","reviewText":"Echo Plus and Alexia have been Great to have around. Performed excellent."},{"reviewerName":"Jason Jope","rating":"5.0 out of 5 stars","reviewTitle":"As good as new!","reviewDate":"August 23, 2019","reviewText":"Great product and works great. Would definatly save money and buy refurbished amazon electronics again!"},{"reviewerName":"Charyl Van Pool","rating":"5.0 out of 5 stars","reviewTitle":"Good buy","reviewDate":"July 21, 2019","reviewText":"Still learning how to use all the features."},{"reviewerName":"drew kroll","rating":"5.0 out of 5 stars","reviewTitle":"not too shabby","reviewDate":"October 14, 2019","reviewText":"Decent little Alexa device for the money - use it daily."},{"reviewerName":"Doris Dimon","rating":"5.0 out of 5 stars","reviewTitle":"Great Assistant","reviewDate":"November 3, 2019","reviewText":"This is a great speaker as well as using it for it's many skills"},{"reviewerName":"Alex","rating":"5.0 out of 5 stars","reviewTitle":"Looked brand new!","reviewDate":"June 13, 2019","reviewText":"Couldnt even tell the item was a refurb."},{"reviewerName":"Michelle Jarmond","rating":"5.0 out of 5 stars","reviewTitle":"Hey Alexa","reviewDate":"October 2, 2019","reviewText":"I am Happy with my new friend Alexa. Im just concerned about exactly how much she's listening."},{"reviewerName":"Amazon Customer","rating":"2.0 out of 5 stars","reviewTitle":"Alexa needs to be smarter.","reviewDate":"July 24, 2019","reviewText":"Alexa can't answer a lot of my questions. Also I can't sync her to my Phillips Smart TV."},{"reviewerName":"Michael Breda","rating":"1.0 out of 5 stars","reviewTitle":"Quality sound","reviewDate":"June 14, 2019","reviewText":"After listening for about 5 minutes the speaker started vibrating and sounding muffled"},{"reviewerName":"T.T. E","rating":"5.0 out of 5 stars","reviewTitle":"Sound is great","reviewDate":"July 20, 2019","reviewText":"Ez to use very helpful"},{"reviewerName":"Lonnie","rating":"5.0 out of 5 stars","reviewTitle":"Great price","reviewDate":"September 25, 2019","reviewText":"Echo plus works and looks like new!"},{"reviewerName":"Eddie Toney","rating":"5.0 out of 5 stars","reviewTitle":"You can make phone calls on this..... wow","reviewDate":"July 27, 2019","reviewText":"I love new technology"},{"reviewerName":"A music lover","rating":"4.0 out of 5 stars","reviewTitle":"Versatile addition to the home. Easy to set up and adapt functions not previously available.","reviewDate":"August 17, 2019","reviewText":"Easy to set up."},{"reviewerName":"Yefry s","rating":"5.0 out of 5 stars","reviewTitle":"Esto es wow","reviewDate":"August 13, 2019","reviewText":"Esto es genial"},{"reviewerName":"Dayn","rating":"5.0 out of 5 stars","reviewTitle":"Great deal","reviewDate":"October 1, 2019","reviewText":"It's great and I love it !"},{"reviewerName":"wesley heller","rating":"5.0 out of 5 stars","reviewTitle":"One of the best things I ever purchased","reviewDate":"June 11, 2019","reviewText":"I just love Alexa. I wish I got it a long time ago"},{"reviewerName":"Thomas Williams","rating":"5.0 out of 5 stars","reviewTitle":"Alexa who","reviewDate":"July 7, 2019","reviewText":"I like that it can do so much and controls a lot of things"},{"reviewerName":"ErnnieG","rating":"5.0 out of 5 stars","reviewTitle":"Just like brand new!","reviewDate":"October 29, 2019","reviewText":"It looks and sound like out of the box for the first time"},{"reviewerName":"mohamed","rating":"5.0 out of 5 stars","reviewTitle":"Satisfied","reviewDate":"June 18, 2019","reviewText":"Works as supposed to, pretty new, no scratch no dent"},{"reviewerName":"Yelmison","rating":"5.0 out of 5 stars","reviewTitle":"10","reviewDate":"August 28, 2019","reviewText":"Me gusto mucho!! Muy buena calidad a buen precio"},{"reviewerName":"Beau Brown","rating":"1.0 out of 5 stars","reviewTitle":"Not working","reviewDate":"November 12, 2019","reviewText":"Does not work now"},{"reviewerName":"Amazon Customer","rating":"4.0 out of 5 stars","reviewTitle":"It performances as Advertise","reviewDate":"April 29, 2019","reviewText":"It works well and sounds great"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Alexa can do so much","reviewDate":"April 10, 2019","reviewText":"SOUND is very good so good it surprises you."},{"reviewerName":"Tamesha","rating":"5.0 out of 5 stars","reviewTitle":"Just simply a fun thing to have around the house!!","reviewDate":"April 4, 2019","reviewText":"Love it...our new member of the family!!!"},{"reviewerName":"Don","rating":"5.0 out of 5 stars","reviewTitle":"The wife loves it what more can i say","reviewDate":"October 29, 2019","reviewText":"The wife loves it what more can i say"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Works great","reviewDate":"June 6, 2019","reviewText":"Works great"},{"reviewerName":"Derek willliams","rating":"5.0 out of 5 stars","reviewTitle":"Dont have anything to say","reviewDate":"June 19, 2019","reviewText":"Good stuff"},{"reviewerName":"Michael D.","rating":"5.0 out of 5 stars","reviewTitle":"Overall good","reviewDate":"July 3, 2019","reviewText":"Convenient"},{"reviewerName":"Sue","rating":"5.0 out of 5 stars","reviewTitle":"Great purchase!","reviewDate":"March 5, 2019","reviewText":"I bought this model (refurbished) several months ago. I love it ! The sound is rich and full, it wakes me every morning to the song I choose, it gives me reminders, and answers my questions. I bought a smart light bulb so I can turn my lamp on or off while I’m away. One of the best purchases I’ve ever made !"},{"reviewerName":"Dan","rating":"1.0 out of 5 stars","reviewTitle":"guess it works with windows?","reviewDate":"August 7, 2019","reviewText":"But I just spent over 2 hours with amazon tech and still couldn't get it to work with 2 different computers and a tablet and still couldn't get it to connect!!!!!!!! What a POS!!!!!!!!!!"}]}