{"title":"Bose Home Speaker 500 with Alexa voice control built-in, Black","manufacturer":"Bose","currentPrice":"$299.00","rating":"3.9 out of 5 stars","totalRatings":"134 ratings","features":["Fill any room with impressive wall to wall stereo sound from a single speaker","Built in voice assistants, like Alexa and the Google Assistant, with superior voice pickup from a noise rejecting eight microphone Array","With Wi Fi, Bluetooth, and Apple airplay 2 compatibility, you can wirelessly stream whatever you want, however you want","Play integrated Wi Fi services like Spotify, music and audible or connect over Bluetooth to play anything from your phone or tablet","Experience superior voice pickup from a custom designed eight microphone Array that hears you over loud music or across the room","Control comes easy, with three different ways to manage what you hear: voice, tap the top controls, or the Bose music app","Alexa speaks English and Spanish"],"reviewsAspects":["sound quality","home speaker","voice control","music app","great sound","bass and treble","preset buttons","via bluetooth","living room","alexa integration","alexa to play","small package","iphone and ipad","voice commands","highly recommend","google assistant","family room","amazing sound","alexa devices","alexa work"],"productInformation":[{"ASIN":"B07FDF9B46"},{"Customer Reviews":"3.9 out of 5 stars\n    134 ratings\n3.9 out of 5 stars"},{"Best Sellers Rank":"#1,455 in Cell Phones & Accessories (See Top 100 in Cell Phones & Accessories)\n#52 in Portable Bluetooth Speakers\n#565 in MP3 & MP4 Player Accessories\n"},{"Shipping Weight":"6.05 pounds (View shipping rates and policies)"},{"Date First Available":"September 20, 2018"}],"productDescription":["Experience wall-to-wall stereo sound from a single speaker. With Amazon Alexa and the Google Assistant built in, millions of songs, playlists, and more are just an ask away. And you have the freedom to control the music your way — with your voice, the top controls, or the Bose Music app.","What sources can I play music from?","Use Alexa or the Bose Music app to play directly from music services over Wi-Fi, or use Bluetooth or the 3.5mm aux jack. Or stream to it with Spotify Connect or AirPlay 2 from an Apple device.","How can I control the music playing on the speaker?","You can start and control content on the Bose Home Speaker 500 with your voice, the buttons on the speaker, the Bose Music app, Spotify Connect (through the Spotify app), or AirPlay 2 from an Apple device.","What app should I use to set up and control the Bose Home Speaker 500?","The Bose Music app is used to set up and control the speaker. Once set up, you can also control the speaker using its buttons or your voice (with Alexa, where available). Some Alexa-related settings can be managed in the Alexa app.","What can I do with the voice assistants on the Bose Home Speaker 500?","It's not possible to provide a full list because Amazon Alexa and the Google Assistant are constantly evolving. But this speaker supports most features, such as music playback, control of smart home devices, setting timers and alarms, and more.","Can I control Spotify through Voice?","Yes. If you have a Spotify Premium account, you can play and control Spotify using Alexa with commands like 'Alexa, play Ed Sheeran on Spotify,\" 'Alexa, play Discover Weekly on Spotify,' 'Alexa, next track,' etc.","Take control of your listening experience with the Bose Music App. Browse all your music in one place, and seamlessly jump between stations, playlists, and services. Plus, it’s another simple way to control the Bose Home Speaker 500. You can easily set up your six presets, and multiple users can personalize their experience and content.","The Bose Home Speaker 500 is part of a new family of smart speakers and soundbars. Alexa voice control built in, you have millions of songs at the tip of your tongue. Or, manage everything from the Bose Music app. Bring all your entertainment to life — music, movies, and TV — in any room you want.","Bose Home Speaker 500","SoundTouch 20 Speaker","SoundTouch 10 Speaker","SoundTouch 30 Speaker"],"reviews":[{"reviewerName":"Pierce","rating":"5.0 out of 5 stars","reviewTitle":"Bose Quality, Alexa Cool, But Not Perfect","reviewDate":"September 20, 2018","reviewText":"Hack...I want to listen to Audible books on my BHS 500. I paired it with my Echo Spot. I tell the Spot to play my book. Bose plays it.\n\nOkay, setup was relatively easy. The sound, as we expect from Bose, is extraordinary. The box itself is very cool looking, looks good where ever you put it.\nOnce connected to Alexa, I connected it to Amazon Music which is where I get most of my music. I subscribe and also have about 8,000 songs stored there. If you have other music sources/stations, they're pretty easy to connect as well.\nI had one major disappointment and one minor. I listen to a lot of books, and was sad when Alexa said she could not play Audible books. I hope that will be remedied in a future firmware update.\nMinor disappointment: Like so many new Alexa compatible devices, the wake word is Alexa. No other choices. So, this is Bose great, Alexa familiar, but just waiting for Bose to make it better.\nI almost gave it a 4, but the sound is just too good.\nRecommended."},{"reviewerName":"BBB","rating":"1.0 out of 5 stars","reviewTitle":"I regret buying this device","reviewDate":"February 28, 2019","reviewText":"This speaker looks great, and sounds great, when it works. Unfortunately, it doesn’t work as advertised. It connects to Bluetooth just fine. But so do all Bose wireless speakers. The real selling point of this speaker was it’s seamless connection to multiple music services. That capability is a disaster. I have reliable and fast wireless in my home. My Bose Speaker 500 was extremely difficult to connect to WiFi. Just setting up the speaker was extremely frustrating. It required multiple attempts to connect to the Bose Music app, and I mean I tried dozens of times. I unplugged the device multiple times. I reset to factory settings multiple times. I rebooted my WiFi multiple times. It finally connected after an hour. The app is horrible, the connection to the device is horrible. And I haven’t even started to discuss how awful the music service playback works. It absolutely refuses to play SiriusXM. Nothing I do works. That was a primary reason I purchased this device, and at this point I’ve given up trying to connect to Sirius. It won’t even play music from my Amazon Prime account, that should work easily through Alexa. No such luck for me. Other elements of Alexa work ok. It will tell me what the temperature is outside, so I’ve got that going for me. Of course, that’s not why I spent $400. It’s a complete waste of money. The Bluetooth connection works fine, but you could spend half this much money to get a good sounding speaker with that capability. Do not waste your money on this awful product."},{"reviewerName":"Jeffrey Wickert","rating":"3.0 out of 5 stars","reviewTitle":"Just okay and for the price you need more than just okay","reviewDate":"October 20, 2018","reviewText":"There is a lot to like about this speaker. The sound is great and the design is very attractive. Unfortunately, there are enough pieces that work as well as an Echo speaker. Asking it play to music, it often told me it wasn't authorized until a second attempt leading to an interesting argument.\n\nI returned this and bought an extra Echo and the Echo Sub instead. This setup improved sound quality in my opinion. Also everything works better with the straight Echo setup."},{"reviewerName":"Oldcaywest","rating":"3.0 out of 5 stars","reviewTitle":"I hope you're patient! Doesn't do what I expected","reviewDate":"November 1, 2018","reviewText":"Numerous issues setting this new speaker up with the Apps. After an hour of trying to find the \"My Bose\" link (which the instructions refer to in the 1st step to begin the setup process,) I ended up reinstalling the Bose Music App. I still haven't found that particular link but somehow managed to get it up , connected and playing music through the App.\nTwo hours later I am still setting it up and having a very hard time getting a support video on \"Group Speakers\" to play. I finally got it to play only to discover when I clicked on the \"Group Speakers\" button as instructed to connect a speaker group, it was whited out and says \"Grouping not Available\"! That's what I bought this for! I only have one other Echo \"Plus\" Gen 2 speaker which from what I've read should work on a multi-room speaker setup. There is this notice on Amazon's page for this item...\"Currently, stereo pairing, speaker groups, and multi-room music only support music playback over your wireless network, and do not support Bluetooth, 3.5mm AUX in, or TV/video connections.\" Aren't I trying to play this over my wireless network through Alexa? I'm confused. I was going to buy the Echo Sub system with 2 Echo+ for my mini-system but now I have no reason to believe that will work as a multi-room system either if this one doesn't. I'll continue to figure this out but if this just ends up being a $400.00 Echo like the product it will be going back. What a disappointment so far. As for sound that is the only reason it's getting a 3. It does not have the bass response I expected at all but the overall sound is as described by Bose as \"The widest sound of any smart speaker.\" It has wonderful sound as a standalone but I really wanted it to act as a bit more of a subwoofer with all the talk about how wonderful the bass was."},{"reviewerName":"Paul J Paradis","rating":"1.0 out of 5 stars","reviewTitle":"Wi-Fi is Impossible to set up","reviewDate":"December 7, 2018","reviewText":"Downloaded the manual.\n\nTried following the instructions on Wi-Fi set up but Bose App does not correspond to the manual's instructions.\n\nBeen working this all day."},{"reviewerName":"Roger C. Mathus","rating":"5.0 out of 5 stars","reviewTitle":"Finally Great Sound in Small Package","reviewDate":"September 24, 2018","reviewText":"The new Bose Home 500 offers the best sound I have heard in small speaker and Alexa is a fine addition. My Bose is next to an Apple Home and I like the Bose sound much better. The Bose also displays album covers and other information. I easily activated Tune-in Radio, Spotify and Amazon music APPS."},{"reviewerName":"Jed","rating":"2.0 out of 5 stars","reviewTitle":"No Spotify voice integration","reviewDate":"The manufacturer commented on the review below","reviewText":"It sounds great but you can’t says Alexa play whatever from Spotify. You have to use the bose app to play from Spotify. Dealbreaker for me, since I want voice control"},{"reviewerName":"James","rating":"2.0 out of 5 stars","reviewTitle":"Compatibility issues","reviewDate":"November 10, 2018","reviewText":"Outstanding sound when operated independently from other Echo products. Doesn’t “play” well with other Echo devices; if you tell it to play a channel everywhere, it lags a few seconds behind the other devices.\nWe returned it and got the Echo Plus / Sub woofer combo - better sync and sounds comparable for much less money."},{"reviewerName":"Syed Shah","rating":"1.0 out of 5 stars","reviewTitle":"This item did not work","reviewDate":"The manufacturer commented on the review below","reviewText":"I received the order and the product would not work via blue tooth. For example, I would play a song on Spotify, YouTube, Amazon Prime Music, it would play through the speaker, however after 30 seconds to a minute, the music started skipping. To remedy this, I took it to my parent's house (different wifi / diff location), and the same thing. The specific item I received skipped 100% of the time I tried to use it."},{"reviewerName":"S. Woods","rating":"5.0 out of 5 stars","reviewTitle":"Great sound in a small package. Alexa is awesome!","reviewDate":"December 1, 2018","reviewText":"I purchased the Home Speaker 500 the day it released. I was immediately impressed with the sound quality. Setup with the \"Bose Music\" app was easy enough. Alexa has stopped responding twice since purchase but I simply unplug the power cord and plug it back in and everything works fine. Hope to see this fixed in the next software update. I've seen several complaints that people can't pair it with other Alexa devices but Bose has made it pretty clear that it will only pair with other Bose Home Speaker devices. I have mine setup with Spotify premium and voice commands through Alexa work perfectly with Spotify. I've also setup the device through Alexa to control my Wemo light switches and my Nest thermostat and love the functionality. I connected my TV through the AUX port and the sound is great for movies. Overall I would highly recommend the Bose Home Speaker 500."},{"reviewerName":"Kenneth A. Olena","rating":"5.0 out of 5 stars","reviewTitle":"Bose quality anyway you look or listen","reviewDate":"December 24, 2018","reviewText":"Bose sound keeps getting better. This was a replacement for an original Sound Dock which finally died. I actually paid for this, unlike some other reviews here. I suspect their value judgments are a Little off. Something for nothing makes it too easy to quibble. Set up was easy as could be. Found my google mesh network right away, updated itself and connected to amazon music, an 8 year old iPod, an iPhone 8, an iPad Air, a surface pro 4 and an iPhone 6 with no issues at all. The sound quality’s amazing. I am an audiophile, and was quite impressed. No substitute for way too much gear, but great for outside the listening room. The app worked perfectly. The engineering was as expected from the company Amar Bose built. Kudos"},{"reviewerName":"R. Ewing","rating":"1.0 out of 5 stars","reviewTitle":"App doesn’t work so product doesn’t work. SMH.","reviewDate":"September 25, 2018","reviewText":"I’m assuming this has the usual great Bose sound, but how would I know. The application to set up and control the device. Will not connect. Tried and tried. Guess Bose will get this back. Come on Bose. DONT BUY THIS UNTIL THE PROBLEM’s FIXED.\n\nUpdate: Received response from Bose with possible solutions. Finally, after powering down and resetting router and firewall, and restoring the speaker to default settings, I finally got the app to recognize the speaker, the speaker to connect to the WiFi and the speaker was activated. Great, right? Nope. The app says the speaker is ready to play, the speaker says “the update will start once downloading is complete” and the app won’t play anything. The “update” is either the largest file ever to be downloaded or the unit is stuck and not downloading.\n\nMy home is full of Bose products. Speakers, sound bar, sleep buds, ear buds, etc. All worked flawlessly. This is such a shame. I’m no computer neophyte. I’ve spent hours trying to get this to work. No dice. With great regret it’s going back."},{"reviewerName":"Phronesis","rating":"5.0 out of 5 stars","reviewTitle":"Impressive audio; good Alexa integration; complete suite of streaming music services","reviewDate":"January 6, 2019","reviewText":"I am not a Bose fan. But the Bose 500 speaker impresses. It is a stately looking speaker that looks good on your kitchen counter. But even better than how it looks, it sounds terrific. Effortless bass and rich well-balanced sound. The expansive soundstage is immediately satisfying to the ear. It can go louder than you can withstand, with no distortion. You will not be disappointed with how it sounds. Music integration is top notch: Pandora, Spotify, Sirius XM, Amazon music, etc. all work flawlessly. Alexa is responsive. The 6 preset buttons are no gimmick, but quite useful. Easy to set up, easy to use. Really enjoyable to listen to at all volume levels. Bose has done its homework on this one. Overall it is an impressive speaker and will meet all of your music needs in the kitchen or living room, and then some. It is worth $400 of your hard earned cash. Highly recommended."},{"reviewerName":"lovedquilts","rating":"1.0 out of 5 stars","reviewTitle":"will not stay on","reviewDate":"January 23, 2019","reviewText":"I really wanted to love this, the sound was great but the radio keeps shutting off. Alexa is very slow to respond to my requests. I am returning this"},{"reviewerName":"Steven","rating":"5.0 out of 5 stars","reviewTitle":"Very Happy with this Purchase - Excellent Streaming Speaker","reviewDate":"August 30, 2019","reviewText":"For the past few years, I've been listening to music on Amazon Echo speakers, which I had synced in various rooms throughout my house. Because I had been listening to music more and more, when my family and I decided to move, I wanted to upgrade my speakers.\n\nI originally was set on getting a pair of the KEF LSX. Though I've never heard them, after all my research, I am sure they are amazing speakers. I also wanted to get some other less expensive speakers (at least compared to the LSX) for other parts of the house that I could sync to (using Air Play 2). I tested out a lot of options in this price range (and even a bit more expensive, like the Sonos Play 5).\n\nWhen we were in the process of moving, I decided on and ordered a Home Speaker 500. After using it for a day, I was so impressed by this speaker that I decided to forego the KEF LSX and just use the Bose throughout the house, so I ordered two more. So, for about the price of on set of LSX, I now have awesome speakers throughout my house. I'm sure I sacrificed sound quality by not getting the LSX (and I definitely sacrificed getting stereo sound on a wide soundstage), but, honestly, I love the sound of the Home Speaker 500, so I don't think I need anything that is 'audiophile' grade.\n\nWhat I Love Most:\n-The sound is full and rich. I don't know how to describe it otherwise, but everything I listen to sounds fantastic.\n-The speakers can also get really loud without any discernible distortion. I haven't pushed them to their full volume as they are quite loud enough even at 50% or 60%, and the sound really does fill the room (and the next room!).\n-The look & overall build quality. They are really handsome speakers with a substantial size without being too bulky. I also appreciate the aluminum finish much more than I expected I would. The aluminum also gives the speaker a really nice heft to it. Nothing about this speaker feels or looks cheap to me (which is partly why it's not a cheap speaker, obviously).\n-The screen. I have read reviews that criticize the screen as not useful and not in line with the current aesthetic for speakers. But, honestly, I listen to a lot of playlists on Spotify, and it's nice to be able to see what's playing. And, even when I'm playing stuff I know, I like seeing the album art.\n-EQ adjustments in the Bose app. You can change treble and bass on a pretty wide range (-100 to 100, with 0 being default). When we first moved in, we didn't have any rugs down, so the sound was way too bright. A small adjustment in the EQ made a huge difference. Now that we have some rugs down, I've adjusted the EQ again back towards the default, and they continue to sound great. Even though these speakers don't self-tune like some of the other speakers in this class (Sonos, Apple, and Google all do to some extent), the tuning you can do as a user I think will make these speakers work for you in any space. And, the speaker does have a host of microphones, so self-tuning is always something Bose could add in the future.\n\n(Minor) Complaints\n-The way groups work is a little different than with Amazon's Echo ecosystem. Instead of creating groups ahead of time, you have to go into the Bose app to create groups ad hoc. So, you can't ask Alexa to play music on a particular group of these Bose speakers. Instead, you have to get music started on one speaker and then create the group you want in the Bose app. Once it's set up and is playing continuously, any music command given to Alexa continues to play on that group. If you stop playing music, the group eventually dissolves. The positive to this is that you can also edit groups (add and remove speakers) on the fly without really interrupting the music. With the Echo ecosystem, I don't think this was possible (except possibly if you were using Spotify Connect with your Echo groups).\n-The app and software can be a bit buggy. It always does what I want it to -- eventually. And it doesn't take long to do what I want it to do. But it also doesn't always work the first time (such as creating or editing a group). Also, album art sometimes disappears, replaced by a generic, white musical note. I will say that the more I have used my speakers, the less buggy the system tends to be. Maybe I'm just becoming more proficient at navigating the software's quirks, or maybe Bose is making some updates to the speakers that I am not aware of.\n-Bose used two side-firing drivers in this speaker, which is supposed to give a wider soundstage for stereo sound. I don't really hear much stereo in these speakers, even with songs that have a lot of it (such as \"Such Great Heights\" by The Postal Service). That said, the side-firing speakers do create a more room-filling sound as Bose claims. And, really, similar to the Echo, the sound quality doesn't change a lot no matter where you are in relationship to the speaker (though the little stereo you might get straight on gets lost completely if you are not more or less straight on to the front or back of the speaker).\n\nAll in all, I absolutely recommend this speaker. It's a bit on the pricier side compared to some of the other speakers it gets compared to (but not all), but, for what I was looking for, I'm really quite satisfied."},{"reviewerName":"Xavier","rating":"3.0 out of 5 stars","reviewTitle":"Excellent sound but beware if you are buying this for its \"intelligent capabilities\"","reviewDate":"January 14, 2019","reviewText":"This is a BOSE sound quality speaker. I’ve been using it in a large family room and it is quite capable of filling the entire room with sound as promised.\nThe issues I’ve had with this device are related with the interface between de app and the speaker and the speaker and the router. So far in about a month I’ve had to reboot the speaker 4 times because the “Alexa” functions stopped working or the WI-FI suddenly became disabled and wouldn’t reconnect.\nI hope that with further updates to the software this issues become resolved, but as this date I would choose another speaker if I was counting on using the AIexa functions of this device."},{"reviewerName":"Vincent","rating":"2.0 out of 5 stars","reviewTitle":"Amazing voice recognition, but fails on sound quality & that low res screen tho","reviewDate":"The manufacturer commented on the review below","reviewText":"In the store this sounds great, because Bose has a special set up with diagonally shaped sides that reflect the sound perfectly towards you when you're standing in front of it, and it has pre-set song/sound demo to go through that must be tuned perfectly so it sounds really good.. So I'm not one of those anti bose guys, I actually have the alexa enabled bose 700 soundbar and sub with the rear wireless speakers and it sounds amazing. This speaker has very little treble at all, even when you turn the treble up in the finicky Bose Music app, i still can't get it to sound quite right. The bass a little light but fine for its size and the mid range is good. I am guessing that's because it only has two mid range drivers and no bass or tweeter. That being said the sounds i fine if you have nothing to compare it to but the regular echo speaker which sounds horrible. But I have a google home MAX which is the same price and sounds miles better than this for the same price, that being said, this is a little smaller and has some more functionality, like the VERY convenient preset buttons. I am annoyed the preset buttons don't have back lighting though because when I want to put on my 'fall asleep' playlist by tapping I can't see and have to turn on my lamp. But overall the presets make this speaker a lot easier to use than the google home max where I have to say \"Hey Google, can you please play 'vincent's play list from spotify premium' and it has to understand me perfectly or it will play some other random playlist.\n\nAnother thing I like is the build quality, it's a nice solid aluminum speaker, with a dense feel, that being said the SCREEN that they put on this thing for album art, is utterly atrocious. Screens are really cheap to make now-a-days, and upgrading to a more pixel density would have been nice. It also has weird back-lighting issues where when there's a darker or black album art you can see light clouding around the corners and the lighting is very uneven. This was on my unit, and units I saw in person at a store.\n\nAlexa integration works well and is easy to set up.\nThe bose music app though, I hate to say, blows... I used to have two Bose Sound Touch speakers, and the sound touch app was much better than this new bose 'music' app. It was feature rich AND you could control it without being on your home wifi network. Which meant I could put some music on for my dog when I was away from home at work, or change the music for guests if they didn't want to download the app. The sound touch app also used to have a windows/mac app version. Which made it a lot easier to organize my music, because I had the bigger screen to set things up on. There is no desktop app available.\n\nAnyway I returned the Bose 500 home speaker recently and I would recommend listening to other choices first. The best part about this speaker is the presets on the top and the size, and the better than an echo sound quality, but I do not believe it is worth 399 or even 349. IT's more of a 200 dollar speaker IMHO compared to competition."},{"reviewerName":"Thomas Novak","rating":"5.0 out of 5 stars","reviewTitle":"Amazing Bose Sound","reviewDate":"October 20, 2018","reviewText":"This Bose Home Speaker 500 has been one of the best purchases I ever made. The ease of set up was very welcomed.\nThe music fills our living room with the volume cranked at barely 25%. The quality is amazing. It has made listening to music on our Echo Plus a thing of the past. There is no comparison."},{"reviewerName":"Juan V.","rating":"1.0 out of 5 stars","reviewTitle":"Internet connection","reviewDate":"April 27, 2019","reviewText":"Nice unit with good sound but very disappointing when it comes to internet connection. I received the unit in a non-marked box and i had the feeling it was a refurbished product. The unit goes offline almost everyday and needs to be unplugged in order to reconnect. Initially I thought it was my internet service, but my other alexa and bose devices do not have any issue. I wish I could have returned it when i could. I am big fan of Bose products but this was a disappointment."},{"reviewerName":"apollo","rating":"1.0 out of 5 stars","reviewTitle":"the speaker is not that reliable it shuts down at times.","reviewDate":"January 20, 2019","reviewText":"I did not like the fact that the speaker turns off when least expected."},{"reviewerName":"Sally G","rating":"5.0 out of 5 stars","reviewTitle":"AWESOME SYSTEM","reviewDate":"January 22, 2019","reviewText":"After reading other reviews I thought I might have trouble connecting the system but because of the BOSE name I knew it would be worth it in the end anyway but much to my surprise, BOSE support was excellent!\n\nTheir support team made it very easy to connect to the internet and connect Alexa. It takes about a half hour to forty-five minutes it connect but the step by step with the help of their support team made it very easy!\n\nHats off to a GREAT COMPANY and a AWESOME SOUND SYSTEM!"},{"reviewerName":"EdoBeats","rating":"5.0 out of 5 stars","reviewTitle":"Better than the competition while it worked","reviewDate":"May 14, 2019","reviewText":"This speaker is hands down the best at a little of everything at the moment. Highly recommend this speaker system. iPhone compatibility as good as the home pod. Android connectivity on point never any issues an for the bread and butter the sound quality is very good I'd say better than the homepod and the google home. Well worth it if you need to fill a room with good sound.\n\nEdit: 5/17 stopped working"},{"reviewerName":"Wilson M. Chelakadan","rating":"5.0 out of 5 stars","reviewTitle":"My fav brand and product","reviewDate":"October 19, 2018","reviewText":"There is some problems with Alexa - doesn’t respond. We need to sign in on each app - SiriusXM, TuneIn, Amazon Music, and Spotify. Sound quality is awesome. Price is a little high. Bose could have used the entire space on the display panel by showing date as well. I wish Bose have given some response when we call “Alexa”"},{"reviewerName":"J. Stanton","rating":"3.0 out of 5 stars","reviewTitle":"Voice Controlled Music Playback Does Not Work","reviewDate":"The manufacturer commented on the review below","reviewText":"At the time of this review, the speaker (which advertises as compatible with both Google Assistant and Alexa) does not work properly with Google Assistant. For the most part, it accepts commands and acts as a Google Home (when added to the Google Home environment), but music playback does not work at all. First, Google Play Music and YouTube Premium music isn't even available for the device, so Spotify (premium) or Pandora must be used. Then, when Google is asked to play something, it says \"sure!\" and starts Spotify, which promptly crashes. The only way to play music is by using the Bose app. Until the voice control is fixed, I can't recommend this product as a smart speaker (but will still keep it for its stunning sound)."},{"reviewerName":"Mark S.","rating":"3.0 out of 5 stars","reviewTitle":"Bose Home Speaker 500 vs Sound Touch 20","reviewDate":"The manufacturer commented on the review below","reviewText":"I had just ordered the Bose Sound Touch 20, but then became aware of the Home Speaker 500 and that it was being sold at a reduced price. I decided to order the 500 so I could compare the two. Here are some comments from a non-audiophile, but someone who does care about, and notices, sound quality.\n\nThe two devices are controlled by different apps. The Sound Touch app has bass reduction control (which is helpful) but no other ways to control sound quality. The Bose Music app allows for both bass and treble adjustment.\n\nThe Sound Touch app allows you to enter a URL for any streamable content that isn't carried by the supported streaming services. The Bose Music app does not. This is important to me...one radio station I listed to frequently is only available on radio.com...a service not supported by either device.\n\nBoth devices support Tune In. But the Bose Music app doesn't support the premium version, so you're forced to listen to commercials when using Tune In with the 500.\n\nOne can get around the two limitation mentioned above by playing content from your phone through the speaker via Bluetooth. But that renders the pre-set buttons useless is a big inconvenience in my opinion.\n\nI found the 500 is more aesthetically pleasing and durably built, being housed in a sleek aluminum case. The Sound Touch is housed in plastic with a foam mesh over the speakers. The fact that the 500 is smaller makes placement easier.\n\nThe 500 has a fully, richer sound with clearer/crisper highs in my opinion. Spoken word sounds a little mushy on the 500, but that is corrected somewhat by adjusting the bass downward. This, of course, is a subjective call. Others may experience the sound differently.\n\nI had always planned to return one of these, and thought it would be the Sound Touch. But I think the 500, while it sounds better, just isn't as useful for my purposes based on the limitation of the app.\n\nHope someone might find these comments helpful."},{"reviewerName":"Abou Guindo","rating":"2.0 out of 5 stars","reviewTitle":"Doesn’t connect with other Bose ( SoundTouch)","reviewDate":"The manufacturer commented on the review below","reviewText":"I already owed a SoundTouch 300 with bass item + surround speakers and the SoundTouch 30. This to mean I was already good in term of sound quality. I bought this item to extend my sound network to another room and “smart” component of the thing. Unfortunately Alexa is not working in the country where I am ( that’s ok !) but what’s really disappointing is the fact that I can’t connect this device to my previous network and play all item simultaneously. It’s already disturbing to have to use two different app to control the items ( Bose music app - SoundTouch app) but this I could live with it, if and only it was possible to connect with the remaining Bose item I possess."},{"reviewerName":"Robert Clemons","rating":"5.0 out of 5 stars","reviewTitle":"GREAT SERVICE!!","reviewDate":"July 10, 2019","reviewText":"Once I finally got the speaker set up right I very happy with everything ! The service from the Bose Co. was fantastic! I spent over an hour on the phone with a Representative in the UK getting it just right!\n."},{"reviewerName":"Raymond Scott II","rating":"4.0 out of 5 stars","reviewTitle":"Love the Alexa feature","reviewDate":"November 4, 2018","reviewText":"The sound is not as good as the SoundTouch series in my opinion but love the convenience of having the Alexa feature."},{"reviewerName":"Michael","rating":"5.0 out of 5 stars","reviewTitle":"Bose Superior Quality with Alexa","reviewDate":"October 31, 2019","reviewText":"Bose never ceases to amaze me. Clarity in sound is unmatched, and having Alexa integrated into the Bose Home Speaker 500 makes asking for a playlist a breeze. My personal favorite is having this product integrate with my home automation products. It makes adjusting my thermostat easier than ever."},{"reviewerName":"Roland R. Repato","rating":"1.0 out of 5 stars","reviewTitle":"Alexa is not working in the Philippines.","reviewDate":"The manufacturer commented on the review below","reviewText":"I didn't' see a clear disclaimer that Alexa will not gonna work in the Philippines. SO I can't use the voice control. Totally useless because I also have OTHER BOSE device. What attracted me to buy this product is the ALEXA FEATURE. CAN ANYONE IN BOSE OR AMAZON HELP ME? THANKS."},{"reviewerName":"JORGE A GONZALEZ O","rating":"1.0 out of 5 stars","reviewTitle":"Bluetooth trouble","reviewDate":"The manufacturer commented on the review below","reviewText":"Constantly disconnect my device from Bluetooth connection and turns off"},{"reviewerName":"Tabba","rating":"5.0 out of 5 stars","reviewTitle":"Excellent speaker","reviewDate":"November 3, 2019","reviewText":"This Bose Home Speaker 500 is wonderful! Resonate sound, easy connection to internet radio or by bluetooth to my phone, it really delivers quality sound. We loved the first one of the home so much that we go another for the office. You can control it easily with your cell phone. The only thing I'd change is that the clock stay on 24/7 even when playing the radio."},{"reviewerName":"Paula","rating":"2.0 out of 5 stars","reviewTitle":"Alexa will not connect","reviewDate":"The manufacturer commented on the review below","reviewText":"I really liked the look, sound and LCD display on this speaker. However, after 3 weeks of trying to get Alexa to connect, with the little support by Amazon and Bose both I received day after day. The issue was never resolved. I returned it. And I am very disappointed. Needs a lot of improvement. But great concept! Now if they can just fix the issues."},{"reviewerName":"Sean LaRue","rating":"3.0 out of 5 stars","reviewTitle":"Does not support all Alexa commands","reviewDate":"January 2, 2019","reviewText":"First and foremost, this device does not support all Alexa commands. For instance, Drop-in is not supported. Second, I was really expecting a fuller sound from Bose especially at lower volumes. installation was really easy and just took a few minutes but you do have to go into the Bose app and set it up and then the Alexa app to connect to your music accounts."},{"reviewerName":"MartinM","rating":"5.0 out of 5 stars","reviewTitle":"Bose is always improving and innovating","reviewDate":"December 31, 2018","reviewText":"Great sound from a small unit. It fills entire 3,000 sq ft home with clear crisp music"},{"reviewerName":"Laura","rating":"5.0 out of 5 stars","reviewTitle":"It’s Bose.","reviewDate":"February 7, 2019","reviewText":"It’s the best sounding, small speaker. The volume and clarity are exactly what you’d expect from Bose."},{"reviewerName":"jac","rating":"4.0 out of 5 stars","reviewTitle":"Great speaker","reviewDate":"October 20, 2018","reviewText":"Great sound but that's what you are going to get from bose.set up was very easy and quick,I listen to my music on spotify and siriusxm and am very happy with the product"},{"reviewerName":"Ytsud","rating":"5.0 out of 5 stars","reviewTitle":"First Class Sound","reviewDate":"March 29, 2019","reviewText":"High quality sound in a compact unit complete with Alexa. App is a bit counter intuitive but does the job. Highly recommended and I would buy it again!"},{"reviewerName":"Dr. Aguilar","rating":"4.0 out of 5 stars","reviewTitle":"Great sound, not so good versatility.","reviewDate":"December 12, 2018","reviewText":"Great sound, but not always, of course it would depend on source quality.\nA little trouble with bluetooth connections, specially when changing devices.\nApp could be better, for example, a music equalizer could help improving sound quality depending the type of music being play."},{"reviewerName":"Rooster","rating":"5.0 out of 5 stars","reviewTitle":"Another Big Sound in a Small Package!","reviewDate":"September 21, 2018","reviewText":"Ya we are sold on Bose! Our Alexa rocks on this Thanks Bose! Now if our Alexa Fire Cube could only say this! I also can use Bluetooth to rock my Ipod Library!"},{"reviewerName":"JYACR5","rating":"5.0 out of 5 stars","reviewTitle":"Just because it has Alexa doesn't mean you have echo!!!","reviewDate":"May 11, 2019","reviewText":"Beautifully built speaker. Sound quality is excellent as expected from Bose. The screen is not a huge deal of the speaker it simply can tell time. Different lights have different means like notifications. You can connect to Bluetooth with many phones or devices. For example my Xbox one is connected to the speaker. So I can tell the Bose home 500 to turn on my Xbox etc..."},{"reviewerName":"Karen S.","rating":"5.0 out of 5 stars","reviewTitle":"Best little speaker sounds ever","reviewDate":"December 25, 2018","reviewText":"The best little music investment I’ve ever bought! The sound quality is amazing so glad I purchased one. The only downfall is the Bose app on phone doesn’t always connect properly."},{"reviewerName":"RW","rating":"3.0 out of 5 stars","reviewTitle":"3.5 Stars. Excellent sound quality in this well-made and handsome unit but over-priced","reviewDate":"November 3, 2018","reviewText":"I am perhaps a smart-speaker/Bluetooth speaker addict. I love to set them up and listen to different sounds and I enjoy figuring out which have the highest value-ratio. Also, I am generally a fan of Bose products, in particular their Soundsport and Noise Cancelling headphones.\n\nSummary of this item:\nThis is a standalone unit with front and rear-firing speakers that connects to your home Wi-Fi to create a Network of Connected speakers if you have more of this same unit or either of their new Soundbars. What this means is that you can use pretty much any music service you are a member of (Amazon, Apple, Spotify, Pandora, etc) and through the Bose app, connect to those accounts and toggle easily between those services and your playlists or content on any of them. These 500 speakers can then be placed in different rooms so you can play the same music in all rooms at the same time or different music in different rooms. All controlled through the Bose app. If you are aware of what Sonos is, this is what they do. This speaker can also go in to Bluetooth mode so you can connect it directly to your device such as iPhone, iPad etc. It also has an Auxiliary port for even more connect ability.\n\nPositives:\n-Handsome and well made.\n-Screen is nice which shows song and artist as well as album or song art work. I am not sure how necessary this is, but it does look good.\n-The sound is very good and \"Room Filling\" Think of their Wave Radio from back in the day and you thought \"How could this much sound come from this small device?\" That is a Bose hallmark and not missed on this device.\n-Connection options: I love that you can go in to Bluetooth mode or have the Aux cable. This is something Sonos does not do.\n\nNeutral:\n-There are two soundbars that can be networked to this or other 500 speakers.\n-Size. See photo with pen for perspective.\n-Sound: True to Bose, it does sound overall well, but specializes in nothing. Bose does a good job representing the sound exactly as it is and not being bass-heavy or treble heavy. The sound is good and at times spectacular. At high volumes it isn't at it's best but at medium volumes it is.\n-There are two subwoofers that are compatible with this unit and those would probably sound great, but one is $400 and the other is $700.\nNegatives:\n-Price. At $400 you can purchase two of the newest version of the Sonos One. I have one of those pictured in size comparison to the Bose 500. Those Sonos One also have Alexa and be separated for true stereo. In my test with both a single Sonos One and Stereo Sonos One, I preferred the Sonos One in both. With just one of them, it was close, but with the pair it was no contest. Sonos. Not only that, but you can separate the Sonos One to be in different rooms and then combine easily for stereo when needed. (Note: I have nothing to do with Sonos, but feel they have excellent products.)\n-The App lost my speaker numerous times over several days and I had to touch the speaker like turn volume up or down on the actual speaker in order for the App to re-find my speaker. If it couldn't find it, I couldn't do anything with the music unless using voice control. This was annoying! The app should just work and find the speaker right away.\n-With front and rear firing speakers, the sound can fill a good sized room, but becase they are front and rear, what that means is that your display would need to be sideways in order to have the sound travel throughout well. Look at my photo of the Bose 500 against a window. In this position, the speaker will fire against the window and forward. If you can position the speaker truly in the center of a room, that would be ideal to maximize it's range and effectiveness but how realistic is that?\n\nSummary If you listen to this in a demo at Bose or as a standalone you will be impressed with the sound coming out of this small package. And you should be. It's excellent. You will also like the screen and you should. It's great. But be aware that I don't feel the networking is ready for prime time in my experience compared to Sonos. I just don't know why my app couldn't find the speaker numerous times and then all of a sudden could? It's has great connection options with Bluetooth and Aux and looks great and upscale. For sound, there are better options of networked speakers at this same price point that will provide a more robust audio experience although not quite as versatile."},{"reviewerName":"Rob","rating":"5.0 out of 5 stars","reviewTitle":"Love Bose","reviewDate":"May 13, 2019","reviewText":"Can’t go wrong with a Bose The sound is top notch best on the market"},{"reviewerName":"jem","rating":"5.0 out of 5 stars","reviewTitle":"Bose 500","reviewDate":"June 9, 2019","reviewText":"This is one of the best investments I have ever purchased. I love that I don't need a high entertainment set. This is small, good quality and sound, and doesn't take up much space."},{"reviewerName":"paula sheedy","rating":"5.0 out of 5 stars","reviewTitle":"Wow this thing is great!","reviewDate":"July 13, 2019","reviewText":"We love this thing. You sit on your couch and say “Alexia, play ‘whatever song or genre your heart desires’” and she plays it. It works perfectly and has been a great addition to our home"},{"reviewerName":"Jodi Monterosso","rating":"1.0 out of 5 stars","reviewTitle":"Never wasting my money on a name!","reviewDate":"The manufacturer commented on the review below","reviewText":"Absolute nightmare to hook up"},{"reviewerName":"Kindle Customer","rating":"5.0 out of 5 stars","reviewTitle":"Perfect","reviewDate":"November 12, 2018","reviewText":"Everything it was advertised to be. Huge sound that stnchs with Alexa to play my music-- can't beat it!"},{"reviewerName":"Bossbunny","rating":"5.0 out of 5 stars","reviewTitle":"You can't go wrong with bose","reviewDate":"December 28, 2018","reviewText":"Sons favorite Christmas gift"},{"reviewerName":"Valerie McGeachy","rating":"5.0 out of 5 stars","reviewTitle":"Would recommend!","reviewDate":"March 7, 2019","reviewText":"Love the sound. Works wonderfully with Alexa. Easy set up."},{"reviewerName":"Barinr","rating":"5.0 out of 5 stars","reviewTitle":"Very good sound for the price, Bluetooth only.","reviewDate":"January 20, 2019","reviewText":"Set up is much easier than it used to be for Bose speakers. It’s strictly Bluetooth which isn’t a problem for me but there’s no input jack. Very good sound for the price."},{"reviewerName":"Tj","rating":"1.0 out of 5 stars","reviewTitle":"Great sound few bugs to work out could be latest technology.","reviewDate":"September 9, 2019","reviewText":"Have some problems after first week will call bose again to find answer. Have to keep resetting.\n."},{"reviewerName":"John Jones","rating":"5.0 out of 5 stars","reviewTitle":"Sleek and great sound","reviewDate":"February 25, 2019","reviewText":"I have had plenty of Bose products and this one has great sound and a sleek look. Works well with Alexa too."},{"reviewerName":"John","rating":"4.0 out of 5 stars","reviewTitle":"Does not work on the Alexa everywhere group.","reviewDate":"October 1, 2018","reviewText":"5 stars for sound. Hope this gets fixed."},{"reviewerName":"Tina","rating":"5.0 out of 5 stars","reviewTitle":"Awesome Speaker","reviewDate":"January 5, 2019","reviewText":"The sound quality of the this is absolutely amazing. It is well worth the higher price tag as compared to other speakers. Set up is fairly easy and setting up the app to play from iTunes was not complicated."},{"reviewerName":"Jerry L","rating":"5.0 out of 5 stars","reviewTitle":"Bueatiful sound, Bose still the best","reviewDate":"January 15, 2019","reviewText":"Fill my first floor with pure and powerful sound, so easy to connect. worty every penny."},{"reviewerName":"knicoles","rating":"5.0 out of 5 stars","reviewTitle":"Amazing Sound!","reviewDate":"October 28, 2019","reviewText":"Bose never disappoints. They are the leaders of sound far as I am concerned. This home speaker sounds Amazing!"},{"reviewerName":"Jessica F","rating":"5.0 out of 5 stars","reviewTitle":"Bose","reviewDate":"February 12, 2019","reviewText":"What a rich sound. Completely satisfied!!"},{"reviewerName":"Jdub","rating":"5.0 out of 5 stars","reviewTitle":"Quality sound","reviewDate":"June 24, 2019","reviewText":"I am limited to amazon music. I have Alexa in my living room and find myself listening to music on google/pandora in my living space. Bose delivers beautiful sound but google has better music,"},{"reviewerName":"Angel A Vargas","rating":"3.0 out of 5 stars","reviewTitle":"Alexa does not work","reviewDate":"May 16, 2019","reviewText":"The problem I encountered was that Alexa does not work outside of continental USA. Great speaker with big dissatisfaction."},{"reviewerName":"Carla","rating":"5.0 out of 5 stars","reviewTitle":"Love it!","reviewDate":"August 30, 2019","reviewText":"Love love love"},{"reviewerName":"MARCELO GENTIL","rating":"5.0 out of 5 stars","reviewTitle":"Item as described.","reviewDate":"July 1, 2019","reviewText":"Very Nice and Powerful!"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Lil speaker with great sound","reviewDate":"May 3, 2019","reviewText":"Great sound"},{"reviewerName":"Scott Macy","rating":"5.0 out of 5 stars","reviewTitle":"I love it!!","reviewDate":"August 28, 2019","reviewText":"A lot of my speakers seem to be limited in volume in this overly cautious age. This speaker can crank. It's crystal clear and I love the sound. The features and the Alexa integration are wonderful. Definitely worth the purchase."},{"reviewerName":"B'","rating":"3.0 out of 5 stars","reviewTitle":"Instructions are sooo small you can't even read them with a magnifying glass!","reviewDate":"The manufacturer commented on the review below","reviewText":"Not a good buy, and sure as hell not worth the price."},{"reviewerName":"Darren Xie","rating":"3.0 out of 5 stars","reviewTitle":"Doesn't connect to phone","reviewDate":"The manufacturer commented on the review below","reviewText":"only connects through Bluetooth and one device at a time. No Alexa access if you are using a oubluc wifi like college wifi, basically a decent speaker but no alexa or album display."},{"reviewerName":"maria","rating":"5.0 out of 5 stars","reviewTitle":"Size and sound.","reviewDate":"July 2, 2019","reviewText":"Love it, athough it was a gift I have one and love it."},{"reviewerName":"Shyamala","rating":"5.0 out of 5 stars","reviewTitle":"Like Bose style","reviewDate":"November 22, 2018","reviewText":"For home"},{"reviewerName":"Dionsio anaya","rating":"5.0 out of 5 stars","reviewTitle":"Quality sound","reviewDate":"July 21, 2019","reviewText":"Small compact speakers great sound"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Amazing!","reviewDate":"July 21, 2019","reviewText":"Amazing sound quality! Wish it had a remote! I use the Google Assistant on this speaker and it works great!"},{"reviewerName":"Juan J. Rojas","rating":"5.0 out of 5 stars","reviewTitle":"Sound quality is amazing","reviewDate":"July 2, 2019","reviewText":"Home main sound"},{"reviewerName":"Jairo Guardado","rating":"4.0 out of 5 stars","reviewTitle":"sounds great","reviewDate":"August 2, 2019","reviewText":"only issue I've had is that airplay doesn't always work, sometimes its distorted and I have to unplug and replug in the device"},{"reviewerName":"EVELYNN.","rating":"5.0 out of 5 stars","reviewTitle":"The delivery day is very important for me","reviewDate":"June 30, 2019","reviewText":"It’s was perfectly for my living room I’m so happy with my purchase. Thank you."},{"reviewerName":"Dana Magallán","rating":"5.0 out of 5 stars","reviewTitle":"Muy bueno","reviewDate":"December 5, 2018","reviewText":"Es lo máximo lo único que me puso triste es que el asistente de voz no viene para La región latinoamerica"},{"reviewerName":"Elaine","rating":"5.0 out of 5 stars","reviewTitle":"Bose","reviewDate":"April 6, 2019","reviewText":"AMAZING!!!"},{"reviewerName":"Carlos","rating":"1.0 out of 5 stars","reviewTitle":"And Brasil?","reviewDate":"October 5, 2019","reviewText":"Alexa is working in Brasil but Bose don't know. Terrible."},{"reviewerName":"Guillermo A.","rating":"5.0 out of 5 stars","reviewTitle":"I love it, I got 1 unit in every space including on the shower room vanity","reviewDate":"October 23, 2019","reviewText":"Great sound\nPerfect size"},{"reviewerName":"Emmanuel Adjei","rating":"4.0 out of 5 stars","reviewTitle":"Make a little bit bigger","reviewDate":"The manufacturer commented on the review below","reviewText":"Make it a little bigger"},{"reviewerName":"Eric","rating":"1.0 out of 5 stars","reviewTitle":"Concert in your home","reviewDate":"September 22, 2018","reviewText":"Update: this thing is trash compared to a real Echo, it’s slow, doesn’t understand commands now doesn’t even play music.\n\nEverything about it is perfect. The sound is unreal by far better then the Echo, Echo Plus and Apple Home. Absolutely worth every penny! Alexa works great."},{"reviewerName":"Gadget Geek","rating":"4.0 out of 5 stars","reviewTitle":"Amazing Sound In A Compact Package But Not Ready For Prime Time","reviewDate":"October 17, 2018","reviewText":"The Bose Home Speaker 500 is probably one of the finest sounding standalone speakers on the market, but the prime reason for selecting this over other Bose speakers is its supposed Alexa Smart capabilities – where it does not deliver!\n\nThe Bose 500 has clear, crisp, deep and wide sound reproduction, that one expects from a Bose speaker, in a compact 8” x 7” size. The Bose 500 puts much larger, much more expensive speakers to shame. It is unbelievable until you experience it! Every frequency is accurately reproduced and there is no sound degradation or distortion even at full volume. The speaker completely encompasses large areas with rich sound and I find myself constantly testing its sound and volume capabilities to find flaws – and I can’t seem to find any.\n\nThis speaker was primarily meant as a replacement for my kitchen speakers and so is kept in a corner on the kitchen counter. The open floor plan provides the speaker a sound landscape of 40 feet long x 20 feet wide x 9 feet high. The Bose 500 fills this space with rich stereo sound from this remote corner and it does not even require the entire volume range.\n\nSetup is easy but requires the Bose App from the iOS or Android stores. You are also required to create a Bose account, using an email address, before you can setup the speakers. Once logged in the app recognizes the speakers and you connect to it via Bluetooth, enter your wi-fi credentials, name the speakers and you’re ready to go.\n\nTo activate the smart portion of the speaker you need to login to your Amazon account that supports Alexa. The app also gives you options to add music services. As of 10/16/18, the following are the only supported services – Amazon Prime, Spotify, Pandora, iHeart Radio, Deezer and SiriusXM.\n\nYou can play music over Bluetooth through any app that supports external wireless speakers. However, except for Prime Music, you cannot ask Alexa to play music from any other service. When you ask Alexa to play music from Spotify she says “I cannot play Spotify Music on that device”. I contacted customer service and they confirmed that except for Prime Music all other service integrations are planned for the future – maybe early next year. That is just unacceptable for a speaker being marketed as “smart”.\n\nAmong the other cons is the lack of ability to include this speaker among groups of your other Amazon Alexa powered devices – which is a shame! Also, it can only be grouped with other Bose “Smart Home” speakers – not with older Bose speakers – which will definitely upset current Bose customers.\n\nAudible which is an Amazon service is also not supported. Airplay support is also planned for the future.\n\nAll Alexa Smart Home skills work well, I have not had any issues as yet.\n\nI am very satisfied with the quality of the speaker and the microphone capability even from across the room, but I cannot whole-heartedly endorse a product that looks to have been rushed to market. If you can live with using the Bose 500 as a “Bluetooth” instead of a “Smart” speaker for 6 months, I would recommend it.\n\nThe Bose 500 is a definite 5-Star product once these issues are resolved."},{"reviewerName":"AZ Customer","rating":"4.0 out of 5 stars","reviewTitle":"Stunning sound - and a few app quirks","reviewDate":"November 1, 2018","reviewText":"Smart Home Speaker 500 with Alexa voice control\nManufacturer: Bose\nAmazon price: $399.00\n\nThe latest entry in high quality home speaker systems is the new Home Speaker 500 from Bose. It plays music via Wi-Fi, Bluetooth, direct connection, or Alexa with control over most of the functions by voice commands. The home speaker market is heating up; Sonos pioneered the movement but now there is strong competition from Apple, Amazon, Marshall, and several others.\n\nTwo powerful drivers aimed outward from the sides provide unexpectedly wide stereo separation. The Bose signature sound is buttery smooth partly because it has been contoured to boost the bass and treble ends of the audio spectrum. Using the Bose Music app, both can be individually adjusted so if you don’t like the out-of-the box equalization, you can adjust it to your liking. You can control the Home Speaker three ways: tapping buttons on top of the unit, from your phone via the Bose Music app, or by using Alexa voice commands.\n\nIn my testing, Wi-Fi streaming, Bluetooth and direct-wired connections work very well. There is a 3.5 mm (1/8 in) Aux-in port on the back of the speaker so a direct connection from any preamplified source is possible. The Bose app plays music from Amazon and other recognized services such as Spotify, Deezer, Pandora, and others. Alexa controls only Amazon Music, unfortunately. Apple Music is not supported but AirPlay 2 is promised for early 2019. Audible is not yet supported ether but I am hopeful that service will also be added next year. The user interface of the free iOS proprietary Bose Music app leaves much to be desired. Finding your way around its multiple screens is frustrating and often leads you in circles. However, you can stream any and all music via Bluetooth from your own devices. Don’t leave it set on Bluetooth when you are done since it doesn’t disconnect on its own. Later on, you will hear your taps and clicks when using your phone for other purposes. The Alexa app is still evolving with frequent updates but still needs further improvement. Alexa always exhibits its own quirks but since I’m not a power user, I get by.\n\nEven though I have very strong Wi-Fi coverage and plenty of bandwidth, I occasionally see messages in the Bose app saying that there is trouble connecting or to come back later for upgraded content. One message told me that audio actions were not supported on the device but in fact, they were working as designed.\n\nApp quirks aside, Bose Home Speaker 500 sounds sensational: beefy, rich response at higher volumes and smoothly intimate sounding music at normal living room levels. There are six preset buttons on top of the speaker. If you like a particular music service or playlist from your library, you can make a preset for it. Also on the top of the speaker are buttons for Play/Pause, Bluetooth, AUX, and two Alexa buttons, one for physical control and one for muting the mics. There is an eight mic array built into the speaker making it very sensitive. Your voice commands will be understood even if music is playing.\n\nThis speaker sounds so good that I really want to give it a five-star rating, but the Bose app makes use and navigation bewildering and Alexa is problematic. User interfaces shouldn't be this complicated. Choose Bluetooth for the majority of your listening and you'll be delighted with the ease of use and the incredibly great Bose sound."},{"reviewerName":"Brent Butler","rating":"3.0 out of 5 stars","reviewTitle":"I expected more","reviewDate":"October 21, 2018","reviewText":"If I weren't expecting Bose quality from this speaker, I'd give it four stars. But for the Bose reputation and price, this just doesn't hold up.\n\nWhile I see that another reviewer reported that this speaker sounds good at maximum volume, that's just nonsense. The distortion at maximum volume is obvious and annoying. And the minimum volume is so low that I can barely hear it sitting 18 inches away. They should have done a much better job on the volume range.\n\nThe sound is good for vocals and some rock. For classic jazz and classical symphony, I wasn't impressed, The performance of this speaker was no better than other wireless speakers I have at half the price point or less.\n\nThe Alexa support works, but it doesn't coordinate with Amazon sourced Alexa products, which is a drawback.\n\nTo get Alexa going, you will need to install the Bose Music app. I couldn't find it here for Amazon tablets, so I used my wife's phone and got it from Google play. The process was straightforward, but it did require me to type in user names and password three times, which is a pain in the neck on a phone, at least for me.\n\nI'm not sorry I have it, but I will keep it's limitations in mind as I use it. If I were comparing products for a purchase, this is not the one I would select at this time."},{"reviewerName":"Jeffrey N. Fritz","rating":"2.0 out of 5 stars","reviewTitle":"Unimpressive As an Alexa Device","reviewDate":"October 26, 2018","reviewText":"Maybe I’ll feel differently later, but right now I find myself asking what’s the point when it comes to the Bose Home Speaker 500. The sound is fine for casual listening and with plenty of volume. It’s the “Alexa built-in voice control” that threw me. You see I expected this to be a full range speaker that was also a full-blown Alexa device. It’s not that at all.\n\nThis is a fair sounding speaker that uses Alexa to control the music but it can’t do many of the things that Alexa can do. Basically, it can only select songs from certain music services. The only way to get Alexa’s attention is to press a poorly marked button on the top. In fact, the only way to get full Alexa functionality with the Bose Home Speaker 500 is to pair it to an Echo or Echo Dot with Bluetooth. In this case this becomes nothing more than a Bluetooth speaker. Color me unimpressed."},{"reviewerName":"Tom Steele","rating":"5.0 out of 5 stars","reviewTitle":"I would give it 10 stars if I could!","reviewDate":"October 16, 2018","reviewText":"I am not a Bose fanboi. In fact, I'm pretty critical of the Bose System that is in my Corvette and feel like it is nowhere near the quality of other, far less expensive car sound systems.\n\nBut this thing blows me away! It is almost flawless.\n\nI'll start with sound quality. I own several Amazon Alexa enabled speakers, and only one of them approaches this quality and it costs more and is much larger. The sound on this is simply STUNNING. Crystal clear highs and tight, crisp, punchy bass that isn't overwhelmed or boomy and rattled.\n\nQuite honestly, I would rate it as audiophile quality. It is superb. I could rant about the sound quality, but there are several other things to like about it as well.\n\nIt has a small screen. That screen shows the album cover, artist and title and looks very nice. It also shows things like volume level. It is very nice.\n\nThe setup was tedious, but straightforward. If you are enabling Alexa, have your Amazon passwords and usernames ready and be prepared to download the Bose Music app (don't accidentally download the Bose connect app, that isn't the right one and won't work) and create an account for Bose. Another account to keep up with...\n\nWe have Amazon unlimited music, so we had to sign in to that too, with exactly the same credentials as the Alexa stuff.\n\nBut, once that is all done, you can treat this thing just like an Echo. You call it Alexa and tell it to play music, or do anything else Alexa does, and it does it. It just sounds better doing it...\n\nDid I mention the sound quality? Wow it sounds great.\n\nThe app is a little spartan, but effective and at first I wasn't sure about adjusting the EQ, but it does have a simple Bass/Treble EQ that helps in my opinion. I like to run the Bass at 30 and the Treble at 40, but you may need more highs depending on your hearing loss. And some songs sound good at 40 bass. I played around and even at 100/100 it sounds good. (Not volume, EQ - I ran it about 60% volume before it got pretty loud for my spacious kitchen.)\n\nAnd it sounds incredible.\n\nIt has a neat feature, it has six presets. This is the only REAL ding I found. It couldn't save my wife's Christian music playlist as one of the presets. That would have been very nifty to be able to just press a button on the front and have it start playing the thing we listen to most often. But I don't suppose it is that hard to tell it do play it.\n\nThe unboxing experience is like an apple copycat. It is very good, but not QUITE as classy as apple. But really, it is still very good and I'm too old to care about unboxing anyway. It is packaged nicely and easy to get out. It has a protective cloth bag and none of that sticky plastic stuff.\n\nIt sounds amazing too!\n\nIn short, this thing is so close to perfect that I can't find any serious flaws. Just nitpicking. I'd give it 10 stars if I could. It is REALLY good!"},{"reviewerName":"CK","rating":"5.0 out of 5 stars","reviewTitle":"Powerful sound","reviewDate":"October 11, 2018","reviewText":"I bought it at Best Buy and I am very very impressed with the sound quality and volume. The 500 plays loud without any distortion and you can adjust highs and lows with the bose app. Imagine grouping 3 Echos in one spot that's how powerful the sound is. The microphone's will pick up your voice commands even at high voulume.\nThe only thing that is really missing is an off button on the unit itself. Instead you have to use the Bose app to put it in standby or tell Alexa \"off\" which will turn the music off but it takes another 15 minutes before the display shuts off.\nI highly recommend the bose 500 speaker."},{"reviewerName":"PD","rating":"5.0 out of 5 stars","reviewTitle":"Bose Never Disappoints","reviewDate":"January 4, 2019","reviewText":"We have an 18'x15' office next to the family room where the home stereo is, and due to how the home is built we really can't here the music in the office from the family room. So enter this crazy Bose speaker 500. I set it up in our office and in an almost 300 sqft room you wouldn't think this one unit would truly fill the room, but WOW, does it! I added a Bluetooth transmitter to the stereo in the family room and I paired the Bose to that. Voila, the office is filled and I mean FILLED with the music from the other room. But even if we don't use that, I can turn on my iPhone or iPad's BT and connect to the speaker without having to go over to the Bose unit and press any buttons, etc. I just pair to it and send music and it plays. Pretty much anything that transmits BT will work. You can use the Bose app if you like but it's not mandatory. I know there is all the Alexa integration which is fine if you use those devices, but we don't, we have all iOS stuff. Supposedly AirPlay2 support will be coming, I assume by a firmware update but even until then, this works GRAT as an on-demand Bluetooth speaker. The term \"speaker\" doesn't really do it justice, this Bose Speaker 500 is a SYSTEM. I can't get over how good it sounds. Expensive and worth it."},{"reviewerName":"Family7","rating":"5.0 out of 5 stars","reviewTitle":"Unreal, premium quality. Well made. And an unsurpassed sound!","reviewDate":"October 18, 2018","reviewText":"Absolutely unreal! I am so happy that I got this for my family. My wife loves it as she is in the kitchen a lot and now she doesn't have to check her phone in order to change music or check the weather, etc. All she has to say is \"Alexa....\" and this product does it for her.\nThe sound quality is unreal. When i was first setting it up, i plugged it into the wall outlet, and about 40 seconds later this turning on sound came on which really startled me... it was immersive! Music is really crisp, i mean really! And the sound goes all over our house, it is so unreal that a small device such as this can do that.\nYou will need to simply plug it in, then download a free app, Bose music, and follow the prompts to connect it (took literally 4 minutes for everything). You can also pair it via bluetooth first.. but i paired it via the app.\nThe device is also pretty heavy.. good heavy, meaning it is truly quality and premium. And when you play a song, for instance from Pandora, it displays the artist on the Bose speaker, its really cool!\nOne thing, that needs work, is the speed at which you want the song to process and work. For instance, i asked \"Alexa, play next song\" via Pandora, and it takes about 10 seconds to process - again, i wished this happened faster.\nOverall, excellent and simply amazing!!! Bose definitely surpassed my expectations, and this is my first Bose device.\nI hope my information was helpful to you. Thank you."},{"reviewerName":"Parker-Moore Family","rating":"3.0 out of 5 stars","reviewTitle":"Not as loud as I thought it would be","reviewDate":"November 16, 2018","reviewText":"Sorry, this video is unsupported on this browser.\n Not as awesome as I thought it world be given the price. It’s not that loud, set-up twice on iPhone and iPad separately, took a few tries to set it up and it can’t be connected via Bluetooth to both at the same time. I was excited about it connect to amazon and Alexa but needs to be further away from my Alexa speaker since they both responded. But the deal breaker was the sound volume. I have another Bose speaker to try out, this one just disappointed."},{"reviewerName":"Customer","rating":"1.0 out of 5 stars","reviewTitle":"No google assistant","reviewDate":"The manufacturer commented on the review below","reviewText":"At this price point, it is a huge disappointment."},{"reviewerName":"rsn","rating":"5.0 out of 5 stars","reviewTitle":"Awesome package, but not for the faint hearted.","reviewDate":"May 11, 2019","reviewText":"I decided to buy this after seeing all the mixed reviews, I had recently eyed these in the best buy where i tried the demo and comparing with Sonos it did not look good so i passed on, recently i had seen it in a store in my home country and was impressed by its sound quality (i only tried the Bluetooth feature at that time) so i decided to buy, had to shell out 487 usd for this including the shipping and the import fees ! in my country\n\nAs i returned home and tried it , i understood why all the mixed reviews of connectivity issues were there, the app itself is decent, but on the second attempt it connected and worked well and i have the habit of frequently moving it around the house and my house has a single WiFi and some range extenders (repeaters) so i experienced occasional connectivity issue when moving between router and repeater , this could explain the issues some people were facing in the reviews , just reset the router and its good to go , because i live in a location where Alexa is not supported it did not work but there is a workaround : just while registering the device select a country that supports Alexa and it will work , if you haven't done it in the first time just reset the device by holding the volume low and aux buttons together and register again with a new email address it should work , personally i have a amazon prime and spotify premium they work well with the system , if you are even a little handy with tech the connective issues are quite easy to fix , now after few days i am not experiencing any connective issues whatsoever. coming to the audio , this is my first Bose system and i have had jbl speakers before and i am not a person one would refer as an audiophile said that the sound is impressive , more bass than expected, i prefer to use it with the default bass 0 and treble 0 in the app, but for the occasional song i use bass 40 and treble 20 and its awesome . for some reason or the other the bass is named as speaker in the android app while its fine with apple ios. since the unit contains two drivers firing sideways to give you that virtual stereo sound , placement of the speaker affects the audio quality , which i quickly noticed as i was moving these speakers wherever i am going , so far what i noticed is if you set it up as i have near a corner as shown in the picture you will probably get the best sound and its far better , not that you cannot set it in any other position just that this gives the best results for me , i like this speaker very much i feel the price is slightly on the higher side. so made a box and started putting my cash in it that i would have spent otherwise on things i will not remember in few days and so far half way through ! makes it even more juicy . you will appreciate things which you really want and had worked for it ...so enjoy, by the way the WiFi streaming has better audio that Bluetooth and flac through Bluetooth and aux sounds awesome , Alexa works well too the mike array picks the voice very well and the physical buttons means i don't have to pick my phone while i am studying so all in all a good deal"},{"reviewerName":"Amazon Customer","rating":"4.0 out of 5 stars","reviewTitle":"Great sound quality","reviewDate":"November 3, 2018","reviewText":"The Bose speaker is a great complement for my Alexa. We put it in a different room from Alexa, where now we can listen to all of our Amazon Music unlimited. The sound quality is fantastic. We like controlling it both from the phone app and by our voice.\n\nSET-UP\nIt was so easy to setup -- took just a few minutes. We set it up so anyone who is using our wi-fi can stream to it as well if they download the Bose app, which will be fun for houseguests to use.\n\nIN-USE\nThe small screen displays the album covers -- it's a nice feature that lets you quickly/easily see what is playing. There are some easy-to-use features in the settings -- adjusting bass, treble, setting a clock display when on standby, and auto dimmer, which adjusts based on the light on the room. It came with an app called \"Tune In\" for podcasts and stations, etc. You can also add your Pandora and Spotify app. The unit is sleek looking (we got the black one).\n\nOne star off for minor functionality issues: I have trouble quickly pausing or stopping a song remotely. If I'm in the room with the speaker and it’s playing loudly, Alexa doesn’t hear my commands. I have to open the Tune In app and select Pause, which takes too long. It would be nice if the Bose had voice control directly."},{"reviewerName":"PATOLA","rating":"5.0 out of 5 stars","reviewTitle":"Excellent Product, Quality Sound","reviewDate":"October 26, 2018","reviewText":"If I had to describe this in one word, I would say \"incredible\". We are a family of Alexa users, but there is none in my son's room. He is a music fan so this was perfect for him.\n\nAlthough setup was straight forward he did have to download the Bose app and then log into Amazon Alexa and Pandora. But once past that, everything was smooth sailing.\n\nHe can play music that is on his phone via Bluetooth or he can play Pandora or Amazon music - the music choices are endless and they sound so darn good.\n\nBose is known for their exceptional sound quality and this speaker 500 doesn't disappoint. The sound fills the room with deep reach bass and crisp highs. The sound stays true at higher levels with no distortion. It is just superior sound quality.\n\nAs far as using it, there is a display on the front that shows the time and when playing music it will show the artist name and album cover if available. From the Bose app you can manage everything from volume to EQ settings. My son set the EQ from the app, but hasn't used the app too much more. He controls it totally with his voice now.\n\nI am waiting to see what future enhancements are included for this Bose/Alexa combo. I think they are off to a good start.\nHighly recommend."},{"reviewerName":"kev6677","rating":"3.0 out of 5 stars","reviewTitle":"DOES NOT WORK PROPERLY WITH IPHONE","reviewDate":"The manufacturer commented on the review below","reviewText":"Very disappointed with the software designers at Bose, be forewarned if you have an ios devise with 13.1 and above the slider volume controls will not work properly with your Bose smart device. In otherwords the app is useless in controlling a basic thing like volume. Also note the bose app is lacking basic features like the ability to change sources and their is also numerous rumors of HDMI Arc issues when connecting with other devices to your smart TV. For the premium price paid this is a total failure, the sound is not even mind blowing, only good add the poor app functionality and there is nothing smart or innovative about there new line of products."},{"reviewerName":"A. Ryan","rating":"4.0 out of 5 stars","reviewTitle":"Fantastic Sound Quality","reviewDate":"January 4, 2019","reviewText":"Like most every other Bose speaker that I have owned or heard, the Bose Home Speaker 500 has amazing sound quality. Among the best I have heard for a speaker of this size. I'm seeing many users saying that they have had a difficult time setting up this speaker, but I did not experience that. Setup seemed fairly easy.\n\nAlexa does work well, BUT...be advised that there are many Alexa features that are not supported by this Bose speaker. For example, I set up a morning routine that would turn on lights, turn up the thermostat, give me the weather and my flash briefing. When I tell Alexa on the Bose speaker to run the morning routine, I get a message \"Sorry, routines are not supported on this device.\" The weird thing is that the routine will still run. So, not sure what's going on there. You also can't communicate with other Alexa devices with this. I do have the unlimited Amazon Music account, so any and all music I have asked for has played with no problem. Apple music is also now supported on Alexa, so I can use the Bose speaker to play my apple music playlists as well.\n\nThe Bose 500 also has 6 \"preset\" buttons that can be set to play different playlists as well, but I can't really see the advantages of that, when I can just ask Alexa to play any playlist I want. Seems like an unnecessary feature.\n\nI do appreciate that the Bose 500 has a small color screen on the front, because it's nice to see the cover of an album when a song is playing, and also, when not in use, it will display the time.\n\nOverall, I'm very happy with the Bose 500. I just wish that all Alexa features were supported."},{"reviewerName":"Christine","rating":"3.0 out of 5 stars","reviewTitle":"Great sound but flakey response time","reviewDate":"The manufacturer commented on the review below","reviewText":"We have a ton of Echo'es in our house so we are definitely devotees of the voice activated household tool. We have this Bose in our living room because it is the biggest device and, of course because its a Bose which is known for great products.\n\nThe sound on this device is great. Its loud and clear, and plays music great. I think the voice activation and response sadly, are really lacking. Quite frequently we have to repeat ourselves numerous times, or she stops or doesn't play anything at all. Its kind of as if there are blips where it has no internet connection. It only happens when we say a command and not during playback of a song.\n\nThe screen is also great, with a bright and clear digital clock and it also shows album covers. We have it too far away from where we sit to really enjoy the screen but as a living room radio its great quality, if only the voice command and response time weren't so flakey"},{"reviewerName":"Amazon Customer","rating":"4.0 out of 5 stars","reviewTitle":"Excellent sound","reviewDate":"November 17, 2018","reviewText":"I love the sound that comes out from a Bose speaker. It has massive amp and really tastefully designed. Only thing that I have is that is does not seem as easy to set up as it should, the volume does not work with voice control to Alexa but with the phone and I am not sure I have fully utilized all its features. But for now, it does play my music and tells me the temperature - which my previous echo did just as well, but without the amazing sound system."},{"reviewerName":"somethingexcellent","rating":"4.0 out of 5 stars","reviewTitle":"Big Sound From a Small Unit","reviewDate":"November 16, 2018","reviewText":"The Bose Home Speaker 500 has been a fun addition to our home sound system options. I like to listen to Spotify or Amazon music while I work. My job requires moving around between a couple of different rooms. The sound on this unit is loud enough that I can hear it from the other room. I listen to music from my phone and am able to wander up to another floor before the connection glitches out. The speaker was super easy to set up. Just plug it in and you are ready to go. There is an app, which I downloaded. I was also able just to connect my blue tooth and play Spotify without the app. This is great if you have friends who want to play \"guest DJ\" and play their Spotify playlist. The Alexa aspect is cool, it's fun to be able to verbally ask Alexa to play a song or type of music. This unit is not cordless, which in my opinion is the only drawback. I have another bluetooth speaker that is cordless and can carry around from room to room. The sound on the Bose 500 knocks the other speakers out of the ballpark though, so I'm happy to unplug the unit to move it to another room."},{"reviewerName":"bike rider","rating":"4.0 out of 5 stars","reviewTitle":"The ultimate in flexibility and good sound.","reviewDate":"March 22, 2019","reviewText":"I did not get my Bose Home Speaker 500 on Amazon (bought it at a local Bose outlet store) so not sure if this review makes it in. But none the less:\n\nI am in the process of returning a Yamaha MusicCast 50 that also had very good sound for a table top. I was just getting frustrated with its flakiness (you can see my review for it on Amazon) ... I just cut/paste this part of that review here:\nAfter deciding that the Yamaha was not quite as baked as it could be I stopped into a Bose outlet. I'm generally not a Bose fanboy ... high price for what you get. But this Yamaha is very expensive too. So I took a look and listen of course. I listened to the Bose Home Speaker 500. It looks like the MusicCast 20 ... so smaller than the MusicCast 50. I was skeptical but let me tell you ... It sounded about the same as the MusicCast 50 to me. Also it seemed to have better app integration for me. E.g. It supported Amazon Music in addition to Pandora, Spotify, TuneIn, ... and intriguingly it had Alexa support. So I took it home for a test run.\nLike I said, it sounds pretty darn close to the MusicCast 50 so that was good. But it was the app support and easy install that blew me away. The initial setup was flawless and intuitive. Yeah I got the Yamaha up but It took a little head scratching (good thing I'm a bit of techy) ... like really it tells me to connect to a private yamaha network to finish the install AFTER the initial connection on the main network timesout ? .... geese. And then you kinda sit there waiting to see what happens next and then it seems to work ... But man , its not a good setup but was able to get through it. On the Bose it just was one two three done. wow. No private network. Just connect and sign into apps.\nThe Bose also had more presets (6 vs 3).\nBut the BIG BIG separator is Alexa. I never used Alexa before so was not biased. I am now an Alexa Fan boy :) !!!\nI could just tell it to play my favorite station or genres and Alexa would go off and find the station or music where it could find it. It defaults to Amazon Music for music search but you can have it default to Pandora/Spotify etc.\nNow its like ... who needs preset buttons?! It totally changes the ease of use and flexibility of the device. Not the least of which is its a full Alexa implementation .... so \"Alexa , whats the weather today?\" :) :)"},{"reviewerName":"Matt Bailey","rating":"3.0 out of 5 stars","reviewTitle":"Great Sound, Not a Great Smart Speaker","reviewDate":"The manufacturer commented on the review below","reviewText":"If you have multiple Alexa devices I would not recommend this. It doesn't have ESP so it will interfere with your other Alexa devices. You can't change the wake word so you have to change any other Alexa devices to something else. Not great at activating smart home products that Amazon made Alexa devices activate with ease.\n\nThe sound is great, but not so great that it is worth the price. I bought one of these at an Amazon store and returned it in about a week. For much less money I bought two Echo Pluses and stereo paired them for even better sound. Works great with my smart products and unlike the Bose it can do multi-room music."},{"reviewerName":"Jeff Wignall","rating":"5.0 out of 5 stars","reviewTitle":"Alexa now rocks the house","reviewDate":"October 21, 2018","reviewText":"I love having an Echo in almost every room and Alexa and I have a very special relationship, lol. We say good morning to one another, goodnight, she tells me jokes, she reads me the news (and knows my first name), etc. And I *love* that she plays music for me--even obscure music like Jellyroll Morton--at my every request. But good as they are, her speakers are just barely adequate. Enter this Bose 500...\n\nHoly cow! Fantastic sound quality and so great to finally pair Alexa's depth of music with a quality Bose speaker! Even when I have it at like 10% power, the fidelity and range are fantastic. I'm not an audiophile by any means but the quality of this speaker just jumps out and grabs you instantly. Alexa, play some Van Morrison from my playlist...\n\nBy the way, I have a Bose system for my TV too and that made me realize just how miserable the speakers built into most (all?) TVs really are...there's no going back."},{"reviewerName":"Glen S.","rating":"1.0 out of 5 stars","reviewTitle":"Would not connect","reviewDate":"The manufacturer commented on the review below","reviewText":"Product is trash. Terrible connection . Keep on asking me to connect Bose 500 via Alexa Ap. There is no ap tor that . You can’t ask to play amazon music via Alexa. You have to connect via amazon prime ap , via Bluetooth . What’s the use of Alexa if it can’t take commands. Honestly sound quality is terrible. No famous Bose base. All in all trash"},{"reviewerName":"Here is my honest opinion","rating":"4.0 out of 5 stars","reviewTitle":"A little buggy","reviewDate":"November 7, 2018","reviewText":"I am a big fan of Bose and have lots of their stuff. The sound on this is not as my SoundTouch 20. Both this and the SoundTouch are a little buggy. The SoundTouch is 2 years old and seems to be much more stable now, so I have hope for updates on this 500.\n\nI have not been able to get my Pandora to work with this (but I haven't had time to really study it), but Amazon Music works well. I am primarily using it as a very over-priced Alexa. But, I have confidence that updates will make this more useful to me. I really wish it integrated with my SoundTouch. I have a Sonos system in my house and really like having the speakers work together or separately. With this, I am using totally different programs to even run them.\n\nI like this, but feel like Bose is not moving fast enough to keep up with other companies' systems."},{"reviewerName":"bobmomusic@hotmail.com","rating":"1.0 out of 5 stars","reviewTitle":"Good sound, bad everything else","reviewDate":"The manufacturer commented on the review below","reviewText":"This is a good-enough sounding speaker, when it works. Probably higher fidelity than most of these stand alone bluetooth devices, since it is the highest price of the bunch and must live up to the Bose name. However, the setting up and staying on through bluetooth sometimes works, shuts off, and has to be dealt with again and again. Haven't gone on to the Alexa part and don't have much interest there. I'm really sick of it and would return it in a minute if it wasn't a frequent flyer 'reward' item. In general wireless technology is ahead of of its usability in the race to the marketplace and I lament the passing of good old analogue audio inputs that work first time and every time."},{"reviewerName":"Hodgepodgerama","rating":"1.0 out of 5 stars","reviewTitle":"NOT really an echo. Just another bluetooth speaker","reviewDate":"November 9, 2019","reviewText":"I have 8 echos in my home and am sort of an audiophile, with 3 other stereos in the house as well as a handful of Bose bluetooth speakers. My wife thinks turning on the stero in the family room is too complicated and the echo in that room is only OK, sound-wise, so I bought her one of these thinking it was an Echo with a Bose speaker. Big mistake. It is a Bose with SOME Alexa features (it will control my lights) but not the features you want the Bose for. Alexa will not play spotify. Alexa will not play Pandora. Alexa will not play SiriusXM. Alexa will not synch up with other echo devices in the house. Bose wants you to use THIER app to do all those things and they want you to buy other Bose speakers to synch up with in the rest of your home. Yeah....well...sorry Bose, that's not what I want. Returned it."},{"reviewerName":"snowman2ski","rating":"2.0 out of 5 stars","reviewTitle":"Buggy, glitchy, expensive... hard pass.","reviewDate":"May 22, 2019","reviewText":"I got this for my husband for his birthday because he loves Bose products. He was so excited to open it but we both decided that we think that this was a waste of money. Very disappointed. We replaced an echo with this product thinking it would integrate with our other Bose smart speakers around the house and would sound better. It does sound better and that’s about it. The Alexa Integration is very buggy. You give her a command and about half the time she does what you ask her to do. It does not integrate at all with any of our other Bose smart products. Overall, we are both very disappointed with this product and wish we didn’t buy it."},{"reviewerName":"Lars Bergstrom","rating":"5.0 out of 5 stars","reviewTitle":"Expensive, but far better quality than previous Bose and other Alexa-enabled home speakers","reviewDate":"October 25, 2018","reviewText":"The room-filling sound quality of this device is better than all of the older (and more expensive) SoundTouch speakers. Even if you ignore all of the Alexa capabilities, this is a superior device.\n\nMy only disappointment was with the Bose Music app. In addition to being yet another app (different from Bose Connect for headphones or Bose SoundTouch for all the other speakers) it requires a login and was much flakier for pairing the speaker out of box than the old SoundTouch app. I'm also afraid that it looks like you can't play the same stream across this speaker and your existing SoundTouch speakers."},{"reviewerName":"Debasis Goswami","rating":"4.0 out of 5 stars","reviewTitle":"It does what it says, but may fall short of expectations","reviewDate":"November 10, 2019","reviewText":"I personally tested this in a brick and mortar store and decided against this and instead bought the Bose Bookshelf pair from Amazon. Let me explain why.\n\nI have a small bedroom that needed a stereo speakers for TV as well as some streaming devices.\n1. This doesn't support Chromecast.\n2. Lack of input choices.\n3. Doesn't work for TV.\n\nIn the end, a high end Denon and a pair of Bose speakers did everything.\n\nIt doesn't matter how good HS500 sound is, it will never match the true and deep stereo output of the bookshelf speakers.\n\nThat said, it is a nice machine, just not for me."},{"reviewerName":"butlerbkoolmom","rating":"4.0 out of 5 stars","reviewTitle":"Damn Shane. So much potential wasted. Deceptive TV compatibility issue.","reviewDate":"November 7, 2019","reviewText":"Very frustrating to set up play my personally uploaded iTunes catalogue. I find I often have to turn the Bluetooth off on my other 2 iPhones and iPad. I thought it was playing via my wireless network but who knows. The sound quality is quite impressive; I am a passionate music lover. I purchased 2 500’s. Took and bit of experimenting now consistently playing from the source I want to hear. Now the things that it does extremely poorly. Bluetooth connection to my LG OLED 55”E8PUA (picture on glass) has a infuriating delay. I also got a DVD of zeppelins rare concert footage and could not look at the picture and enjoy it. Why I thought since my $89 Pulse 4 portable wireless speaker worked seemlessly with my TV that the $900 2 Bose 500’s would sound better, idk. Also, I don’t want Alexa or google or anyone else to listen to me. I run an illegal bookmaking operation in Nevada, so...."},{"reviewerName":"M. Matthews","rating":"4.0 out of 5 stars","reviewTitle":"Gorgeous Sound; Limited Connectivity for Apple Users","reviewDate":"March 6, 2019","reviewText":"First, this speaker sounds wonderful, with plenty of detail for classical music. It's a little light in the bass, but marvelous in the mid and upper ranges.\n\nIf you are an Apple user, though, this speaker has limitations. In a nutshell, you can only connect via Bluetooth, and it only supports one Bluetooth device connection. Switching from my iPhone to my MacBook is a total pain. Also, it doesn't support Apple Music, even though my Amazon Echo does. Here's hoping for some firmware updates with Airplay and/or Apple Music support in 2019."},{"reviewerName":"D. Woodruff","rating":"5.0 out of 5 stars","reviewTitle":"Fantastic Sound, Alexa Integration","reviewDate":"January 2, 2019","reviewText":"Let's start with what's great. The Bose Home Speaker 500 has loud, booming sound from a relatively small package with no distortion even at the highest volumes. It can fill a large room with enough sound that it'll start to resonate off the walls. It also has Alexa voice control. It's as accurate as any Echo device that I own, so well done. In fact, the only thing I don't like about this unit is that you can't add it to an Echo group for playing music across multiple devices. Hopefully a software upgrade will enable that functionality in the future.\n\nIf you're a Bose fan or if you want a killer bluetooth speaker with voice control you simply can't go wrong with this speaker. It's just plain awesome."},{"reviewerName":"D. Matlack","rating":"3.0 out of 5 stars","reviewTitle":"A bit pricey if you are not a big Alexa user","reviewDate":"October 25, 2018","reviewText":"Basically a high end Alexa. If you use Alexa a lot in your house hold than this is the version for you since it does have the heavenly Bose sound. But if you are not a big Alexa user, for example here where I live our internet is spotty, slow and easily affected by the weather this might be a bid ostentatious for purchase."},{"reviewerName":"Evan Jacobs","rating":"4.0 out of 5 stars","reviewTitle":"Better bass!","reviewDate":"November 6, 2018","reviewText":"So, you want an Amazon Echo but you want better bass response? This may be the unit for you. It's sort of like an Echo on steroids. It's bigger and beefier. It's also sounds better (although the Echo is no slouch in that department). It has a display which the regular Echos don't have. In use, I find the regular Echo seems to hear me a bit better and is quicker to respond to queries. You can control this one via an app but I miss the remote that the Echo uses."},{"reviewerName":"AreYouKidding?","rating":"5.0 out of 5 stars","reviewTitle":"Solid speaker, amazing sound, good Alexa integration","reviewDate":"March 16, 2019","reviewText":"A solid, well built speaker with room-filling sound. I have this in my workout room and I'm a big fan. Alexa integration is good but not perfect. There is a slight delay after initial wake command vs. the other Echo devices around the house. The screen is also not as useful as our Echo Spot or Echo View. E.g. no timer shows when that skill is being used. The screen is really just limeted to showing the clock or whatever music is playing. Still very satisfied as this absolutely rocks when it comes to music."},{"reviewerName":"(¬‿¬)","rating":"5.0 out of 5 stars","reviewTitle":"Gorgeous","reviewDate":"October 22, 2018","reviewText":"This is a small speaker with big sound. My son played around with it all afternoon with his app, then the family had a go with Alexa. She's not smart enough for my taste, but she can do things like turn the volume up and down hands-free. The speaker itself is beautiful and heavy for its size. I can really hear the base, and the music just fills the room, crisp and clear. Bose really lives up to its name with this one."},{"reviewerName":"Jason Stokes","rating":"5.0 out of 5 stars","reviewTitle":"Easy setup, easy to use, great sound.","reviewDate":"February 8, 2019","reviewText":"I really like this. We have a few Alexa devices in our home, and this is certainly the best sounding and coolest looking - and it includes a small screen to see what's actually happening. Connected easily the first time, and easily allows Bluetooth and other connections to pump out the great sound you'd expect from a Bose product.\n\nMy only quibble with this product is the multiple apps needed to set it up with other Bose products. I already have other Bose products that use a different Bose app. That's weird."},{"reviewerName":"Method2Madness","rating":"5.0 out of 5 stars","reviewTitle":"Oh my God.","reviewDate":"October 15, 2018","reviewText":"This thing is CRAZY. I've never been one to drink the Bose kool-aid, but if everything sounds as good as this thing, I may be a Bose customer in the future.\n\nSetup was easy and straightforward. Once I downloaded the Bose Music app, I added my Amazon and Spotify accounts and was off.\n\nAlexa works beautifully, as does Spotify.\n\nI can't recommend this enough."},{"reviewerName":"Amazon Customer","rating":"2.0 out of 5 stars","reviewTitle":"Bluetooth issue","reviewDate":"The manufacturer commented on the review below","reviewText":"I bought Bose Home Speaker 500 at an official store. I really liked the sound which is crisp with very rich bass. While streaming by wifi had no issue, bluetooth connection had many many skippings during a song. I exchanged it with a new one at Boss store, which had the same problem, so I had to return the product. There was no bluetooth connection issue when I tried one of the speakers at the store, so it may be interference caused by environment. It is a pity cos I really liked the sound. Besides, those who use only wifi should have no problem."},{"reviewerName":"Geo3","rating":"1.0 out of 5 stars","reviewTitle":"doesn't work","reviewDate":"The manufacturer commented on the review below","reviewText":"Alexa doesn't work at all. Only response to commands is \"I can't do that right now.\" Only response to playing music is \"That device is offline right now.\" There are numerous problems on the Bose blog for these issues and the only response is \"try rebooting your router,\" or \"unplug the speaker for 2 munutes and try again.\" What a pathetic joke."},{"reviewerName":"Amazon Customer","rating":"3.0 out of 5 stars","reviewTitle":"Alexa is not available in PR","reviewDate":"The manufacturer commented on the review below","reviewText":"Although the sound quality is incredible, I bought this product with the intention of having Alexa as part of Smart House. Unfortunately, it does not work in Puerto Rico. I would like more information on when (estimated) I can use Alexa."},{"reviewerName":"KasaC","rating":"5.0 out of 5 stars","reviewTitle":"excellent product","reviewDate":"October 27, 2018","reviewText":"Easy to set up and sync with app on phone, the sound quality of this is as good as what has become standard for this brand. Having Alexa included only makes this item answer all needs."},{"reviewerName":"John","rating":"5.0 out of 5 stars","reviewTitle":"Sound is Amazing","reviewDate":"March 31, 2019","reviewText":"The sound is great. Has phenomenal base. And once it’s connected with app and internet there is no need for a phone to play the music if you already set up playlists for the numbers on the top."},{"reviewerName":"Predadactyl","rating":"1.0 out of 5 stars","reviewTitle":"Though set up","reviewDate":"The manufacturer commented on the review below","reviewText":"Sad"},{"reviewerName":"Dhruv Bajpai","rating":"3.0 out of 5 stars","reviewTitle":"Can’t be smart without Alexa ever getting connected!!","reviewDate":"The manufacturer commented on the review below","reviewText":"Connecting Alexa to it is a nightmare!! The Alexa store Bose apps suck. Period."},{"reviewerName":"Charles N Stone","rating":"1.0 out of 5 stars","reviewTitle":"Alexa doesn’t work","reviewDate":"The manufacturer commented on the review below","reviewText":"Alexa is not supported in some countries even where Alexa is available for other devices. This is not made clear in Bose information and you can only discover this by searching the Bose community questions. Deceptive advertising."},{"reviewerName":"Glenn GC","rating":"5.0 out of 5 stars","reviewTitle":"Elegant and sounds great","reviewDate":"August 16, 2019","reviewText":"Sounds amazing. I love the display. Alexa works great. Tried Google Assistant too for a while, but works better with Alexa."},{"reviewerName":"weeelson","rating":"3.0 out of 5 stars","reviewTitle":"Very disappointed","reviewDate":"July 9, 2019","reviewText":"Does not work as a group stereo speaker with bluetooth"},{"reviewerName":"Dennis Anderson","rating":"3.0 out of 5 stars","reviewTitle":"makes the AUX input useless","reviewDate":"The manufacturer commented on the review below","reviewText":"every time I plug a audio cable in the AUX jack I get a loud rapid pulsating sound. overbearing!!!"},{"reviewerName":"M","rating":"5.0 out of 5 stars","reviewTitle":"Good compact speaker","reviewDate":"February 23, 2019","reviewText":"I have both the echo and Home speaker 500. We get certainly much better sound from the Bose home speaker !"},{"reviewerName":"Angela Hill","rating":"5.0 out of 5 stars","reviewTitle":"Satisfied customer","reviewDate":"August 26, 2019","reviewText":"Excellent sound quality and reliability!"},{"reviewerName":"Pablo","rating":"1.0 out of 5 stars","reviewTitle":"Es compatible??","reviewDate":"The manufacturer commented on the review below","reviewText":"Es compatible con iPhone y Android???"}]}