{"title":"ICEWATER 3-in-1 Smart Water Bottle(Glows to Remind You to Stay Hydrated)+Bluetooth Speaker+ Dancing Lights,22 oz,Stay Hydrated and Enjoy Music,Great Gift","manufacturer":"ICEWATER","currentPrice":"$19.99","rating":"4.4 out of 5 stars","totalRatings":"592 ratings","features":["\n         Make sure this fits\n                by entering your model number.\n        \n","★【Funny Gifts】1 Hour Glows to Remind You to Drink More Water ,Funny Birthday Gifts for Women, Men, Best Friends, Coworkers, Mom, Dad, Her, Him - Stay Hydrated and Healthy,Enjoy Music","★【Bottle Materials】Water Bottle Materials Made in USA ,EASTMAN Tritan,100% BPA-Free Non-Toxic,NO Smell","★【Portable Wireless Bluetooth Speaker】360°Sound,Built-in 600mAh Battery,5W,Very Loud and Clear,Water Resistant,For Party,Yoga,Gym, Bike,Beach,Hiking,Pool,Shower,Camping, Outdoor","★【Resonant Design】Special Resonance Function,When Used on Wooden Tables Will Produce Strong Bass","★【Dancing Lights】Press and Hold the Pause Button,Turn on or off the Dancing Lights Mode,In Dancing Lights Mode,Lights Will Dancing to Music"],"reviewsAspects":["water bottle","drink water","smart water","reminds me to drink","sound quality","highly recommend","love this water","bluetooth","easy to clean","great sound","easy to use","water intake","works great","better than expected","lights up to remind","added bonus","worth the money","staying hydrated","forget to drink","bottle ever"],"productInformation":[],"productDescription":[],"reviews":[{"reviewerName":"David","rating":"5.0 out of 5 stars","reviewTitle":"Works as expected - Keeps me Hydrated","reviewDate":"November 12, 2018","reviewText":"So I wasn't sure I needed this, \"who needs a water bottle to remind me when I'm thirsty?\" But turns out I was completely wrong and I actually really love this water bottle! I really find the light up system helpful especially on busy days at work when I might forget to go grab that cup of water.\n\nThis 3-in-1 speaker really shocked me at how well it works! For it to be so small, the sound is both crispy and deep, very loud. You can have the colored lights dance to the music as well which I thought was a really cool. It goes with me on my bike, in my backpack, with me around the house...\n\nAll in all a great health accessory and a heck of a conversation starter."},{"reviewerName":"Clay","rating":"2.0 out of 5 stars","reviewTitle":"Best Value Smart Water Bottle - Terrible Customer Service","reviewDate":"February 28, 2019","reviewText":"AMENDED REVIEW:\nI'm really dissapointed with the customer service. I originally LOVED this water bottle (see original review below), but after a couple of months the charger broke, basically making it useless. When I reached out to them, they quickly informed me they'd send a new one, but never did. Unless you plan on purchases this several times, I'd say buy a more reliable one.\n\nORIGINAL REVIEW:\nSo I have had like 20 smart water bottles, and this is BY far my favorite, even before factoring in the great price. I used to have the Hidrate Spark and hated how you had to order replacement batteries from the company. While this one doesn't track your water intake, I absolutely love the light show I get every 2 hours to remind me to drink. I wish it was every single hour, but it does its job. Not only that, but the speaker volume is so loud when using it that way - it's amazing. Most other water bottles are 16 or 18 ounces, I love that this one is 22. Little things like the size of it, drinking spout, ability to recharge via USB, and closure all make a huge difference, as silly as that sounds. This is seriously my favorite water bottle ever!"},{"reviewerName":"Stephanie","rating":"5.0 out of 5 stars","reviewTitle":"Does what it needs to.","reviewDate":"February 18, 2019","reviewText":" I like this product. It tells you when to hydrate without being overtly annoying like others. It works by have the bottom turned on and the light goes up through the water and changes colors. I mention water as if it’s other than clear, the light doesn’t show up well. Its also great by being able to turn it off. For this price, that's amazing. I couldn't find any that did that. Charged through USB, so you'll never need batteries. I don't use it for the speakers to pay music so I just turn that feature off from disconnecting my phone."},{"reviewerName":"PoshGirl","rating":"5.0 out of 5 stars","reviewTitle":"Fantastic Product - a MUST have!!","reviewDate":"January 15, 2019","reviewText":"This water bottle is fabulous! It shipped quick, arrived on time and was easy to set up and connect to blue tooth. I am amazed at how great the sound is when playing music! My son also thought it was COOL! The best part??? It is SUPER affordable! Thank you! Big win!"},{"reviewerName":"Diamond","rating":"5.0 out of 5 stars","reviewTitle":"I’m in love with this bottle 🥰","reviewDate":"February 8, 2019","reviewText":"I love everything about this bottle! I’m a very skeptical person so I read every review before I actually purchased it. The reviews almost swayed me. Glad I decided to give it a try it was a great buy. This water bottle has truly surpassed my expectations. It reminds me to drink water hourly, the lights are nice and bright and the speaker is so loud! I can’t stop telling people about this bottle."},{"reviewerName":"Amber McConnico-Rodriguez","rating":"5.0 out of 5 stars","reviewTitle":"Husband adores it.","reviewDate":"January 17, 2019","reviewText":"I bought this for my husband for Christmas. He loves it. The sound is great and has a lot of bass. He brings it with him to conventions. He's never seen anything like this before, so he thinks the concept is innovative and genius."},{"reviewerName":"Bryan","rating":"5.0 out of 5 stars","reviewTitle":"Great as a gift!","reviewDate":"February 10, 2019","reviewText":"Bought it as a gift for the worship director at my church. He loved it. He hates drinking water but has found that the Bluetooth speaker makes him want to have it wth him and the notification light keeps him hydrated"},{"reviewerName":"LavoneMoltron","rating":"5.0 out of 5 stars","reviewTitle":"Love!!","reviewDate":"February 27, 2019","reviewText":"I love this water bottle. I cannot say enough how much I love this water bottle. It is so loud. It is the best little Bluetooth speaker that I have and it’s a water bottle and it lights up. It seems to be holding up to my very active life as well I have dropped it several times and have had no issues. I’ve got it soaking wet with also no issues."},{"reviewerName":"Alika","rating":"5.0 out of 5 stars","reviewTitle":"Fun bottle","reviewDate":"February 4, 2019","reviewText":"Love this bottle. Bought it for myself as a reminder to drink. Now hubby and the kids are constantly trying to steal it from me. Colors are beautiful and the speaker is pretty fun. Customer service is attentive and timely. Great purchase."},{"reviewerName":"Harley!","rating":"5.0 out of 5 stars","reviewTitle":"Hydration Motivation","reviewDate":"February 12, 2019","reviewText":"Just as described, this bottle has a little extra weight to it due to the lights and music, but it's a plus for my walks holding it. The lights make it fun and I find myself drinking more water since it's fun to use."},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Great gift","reviewDate":"December 16, 2018","reviewText":"Gave as a gift and she said how much she loved it and how well it woks I can’t wait to order myself one"},{"reviewerName":"Fabriel","rating":"5.0 out of 5 stars","reviewTitle":"Awesome!!!","reviewDate":"January 13, 2019","reviewText":"I love it!!! The sounds is awesome. It also reminds u to drink every hour. Great for working out. ❤️❤️❤️"},{"reviewerName":"Elizabeth","rating":"5.0 out of 5 stars","reviewTitle":"Drinking water in style","reviewDate":"January 16, 2019","reviewText":"I’m horrible about drinking water. This bottle sure helps me remember. It looks pretty also the ability to be reminded with music to drink water it’s a plus. Love it."},{"reviewerName":"JM Tuan","rating":"5.0 out of 5 stars","reviewTitle":"Great Product","reviewDate":"January 17, 2019","reviewText":"I bought this for my son as a Chrismast gift, and he loved it so much! The sound from the speaker is great and my son drink water more than before. This product works as I expect! Recommended."},{"reviewerName":"LaQuinda Tugman","rating":"5.0 out of 5 stars","reviewTitle":"Great buy!!!","reviewDate":"January 23, 2019","reviewText":"Smart! Yes it is! This bottle reminds me when to drink by lightning up. Life gets so busy that I forget to drink. The built in Bluetooth speaker is awesome! It’s loud and has a great sound quality. For the price I bought a second one as a Christmas gift to a friend and they absolutely love it!!"},{"reviewerName":"Lainey randolph","rating":"5.0 out of 5 stars","reviewTitle":"Highly Reccommend!!","reviewDate":"January 9, 2019","reviewText":"I bought this as a gift and she absolutely loved it. She had asked for just the reminder light up and when she found it about the Bluetooth speaker she was so EXCITED. She couldn’t wait to use it. The speaker is loud, sounds clear, and so easy to connect to your phone to play music. Definitely reccommend!!! The light up feature is awesome as well and a nice reminder for someone who forgets to drink throughout the day!"},{"reviewerName":"BSassay1","rating":"5.0 out of 5 stars","reviewTitle":"Cool","reviewDate":"January 28, 2019","reviewText":"Got this for a Christmas game. Awesome gift"},{"reviewerName":"Peace&blessings","rating":"5.0 out of 5 stars","reviewTitle":"Best little workout buddy, lol!","reviewDate":"March 2, 2019","reviewText":"I absolutely love this bottle. The way the lights dance when I'm playing music. The bass, when placed on a table expands the sound. I'm getting so many compliments on this little device."},{"reviewerName":"Polica t.","rating":"5.0 out of 5 stars","reviewTitle":"It's not made real strong..","reviewDate":"January 10, 2019","reviewText":"I really like the bottle everything the bottle says that it does it does.. I bought one and end up buying my daughters one too."},{"reviewerName":"Tobias","rating":"5.0 out of 5 stars","reviewTitle":"The best water bottle I have ever purchased","reviewDate":"November 20, 2018","reviewText":" I honestly did not realize how dehydrated I was before using this 3-in-1 smart water bottle.I'm working to increase my water intake for weight loss and more energy and with this product it is helping, The flashing light reminds me that I need some water intake and it's especially useful,Little speaker is perfect for what I wanted it for"},{"reviewerName":"Renee'","rating":"1.0 out of 5 stars","reviewTitle":"Reminder is not consistent and the notification sounds cannot be turned down.","reviewDate":"December 26, 2018","reviewText":"2 weeks later (3 stars down to 1 star):\nThe reminder is not consistent and the low battery announcement is CRAZY loud. I docked it 1 star for that. The other lost star was for the company trying to bribe me to remove my post.\n\nOriginal post:\nIt would be nice if you could adjust the reminder interval. It appears that it reminds you about every 1.5 or 2 hours. I would prefer every hour. The sound when turning off and on is loud as well. It does not appear that you can turn that down or mute it."},{"reviewerName":"John","rating":"5.0 out of 5 stars","reviewTitle":"Works as described!","reviewDate":"January 29, 2019","reviewText":"Love the colors. Great speakers! Easy to charge, You can change the colors or set it to go through all the colors automatically."},{"reviewerName":"May","rating":"5.0 out of 5 stars","reviewTitle":"Unique and Futuristic","reviewDate":"January 17, 2019","reviewText":"Very unique and futuristic to have music coming from your water bottle!! ❤️❤️"},{"reviewerName":"Jeff D. Fennell","rating":"3.0 out of 5 stars","reviewTitle":"Soliciting for 5-star reviews","reviewDate":"March 27, 2019","reviewText":"I liked this water bottle fine, until they emailed me, offering $20 for a 5-star review. Sketchy..."},{"reviewerName":"DRay","rating":"5.0 out of 5 stars","reviewTitle":"Works as advertised!","reviewDate":"January 3, 2019","reviewText":"My daughter and her fiance are in the Airforce. I bought them for Christmas. They were a huge hit. Now their friends want one."},{"reviewerName":"Ernesto Mojica","rating":"5.0 out of 5 stars","reviewTitle":"Lo recomiendo 100%","reviewDate":"December 11, 2018","reviewText":"Es muy bueno. Excelente producto !"},{"reviewerName":"Jim Kies","rating":"5.0 out of 5 stars","reviewTitle":"Keeps you hydrated & happy !","reviewDate":"January 9, 2019","reviewText":"3 in 1 Smart Water Bottle\n- reminds you to drink by glowing , has a wireless speaker with great sound capabilities for a water bottle , mouth opening is best ever ! Lid closes tight. Has a loop to clip in while walking,biking, drink ,play your tunes - it doesn’t get any better ! LOVE THIS WATER BOTTLE. You will too !"},{"reviewerName":"AP","rating":"5.0 out of 5 stars","reviewTitle":"Great way to track your water consumption while listening to music!","reviewDate":"July 24, 2019","reviewText":"I had been meaning to buy a smart bottle for a while, but I always put it off because of the price point. I found the ICEWATER bottle on Amazon, and decided to give it a try. At 20 dollars a piece, it is very reasonably priced, which I love. First up, the aesthetics. I think they have an okay mix of colors, I mean you cannot go wrong with black and blue, can you? I like that the shape encourages a steady grip on the bottle. Plus, non-toxic and BPA-free material that is made in the USA (I always feel slightly on the edge when I see plastics coming in from the offshore industries)! My primary goal was to somehow make my husband consciously drink more water. So, the Icewater was plopped on to his work desk, and i reminded him to check it every so often. The bottles pairs well with most devices (we tried on an iPhone and two old Android devices too). After it pairs, use it like you would a speaker. THAT is what got me astounded! The speaker quality is spectacular for a bottle. Pretty decent bass too. Of course, this is nowhere near BOSE, but hey, you purchased a smart bottle remember? The bottle holds about 22 oz of water, which is decent. And that lambent glow every once a while works wonders i ensuring that my husband drinks sufficient water throughout the day. On a minus side, no adapter is provided, so we used the USB ports on our laptops to charge our (individual) bottles. I am not sure if the speakers are designed for the dishwasher, but I will say don't try. Wash it with your hands if it comes to it. In my opinion, this is a fantastic bottle for all the basic smart bottle needs.\nUPDATE: I originally purchased one for my husband, but thought about it once more, and purchased one for myself too. I mean, I like the idea of drinking out of a bottle that plays fab songs. :D"},{"reviewerName":"BonsaiRose11","rating":"3.0 out of 5 stars","reviewTitle":"Good quality, but a bit \"smarter\" would be great","reviewDate":"February 19, 2019","reviewText":"First and foremost, this is a solid product. It does what it claims to do, and it doesn't look cheap or tacky. Where I was a little disappointed was in the fact that it isn't app-enabled. this is largely my bad for not reading the product description fully, but I assumed a \"smart\" water bottle would include some kind of smart tech element. It's great that the water bottle glows every hour, but the purpose is defeated if the water bottle isn't near you when it glows. It would be much better if it included push notifications so you're reminded to go and fetch your water bottle when it's time to drink. It's also lacking the \"how much to drink\" element. Some kind of measurement feature would be nice, or even a section in the guide outlining how much you should drink when the water bottle glows."},{"reviewerName":"Kelly Jo","rating":"5.0 out of 5 stars","reviewTitle":"Must Buy! Great gifts as well!","reviewDate":"October 23, 2019","reviewText":" Also shared on my facebook page, I don’t write many reviews, although I probably should as much as I use Amazon. But, Charged fast and have just been playing today . I’ll start early tomorrow on tracking it more so. I Love how the bottom twists off so can clean bottle. The lights and built in speakers (Bluetooth) you’re choice to use or not required. For this price I surely didn’t expect what I received. Which was super fast. Yes,I am a Prime Member although, I must say some sellers even on prime don’t get product to you in the fast as this was. I need to go ahead and order some Christmas gifts 🎁.\nI’ll definitely be watching other items from this seller!\n* I paid for this product in full so this is my unbiased review on this 3-in-1 Smart Water Bottle*"},{"reviewerName":"Tyisha","rating":"1.0 out of 5 stars","reviewTitle":"Broke after 9 days","reviewDate":"January 18, 2019","reviewText":"Very disappointed. Was so happy to receive this. I have started a diet and needed motivation to drink more water. Loved the look and idea of this bottle. I received it on January 9th and was happy until yesterday. Now the speaker and color features will not work. It will not turn off or play sound. I really liked it and it was helpful getting me to my daily goal of drinking more water. Will be returning now because with out the added features it is useless to me now. Contacted seller. Will be receiving a replacement bottle. Fingers crossed this one will work better"},{"reviewerName":"Brittany & Seth Brott","rating":"5.0 out of 5 stars","reviewTitle":"Speaker is awesome","reviewDate":"June 18, 2019","reviewText":"I got this water bottle to remind me to drink water throughout the day. I can go days and days without drinking water and only drinking sweet tea, flavored waters and juice (oops!) and I am trying hard to change that. The bottle works as described, although I don't always see the reminder light because there is no vibration or sound that accompanies it. Having said that, I have found that I don't really need the reminder light, because I like the way this bottle is set up, it makes it easier to keep on top of drinking water. I like the wide mouth feature, as I always put big lemon slices in my water, and the sport top is great so that you don't spill water on yourself (which is why I hated my last wide-mouth water bottle). The cap also features a little metal clip that can be clipped to the unlatch button, so that the bottle doesn't accidentally become unlatched in your backpack/purse. My two year old is thrilled with this water bottle and steals it from me every chance he gets, because the lights are fun and he loves to listen to music with it. The speaker was also a pleasant surprise, as it packs a punch for such a small speaker. It has nice bass and doesn't sound 'tinny' like most small/cheaper speakers. Overall, this bottle is great and I've taken it with me everywhere since receiving it!"},{"reviewerName":"Clipped Wings","rating":"5.0 out of 5 stars","reviewTitle":"Great speaker for $20.","reviewDate":"June 16, 2019","reviewText":"Edited to update rating. Seriously, buy this for the speaker alone. It's absurdly good sound for $20 and has a range of well over 30 feet (through a kitchen, a bathroom, a power conduit and two walls, it still played flawlessly. I can't speak to it's longevity, but even if this thing craps out I'll be getting another one.\n\nSurprisingly good sound quality for $20. I use it in my house just to listen to music now when not on my headphones.\n\nI bought it to use on my bike during my commute (it's incredibly dangerous to use headphones while running/biking where I live) and it fits my bike rack perfectly.\n\nHad some issues pairing it. I had to make my phone forget all other devices before it would detect the bottle, but now it pairs automatically any time I turn it on.\n\nI live in a very rainy area and can't find any info on the speaker's water resistance, but for $20 it won't be a crisis if I had to buy another.\n\nI don't have any trouble hydrating so the reminder light and dancing lights are a non-issue for me, in fact I carry a 32 oz bottle daily already so it'll be an adjustment to lose that extra volume but the speaker is nice enough to warrant the loss.\n\nI don't like the cap compared to my other bottle. It doesn't flip all the way open on its own and feels very cheap. There's also no strap, which my other bottle has, which means I lose a free hand while carrying it.\n\nDefinitely a good buy despite shortcomings."},{"reviewerName":"kunga","rating":"5.0 out of 5 stars","reviewTitle":"This bottle is literally a hooking up device, and much more three thing.","reviewDate":"August 26, 2019","reviewText":"It is the best water bottle in the whole world. I was hooked up with it the moment I opened the box. I love the bass feature of the bottle. When I put the bottle on my glass table, the whole table was vibrating, and I was like this is so cool. It felt like I was in a concert or a pub with this, rocking the table. With every beat, I can feel the rythim of the song. This is better than Bose headphones tbh. I was so hooked up in the bottle that I get to notice the lid machanism. How it work is really a genius. It is literally cool. Who knew a plastic that looks like a cut straw which same material as the the rubber that acts as a washer of the bottle could be used as a spring for the cap.\nBut now for the thing that I really want on the bottle as a bonus is a tattoo like design engraved on the transparent body of the bottle, not much design but little bit here and there. It could be a star or moon or clouds or fire. It will definitely complement the dancing lights feature. Thinking about it makes me really excited. I am definitely looking forward to seeing designs on the bottle. It will look Soo cool than the cool thing it is right now.\nAnother thing I want to see is that a ceiling display thing.\nI am so hooked up on this haha. I literally love the ceiling light display that I found. It is literally a plus. It can be used as a disco thing if it has a separate cap that acts as projector for the light. The disco thing could be a major thing when I am going to sleep. Anyway this is just an idea that I really want it to come to life. ;)"},{"reviewerName":"Kindle Customer","rating":"2.0 out of 5 stars","reviewTitle":"Save your money.","reviewDate":"July 28, 2019","reviewText":"This product is just high priced plastic. It comes with instructions that are so confusing that you can't make much sense of them. The only thing I could get this bottle to do was make a random beep once in a while and twinkle colored lights once when I pressed start. The instructions say that you can get the bottle to act as a wireless music amplifier by going to your phone under devices and making a connection to \" waterbottle\". Of course , that device is not on one's phone, you have to go to your app source. There ARE apps for waterbottles , but not for this waterbottle. The seller also wants you to send them your review and they will send you a second waterbottle as a gift. Good luck on that !"},{"reviewerName":"Jose T.","rating":"5.0 out of 5 stars","reviewTitle":"Awesome Water Bottle!","reviewDate":"August 20, 2019","reviewText":"Never thought I would see a day where a Bluetooth speaker tied to a plastic water battle but here we are. I love it! It's a water bottle with a speaker! Also led lights emitting from it to remind u every hour to drink water and stay hydrated. Not only that but led lights can be used to pair up with the music ur playing! Pretty awesome from a small speaker. The music sounds nice and clear, nothing exaggerated but once u put it in a wooden surface , the bass is great coming from a small speaker like this. My only concern would be every time I wash it u may want to take off the bottom speaker portion off, it is water resistant but I wouldn't take that risk. Other the that this is something I am definitely going to have with me every where I go."},{"reviewerName":"DC","rating":"5.0 out of 5 stars","reviewTitle":"Works Perfectly","reviewDate":"August 5, 2019","reviewText":"I purchased this bottle because I was tired of wasting plastic with single use bottles of water. The water reminder sounded like a good idea, and the speaker would be a bonus. Let me say, that this is way nicer than I was expecting.\n\nFirst, the bottle itself: It comes apart into 3 pieces, the cap, the bottle, and the speaker. The bottle is easy to clean and maintain, and everything screws back together easily. It holds plenty of water, and does exactly what a bottle should do.\n\nSecond, the lights: The lights are bright, and remind you when it is time for more water. There is even a sound reactive mode for a neat little light show on your desk or wherever.\n\nThird, the speaker: This was the biggest surprise. I will admit, I wasn't expecting much from this speaker, but I was blown away. It gets loud, but also clear. If you have it sitting on a wooden surface, it also produces rich, deep bass tones. It is punchy, sounds quite a bit better than my echo dot, and the battery seems to last a very long time. (I haven't timed it, but I haven't had to charge it every day.)\n\nI am highly satisfied with this bottle and would definitely purchase again."},{"reviewerName":"Taissa","rating":"1.0 out of 5 stars","reviewTitle":"DOES NOT WORK!","reviewDate":"September 11, 2019","reviewText":"I was so excited about this water bottle! A friend at work got one and I literally placed an order as soon as she showed me. However, when it arrived I realized the hourly reminder DOES NOT WORK AT ALL!\nThe lights will turn on if you press the power button only but not by itself, which is whats it was supposed to do! On top of that, the pause/play button came broken and I can only control the speaker on my phone... btw, speaker works just fine but it wasn't the reason why I bought the bottle!\n\nI am sad to say I do not recommend this product and will return mine."},{"reviewerName":"Jenny Brook","rating":"5.0 out of 5 stars","reviewTitle":"Finally, a reminder to hydrate that works.","reviewDate":"August 2, 2019","reviewText":"I can not even begin to count how many mobile apps I've downloaded and tried to serve as reminders for me to drink enough water. Every time I get into \"one\", it is only a matter of time before I begin swiping off the notifications, out of habit and forgo the drinking water part altogether, as I'm supposed to do. With this water bottle though, the notification comes from the sources itself. Now that it is the bottle that glows and makes sounds, it gets my attention and I've been grabbing it, drinking it and then setting it back down until the next reminder comes on. I love it!"},{"reviewerName":"Melissa","rating":"3.0 out of 5 stars","reviewTitle":"Just okay","reviewDate":"August 1, 2019","reviewText":"If you want a water bottle that reminds you to drink water, I would just recommend getting the Hidrate bottles even though they are a little bit more expensive. This one is good if you will have your water bottle right next to you and you can see the light changing but I usually am on the go and have my water bottle packed away in my bag so the light really doesn't do much for me. Having the Hidrate bottle was so much more effective sense it sends reminders to my phone and tracks my water intake on their app. If you are serious about increasing your water intake, I wouldn't bother purchasing this."},{"reviewerName":"MajaDB","rating":"3.0 out of 5 stars","reviewTitle":"3 in 1 smart water bottle","reviewDate":"September 25, 2019","reviewText":"I purchased this dancing water bottle for my 80-year-old Mom. She has a difficult time remembering to drink and I was hoping this cup would remind her every hour to take a drink. The problem is the dancing lights only remain one for less than 2 minutes and if you aren't looking directly at the cup you will miss the \"dancing\" lights. It took me most of the first day before I saw the lights change colors. The set up was very easy, and the speaker that is in the cup's base works great, but the lights aren't bright enough to catch your attention. And they need to last a lot longer than a minute to be motivated by them. I'm disappointed that the cup won't work for mom but I'll keep it for a Christmas gift,"},{"reviewerName":"Amazon Customer","rating":"2.0 out of 5 stars","reviewTitle":"Depends","reviewDate":"October 10, 2019","reviewText":"It's a great bottle if you're not a water drinker and struggling to remember to drink it. It really did it's job for me. I'm giving 3 stars, because after using it for few weeks, it started to leak every time I drink. I need to open the cap and dry it off, before I attempt to drink from it. Otherwise, my shirts would always be wet. I hope it's just a manufacturing issue with this bottle. I will attempt to exchange to a new. But if the same issue will be with another bottle, I will have to return it for good.\nUPDATE: I received a replacement and to my biggest disappointment - it's the same issue. Except, that this started to leak from the day 1 and way more than the other one (to the extend where I had to change my top, because it got so wet). It's upsetting, because the lighting worked well reminding to drink."},{"reviewerName":"Ruby Blue","rating":"1.0 out of 5 stars","reviewTitle":"Overpriced","reviewDate":"May 26, 2019","reviewText":"Cheap water bottle. Save your money their r better water bottles on the market. They offered me a stainless steel water bottle as a gift if I will give them a 5 star review. I can’t be bought.\nDoesn’t work as advertised."},{"reviewerName":"Kenneth Reed","rating":"4.0 out of 5 stars","reviewTitle":"Works great for the price","reviewDate":"May 16, 2019","reviewText":"I’m terrible at drinking water. I’m one of those people that are just never thirsty. I can go most of the day without drinking. I know this isn’t healthy, so I decided to look for a bottle that reminds me to drink.\nThere are some more expensive ones out there, but I decided to try this one. I’m pretty happy with it.\nIt does a nice job of reminding me to drink at least once an hour. For me, that’s VERY frequent.\nPROS:\nLights work well.\nSpeaker is decent for its size.\n\nCONS:\nFirst time pairing with my phone took a bit. I finally had to forget the device, then try again from scratch. After that, it paired, and then pairs each time automatically.\nThe bottle is a bit small. Works well for me, but those that actually drink a lot will be refilling frequently."},{"reviewerName":"ZBS","rating":"5.0 out of 5 stars","reviewTitle":"Great product","reviewDate":"May 20, 2019","reviewText":"The water bottle is really cool. I never thought I would need a water bottle to remind me to drink water, but it really works. I get so caught up when I am working, that sometimes I do forget to drink water, so it's good that this water bottle reminds me to stay hydrated. I was amazed that the speaker is so loud, not only is it loud, but you can skip tracks which is really great!"},{"reviewerName":"M. Wonnacott","rating":"5.0 out of 5 stars","reviewTitle":"Maybe the most frivilous thing I've purchased, but I'm happy with it.","reviewDate":"July 6, 2019","reviewText":"I did not need a water bottle with a glowing LED light and a bluetooth speaker. I don't believe there are many people, if any, in the world who do. That's a problem with me, not the product. If you're looking at this, I don't know what to tell you. It does what it says on the box. If that appeals to you, you should buy it. I definitely remember to drink more water, I guess, and the sound is pretty good for a bluetooth speaker on the bottom of a water bottle. I don't pay enough attention to know if it lights up every hour to remind me to drink, but the light is pretty reflected through the water."},{"reviewerName":"Jacky Sandoval","rating":"4.0 out of 5 stars","reviewTitle":"Not bad, like it!","reviewDate":"March 24, 2019","reviewText":"First, I didn’t give five stars because getting the reminder light to work is a bust. Lol I have no idea how, and I’ve tried all settings and reading the questions on here but nothing. So...that’s going nowhere. I feel like the instructions could be far more clear on this. Also, colors in the pictures aren’t clear enough. The pink looks more rose gold in the pics but in reality it’s baby pink.\n\nOver all, though, it’s an awesome bottle. The lights are beautiful and you can make them move to the beat of the music. The speaker is clear and loud! And charging is very easy."},{"reviewerName":"Nicholas G.","rating":"1.0 out of 5 stars","reviewTitle":"Broke after 2 months!!! Bluetooth doesn’t stay connected","reviewDate":"June 27, 2019","reviewText":"Update... two months and my bottle broke!!! The latch won’t stay closed and the top will not stay tight. So every time you drink water you get drenched! First off I’ll say the water bottle is great! The lights. are great. I’m not sure how the lights are suppose to display. I feel my bottle is a little bipolar. One day it goes off every two hours next day it’s every hour 🤔 Either way I stay hydrated. Speaker sound is great however a lot of Bluetooth connection issues. Again, not always but some days the speaker plays for hours and hours until it dies. Other days like today, fully charged speaker is disconnecting every 2-3 minutes. Very frustrating. Not worth the $20"},{"reviewerName":"Lydia Santangelo","rating":"5.0 out of 5 stars","reviewTitle":"Not only a great water bottle but fun too!!","reviewDate":"November 10, 2019","reviewText":"This water bottle is so much more than what we thought. I bought it for my teenage daughter to encourage drinking more water... not only is the glowing light a great reminder but having the speaker in the water bottle has her carrying it everywhere she goes. We’ve already shred this with all our family members who can’t wait to buy one too. The bottle doesn’t leak and is easy to wash, and the handle makes it easy to carry wherever you go. A+++!!"},{"reviewerName":"Salsa28Verde","rating":"5.0 out of 5 stars","reviewTitle":"Awesome water bottle","reviewDate":"August 30, 2019","reviewText":"I have a bad habit of not drinking enough water even when the dang water bottle is in my face, the reminder lights are really neat and kinda kick starts my brain to finally register that I should indeed drink out of this bottle now lol. The speaker is surprisingly loud and clear when you play music, I expected a low-quality speaker but that's not the case. I noticed that the silicon part of the top can pop out if you want to clean it but make sure to push it back in where the nub doesn't completely pop out of the other side, otherwise it won't create the watertight seal to prevent the water from spilling out when you tip the bottle over."},{"reviewerName":"Makingmemoriescrafts1978","rating":"5.0 out of 5 stars","reviewTitle":"Awesome Bluetooth speaker","reviewDate":"March 20, 2019","reviewText":"But this to help me keep track of my water intake. I don't use it much for that but I do love the speaker. I keep it on my desk and play it all the time the quality is awesome. I would have loved if the light made a continuous blank until you took a drink. It was kind of hard because it only went off once an hour and if I wasn't looking at the bottle I didn't realize it."},{"reviewerName":"M. Copple","rating":"1.0 out of 5 stars","reviewTitle":"Not so smart!","reviewDate":"January 4, 2019","reviewText":"The 1st day the reminder glow worked. 2nd day the reminder glow stopped working. I will be returning"},{"reviewerName":"Melissa","rating":"5.0 out of 5 stars","reviewTitle":"Perfect water bottle for camping, outdoor fun","reviewDate":"November 2, 2019","reviewText":"This is probably the coolest water bottle I've ever bought, and I've bought a lot of water bottles. This is the perfect bottle to take camping - it can play music through Bluetooth, goes with you if you're out having a picnic or chilling by the campfire, and of course keeps you hydrated. It can actually get pretty loud, too, without sacrificing sound quality! (Note: we didn't let it get too loud while camping because we're not jerks).\n\nThe only negative is the bottom (Bluetooth/speaker) is impossible to remove, so I can't actually put it in the dishwasher and I have to be very careful when washing it by hand. That's a bummer."},{"reviewerName":"Tessie M Tigner","rating":"1.0 out of 5 stars","reviewTitle":"Not what I expected...","reviewDate":"March 28, 2019","reviewText":"It's a very basic plastic bottle with a speaker. The 'light' reminder is so light you can barely see it. It feels pretty inexpensively made. The best part of the bottle is the speaker, but it takes up a lot of space I'd rather have for water. It looks way better on the website then it actually is."},{"reviewerName":"Rose Norman","rating":"5.0 out of 5 stars","reviewTitle":"It's loud","reviewDate":"July 3, 2019","reviewText":"OMG! BEST THING I BOUGHT ON HERE. This little gadget is LOUD! I bought this coz I'm an outdoor person. I love fishing, camping, paddle boarding. I thought this would be convenient. I've taken it on deep sea fishing, lake fishing, at work. And today, I finally got the chance to take it out paddle boarding. In the middle of the lake, people would look my way to see where the music is coming from. They were probably 30 to 50 ft away from me. I was definitely the party paddle boarder out there."},{"reviewerName":"Shannon Eggert-Wong","rating":"5.0 out of 5 stars","reviewTitle":"Nifty little water bottle","reviewDate":"August 2, 2019","reviewText":"I was really curious about this water bottle after a friend of mine had posted it on social media. I went ahead and bought one and I'm in love! How cool is this thing?? Not only does it remind you to drink water, but the bluetooth speaker on it has great sound! I blast my music during my workouts and can easily change the songs and volume. It charges super quick and lasts for hours. It has a double safety lock so no leaking and it's very easy to clean. Definitely worth the buy!"},{"reviewerName":"Cassidy","rating":"4.0 out of 5 stars","reviewTitle":"So far, so good!!","reviewDate":"August 21, 2019","reviewText":"I really love this water bottle! For the money, you can't beat it. I've only had it for almost a week so I can't really review the durability honestly. I will update later on to comment on the durability!\nThe speaker is great. Louder than my $40 Bluetooth speaker from Walmart. I was really impressed. Easy to use. Very simple instructions and functions.\nIt lights up as soon as you turn it on and then every hour on the dot after that to remind you to drink! Works just like advertised and it has definitely helped me drink more water these last few days so I'd say it's working!\nOverall, I love this product. I left 4 stars for now, because I have no idea what the durability is like. We'll see how it holds up to my hectic life and I will update my review later on, but so far, definitely worth the money!!"},{"reviewerName":"C.","rating":"5.0 out of 5 stars","reviewTitle":"Great icebreaker for middle school students","reviewDate":"September 25, 2019","reviewText":"I purchase this bottle as a gift for my grandson, and he was hand-over-heels about the bottle. He took it with him to school and at recess, played some music and let the bottle \"glow.\" This was the icebreaker he needed since he was in a new school. He said \"his peers liked that it lit up as a remainder to drink more water.\" Thanks for making my grand son's transition to a new school smooth."},{"reviewerName":"Caroline","rating":"5.0 out of 5 stars","reviewTitle":"All inclusive deal","reviewDate":"July 13, 2019","reviewText":"This is such a good product. I mainly wanted the music for my desk at work. The top /spout is important to me personally, it is a covered spout with a great seal for toting to and fro. The speaker is not Bose sound ... but that is not what I expected or needed. It is perfect for my needs. The light feature is a crazy cool bonus. I drink water daily... it helps me to keep a portion of my needs/wants in one place. Very easy to separate speaker for washing in dishwasher.\nJust a bonus bonus product !"},{"reviewerName":"S","rating":"5.0 out of 5 stars","reviewTitle":"Love it!","reviewDate":"June 2, 2019","reviewText":"Bought this as a gift for my mom. Needless to say, everyone who sees it is highly impressed with it. She enjoys the reminders to drink more water and it’s an added bonus for her because she works with children and the kids love the different colored lights. The speaker attached to the bottom is also really nice quality and better than anything I would expect from a water bottle speaker. Overall this thing has great value."},{"reviewerName":"Satbir Singh","rating":"4.0 out of 5 stars","reviewTitle":"Good bottle with speaker but few things can be improved to make it perfect","reviewDate":"October 24, 2019","reviewText":"I ordered this bottle because I want reminder to drink water. I often forget to drink while working.\nPro -\nThe speaker is very good. Light glows every hour.\nEasy to maintain, clean as the bottle can we removed.\nCons - Only light glows for couple of seconds for reminder. If you are not looking at the bottle, you might miss the it.\nBluetooth connect with any device without any pairing mode. If you are in office and not connected the speaker to your device, anyone else can connect to your speaker and play anything making thinks embarrassing for you.\nSuggestion for next model:\nAdd a pairing mode, so a device can connect to your speaker only when Bluetooth is in pairing/discoverable mode.\nAdd a sound option for hourly alert or keep the glow light alert 'ON' till some one manually turns then off after drinking water."},{"reviewerName":"Karlee Wyatt","rating":"4.0 out of 5 stars","reviewTitle":"Fun and practical!","reviewDate":"October 7, 2019","reviewText":"I bought this for my daughter and she loves it. It is fun and easy to use too! The lights are bright enough unless placed in a sunlight backdrop. The lights are helpful for her to keep pace with staying hydrated. It could be a larger size but then it wouldn’t fit on her bike. She can stay hydrated and when not drinking it doubles as a speaker on her bike ride. A suggestion would be to have the buttons be a different color than the base itself. Great idea and satisfied with the product. I would recommend."},{"reviewerName":"Kristy B","rating":"5.0 out of 5 stars","reviewTitle":"Great value for low cost. Easy to open while driving. Speaker and colors rock!!","reviewDate":"April 20, 2019","reviewText":"Love this bottle for the great price and fun of it!!! I've dropped it a few times. It's on the verge of breaking soon if I'm not careful lol. One button doesn't work anymore because of my clumsiness.\nThe speaker is removable from bottom. So water bottle doesn't hold as much water as I'm used to. And when I use speaker while disconnected from the rest of bottle it subtly, slowly moves across surface of table LOL. It eventually falls off my table if I forget to put some cloth under it. The little vibrations of music make the speaker shimmy slowly! It's funny."},{"reviewerName":"nerdylikethat","rating":"3.0 out of 5 stars","reviewTitle":"Not as sturdy as I thought it would be.","reviewDate":"June 15, 2019","reviewText":"The plastic part of this water bottle is very thin. The “light” to remind you to drink is on almost all the time. The Bluetooth speaker is it’s one redeeming feature. Great sound from it, I used it to listen to a podcast in my car and the sound was great."},{"reviewerName":"Zibi","rating":"5.0 out of 5 stars","reviewTitle":"Decent Sound Quality, Nice Lights, and functional!","reviewDate":"July 23, 2019","reviewText":"I’ve been looking for a medium sized water bottle that will be easy to carry, and this one does just that! The speaker and lights is an added bonus, and if you put the speaker on a wooden table, it actually delivers more bass which is really cool. It’s very ergonomic and functional. I’d totally recommend this to anyone who’s looking for a nice water bottle."},{"reviewerName":"Aliree","rating":"5.0 out of 5 stars","reviewTitle":"Must buy! Light changing effect is so cool!!","reviewDate":"October 19, 2019","reviewText":"I'm so loving this water bottle. The speaker connects easily to my phone and sounds great. I get so many comments on it. The color changing is bright and very very cool. Charge lasts over 12+ hours with the lights on. I use daily. Super easy to clean. Now everyone in my family want one! I will be purchasing more for friends and family."},{"reviewerName":"Naquana Andrews","rating":"5.0 out of 5 stars","reviewTitle":"In love!!","reviewDate":"August 18, 2019","reviewText":"Ok so I waited 2 days to write a review and that’s all it took for me to love love love this water bottle. Not only do I love the reminder to drink but I also fell in love with the fact that it is a Bluetooth speaker as well. Took it for a walk and people was amazed. I also was able to listen to music while cleaning my room without plugging in my old school stereo, which is also a plus in my book because I was always skeptical of portable Bluetooth speakers for some odd reason."},{"reviewerName":"LESLIE C WYERS","rating":"4.0 out of 5 stars","reviewTitle":"still figuring things out","reviewDate":"October 10, 2019","reviewText":"So far, it has alerted me once to drink water. Maybe I am not using it correctly?? the Bluetooth speaker works great and has great sound. The lid locks down when flipped over so it doesn't come back and hit your face while drinking. I gave it a 4 star for now because I am still figuring out how to use it properly on the alert option."},{"reviewerName":"Tropix","rating":"5.0 out of 5 stars","reviewTitle":"Love it!","reviewDate":"May 3, 2019","reviewText":"I love this water bottle! Everybody at work laughed and absolutely loved it! It’s easy to clean. It’s easy to pair. The lights are very cute! And fantastic sound for its price! I happily bought another one the same day!"},{"reviewerName":"Jessica Zerini","rating":"5.0 out of 5 stars","reviewTitle":"Coolest reminder to drink water & best price I could find!","reviewDate":"July 18, 2019","reviewText":"I use to work at an active place (doggie daycare) so I never had an issue with drinking water but since I have an office job & I sometimes get busy or consumed in paper work, I have noticed I'm forgetting to drink water.\nI never thought I would need something to remind me but I absolutely love this water bottle! It's easy to use & I love that you can play music or not play music for the reminder to drink. The lights are awesome too! Actually catches my attention & makes me aware that I have not taken a drink in awhile.\nThe speaker is amazing! It's actually loud & not that static feedback kind of loud but you can actually hear the music & the bass!\nI am one happy customer!"},{"reviewerName":"vladimir","rating":"5.0 out of 5 stars","reviewTitle":"The best bottle out there!!!","reviewDate":"March 25, 2019","reviewText":" I was blown away when I got this bottle 3 in 1 very well build,strong nothing cheap,and speaker after I paired with my iPhone so loud,I’ll definitely buy again,thank you"},{"reviewerName":"Fishingstars","rating":"5.0 out of 5 stars","reviewTitle":"Great gift- teens and tweens love!!","reviewDate":"October 4, 2019","reviewText":"My daughter absolutely LOVES this bottle, I gave to her as a birthday side gift and loved it better than the others! She is 12 years old- my 16 yr old daughter is begging for one, the sound quality is wonderful! Very loud and the lights are super cool- this water bottle is a hit with my teen daughters and their friends!!"},{"reviewerName":"Kaitlyn","rating":"1.0 out of 5 stars","reviewTitle":"DO NOT BUY! Not worth the money","reviewDate":"March 26, 2019","reviewText":"Everything about this water bottle is a joke. The water leaks from the top when you drink from it, the light rarely works but on top of it all, the blue tooth speaker makes random beeping noise that won't stop.\n\nI was on a two hour flight and out of no where, the blue tooth speaker turned on and began making beeping noise FOR TWO HOURS! I couldn't shut it off because the power button didn't work. I couldn't turn down the volume because the volume button didn't work. Definitely not worth the money. DO NOT BUY"},{"reviewerName":"Hillary Staley","rating":"5.0 out of 5 stars","reviewTitle":"Beautifully lit AND has a Speaker!!!","reviewDate":"April 14, 2019","reviewText":"I bought this for my mom for three reasons; to remind her to drink more water, to have a nice little speaker for her home workouts, and the lights are so bright and pretty that she wouldn’t easily lose it! Well, she absolutely loves it. She takes it with her everywhere and is constantly getting complimented on her pretty water bottle! She said it was easy to figure out how to use the first time and it’s really fun but also very practical!"},{"reviewerName":"E Cabibi","rating":"5.0 out of 5 stars","reviewTitle":"3 in 1 indeed","reviewDate":"October 24, 2019","reviewText":"I bought a black and a pink one to make it fun to remind my mom and I to drink more water. It truly does! The lights go off and I reflexively take a drink and before you know it, I have refilled it many times. The speaker works great and is useful in my office when on calls or wanting to listen to music. Only down side is that it sweats since it isn't insulated. I carry a small towel to help with that. I like that it is only 22 oz doesnt feel like drinking tons. Also, I like the sip opening and locking. I have attached a carabiner to attach to my bag and it is easy to transport. Great for the price."},{"reviewerName":"The Occasional Aristocrat","rating":"5.0 out of 5 stars","reviewTitle":"this is one of my favorite amazon purchases ever.","reviewDate":"September 17, 2019","reviewText":"It is super sturdy, the lights are a great way to remind me to drink...and i was surprised that the speaker in it is louder than my amazon echo....also i love the fact that it has a spout to drink from not just some giant wide mouth bottle like so many water bottles are today. When its closed - its closed. I have never had it pop open when it shouldnt."},{"reviewerName":"Audra","rating":"5.0 out of 5 stars","reviewTitle":"Great quality! Vibrant colors and excellent sound!","reviewDate":"April 11, 2019","reviewText":"What an exciting item that is helpful (reminding me to hydrate) - blue tooth speaker that I use while following a work out DVD. It sounds like the instructor is in the room with me! It makes working out fun with bright fun lighting. I love this product! I purchased blue and black. A must have!! Does not leak. Great weight and quality."},{"reviewerName":"Nanette Mattice","rating":"5.0 out of 5 stars","reviewTitle":"This bottle is great!","reviewDate":"July 8, 2019","reviewText":" This water bottle is so cool! I own several Bluetooth speakers and this one definitely does it’s job, I am very impressed with the sound quality and how loud it can get. The lights are neat, and the lid closes solid so there is no leaking. Love the wide top for ice cubes to easily go in and simple to clean mouth piece (if you are a straw user you could add one but I don’t use a straw on water bottles I pull them out) overall it’s a fantastic product and if you are an active or outdoors person and don’t like earbuds, this bottle is great!"},{"reviewerName":"Stylianos","rating":"3.0 out of 5 stars","reviewTitle":"Good product but reviews are not to be trusted here","reviewDate":"August 26, 2019","reviewText":"Very simple. No app to track consumption. Light go on randomly not sure what the algorithm is for that. The bluetooth speaker is awesome and easy to set up. You can wash in washing machine.\n\nI did not like the fact they give you a note asking for good ratings and offering a free item. Really makes the reviews not honest."},{"reviewerName":"Ryssa","rating":"4.0 out of 5 stars","reviewTitle":"I like it","reviewDate":"October 7, 2019","reviewText":"Very good product I love the lid doesn't leek and is durable. I love the lights because I sometimes forget to drink so it’s a good reminder. I haven’t had the chance to use the speaker. The only thing I would change is I wish it was bigger but it being the size it is makes it easier to hold, so you can’t have everything"},{"reviewerName":"Mike L.","rating":"1.0 out of 5 stars","reviewTitle":"Alert Doesn't Work","reviewDate":"February 22, 2019","reviewText":"I bought this specifically for the alert feature and after 3 weeks of trying to get it to work I have given up. The only directions provided are not very descriptive and maybe I am doing something wrong? So this will go on the boat and work as a speaker instead. Onto looking for a new alert water bottle!"},{"reviewerName":"Janet C","rating":"2.0 out of 5 stars","reviewTitle":"Broken after a week","reviewDate":"September 21, 2019","reviewText":"I had this bottle for a week only and it’s already broken. After using the bottle the first time my thought was I pretty much just paid for the speaker and the light effect. The bottle itself isn’t durable. The top is kind of cheap and although I tried to be extremely careful while closing it it still broke on me. Now I can’t use it at all."},{"reviewerName":"Alicia Sanders","rating":"1.0 out of 5 stars","reviewTitle":"Neat concept, if it would actually work.","reviewDate":"June 22, 2019","reviewText":"Charged this bottle when it arrived. Once charged, we filled ot with water and turned it on. Speaker quality was ok but the notification light to drink water doesn't work at all so keeping this product is a moot point since I bought it for that reason."},{"reviewerName":"Elizabeth Konkle","rating":"1.0 out of 5 stars","reviewTitle":"Not so waterproof light up speaker","reviewDate":"November 3, 2019","reviewText":"The bottle only worked for about an hour. Sweat from the outside ran down the \"waterproof\" speaker and it stopped playing mid song and never worked again.i was extremely disappointed."},{"reviewerName":"Mona","rating":"5.0 out of 5 stars","reviewTitle":"I like it... lights & music! Win/Win","reviewDate":"September 30, 2019","reviewText":"I like it a lot. It's so cool how it lights up to the music. Really good sound quality. I am still learning how to use it\nMy favorite part is how clear the music sounds and blinks light to the music. My only con is the button to close it... it seems confusing at first on how to close it. You gotta press it in to close it and out the metal piece over it to secure it....🙄"},{"reviewerName":"ewudiba","rating":"5.0 out of 5 stars","reviewTitle":"GREAT WATER BOTTLE!","reviewDate":"August 2, 2019","reviewText":"This water bottle is easy to setup and use. I appreciate the quality sound of the bluetooth speaker and enjoy the lights. I have receive several compliments on the water bottle and have directed several people to Amazon to purchase one. The flashing lights as reminder to drink more water is great. However, I wish they would implement an app that you can visually track your water intake as well."},{"reviewerName":"Rena","rating":"5.0 out of 5 stars","reviewTitle":"Great bottle, awesome speaker!","reviewDate":"May 15, 2019","reviewText":"I wanted a water bottle that reminds me to drink water but I got a bonus because it has an awesome speaker. I was really blown away by the clarity and sound! I love that bottle doesn’t have a straw and I can drink directly from the bottle. Plus, it is one less part to wash. It glows different colors to remind me the drink, and the light can be set to dance with the music when connected to Bluetooth. My kids love this bottle and I can’t wait to it with us on our walks to the park. Definitely a useful product that is fun for all. 😊"},{"reviewerName":"Amazon Customer","rating":"4.0 out of 5 stars","reviewTitle":"Great quality water bottle with simple reminders and good value","reviewDate":"July 11, 2019","reviewText":"Just wanted a good quality water bottle with some kind of simple reminder to help with my bad habit of not drinking enough water and this delivered! I could do without the Bluetooth speaker altogether but maybe I'll get use out of it when going out hiking\n\nThe only thing I don't like about it is how loud the noises are when turning the power on and off. If my only desire is to have the reminder functionality, it's very annoying having the incredibly loud noises coming from the speaker when it's trying to connect/disconnect Bluetooth. An option to silently turn on just the reminder light by pressing the power button once then the normal power on where you hold the button would make this a perfect 5/5"},{"reviewerName":"Misty Jennings","rating":"5.0 out of 5 stars","reviewTitle":"Great quality","reviewDate":"July 29, 2019","reviewText":"This is a nice sturdy bottle. I love that it lights up because it catches my attention and reminds me to drink. After my cancer treatments I've become very forgetful so this is perfect. I think I'll got one from my grandma too. The sound quality of the speaker is great. I'm surprised they don't delt his for more."},{"reviewerName":"Steph M","rating":"4.0 out of 5 stars","reviewTitle":"Gets the job done in an affordable way","reviewDate":"October 29, 2019","reviewText":"Bought this for my son. It does a great job reminding him to drink. We have not hooked up the wifi yet but he loves the cup. My only complaint is it is NOT spill proof so after a few spills we now only let him use it at school and not take it when we go out just incase it tips over."},{"reviewerName":"Deborah Bush","rating":"5.0 out of 5 stars","reviewTitle":"Great Reminder to Drink your water","reviewDate":"March 18, 2019","reviewText":"If you're looking for a water bottle that reminds you to drink, this is the one. I knew I needed to drink much more water during the day than I had been drinking. The light changing effects that the bottle produces catches my eye on my desk and reminds me to drink. I went from drinking 16 oz on a good day to about 70 oz each day. Great investment and it has an added blue tooth speaker."},{"reviewerName":"Misty Rennquist","rating":"5.0 out of 5 stars","reviewTitle":"Kids love it Fun gadget","reviewDate":"March 14, 2019","reviewText":"I bought this for my children to help them remember to drink more water. We did not even use the speaker function, but they love how it lights up to remind them to drink. This was affordable and fun alternative to the 40$ bottles that are on the market. The bottle came with a usb charger and it held a charge for several days. My son accidentally left the water bottle in very cold conditions overnight the first day we had it and it did not damage or affect the device in any way."},{"reviewerName":"KRAND","rating":"1.0 out of 5 stars","reviewTitle":"Broke after 1 washing and not bright","reviewDate":"May 1, 2019","reviewText":"The front push in tab that sits below the metal clasp fell out after 1 hand washing. I pushed it back in but 2 seconds later it snaps back out. And the light is not very bright at all. Junk."},{"reviewerName":"Candis Gorman","rating":"5.0 out of 5 stars","reviewTitle":"Keeps my attention on drinking water","reviewDate":"October 25, 2019","reviewText":"It holds 22 ozs, so its a doable amount for me to drink in a few hours. The sound through the speaker sounds clear. I probably won't listen to music from it often because it may drain my phone. I love the colored lights blinking in sync with the music. The directions are minimal, so I am still trying to figure out how to get the bottle to remind me to drink.\n\nWhat I dislike is that the pink light buzzes some. Maybe that is just my bottle. The other two colors are quiet."},{"reviewerName":"melinda","rating":"5.0 out of 5 stars","reviewTitle":"So cool","reviewDate":"May 16, 2019","reviewText":"This is awesome I love it the bluetooth speaker actually sounds really good and it lights up every hour to remind you to drink you do need to have it but you to see the lights but for me I forget so much to drink even with water sitting next to me so this is perfect.\nThe speaker comes off so you can wash the bottle"},{"reviewerName":"Jaissa Feliz","rating":"5.0 out of 5 stars","reviewTitle":"Sleek practical designed bottle that truly does bring joy!","reviewDate":"November 5, 2019","reviewText":"I love it! The designers for this product thought of everything! The design is very practical and sleek. When the water bottle lights up it gets me excited to stay hydrated. The leak lock works great. It came with clearly labeled instructions on how to operate all the buttons. I had no idea this came with a speaker when I ordered it and I was pleasantly surprised by how loud it was. The only thing I would say could be added is for the circular grab area to be able to latch as if it were a keychain for those of us who would like to hook it onto our backpacks when going hiking :) this water bottle truly does bring me joy, thank you!"},{"reviewerName":"Amazon Customer","rating":"3.0 out of 5 stars","reviewTitle":"Good buy.","reviewDate":"January 7, 2019","reviewText":"Kind of hard to figure out and I'm not sure if it actually lights up every hour..however our son who is 12 with leukemia and has to drink all day long he loved the colors and the speaker works great."},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Great value & awesome product!","reviewDate":"June 18, 2019","reviewText":"I’m in love with this bottle! Concept is genius. Super affordable. I get migraines & constantly hear how I’m dehydrated. Now I sit in front of my monitor screens all day & watch the bottle change colors to remind me to drink water. Not to mention the great audio sound that comes thru the speaker!"},{"reviewerName":"Senyed","rating":"5.0 out of 5 stars","reviewTitle":"Excellent product and at great price","reviewDate":"August 3, 2019","reviewText":"This water bottle is excellent. Bluetooth connectivity is great. The speaker sound is very good. The battery life is excellent. It reminds you to drink water if you have not done it for a while. I do really love this water bottle and the best thing is the price."},{"reviewerName":"Jessica M","rating":"5.0 out of 5 stars","reviewTitle":"The best water bottle!","reviewDate":"March 31, 2019","reviewText":"I love my water bottle! I recently had bariatric surgery so I have to make sure I consume enough fluids every day and this water bottle helps me so much. I drink about 3 full bottles a day plus when I'm working out or walking, I get to listen to my music which is super clear! I highly recommend this product!!!!"},{"reviewerName":"Tishana A.","rating":"5.0 out of 5 stars","reviewTitle":"Perfect Water Bottle","reviewDate":"May 17, 2019","reviewText":"I love this water bottle. I really was looking for something to fit into the cup holders of my new car seat and this is the perfect size and not too bulky. The Bluetooth speaker was an added bonus!! The speaker quality is excellent. I love how the bottle lights up to remind me to drink. I will definitely be recommending this as a gift idea to my friends and family."},{"reviewerName":"Joshua","rating":"5.0 out of 5 stars","reviewTitle":"A Frequent Reminder to Stay Hydrated and a Dance Party All in One!!!!!!","reviewDate":"July 17, 2019","reviewText":"I love the design and layout of this product! First of all the light display to remind me to drink water every hour is fantastic! I also love the Bluetooth speaker at the bottom! The sound quality is fantastic and crisp! Super easy to connect and play music right away! It also detaches from the bottom so you can easily wash the bottle out! I also love the fact that there is an extra lock on the bottle to make sure it doesn’t accidentally open and spill all over if you are traveling or riding a bike! And lastly the price is fantastic! Don’t think you are gonna find a better water bottle than this! Highly recommend!!!"},{"reviewerName":"Josh Waters","rating":"2.0 out of 5 stars","reviewTitle":"Works for what i need but it arrived broken.","reviewDate":"September 28, 2019","reviewText":"Just got it today and charged up the speaker, it connected just fine to my devices and is pretty loud, louder than I needed which is great, I think its going to work out nicely. The one issue I have though is it arrived broken. The speaker button to lower volume does not work. The pause and raise volume have a click while the lower does not, it doesn't really hinder my experience much so im not going to bother returning it, but its worth mentioning. I may take it apart later and see if I can mend it but the rubber surrounding the speaker is glued in two places."},{"reviewerName":"Carol Adams","rating":"5.0 out of 5 stars","reviewTitle":"Better than other Smart Water Bottles!","reviewDate":"April 2, 2019","reviewText":"This smart water bottle goes above and beyond other bottles I was contemplating spending more money on. I wanted to wait until I had been able to use the bottle several weeks before reviewing it just to see if it was going to mess up or break. It still works just as it did the day I took it out of the box. I love the glow it gives and the bluetooth speaker has really come in handy in our office. I liked mine so much I had to buy another one to have it shipped to my sister in Hawaii. She was impressed by the speed of receiving it! She is still using her's also."},{"reviewerName":"Jun G","rating":"2.0 out of 5 stars","reviewTitle":"Cap leaks","reviewDate":"August 5, 2019","reviewText":"Pro:\n1. low price\n2. speaker\nCon:\n1. cap leaks\n2. heavier because of the speaker\n3. less water capacity because of the speaker\n4. taller because of the speaker, and the small base made it unstable and easy to tip over.\n\nAll I wanted is a water bottle with a flashing light reminder to drink. All other bells and whistles are useless and make it worse."},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Super convenient addition if you can’t remember to hydrate","reviewDate":"June 6, 2019","reviewText":"This water bottle (so far) is awesome! The speakers seem to be pretty great for such a compact device, and the lights to remind you to drink are super helpful. The best part, for me, is the fact that I can have this bottle play my music in the cup holder of my stroller while my phone/pedometer remains in my pocket without any wires annoying me! Such a cool idea! I hope it keeps working!"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Awesome bottle!","reviewDate":"July 4, 2019","reviewText":"I got it yesterday and I'm already loving it! I work as a nurse and sometimes forget to drink water when I get busy. This would really help! Plus the speaker can let me listen to my music to soothe my mind when the workload gets too much. I just wish this bottle comes in more than 22oz since I work 12 hour shifts. But otherwise, this is a great buy!"},{"reviewerName":"Mom4Roses","rating":"5.0 out of 5 stars","reviewTitle":"Solves more problems than you think.","reviewDate":"March 22, 2019","reviewText":"Couldn’t figure out how to effectively get my teenager to drink enough water with her medication. It was really a problem. She opened the box, looked at the bottle, linked it to her Amazon music playlist and ran to her room. Brilliant idea to make her life a little more “normal” while coping with a chronic illness. So thankful to see her smile. Price is amazing. Don’t hesitate to buy. 🙂"},{"reviewerName":"Kirkuk K","rating":"5.0 out of 5 stars","reviewTitle":"This bottle does help me drink more during my work shift.","reviewDate":"March 15, 2019","reviewText":"Haven't figured out how to set it to light up exactly on the hour but, that's no biggie. It does light up every hour to remind me to drink. Doesn't keep track of how much I've had but, that's no problem. Works as advertised."},{"reviewerName":"Evan Gatewood","rating":"5.0 out of 5 stars","reviewTitle":"Best Water Bottle I've Owned","reviewDate":"September 2, 2019","reviewText":"I love the combination of water bottle and Bluetooth speaker. All my friends get a kick out of it and it helps me never leave my water bottle laying around. It's super convenient and produces decent sound for its size. Fun cheap gift too. The price is right for what you get. 100% recommend!"},{"reviewerName":"Zahra Jaferi","rating":"4.0 out of 5 stars","reviewTitle":"Great product","reviewDate":"September 23, 2019","reviewText":"I don’t like that you have to charge it and it takes a while. Maybe an hour or two. I love the music from my iPhone and the calming apps it plays. I love the lights. I like the buttons. It has a play button and volume buttons."},{"reviewerName":"BARBARA J.","rating":"5.0 out of 5 stars","reviewTitle":"Dry useful and kind cool","reviewDate":"October 20, 2019","reviewText":"This is something I never thought I would use but I was so wrong! Highly recommend if you are as forgetful as me about properly hydrating yourself. Also, I removed the speaker from my office and replaced it with this......a great sound that was u expected also."},{"reviewerName":"Amazon Customer","rating":"4.0 out of 5 stars","reviewTitle":"Saved the Day","reviewDate":"March 21, 2019","reviewText":"I am very pleased with this water bottle. It subtlety reminds me to drink every hour by glowing the color of my choice. I like its weight and its composition. It will hold .5 liter and that is easy to track. The feature that I didn't expect to wow me was the bluetooth speaker. I went to yoga class and the instructor was unable to connect to Pandora to play her music for the class. I said my water bottle was bluetooth. She was able to find and connect to the bottle and play the music very easily, saving the day! Now she uses my bottle at each class!"},{"reviewerName":"Jason","rating":"5.0 out of 5 stars","reviewTitle":"Excellent for bike rides","reviewDate":"October 12, 2019","reviewText":"Purchased this for bike rides as it is much safer than wearing headphones. It is the perfect size and fits securely into the bottle holder on the bike. The sound quality is surprisingly good with a nice warmth and clarity...a huge upgrade from the phone speaker and gets much louder than needed. The speaker base easily unscrews from the water bottle for cleaning purposes. Very happy with the purchase at this price."},{"reviewerName":"Crypto1189","rating":"4.0 out of 5 stars","reviewTitle":"Great water bottle more features would be nice","reviewDate":"May 14, 2019","reviewText":"So far so good, it does what it's suppose to as for hydrating my wife uses it more. There is an issue with with it reminding every hour. Would be nice if it was consistent but it works. Also would be nice if the bottle vibrated every hour."},{"reviewerName":"Tracey Pettit","rating":"5.0 out of 5 stars","reviewTitle":"Great water bottle! Bought it for biking.","reviewDate":"July 15, 2019","reviewText":"This bottle is lightweight and has a nice, clear speaker that can get pretty loud. Lights are fun and can be turned on to play to the music or shut off to only come\nOn for the two hour “drink water” prompt. It’ll be great to take on bike rides! So happy I found this! Bargain."},{"reviewerName":"Talise","rating":"5.0 out of 5 stars","reviewTitle":"Don’t like drinking water? This bottle is for you.","reviewDate":"March 26, 2019","reviewText":"I’ve always had a hard time drinking water, like most people I’m sure, but this water bottle makes it much easier. It’s visibility pleasing with the lights that remind you to drink your water and it has a speaker on it so you can listen to your music. My mind was blown and I’m loving it."},{"reviewerName":"katherine aguero","rating":"1.0 out of 5 stars","reviewTitle":"The smell is really strong!","reviewDate":"March 27, 2019","reviewText":"The Bluetooth speaker works well but, the water bottle has a strong smell. I have been using this smart water bottle for more than 2 weeks and have washed it everyday to see if the smell goes away but no! I only use it for water and I wish the smell could go away but it seems that nothing works. Besides that everything works fine"},{"reviewerName":"TNNC","rating":"3.0 out of 5 stars","reviewTitle":"Eh","reviewDate":"August 19, 2019","reviewText":"The speakers are FANTASTIC! But the whole water reminder glowing light doesnt work? I dont know if it just doesn't work and the ad was a scam or I dont know how to make it work? But other than that the bottle is good. The speakers are a must!"},{"reviewerName":"James D. Watkins","rating":"5.0 out of 5 stars","reviewTitle":"My son took the first one I ordered, so I had to purchase a new one","reviewDate":"September 6, 2019","reviewText":"This is my second smart water bottle. I always get ask about while using it. Several of my walking friends have purchased one. I like the speaker, reminder to stay hydrated and style of my smart water."},{"reviewerName":"Doris M.M.","rating":"4.0 out of 5 stars","reviewTitle":"Coolest Water Bottle Ever !!","reviewDate":"July 3, 2019","reviewText":" I love the flashing lights & that it’s bluetooth. I can listen to my tunes from my iPhone.\nWhat I don’t like is that the “volume up” button doesn’t work that well. It makes the music skip. The volume down is just fine.\nI can’t get the bottom off in order to wash the bottle very well & I don’t want it getting wet & ruining it."},{"reviewerName":"Brookee Miller","rating":"5.0 out of 5 stars","reviewTitle":"Happy Customer","reviewDate":"June 5, 2019","reviewText":"I like to take walks in the evenings with my children and everyone wants to listen to music. I didn’t want to carry around a speaker and felt like headphones would be unsafe. So when I came across this bottle I thought this would be a total score. We just got back from an afternoon walk and we were all very happy with it. The speaker is loud. I was pleasantly surprised. The lights are just bonus. We carry water bottles as we walk and having the speaker makes it even better. Would definitely purchase more and gift these to my friends who work out. Happy customer."},{"reviewerName":"Donna Thorne","rating":"3.0 out of 5 stars","reviewTitle":"Good Quality Speaker but Faulty Open/Close latch","reviewDate":"November 9, 2019","reviewText":"I REALLY REALLY wanted to leave a very positive review for this water bottle. I was so excited to get it and talked about how good it was for the price- especially since it's also a speaker. However, after 3 days of use, the latch/spring to open/close the bottle literally just popped out of the socket as I was trying to close the bottle and now it is no longer usable as a water bottle because it doesn't close. This could be a rare occurrence and if it wasn't for this I would have nothing but positive things to say."},{"reviewerName":"Emily Guthrie","rating":"5.0 out of 5 stars","reviewTitle":"Great bottle but wish it held more water.","reviewDate":"September 22, 2019","reviewText":"I really enjoy this water bottle! My lid does not snap on all that well, but nothing to send back for. I love the functionality of this bottle. I debated between this one and one that was labeled different times of the day. I am satisfied that I chose this one because it has a visual reminder. It is very easy to clean too! The ONLY drawback I would say is the amount of water it holds. I wish this held more water at once than it does. However, I still love this and will continue to use it!!!!"},{"reviewerName":"OCNYMOMOF3","rating":"1.0 out of 5 stars","reviewTitle":"Don’t believe the hype","reviewDate":"October 4, 2019","reviewText":"It was cool for the first day. Second day pieces starting falling off. Metal piece that keeps the lid closed fell off. Spring latch fell off. Doesn’t really glow. Sound was good. I would have sent it back, but threw out the package. Was so excited, but quickly disappointed."},{"reviewerName":"Shaena","rating":"5.0 out of 5 stars","reviewTitle":"Water Made Fun","reviewDate":"September 9, 2019","reviewText":"This is a good speaker and a pleasant reminder to stay hydrated. A variety of colors, the blue fits nicely on my desk. Added a clip to make it easier to hook and it works great to take on a hike."},{"reviewerName":"David S.","rating":"5.0 out of 5 stars","reviewTitle":"Great product","reviewDate":"August 7, 2019","reviewText":"This water bottle is fabulous! It shipped quick, arrived on time and was easy to set up and connect to blue tooth. My daughter also thought it was neat and wants one now. Price is right as well."},{"reviewerName":"K. Edwards","rating":"5.0 out of 5 stars","reviewTitle":"Great value- works as advertised!","reviewDate":"August 26, 2019","reviewText":"This water bottle is great! My medical condition requires I drink water often and this device is perfect with its reminder. It comes with a nice charger cord and the sound is great. The sound/light unit screws onto the bottom- great!\nI wish it was just a little larger.\nHighly recommended."},{"reviewerName":"Erin K","rating":"4.0 out of 5 stars","reviewTitle":"Nice Water Bottle, Wish It Lasted Longer","reviewDate":"July 27, 2019","reviewText":"My son really liked this water bottle. It sounded great, looked really nice, connection was good but he’s only 10, autistic, dropped it and it broke. The speaker part is still in tact though but it’s not working so... he’s a bit tough and I’m not sure how durable the water bottle is but it seemed to be made well."},{"reviewerName":"Hello","rating":"5.0 out of 5 stars","reviewTitle":"Awesome!","reviewDate":"July 30, 2019","reviewText":"Just got this today and I love it already! I could now take my music with me and stay hydrated. The speaker works great and is very loud for its size. The water bottle lights up to remind you hourly to drink your water. The bluetooth set up is always very easy. I would definitely buy this again and would even consider purchasing it as gifts."},{"reviewerName":"Jina","rating":"1.0 out of 5 stars","reviewTitle":"Piece of junk. Broke 2 days later.","reviewDate":"September 15, 2019","reviewText":"Piece of crap. I should've known better when similar products were selling for significantly more. The bluetooth speaker broke Sunday. I received it Friday. Definitely returning."},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Fun Water","reviewDate":"October 18, 2019","reviewText":"This is a super fun way to remind yourself to drink water. Plus the speaker is LOUD!!!!! You can control the volume either on your phone or on the bottle. As for durability I'm not 100% sure. I will not be putting it in the dishwasher that is for sure. The speak is removal so if you wanted to put it in the dishwasher you probably could but I'm thinking it might melt a little.\nOver all I think its a fun way to get more water in."},{"reviewerName":"AmazonFire","rating":"5.0 out of 5 stars","reviewTitle":"Waaaaay better than other similar water bottles!","reviewDate":"July 20, 2019","reviewText":"OMG! I love it! I almost paid $55 for a similar cup my boss got with half the features and horrible reviews! I am SO happy I went with my gut and information from previous reviews! As much as I spend on other water bottles this one is way better! Decent sound from a small speaker and definitely helps my water intake! Definitely a recommended products! Thanks guys!"},{"reviewerName":"Anna Jesus","rating":"5.0 out of 5 stars","reviewTitle":"Such a fun purchase!","reviewDate":"April 8, 2019","reviewText":"I am a bit of a gadget junky, so no surprise this caught my eye! I was, however, incredibly pleased after it arrived to find it was not just fun but incredibly functional. The speaker quality is excellent, removing the bottle for cleaning is very easy, and I was surprised to find I really did benefit from the “reminder” to drink water. And how did I overlook the dancing lights! If you are looking at this, you should go for it."},{"reviewerName":"Cory Gillespie","rating":"5.0 out of 5 stars","reviewTitle":"Amazing product!","reviewDate":"November 1, 2019","reviewText":"This water bottle is amazing! It looks great and feels very durable! I love the reminder, it has kept me on track, which was the main reason I purchased it. The lights are bright and the speaker is wonderful! It gets louder than I thought it would. Would definitely recommend!"},{"reviewerName":"n","rating":"5.0 out of 5 stars","reviewTitle":"I REALLLLY REALLLLY LIKE IT","reviewDate":"April 27, 2019","reviewText":"Received my bottle today and I like it. I wish it had the marking on the side so that I could keep up with how much I'm drinking, but it is still a great bottle. It is actually loud for it to be so small. You can use the water bottle to skip to the next song or even repeat the current song. Just remember that the power button needs to be on to remind you to drink water. I hope you enjoy your bottle as much as I have so far."},{"reviewerName":"Cory Clark","rating":"5.0 out of 5 stars","reviewTitle":"Great product!!!!","reviewDate":"March 17, 2019","reviewText":"Great product!!!! I love the fact that its has a speaker which plays loud. The different colors are amazing. I actually brought it into work and everyone was amazed and purchased several."},{"reviewerName":"Erica N","rating":"5.0 out of 5 stars","reviewTitle":"Highly recommend!","reviewDate":"June 21, 2019","reviewText":"This thing turns heads...so many ppl ask me where did I get it and what it does...the blinking lights when it's time to drink is perfect to help me stay on track with drinking water...BUT...the bluetooth speaker was a bonus...the speaker is great quality to be a water bottle ...great for walks or just chilling in the back yard..."},{"reviewerName":"Kristoph","rating":"5.0 out of 5 stars","reviewTitle":"Love it!","reviewDate":"July 30, 2019","reviewText":"This was so easy to set up! I love the light on it! They are bright and eye catching! It makes the gym so much more fun because, I can torture my personal trainer by using it as a speaker for my Spotify!"},{"reviewerName":"Mr. Q","rating":"5.0 out of 5 stars","reviewTitle":"Lots of fun and connects quickly","reviewDate":"September 22, 2019","reviewText":"We bought this for our son to help remind him to drink regularly. He loves the colors and we love the added bluetooth features. Took it camping this weekend and it worked like a charm. Great product and easy to clean with the bottom park twisting off."},{"reviewerName":"Lee Horn","rating":"5.0 out of 5 stars","reviewTitle":"Great Product!","reviewDate":"July 12, 2019","reviewText":"I LOVE this water bottle! The colored light is fun & is a helpful reminder to drink my water. It is tough enought to withstand beind dropped & the volume gets pretty loud too. This is a great gift gift idea. I will be buying more for friends & family!"},{"reviewerName":"M9brazil","rating":"5.0 out of 5 stars","reviewTitle":"Perfect for an apartment gym or bike rides","reviewDate":"July 19, 2019","reviewText":"I love this thing when i am at my work gym alone i dont need headphones, i blast this bad boy.\n\nAlso riding my bike it helps me jam out while on a ride. GREAT SOUND"},{"reviewerName":"Shaffergirl","rating":"5.0 out of 5 stars","reviewTitle":"Fun and Functional","reviewDate":"March 18, 2019","reviewText":"I like the colored light display. I take it with me to work. It’s so cool a coworker ordered one too. Another coworker requested we listen to music on it. Works great! The speaker unit unscrews to remove for easy cleaning of the water bottle portion. I really like the loop on top so I can carry it with just one finger. Not made with cheap, hard plastic. Worth the small price tag."},{"reviewerName":"kluce126","rating":"5.0 out of 5 stars","reviewTitle":"Amazing Water Bottle!!!!","reviewDate":"October 20, 2019","reviewText":"I love this water bottle! It reminds me to drink which I definitely need plus having the blue-tooth speaker is a definite plus. It's durable and easy to clean. I've found the bottle I will continue to buy from now on!!"},{"reviewerName":"Malane Brown","rating":"5.0 out of 5 stars","reviewTitle":"Perfect for everyone, everyday!!","reviewDate":"March 26, 2019","reviewText":"We love this product so much we bought 3 of them. My kids and myself use these daily. And where from listening to the music while working out or around the house someone always has the speaker on. The water bottle are great, they are the perfect size for kid to take to school or practice. I love that it helps me remember to drink with the lights through out the day."},{"reviewerName":"Shamika","rating":"5.0 out of 5 stars","reviewTitle":"Awesome!","reviewDate":"May 15, 2019","reviewText":"This bottle is amazing! I usually use my Contigo because it keeps everything cold for hours on end and I am a little disappointed that this one \"sweats\" so much but I knew it was just a regular plastic bottle so it was expected. The speaker is exceptionally loud! It is literally louder than my other Bluetooth shower speakers by a long shot. The lights aren't that big and bright but it's still really cool. Definitely would recommend!"},{"reviewerName":"Jessica Ellington","rating":"5.0 out of 5 stars","reviewTitle":"Great gift!","reviewDate":"August 15, 2019","reviewText":"I absolutely love this! It would be such a cool gift for anyone. It can be used for such a wide range of activities. Small parties, hiking, boating, walking or jogging. The list goes on and on. Also, the price is unbelievable."},{"reviewerName":"Jessica","rating":"5.0 out of 5 stars","reviewTitle":"Fun hydration!","reviewDate":"September 27, 2019","reviewText":" At first I thought this was pretty gimmicky, but I have to say it really makes staying hydrated fun! My kids loved listening to music and watching the colors and actually asked to drink some water bin between dance moves. I’m really happy with it so far!"},{"reviewerName":"jenna pittssley","rating":"5.0 out of 5 stars","reviewTitle":"Best investment yet","reviewDate":"October 4, 2019","reviewText":"I am in absolute awe of how amazing this product this is. The colors are bright and vibrant and sure to grab my attention and make sure I drink my water. The speaker is so loud and powerful. Everyone at my restaurant job wants to connect to is cause it's such a good speaker. And it's so easy to clean. Also on the plus side my toddler has dropped this water bottle at least 30 times in the 2 days I've had it and it still works :)"},{"reviewerName":"chelsea","rating":"5.0 out of 5 stars","reviewTitle":"Serves its purpose and more!","reviewDate":"March 31, 2019","reviewText":"Myself and everyone are so intrigued by my magical water bottle.. the lights are amazing and I’ve never seen anything like it! The sound is clear and it’s so pretty at night !!"},{"reviewerName":"Rhonda","rating":"5.0 out of 5 stars","reviewTitle":"Love it!","reviewDate":"July 29, 2019","reviewText":"This is the best affordable bottle you can buy. I had a problem with my seal, the seller sent a new one in 2 days. Glad I purchased!! You will not be disappointed."},{"reviewerName":"abby","rating":"3.0 out of 5 stars","reviewTitle":"Not what I expected","reviewDate":"May 7, 2019","reviewText":"The light is not very bright, as displayed, to remind you to drink. Half of the time I didn’t even see the light. The battery runs out pretty quickly as well even if you aren’t listening to music or anything."},{"reviewerName":"Kelly Maguire","rating":"3.0 out of 5 stars","reviewTitle":"good speaker, but not great water bottle","reviewDate":"June 16, 2019","reviewText":"The bottom is not flat so it can easily tip over. The speaker works well. I thought it would remind you to drink but if it does, I haven't figured out how to use it"},{"reviewerName":"Karen S","rating":"5.0 out of 5 stars","reviewTitle":"Loving this Smart water bottle","reviewDate":"September 13, 2019","reviewText":"I love this water bottle it does remind you to drink. Very easy to connect to Bluetooth. The speaker has great sound. The only problem I have is the plug going into the USB; it doesn't seem to fit. I had to use a different plug. I would definitely recommend this water bottle. The lights really do dance to the music."},{"reviewerName":"Cristina","rating":"5.0 out of 5 stars","reviewTitle":"Makes drinking water fun","reviewDate":"October 2, 2019","reviewText":"Keeps water cold even after ice has melted. Sounds and lights help remind me to drink Easy to carry with loop on cap. Speakers are an interesting new treat, never had a water bottle that I could listen to music through. Sturdy cap also. This will make drinking my water more entertaining."},{"reviewerName":"Lene","rating":"5.0 out of 5 stars","reviewTitle":"The music is louder and the bottle is super handy..you can bring everywhere..Love it","reviewDate":"October 24, 2019","reviewText":" LOVE THIS BOTTLE!!! I have a lot of compliments and is loud the music if your water lover and music lover this is for you...I wish I can gave a billion stars I highly recommended... ❤❤❤...Please buy this smart bottle..You will Love it..Super duper cute the bottle and is safe they have a double lock...I'm very happy I bought this smart water....Thank you..❤❤❤❤🥰🥰🥰🥰🥰"},{"reviewerName":"steve sell","rating":"5.0 out of 5 stars","reviewTitle":"Great bottle and speaker!","reviewDate":"March 30, 2019","reviewText":"The kids love the fact that they light up reminding them to drink their water, we love the fact we don’t have to keep hassling them to drink. And, they have a Bluetooth speaker so they can listen to music as well. Great idea!"},{"reviewerName":"Casey M.","rating":"5.0 out of 5 stars","reviewTitle":"Perfect gift for the person trying to be a water drinker!","reviewDate":"October 18, 2019","reviewText":"I bought this for a friend for her birthday. She loved the idea of this water bottle and loves the product! I plan on buying at least one more for a Christmas gift!"},{"reviewerName":"Emily Curtis-Sinkevich","rating":"5.0 out of 5 stars","reviewTitle":"Just what you need without the high price","reviewDate":"August 20, 2019","reviewText":"Simple water bottle to keep you in check on staying hydrated and the Bluetooth is easy to link to your device with no set up needed."},{"reviewerName":"DG","rating":"2.0 out of 5 stars","reviewTitle":"Nice Idea. Poorly made.","reviewDate":"October 31, 2019","reviewText":"Love the idea. But the bottle doesn't seal properly. Sports drink leaked out all over my clothes in my gym bag."},{"reviewerName":"anthony a linn","rating":"5.0 out of 5 stars","reviewTitle":"Wow, had no idea this even existed","reviewDate":"July 30, 2019","reviewText":"Simply amazing, awesome, my wife struggles to keep with her water intake for the day, this makes it so easy, and blue tooth also, wow you cannot beat it, its a must have for anyone"},{"reviewerName":"marwoofal","rating":"5.0 out of 5 stars","reviewTitle":"Amazing and so easy to use!","reviewDate":"October 5, 2019","reviewText":"This bottle is amazing! I’m a 2nd grade teacher who never remembers to drink enough and this is the perfect solution! My students love to tell me my bottle is glowing! It’s a great plus that I can also use it as a speaker and it has a locking top so it’s no big deal if my students knock it over :) I highly recommend it!"},{"reviewerName":"veronica","rating":"3.0 out of 5 stars","reviewTitle":"Meh.","reviewDate":"June 12, 2019","reviewText":"The speaker works great. The mouthpiece is comfortable. However, this only holds 16.9 ounces of water not 22. The lid is hard to close and also leaks."},{"reviewerName":"Nicole S.","rating":"5.0 out of 5 stars","reviewTitle":"Awesome Office Fun!","reviewDate":"October 8, 2019","reviewText":"I was actually impressed with the sound quality for such a small speaker. The plastic for the water bottle is solid and not flimsy or cheap feeling. We are always talking about having a Bluetooth speaker available in the office and this was a super portable and multi-functional solution. The charge holds really well also."},{"reviewerName":"H. Renay Anderson","rating":"5.0 out of 5 stars","reviewTitle":"A Rainbow of Fun!","reviewDate":"August 3, 2019","reviewText":"Hydration is so important to maintain healthy skin, hair, and energy! This is an Awesome reminder that taking care of your health can be fun!"},{"reviewerName":"Kindle Customer","rating":"1.0 out of 5 stars","reviewTitle":"IT DOES NOT DO AS ADVERTISED","reviewDate":"July 10, 2019","reviewText":"I was given one of these bottles for my birthday and it worked wonderfully! The bottle did everything it said it would do; I loved it! I mistakenly dropped it and the cap broke. So, I took it upon myself to order another one and it does not work like the first one at all. It won't hook up to my phone and I can't blue tooth it at all. Very disappointed in this product."},{"reviewerName":"Heather Wilmot-Luna","rating":"5.0 out of 5 stars","reviewTitle":"Awesome 3 in 1","reviewDate":"May 8, 2019","reviewText":"Sorry, this video is unsupported on this browser.\n This is an awesome water bottle. I love how it’s a 3 in 1. I can go for a bike ride and not have to bring a separate speaker for when I’m going out. I love how it reminds you to drink more. There’s times I can just forget to take a drink when I’m in the middle of working. This is the best water bottle I have come across.\n\nThank you!"},{"reviewerName":"sarah hampton","rating":"5.0 out of 5 stars","reviewTitle":"A great help in helping you keep hydrated","reviewDate":"September 6, 2019","reviewText":"I have always had a problem with remembering to drink my water, even if it's right beside me. I love how this bottle gets my attention. The bluetooth speaker and flashing of colors were another thing thst got my attention. Totally would recommend this water bottle to people like me that need that little extra help on keeping hydrated"},{"reviewerName":"Rose","rating":"3.0 out of 5 stars","reviewTitle":"Ok","reviewDate":"July 8, 2019","reviewText":"Really like the speaker it is great quality for the price, but the actual bottle broke within 2 weeks. The lid came off and will not close tight. Ok product but be careful with lid."},{"reviewerName":"shira","rating":"5.0 out of 5 stars","reviewTitle":"Fun, Cool, and Exciting!!!!","reviewDate":"May 21, 2019","reviewText":"The minute I got this water bottle I began using it.... the speakers are very clear and the Bluetooth name came up right away... the batteries also last a long time and the volume can go really loud... its really worth it!!!! get it!!!!"},{"reviewerName":"cristal2199","rating":"5.0 out of 5 stars","reviewTitle":"This is a great product!","reviewDate":"July 31, 2019","reviewText":"I just had weight loss surgery so I heard about this water bottle that lights up to remind you to drink. I LOVE it! The speaker is loud and I love the party lights that goes with the music! It keeps water cold for a while too! Can’t wait to take it to the beach!"},{"reviewerName":"Charles dagley","rating":"5.0 out of 5 stars","reviewTitle":"Great product.","reviewDate":"May 20, 2019","reviewText":"Arrived very quickly. Light up to remind me to drink, which I love since I get busy at work. Will recommend to my friends. My granddaughter loves the Bluetooth speaker. Thank tou so much!"},{"reviewerName":"frances","rating":"5.0 out of 5 stars","reviewTitle":"Love it!","reviewDate":"March 14, 2019","reviewText":"Absolutely love this product!! Has been lighting up every hour for me and my team enjoys the attached Bluetooth speaker. Love having a water bottle that reminds me to up my water intake!! Recommend this and already have to a few coworkers"},{"reviewerName":"Zara S","rating":"5.0 out of 5 stars","reviewTitle":"Great speaker","reviewDate":"April 2, 2019","reviewText":"Wish this went off every hour instead of every 2hrs but it works as advertised. Love the speaker! Very loud and easy to connect"},{"reviewerName":"Amazon Customer","rating":"4.0 out of 5 stars","reviewTitle":"Love the product concept","reviewDate":"April 25, 2019","reviewText":"I love the 3-in-1smart water bottle, the way it feels and lights up. My only issue is I can not get it to connect to my Bluetooth on my phone."},{"reviewerName":"Holly E.","rating":"5.0 out of 5 stars","reviewTitle":"Light","reviewDate":"March 7, 2019","reviewText":"It doesn't light up every 2 hours like it says but it is good quality with a loud speaker and dancing lights. I still love this bottle though! It is easy to use"},{"reviewerName":"Jasmine Uribe","rating":"5.0 out of 5 stars","reviewTitle":"Bomb as heck!!!!","reviewDate":"June 4, 2019","reviewText":"I really like that I bought this gift for my wife she loves it she can take it to work and jam out while staying hydrated. Highly recommend. :) My favorite thing about it is the fact it’s leak proof has a good closing mechanism."},{"reviewerName":"Andi-Lee claar","rating":"5.0 out of 5 stars","reviewTitle":"Works as advertised!","reviewDate":"July 30, 2019","reviewText":"Works as advertised, speaker works great and the top latches closed very well. Wish it had more detailed directions for turning it on and the other functions but other than that the product is great!"},{"reviewerName":"Lucky","rating":"5.0 out of 5 stars","reviewTitle":"Product looks smart and stylish","reviewDate":"July 21, 2019","reviewText":"Excellent product...helps me drink more water during my busy office hours..five + stars .."},{"reviewerName":"Amazon Customer","rating":"4.0 out of 5 stars","reviewTitle":"Better than expected","reviewDate":"April 28, 2019","reviewText":"I had been wanting this water bottle for a while because it looked cool, however, I thought it wouldn’t actually work. I was so wrong! The speaker is way better than I expected and I love that it reminds me to drink water. The only thing I would change is that there was a bigger size, and that the top clasp was a little easier to open. Besides that, I’m loving it so far!"},{"reviewerName":"Midnight Angel","rating":"5.0 out of 5 stars","reviewTitle":"The speaker alone is worth it.","reviewDate":"June 17, 2019","reviewText":"It's worth it for just the speaker. I was lucky to get it for $10. Water bottles alone cost that amount and more. I absolutely love it and would recommend it to anybody."},{"reviewerName":"Ryleigh","rating":"2.0 out of 5 stars","reviewTitle":"Cool but too small and poor lid closure quality.","reviewDate":"August 5, 2019","reviewText":"The button the clips the lid closed broke 2nd time I used the bottle. I then just used the metal clasp to keep it closed and that ended up coming off. The bottle can't be used now unless I want it spilling all over. The speaker sounds good in the house but not outside."},{"reviewerName":"Sharlene England","rating":"4.0 out of 5 stars","reviewTitle":"One item. Two choices!!","reviewDate":"July 1, 2019","reviewText":"Love the sound ,the price and the quality. Need to order another one for my 4 yr old granddaughter. She loves it!"},{"reviewerName":"Tehya Noell","rating":"5.0 out of 5 stars","reviewTitle":"Great bottle minor flaw","reviewDate":"July 7, 2019","reviewText":"This water bottle is awesome! The speaker is amazing quality for the bottom of a water bottle. The little hook to help lock the cap closed does pop off and can be annoying but just pop it back in and you’re good to go! The people saying the light doesn’t work anymore to remind them might not be paying attention and miss it lighting up. Mine has continuously worked."},{"reviewerName":"Amanda","rating":"2.0 out of 5 stars","reviewTitle":"I wouldn’t recommend","reviewDate":"October 7, 2019","reviewText":"It’s heavier then I was expecting. A couple weeks after I had it the lid broke and It takes a lot of effort to close the bottle. This wasn’t worth it to me. I can use the Bluetooth speaker but I won’t use the bottle. Oh I also thought every hour it would stop glowing if you picked it up and drank it but it just keeps glowing for a few minutes."},{"reviewerName":"Suzanne Regalado","rating":"5.0 out of 5 stars","reviewTitle":"Great product","reviewDate":"March 18, 2019","reviewText":"I wasn't sure how this product would compare to the Hydrate product, but it is actually pretty convenient. It lights up and also allows you to hook to Bluetooth if you are outside running/walking and don't want your headphones on. It comes apart easily so you can run it in the dishwasher and holds the charge very well. I would recommend this product to anyone who is trying to compare this product to Hydrate."},{"reviewerName":"Ladydee","rating":"5.0 out of 5 stars","reviewTitle":"Adorable idea","reviewDate":"July 18, 2019","reviewText":" I loved this water bottle! Absolutely adorable and fun! Can’t wait to use it at my desk so I can finally enjoy music! Great price too!!!"},{"reviewerName":"Mina Rodriquez","rating":"5.0 out of 5 stars","reviewTitle":"Work's Exactly as advertised","reviewDate":"May 10, 2019","reviewText":"I didn't really know what to expect when I purchased this bottle. But, everything works perfectly. The sound is great, the bottle lights up. It does everything it says it does. :-) I would definitely recommend this to a friend or co-worker."},{"reviewerName":"Daniel Ibarrondo","rating":"5.0 out of 5 stars","reviewTitle":"Love the reminder to drink water!","reviewDate":"September 1, 2019","reviewText":"I wasn't much of a water drinker ever! After being advised that I was dehydrated and needed to drink more water a friend suggested the Smart Water Bottle. I'm so glad I purchased it! I keep it on my office desk and the glow reminds me to drink water. The speaker is an added bonus as I like to hear music while I work. Great product as described!"},{"reviewerName":"Amelia Yehoshua","rating":"5.0 out of 5 stars","reviewTitle":"Amazing for a price and even for double the price!","reviewDate":"July 13, 2019","reviewText":"Thank you so much for inventing this speaker / water bottle/ light up toy! I love everything about this water bottle including the way that it is opened, the way that went you play it on a wooden desk you can really feel the bass. This water bottle is overall is an amazing purchase. There is nothing to complain about here. Will probably buy as a gift. Thanks!"},{"reviewerName":"T. Urish","rating":"1.0 out of 5 stars","reviewTitle":"Directions could be better","reviewDate":"November 11, 2019","reviewText":"The bottom part falls off easily. I never could figure out how to get it to work."},{"reviewerName":"Sadhana Narasimhan","rating":"5.0 out of 5 stars","reviewTitle":"Cool!","reviewDate":"May 15, 2019","reviewText":"How cool is this! Plays music and also reminds me to drink water. I forgot often to drink water, this will remind me now"},{"reviewerName":"Jolie","rating":"5.0 out of 5 stars","reviewTitle":"Really does work","reviewDate":"September 25, 2019","reviewText":"I love this water bottle! The speaker is great and it does remind you every hour to drink water! I love the changing light colors too."},{"reviewerName":"catrina haith","rating":"5.0 out of 5 stars","reviewTitle":"Love it.","reviewDate":"October 8, 2019","reviewText":"It's so awesome. After my daughter saw mines. I had to order her one. Lol"},{"reviewerName":"Cherryleedrinkard","rating":"3.0 out of 5 stars","reviewTitle":"Gimic","reviewDate":"July 2, 2019","reviewText":"Just get a water bottle that keeps things cold or hot. Not a good value"},{"reviewerName":"Suzannah J. Boysen","rating":"4.0 out of 5 stars","reviewTitle":"Effective!","reviewDate":"October 2, 2019","reviewText":"This has been really helpful in reminding me to drink more water. The lid is a little poorly made but I like the spout which makes it easier to drink water. Bluetooth is always a bonus. I would recommend!"},{"reviewerName":"Danthia","rating":"4.0 out of 5 stars","reviewTitle":"Good quality","reviewDate":"May 17, 2019","reviewText":"I’m giving it a 4 star due to the fact the bottom doesn’t come on at all... but the bottle itself is great👌🏽 But just upset it’s not working"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Flashes with music! Fun and practical","reviewDate":"September 8, 2019","reviewText":"I gave this as a gift to my cousin and he really enjoyed it- we played with the different modes and colors and music (yes there is a speaker on the bottle and the lights can flash to it!) and filled it with water to see how the water lit up. Thank you!"},{"reviewerName":"Gisselle Alonso","rating":"5.0 out of 5 stars","reviewTitle":"So cute and functional!","reviewDate":"July 15, 2019","reviewText":"This water bottle is soooo cute!! The sound quality is so good and clear and the colors are so cool! I took it to work and everyone fell in love with it!!!!"},{"reviewerName":"ZSG","rating":"4.0 out of 5 stars","reviewTitle":"Like it so far!","reviewDate":"September 15, 2019","reviewText":"So far it is a good water bottle. The speaker is really loud, LOVE IT!"},{"reviewerName":"Chandra M.","rating":"5.0 out of 5 stars","reviewTitle":"Very unique/get your kids drinking!","reviewDate":"June 21, 2019","reviewText":"I absolutely love this! I can workout, listen to music, and stay hydrated without needing my phone by my side! It's cute and unique. My children are trying to take it. Good motivation to get kids to drink up."},{"reviewerName":"Kitty B.","rating":"3.0 out of 5 stars","reviewTitle":"Cool,but not very durable.","reviewDate":"September 10, 2019","reviewText":"It's a really cool idea,but don't drop it. I got it Sunday,on Tuesday I dropped it on linoleum floor and it cracked in 3 place. Loved it for the 3 days I had it, though."},{"reviewerName":"Abby B.","rating":"5.0 out of 5 stars","reviewTitle":"10 out of 10 Best Functional Waterbottle","reviewDate":"September 11, 2019","reviewText":"For a water bottle enthusiast, this is the unique type of water bottles I am ecstatic to add to my collection. The bottle is unique and has so much functionality! This is built to be versatile for not only the office to outdoor adventures."},{"reviewerName":"LaShawn","rating":"5.0 out of 5 stars","reviewTitle":"Must have","reviewDate":"October 30, 2019","reviewText":"I love this product i use it everyday I bought this product cause its hard for me to remember to drink water at work and the bonus part to me was that it had a bluetooth speaker"},{"reviewerName":"JG","rating":"5.0 out of 5 stars","reviewTitle":"Get this water bottle!!","reviewDate":"September 29, 2019","reviewText":"Exceeded my expectations! I have been looking for an affordable smart water bottle, and the price was right on this one, so I pulled the trigger and bought it. I guess I didn’t read the description very well, because it was a complete surprise to me that it also has a Bluetooth speaker! All around great value and I’m super happy with it!"},{"reviewerName":"Viewer","rating":"5.0 out of 5 stars","reviewTitle":"Great!","reviewDate":"November 4, 2019","reviewText":"Amazing bottle! Great sun on the speaker, very cute lighting features."},{"reviewerName":"M. Bahringer","rating":"4.0 out of 5 stars","reviewTitle":"Surprisingly Good Speaker","reviewDate":"December 9, 2018","reviewText":"I was pleasantly surprised how good the speaker is. The colors are cool. I think it's a good conversation piece at work!"},{"reviewerName":"S.V.","rating":"2.0 out of 5 stars","reviewTitle":"Music speaker sucks","reviewDate":"September 16, 2019","reviewText":"The speaker doesn’t work. I tried playing music on it and it’s super staticky and cuts in and out. I emailed the company and never got a response. So basically I got a product that half works."},{"reviewerName":"swtgirlcass16","rating":"5.0 out of 5 stars","reviewTitle":"Great smart water bottle","reviewDate":"June 22, 2019","reviewText":"This is more than a water bottle with bluetooth features to play music! Water bottle looks to be well constructed and easy to use based on the instructions. Can't wait to use this water bottle and hopefully drink more water."},{"reviewerName":"Desirae Martinez","rating":"1.0 out of 5 stars","reviewTitle":"Does not work as described.","reviewDate":"August 18, 2019","reviewText":"Turns itself off after being on for one minute. It does not work as described."},{"reviewerName":"Brenda","rating":"5.0 out of 5 stars","reviewTitle":"A good buy!","reviewDate":"June 6, 2019","reviewText":"I love this bottle. i seen someone with one I ordered one the same day went to work an a coworker wanted it so I gave it to them an order me another love the way it sounds thank you. Nice product."},{"reviewerName":"Zambu","rating":"5.0 out of 5 stars","reviewTitle":"Fun water bottle","reviewDate":"August 15, 2019","reviewText":"This water bottle is fun for the backyard or bike riding. The speaker pairs easily with my smartphone and has good sound. Detachable for easy cleaning. Good sound for such a small speaker. Great price. Fast shipping."},{"reviewerName":"scott c laird","rating":"5.0 out of 5 stars","reviewTitle":"works for me","reviewDate":"April 26, 2019","reviewText":"i like it , first day i put away 120 oz of water and i normaly would do a 20oz bottle"},{"reviewerName":"Jessie Nelson","rating":"5.0 out of 5 stars","reviewTitle":"It's Amazing!!!","reviewDate":"September 26, 2019","reviewText":" I love this water bottle, although it is the second one as for the first one leaked. Amazon sent me a new one and this one works perfectly, no leaks and it does light up on the hour to remind me to drink. Definitely going to order more as Christmas presents."},{"reviewerName":"Alonso Arias","rating":"3.0 out of 5 stars","reviewTitle":"Disappointed","reviewDate":"March 4, 2019","reviewText":"Purchased two of these and pretty much everything is like they say except one of them leaks and will need to be returned."},{"reviewerName":"ERIC","rating":"1.0 out of 5 stars","reviewTitle":"Not cool","reviewDate":"June 9, 2019","reviewText":"Mines didn’t come with any directions and it hasn’t remained me to drink either"},{"reviewerName":"daisy pinkston","rating":"3.0 out of 5 stars","reviewTitle":"I like the idea.","reviewDate":"June 1, 2019","reviewText":"I like the bottle and concept. Quality of the bottle is what you expect for price. Only thing I dislike is the time it reminds you. It says on amazon 1 hour but it's actually 2 hours. I'm busy at work and forget to drink but drinking only once every 2 hours isnt anywhere near enough."},{"reviewerName":"verna","rating":"3.0 out of 5 stars","reviewTitle":"Instructions was poor.","reviewDate":"November 11, 2019","reviewText":"Could not read instructions was not readable"},{"reviewerName":"Shopalot","rating":"2.0 out of 5 stars","reviewTitle":"I would pass on this","reviewDate":"May 24, 2019","reviewText":"Would light at random moments and had a mind of its own"},{"reviewerName":"Lauren","rating":"5.0 out of 5 stars","reviewTitle":"Speaker is clear and crisp","reviewDate":"September 28, 2019","reviewText":"Great product! Works great we love it!"},{"reviewerName":"Dee","rating":"5.0 out of 5 stars","reviewTitle":"It looks just like the picture.","reviewDate":"September 26, 2019","reviewText":"I like everything about this cup will be ordering more for Xmas gifts"},{"reviewerName":"LovelyNessa","rating":"5.0 out of 5 stars","reviewTitle":"Great product!!","reviewDate":"September 29, 2019","reviewText":"I’m a nursing assistant and we can’t have our phone on us but we can have our bottle of water on us. And this works great for me and helps me get through my 12 hours at work being able to listen to music."},{"reviewerName":"Ezz Khattab","rating":"5.0 out of 5 stars","reviewTitle":"Quality bottle and speaker","reviewDate":"February 23, 2019","reviewText":"Bottle quality is really well-made, and the speaker volume is really, really decent and loud.. it is even louder than my JBL Go, and the LED light reminder feature is handy... a 5/5 from me."},{"reviewerName":"Ebonesha Cooper","rating":"5.0 out of 5 stars","reviewTitle":"Bluetooth speaker","reviewDate":"March 30, 2019","reviewText":"I LOVE this water bottle. I love that I can listen to music through the Bluetooth speaker in my office and that it lights up to remind me that I need to drink water! I can walk at the park and still enjoy listening to music with my kids since I don’t like to have in headphones while being out with them."},{"reviewerName":"Mike Hegarty","rating":"5.0 out of 5 stars","reviewTitle":"Great buy!!!","reviewDate":"February 18, 2019","reviewText":"Bought it for my daughter and she loves it. She loves having a speaker attached to her water bottle."},{"reviewerName":"Adam Henning","rating":"5.0 out of 5 stars","reviewTitle":"Cool water bottle","reviewDate":"June 15, 2019","reviewText":"Light works speaker is awesome but ice doesn't last very long."},{"reviewerName":"aleli","rating":"5.0 out of 5 stars","reviewTitle":"Love it","reviewDate":"August 12, 2019","reviewText":"Just like the picture and perfect love it coming for another one"},{"reviewerName":"Javis H.","rating":"5.0 out of 5 stars","reviewTitle":"Awesome water bottle!","reviewDate":"October 11, 2019","reviewText":"Love, Love, Love this water bottle. The speaker has great sound, cool light features and holds enough water to make sense. Now everyone in my family wants one too"},{"reviewerName":"Jessica M.","rating":"4.0 out of 5 stars","reviewTitle":"Perfect water bottle for hiking and camping!","reviewDate":"December 14, 2018","reviewText":"Works great, the light reminds me to drink water and the speaker is perfect for hiking trails!"},{"reviewerName":"Harley","rating":"5.0 out of 5 stars","reviewTitle":"Bottle Lights up to remind you to drink water","reviewDate":"October 20, 2019","reviewText":"This product is AMAZING. I just recently had gastric bypass surgery and I keep forgetting to drink water. This bottle lights up to remind me. Love it!!"},{"reviewerName":"Brooks Freeman","rating":"5.0 out of 5 stars","reviewTitle":"Excellent product","reviewDate":"September 19, 2019","reviewText":"I really like the product as a whole. This speaker sounds excellent in loud. No leaking anywhere on the bottle. The lights worked better than expected. The only Thing I would Change is I would have a separate Button for the lights instead of using the pause button for the radio and the arrow button for the radio."},{"reviewerName":"paula","rating":"5.0 out of 5 stars","reviewTitle":"LOVE IT!!","reviewDate":"March 12, 2019","reviewText":"Love this water bottle! I have used it daily for over a month now. The sound that the speaker puts out is AMAZING!"},{"reviewerName":"vwbgnu naples fl","rating":"2.0 out of 5 stars","reviewTitle":"Breaks too easily.","reviewDate":"May 28, 2019","reviewText":"Breaks too easily. Mine just started making a high pitch nose and you can’t shut it off only plug it in to make it stop. It can do that but not give you an audible notification. Weird. Oh and now I am one day outside the return. Lol. This would be the third broken in a month."},{"reviewerName":"Manuel belloso","rating":"5.0 out of 5 stars","reviewTitle":"A Hydro flask is too boring.","reviewDate":"June 21, 2019","reviewText":"Remember the water dancing speaker you always wanted? Well this is it in the form of a water bottle. The sound is so crisp, the lights look gorgeous, the design is beautiful, and this is truly a smart water bottle that lights up to remind you to drink more water. It's the one item you never knew you needed."},{"reviewerName":"Catherine S. Tabor","rating":"5.0 out of 5 stars","reviewTitle":"Great for walks or bike rides","reviewDate":"May 4, 2019","reviewText":"It's a bit heavy when filled but great for walks or bike rides with the speaker."},{"reviewerName":"Leonardo Gonzalez","rating":"5.0 out of 5 stars","reviewTitle":"Fun water bottle","reviewDate":"July 23, 2019","reviewText":"The speaker is surprisingly loud and the lights are very cool. Traveling with a portable speaker is usually inconvenient but having it attached to the bottle is a great idea. My previous bottle had a mouth piece you had to bite that was very hard to clean and this is much more simple and easy. Worth it."},{"reviewerName":"ALISON","rating":"1.0 out of 5 stars","reviewTitle":"Doesn't remind you at all.","reviewDate":"October 16, 2019","reviewText":"I found the directions difficult. I was under the impression that it lights up every hour as a reminder. Mine simply changes colors continuously. The Company does not respond to emails for help. A waste of money!"},{"reviewerName":"mark neu","rating":"5.0 out of 5 stars","reviewTitle":"Best gift ever","reviewDate":"April 21, 2019","reviewText":"I bought this product for my daughter for a gift. She likes to listen to music when she rides her bike and headphones are dangerous. She absolutely loves it. The speaker works awesome. It is easy to clean. I would definitely recommend this to others. Great for teenagers."},{"reviewerName":"Boi Prashasouk","rating":"5.0 out of 5 stars","reviewTitle":"Kid Approved","reviewDate":"March 17, 2019","reviewText":"Bought this for my son and he absolutely loves it. He puts allll of his drinks in there. Also loves how it’s detachable and I don’t have to worry about messing up the speakers. I would recommend this product and buy again as they make perfect gifts!"},{"reviewerName":"Rae Ann Anderson","rating":"1.0 out of 5 stars","reviewTitle":"3-in-1 smart water bottle","reviewDate":"March 13, 2019","reviewText":"My drinking glass does not light up to remind me to drink my water! First time using it and I've got it turned on. Disappointed with it! Could have saved 20 bucks!!"},{"reviewerName":"Elinor","rating":"2.0 out of 5 stars","reviewTitle":"Not recommended","reviewDate":"August 15, 2019","reviewText":"Not Recommended at all I use only 4 times and the cover at lid it’s broke"},{"reviewerName":"Sheerina","rating":"5.0 out of 5 stars","reviewTitle":"Versatile and Functional","reviewDate":"August 23, 2019","reviewText":"The product is awesome. I have been using it all week and took it to the pool and there have been no issues. Love the lights feature. It captures my attention to drink water and is fun. The speaker function is Handy so I do not have to carry more than one item. It's all in one."},{"reviewerName":"Amazon Customer","rating":"1.0 out of 5 stars","reviewTitle":"Great Gift Idea","reviewDate":"July 18, 2019","reviewText":"Lights stopped working and does not keep water cold. Very cool product at first. Surprisingly loud speakers. Great for taking to the pool or on hikes. Short battery life and keeping water colder for longer period of time."},{"reviewerName":"N Wilson","rating":"2.0 out of 5 stars","reviewTitle":"No volume control","reviewDate":"September 15, 2019","reviewText":"Unable to adjust the volume on the speaker. Also plastic of the bottle seems flimsy. That is will break after being dropped a few times. I need a bottle that is sturdier since I constantly drop things."},{"reviewerName":"Chele Bell","rating":"5.0 out of 5 stars","reviewTitle":"Most awesome water bottle!","reviewDate":"July 25, 2019","reviewText":"I absolutely love my new 3 in 1 water bottle. The sound coming out of the speaker is amazing. Ice water and music are my two favorite things and now I can have both of them in one. I highly recommend this product."},{"reviewerName":"Renado Lewis","rating":"4.0 out of 5 stars","reviewTitle":"Hot beverages not recommended","reviewDate":"December 28, 2018","reviewText":"Great gift for my son. He loves the color changing led. He carries it everywhere."},{"reviewerName":"krzy612","rating":"5.0 out of 5 stars","reviewTitle":"Great water bottle","reviewDate":"November 7, 2019","reviewText":"Has very sleek design and works very well."},{"reviewerName":"Helene Lindstr&ouml;m Sj&ouml;din","rating":"5.0 out of 5 stars","reviewTitle":"Great","reviewDate":"November 8, 2019","reviewText":"Awsome"},{"reviewerName":"Samantha","rating":"5.0 out of 5 stars","reviewTitle":"Staying hydrated is the key","reviewDate":"July 12, 2019","reviewText":"I've always tried to drink water and its been hard, with this remarkable bottle it reminds me to drink when it lights up which is pretty darn cool. The music also is a plus while im at work. Im a teacher so my class can listen to soothing music while working. Really creative invention."},{"reviewerName":"Liesl E.","rating":"4.0 out of 5 stars","reviewTitle":"Excellent gift!!","reviewDate":"November 3, 2019","reviewText":"Bought as a gift for my daughter. She loves it! The dance moves lights are great. It was super easy to pair and is incredibly loud. Much louder that I was expecting. My 2 younger children want one now too. Only change I would possibly suggest is to make it bigger to hold more water."},{"reviewerName":"Laurie","rating":"5.0 out of 5 stars","reviewTitle":"Great value","reviewDate":"June 24, 2019","reviewText":"Not only do I love my IceWater, but all my co-workers love it. Plus I am getting them for gifts this year. I am terrible about drinking water and this is exactly what I needed with an added bonus. Love the speaker. Always with me!"},{"reviewerName":"Alexis Hart","rating":"5.0 out of 5 stars","reviewTitle":"Great Purchase","reviewDate":"June 24, 2019","reviewText":"I have always struggled with drinking enough water. This was a well priced solution that reminds me to drink water each hour. It does the trick and I have had no issues. Would order again in a heartbeat."},{"reviewerName":"jennifer George","rating":"5.0 out of 5 stars","reviewTitle":"Love this water bottle","reviewDate":"March 8, 2019","reviewText":"I bought one of these bottles and loved it so much had to by 3 more for my kids :) I love how it lights up to remind you to take a drink, and I love listening to my music through this, the sound is just awesome . I use this every day at work and at home !!"},{"reviewerName":"DCH","rating":"1.0 out of 5 stars","reviewTitle":"Practical, cute bottle!","reviewDate":"March 14, 2019","reviewText":"Very practical, Bluetooth speakers are super handy! Love the glowing! Amazing!"},{"reviewerName":"Kindle Customer","rating":"5.0 out of 5 stars","reviewTitle":"Water bottle","reviewDate":"July 24, 2019","reviewText":"Good quality"},{"reviewerName":"Andrea","rating":"5.0 out of 5 stars","reviewTitle":"Fun bottle!!","reviewDate":"June 18, 2019","reviewText":"The quality of the bottle is great. The fact that it has lights to remind you to drink sounds silly but it works with our busy schedules. We originally purchased the bottle for a contest prize at work, I found it so nice that I HAD to buy one for myself. Speaker is a plus!!"},{"reviewerName":"CS","rating":"5.0 out of 5 stars","reviewTitle":"Never forget to drink your water again!","reviewDate":"March 27, 2019","reviewText":"Love this product! Great way to remind me to drink more water. I've been looking for a product like this and this one is reasonably priced and does exactly what I wanted. Received promptly after ordering too - great seller and great product!"},{"reviewerName":"DE","rating":"4.0 out of 5 stars","reviewTitle":"Cool!","reviewDate":"July 25, 2019","reviewText":"I like this water bottle. Very easy to clean. Clear nice sound on the speaker. The only thing I don't like is when I get ready to drink I have to hold the top down so that it doesn't hit me in the nose....LOL"},{"reviewerName":"Kelli","rating":"5.0 out of 5 stars","reviewTitle":"Great product","reviewDate":"November 10, 2019","reviewText":"Leak proof!!!! Amazing speaker!!!! Hourly reminder!!!\nI was looking for a way to be intentional with my water intake, and this water bottle is the answer. You won’t find a better bottle for the price! I am definitely purchasing more as Christmas gifts for the family."},{"reviewerName":"Luis Eloy Tellez_becares","rating":"5.0 out of 5 stars","reviewTitle":"I recommend it","reviewDate":"May 12, 2019","reviewText":"All excellent"},{"reviewerName":"dancermom","rating":"5.0 out of 5 stars","reviewTitle":"Helps diet water tracking!","reviewDate":"October 7, 2019","reviewText":"I love this water bottle! I’m doing a diet program where I am supposed to drink 64 oz of water daily and I just forget. This bottle keeps me on track which really helps in my diet. I love both the lights and the music and it charges easily!"},{"reviewerName":"itzel","rating":"5.0 out of 5 stars","reviewTitle":"Great purchase !","reviewDate":"August 20, 2019","reviewText":"Was looking for the dancing waters speakers when I saw this, decided to give it a try and I am very happy!"},{"reviewerName":"Jess_SD","rating":"5.0 out of 5 stars","reviewTitle":"Amazing Value!!","reviewDate":"May 13, 2019","reviewText":"I wish I could give this bottle more than 5 stars! The speaker is amazing and the price is incredible! Highly recommend this product!"},{"reviewerName":"Nicole","rating":"5.0 out of 5 stars","reviewTitle":"Better than expected!","reviewDate":"August 1, 2019","reviewText":"This gift is so much better than I thought it would be! I just really wanted to be reminded to drink water but was shocked at how great the sound is! Very much recommend! Easy to use and pair to your phone!!"},{"reviewerName":"Destinee","rating":"5.0 out of 5 stars","reviewTitle":"Love It","reviewDate":"February 18, 2019","reviewText":"This water bottle was pretty impressive The speaker works great and I love the lighting."},{"reviewerName":"ama","rating":"5.0 out of 5 stars","reviewTitle":"👍","reviewDate":"June 18, 2019","reviewText":"👍"},{"reviewerName":"PNJ","rating":"4.0 out of 5 stars","reviewTitle":"Great Idea!","reviewDate":"June 21, 2019","reviewText":"I only wish it held more water. Other than all that, its perfect! I got it for my sister and she loves it! Uses it with her bike."},{"reviewerName":"maria brooks","rating":"5.0 out of 5 stars","reviewTitle":"Works great","reviewDate":"March 18, 2019","reviewText":"Product works great, I got it to help my son remember to drink water and it has done that."},{"reviewerName":"Leila Willingham","rating":"5.0 out of 5 stars","reviewTitle":"Brilliant!","reviewDate":"July 5, 2019","reviewText":"This thing is awesome!!!! It sounds crazy that a silky light would remind you to drink water, but it does! I take it on walks, so the speaker is the coolest bonus feature ever! Awesome gift too. Highly recommend!!"},{"reviewerName":"gabe","rating":"5.0 out of 5 stars","reviewTitle":"100% satisfied","reviewDate":"September 3, 2019","reviewText":"Absolutely love this water bottle. Its difficult to get my 4yr old to drink her H2O with the cool light affects it’s like a game to her and drinks up. The speaker is awesomely loud. Five stars for sure!"},{"reviewerName":"LC","rating":"5.0 out of 5 stars","reviewTitle":"Love it","reviewDate":"April 25, 2019","reviewText":"Love it got one for my mom & myself"},{"reviewerName":"Harri watkin","rating":"5.0 out of 5 stars","reviewTitle":"Overall great product","reviewDate":"August 1, 2019","reviewText":"Amazing product, was a bit unsure when I ordered it but the bottle is the perfect size for what I need and the sound quality from the Bluetooth speaker is unbelievable. Shipping was fast and easy. It took a week to come which is good as it came from over seas."},{"reviewerName":"Michael J. Potapa","rating":"5.0 out of 5 stars","reviewTitle":"Great smart water bottle!!!","reviewDate":"July 23, 2019","reviewText":"This water bottle exceeded my expectations! I bought this for my wife who always tells me she doesn’t drink enough water and now she gets hourly reminders! She also likes the speaker and it gets much louder than I thought it would. Great buy for the price!"},{"reviewerName":"Princess","rating":"5.0 out of 5 stars","reviewTitle":"Love it","reviewDate":"March 15, 2019","reviewText":"Great water bottle excellent light glow & music I love it will purchase a next one for my sister."},{"reviewerName":"david castro","rating":"5.0 out of 5 stars","reviewTitle":"Genius","reviewDate":"April 14, 2019","reviewText":"Super cool concept! Love it"},{"reviewerName":"S. Crosara","rating":"5.0 out of 5 stars","reviewTitle":"Awesome gift!","reviewDate":"June 22, 2019","reviewText":"Awesome quality, the speaker is clear and super loud, this was such a legit gift! The lights are such a fun addition, I am super impressed with this water bottle!"},{"reviewerName":"Kathryn A. Kerkhove","rating":"4.0 out of 5 stars","reviewTitle":"Love It!!!","reviewDate":"September 4, 2019","reviewText":"I'll be honest the first one I had lasted about a month, it stopped working. The company replaced it & this one is working well. I use it while ridding while my bike. Sound quality is good and I'm happy with it."},{"reviewerName":"Nelsy marte","rating":"5.0 out of 5 stars","reviewTitle":"Great sound and beautiful lights","reviewDate":"July 29, 2019","reviewText":"This water bottle is awesome, the speaker is very clear and loud, I am very satisfied with it. The best water bottle made yet."},{"reviewerName":"Melissa","rating":"5.0 out of 5 stars","reviewTitle":"Fun water bottle!","reviewDate":"October 21, 2019","reviewText":"I waited a bit before writing my review. I like the sound quality, lid lock and LED lights. People are amazed I can play my music and talk radio through it. Be sure to add plenty of ice so the lights show more brightly."},{"reviewerName":"Thomas Koch","rating":"5.0 out of 5 stars","reviewTitle":"Replacement came works great!","reviewDate":"April 7, 2019","reviewText":" Replacement came, and works great!"},{"reviewerName":"Kristopher Caughie","rating":"5.0 out of 5 stars","reviewTitle":"Works as described!","reviewDate":"October 14, 2019","reviewText":"This water bottle has made drinking water so much more fun and definitely helps me remember to drink water all throughout the day. The speaker works great with great sound quality, is easy to use clean and does not leak."},{"reviewerName":"Amy","rating":"5.0 out of 5 stars","reviewTitle":"It’s awesome!!","reviewDate":"September 2, 2019","reviewText":"Definitely a cool product, speaker is pretty loud and give a little bump, and the colors in the water bottle are amazing, does what it says... The speaker detaches as well, lid comes off for easy cleaning will definitely buy another.."},{"reviewerName":"Courtney Briahn Fauntroy","rating":"5.0 out of 5 stars","reviewTitle":"10/10 Recommend!","reviewDate":"April 3, 2019","reviewText":"The light reminder definitely encourages me to drink more water, super easy to wash, and the bluetooth speaker is really convenient for exercising or even discreetly playing music at your desk. Everyone at work has been raving asking how to get one!"},{"reviewerName":"Tammy","rating":"5.0 out of 5 stars","reviewTitle":"Helps with my water intake so much!!!!","reviewDate":"April 2, 2019","reviewText":"This cup is AMAZING!! I bought it to help remind me to drink, which it definitely does, with the added perk of a speaker!!! If you are on the fence, get off and buy this!! You will not be disappointed."},{"reviewerName":"TS1","rating":"5.0 out of 5 stars","reviewTitle":"Perfect","reviewDate":"May 31, 2019","reviewText":"Perfect"},{"reviewerName":"Amanda L","rating":"5.0 out of 5 stars","reviewTitle":"Top stays secure so it doesn’t leak","reviewDate":"June 21, 2019","reviewText":"The bottle is very easy to clean, charging is no problem and no need to buy extra batteries. I was not expecting the music quality to be as great as it is, but it is clear and gets pretty loud. The box it comes in makes it easy to give as a gift."},{"reviewerName":"Karen LaFrance, Social Worker","rating":"1.0 out of 5 stars","reviewTitle":"Very Unhappy","reviewDate":"May 12, 2019","reviewText":"Very disappointed that reminder function does not work. It is the only reason I bought the bottle. The enclosed instructions are incomplete and poorly written."},{"reviewerName":"Amazon Customer","rating":"1.0 out of 5 stars","reviewTitle":"You get what you pay for with this water bottle!","reviewDate":"June 14, 2019","reviewText":"Left the water bottle on as described but the hourly lights do not turn on. Also, the disco lights feature do not work despite following instructions. Terrible product and I wouldn't recommend buying."},{"reviewerName":"Diana Gutierrez","rating":"5.0 out of 5 stars","reviewTitle":"Was to try to connect to my Bluetooth","reviewDate":"June 24, 2019","reviewText":"I love this item it works really good"},{"reviewerName":"Amazon Customer","rating":"4.0 out of 5 stars","reviewTitle":"Great Product!","reviewDate":"March 21, 2019","reviewText":"I love the lights...and honestly, I wasn't all that interested in the speaker feature, but the sound is surprisingly good and I have actually used it a time or two :) Great value... without a doubt, I drink more water because of this bottle!!!"},{"reviewerName":"Arleth G","rating":"5.0 out of 5 stars","reviewTitle":"The best water bottle I’ve seen.","reviewDate":"July 15, 2019","reviewText":"I got this as a gift for my boyfriend and he LOVED it. The speaker works better than I thought it would. Sounds so good. Easy to use. Easy to connect and figuring out the settings wasn’t hard to do either. Might get one for myself after this!"},{"reviewerName":"sandra mcgillicky","rating":"5.0 out of 5 stars","reviewTitle":"Great item","reviewDate":"February 25, 2019","reviewText":"Glad I ordered this item it's wonderful"},{"reviewerName":"Cynthia Rhodes","rating":"4.0 out of 5 stars","reviewTitle":"G","reviewDate":"September 30, 2019","reviewText":"Gift"},{"reviewerName":"Logan bennett","rating":"5.0 out of 5 stars","reviewTitle":"Bluetooth speaker is really great","reviewDate":"September 25, 2019","reviewText":"Buying this bottle was money well spent. The speaker alone is well worth the price as it is better than most Bluetooth speakers I've seen on the market. The bottle is really durable and easy to clean. In all a great bottle for everyday use."},{"reviewerName":"Y.D","rating":"5.0 out of 5 stars","reviewTitle":"Amazing product","reviewDate":"March 14, 2019","reviewText":"Great product my daughter loves it!"},{"reviewerName":"Kelly Jo","rating":"5.0 out of 5 stars","reviewTitle":"Great bottle and awesome speaker!","reviewDate":"November 10, 2019","reviewText":"I really like this water bottle! The blowing to remind me to drink is great, but I also really love the speaker! It’s great for when I’m on the treadmill and need some music plus my water! Very happy with it!"},{"reviewerName":"Cathilina Robinson","rating":"5.0 out of 5 stars","reviewTitle":"Water bottle","reviewDate":"March 16, 2019","reviewText":"I received this water bottle abd i absolutely love it"},{"reviewerName":"Ashton Whitley","rating":"5.0 out of 5 stars","reviewTitle":"Really Cool Water Bottle","reviewDate":"August 8, 2019","reviewText":"Awesome Product!!!! Absolutely handy and the fact that its rechargeable and you dont have to constantly replace the batteries is a plus"},{"reviewerName":"TS1","rating":"5.0 out of 5 stars","reviewTitle":"This is a perfect water bottle!","reviewDate":"March 23, 2019","reviewText":"Best by far"},{"reviewerName":"Jennifer Lotti","rating":"1.0 out of 5 stars","reviewTitle":"Didnt like it,returned within a few days","reviewDate":"July 6, 2019","reviewText":"Hard to connect,came on by itself,didnt light up at all..horrible instructions"},{"reviewerName":"tracy d.","rating":"5.0 out of 5 stars","reviewTitle":"Awesome","reviewDate":"March 16, 2019","reviewText":"My daughter loves this water bottle, great speaker on it too !"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Love, Love, Love!","reviewDate":"April 2, 2019","reviewText":"This is the coolest water bottle! The speaker is amazing! Shockingly the bottle is not heavy at all. The water bottle itself is a little smaller than I would prefer but overall an amazing buy!!!! Highly recommend!"},{"reviewerName":"Caitlin Brozell","rating":"5.0 out of 5 stars","reviewTitle":"Loud speaker, bright lights","reviewDate":"March 31, 2019","reviewText":"The color is very nice- it is a very nice size. I was surprised with how powerful the Bluetooth speaker was and the lights are very bright. It does exactly what I need it to and more!"},{"reviewerName":"Thomas","rating":"5.0 out of 5 stars","reviewTitle":"You will absolutely love this water bottle ❤️👍","reviewDate":"September 3, 2019","reviewText":"I love this water bottle. I have a lot of water bottles but none as versatile as this one. The speaker is great it is loud enough and has fantastic sound quality. The changing lights are a great bonus. I ABSOLUTELY LOVE IT ❤️"},{"reviewerName":"Jackson","rating":"5.0 out of 5 stars","reviewTitle":"So good that you would want to purchase it again!","reviewDate":"April 27, 2019","reviewText":"Best Smart Water Bottle i ever bought! I will be buying 2 more! Even comes with a locking mechanism! The water bottle is designed with the highest consideration to serves its users!"},{"reviewerName":"roberta","rating":"5.0 out of 5 stars","reviewTitle":"The sound quality","reviewDate":"March 29, 2019","reviewText":"I ordered 2 and my daughter really thought it was kewl sounds great. Bluetooth connects easy and quick"},{"reviewerName":"daimara","rating":"5.0 out of 5 stars","reviewTitle":"Lo recomiendo 100%","reviewDate":"June 11, 2019","reviewText":"Es perfecto. La música se escucha fuerte. Es mejor de lo que esperaba calidad precio."},{"reviewerName":"Bubblegum Bitsh","rating":"5.0 out of 5 stars","reviewTitle":"A fun water bottle with bluetooth speaker.","reviewDate":"September 29, 2019","reviewText":"Arrived fast and it's a useful water bottle. The bluetooth speaker is louder and connects instantly. The reminder to drink water has helped me increase my intake. I recommend."},{"reviewerName":"kaci","rating":"5.0 out of 5 stars","reviewTitle":"100% worth the money to but this water bottle","reviewDate":"October 10, 2019","reviewText":"Easy to use. You can use it without the speaker on it if you wish. It reminds you to drink so I have been drinking more water. The speaker has great sound! I love everything about this smart water bottle!"},{"reviewerName":"Tamara","rating":"5.0 out of 5 stars","reviewTitle":"Speaker sounds great and loud.","reviewDate":"June 30, 2019","reviewText":"I gave this to my husband as a Father's Day gift and he loves it! It sounds louder than what I expected, and he is drinking more water now, which was the reason for buying this product in the first place."},{"reviewerName":"TG","rating":"5.0 out of 5 stars","reviewTitle":"Awesome","reviewDate":"March 19, 2019","reviewText":"I bought this for my husband. He has a tendency to forget to drink water when he’s working. So far he seems to like it. The lights flash so he remberes to take a drink. He also likes that he can play his ITunes with the speaker."},{"reviewerName":"lisa b.","rating":"5.0 out of 5 stars","reviewTitle":"Absolutley Love this Water bottle!","reviewDate":"September 22, 2019","reviewText":"I love his so much I have bought 4!! one for a friend who does not drink water and the other day at lunch she ordered a glass of water and drank it! So it works as a reminder and I love it! Thank you"},{"reviewerName":"geovanni corona","rating":"5.0 out of 5 stars","reviewTitle":"Must buy if your looking for a new cool water bottle for the gym work or just to have.","reviewDate":"October 29, 2019","reviewText":"Has a ergonomic shape to it and easy to setup and use. Really like the hour to hour reminders to drink water. Speaker sounds great for the size and the dancing lights add a little flash to the function."},{"reviewerName":"Alexis Dixon","rating":"4.0 out of 5 stars","reviewTitle":"Amazing","reviewDate":"March 14, 2019","reviewText":"I love this water bottle I can’t wait for summer only downside it had freezed up twice and I had to let it die out which was disappointing but other then that I take it everywhere with me"},{"reviewerName":"Brigitte B","rating":"5.0 out of 5 stars","reviewTitle":"The best water bottle ever","reviewDate":"July 21, 2019","reviewText":"This water bottle is awesome! It has so many amazing features like a Bluetooth speaker LED’s and a reminding feature to drink some water it’s so amazing and a great purchase so good I even bought 2"},{"reviewerName":"Nika15","rating":"5.0 out of 5 stars","reviewTitle":"The speaker sounds amazing!","reviewDate":"February 23, 2019","reviewText":"I got it as a gift. I love it."},{"reviewerName":"topazio","rating":"5.0 out of 5 stars","reviewTitle":"Perfect bottle water!!!","reviewDate":"March 21, 2019","reviewText":"This bottle was a gift for my friend and she loved it, now she is always hydrated and happy because she can listen to her favorite music... really good product and the look is nice!!"},{"reviewerName":"Jack Manne","rating":"5.0 out of 5 stars","reviewTitle":"Great gift","reviewDate":"June 28, 2019","reviewText":"great sound. The lights are really cool\nYou shld totally buy!"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"So dope! Buy it!","reviewDate":"September 25, 2019","reviewText":"Such a good quality speaker and the lights are so cool! The dopest water bottle I’ll ever own. All my friends want one now! And for only $20?!?! Buy one!"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"One of my favorite water bottles","reviewDate":"March 15, 2019","reviewText":"The sound quality of the speaker is excellant. It was easy to pair with my phone. Water reminder works exactly as described. I am thinking on getting another in a different color."},{"reviewerName":"melissa m woods","rating":"5.0 out of 5 stars","reviewTitle":"Coolest water bottle ever","reviewDate":"September 19, 2019","reviewText":"This is the coolest water bottle I’ve ever bought. The speaker sounds great! Love it! Everyone needs one of these"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"it doesn't leak","reviewDate":"July 14, 2019","reviewText":"i love my cup"},{"reviewerName":"Saad K.","rating":"5.0 out of 5 stars","reviewTitle":"An Amazing Water Bottle","reviewDate":"March 28, 2019","reviewText":"The product is absolutely amazing. It makes me drink water more often in the day and I love the bluetooth speaker. No connection issues and it is very loud for such a small bottle."},{"reviewerName":"Customer","rating":"5.0 out of 5 stars","reviewTitle":"The coolest water bottle ever!","reviewDate":"May 2, 2019","reviewText":"Amazing water bottle. So pretty and works well. I will definitely buy more for friends and family!"},{"reviewerName":"Muzaffar Ullah","rating":"1.0 out of 5 stars","reviewTitle":"Terrible that’s the best I can say","reviewDate":"September 24, 2019","reviewText":"Dislike this bottle so damn much. It was recommended in a YouTube video so I bought it. Worst $20 bucks of my life. Lid doesn’t close and has spilled and the speaker is messed up."},{"reviewerName":"JAN H","rating":"5.0 out of 5 stars","reviewTitle":"Great Buy!","reviewDate":"March 25, 2019","reviewText":"I love this bottle! The lights are a great reminder and actually helps me drink more water. The latch on the top is tight which prevents spills. The bluetooth speaker sounds good and is pretty loud. The dancing lights to the music is fun. Great Buy!"},{"reviewerName":"Sheila B.","rating":"5.0 out of 5 stars","reviewTitle":"Keeps me drinking more water!","reviewDate":"August 5, 2019","reviewText":"This is one awesome water bottle! How cool and keeps me drinking my water! Thank you!"},{"reviewerName":"robert","rating":"5.0 out of 5 stars","reviewTitle":"Great product!","reviewDate":"May 16, 2019","reviewText":"Great product and real crowd pleaser especially because no one would expect speaker on a water bottle! Great sound and easy to detach and clean. I Would highly recommend this product to anyone young and old."},{"reviewerName":"aubrey ganda","rating":"4.0 out of 5 stars","reviewTitle":"GREAT SOUND","reviewDate":"October 26, 2019","reviewText":"Love this bottle, great sound but it does leak every time and I have no idea why, even when it’s up right.. but otherwise it’s amazing."},{"reviewerName":"great i love it","rating":"5.0 out of 5 stars","reviewTitle":"Easy","reviewDate":"June 20, 2019","reviewText":"I love this bottle am going be starting my workout routine soon so this is gonna be helpful for me."},{"reviewerName":"Christopher Norgan","rating":"5.0 out of 5 stars","reviewTitle":"Love it. Love the volume","reviewDate":"November 5, 2019","reviewText":"I was super excited to receive this smart water bottle. The color is beautiful, its not heavy and will fit anywhere. The volume is loud and love it in every way."},{"reviewerName":"david","rating":"5.0 out of 5 stars","reviewTitle":"smart water bottle","reviewDate":"September 14, 2019","reviewText":"I like the water bottle very much because it is very useful and easy to use. the speaker is awesome the sound is perfect I can hear the music without a problem. the light is pretty cool and is very strong."},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Great and easy to use","reviewDate":"September 24, 2019","reviewText":"I like how it will tell you when you need to drink. I also like the speakers so I can listen to the music from my phone."},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Love it","reviewDate":"March 27, 2019","reviewText":"I love my bottle!! I can take my water and my music anywhere🥰🥰🥰"},{"reviewerName":"terri0581","rating":"5.0 out of 5 stars","reviewTitle":"It does exactly wat it says","reviewDate":"August 2, 2019","reviewText":"I’m in love with this water bottle I saw a friend with one and I had to have it this was a great idea drinking water listening to my favorite tunes is the best I recommend everyone get this"},{"reviewerName":"Pen Name","rating":"5.0 out of 5 stars","reviewTitle":"Great speaker","reviewDate":"March 9, 2019","reviewText":"The water reminder function didn't really work, but it had an amazing sounding Bluetooth speaker. Great for taking on jogs."},{"reviewerName":"Lindsey","rating":"5.0 out of 5 stars","reviewTitle":"Buttons stopped working 😭💔😞","reviewDate":"September 16, 2019","reviewText":"I want to give this a 5 star review but after 28 days my pause & next buttons stopped working 😢 I returned mine & got a refund. Be careful how hard you push your buttons or they’ll stop working ‼️‼️‼️‼️"},{"reviewerName":"Kristen Pate","rating":"5.0 out of 5 stars","reviewTitle":"Great way reminder to drink water","reviewDate":"July 8, 2019","reviewText":"My husband loves this bottle. Helps him to remember to drink his water."},{"reviewerName":"Zyel","rating":"5.0 out of 5 stars","reviewTitle":"Great speaker quality! Beautiful Design!","reviewDate":"August 14, 2019","reviewText":"I was pleasantly surprised by the impressive speaker quality, even at high volumes there was little to no reverb. I think it looks great and the LEDs are strong but unobtrusive. Overall, very satisfied."},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Great bottle!","reviewDate":"July 28, 2019","reviewText":"Got this as a gift for my girlfriend. She's outdoorsy and tech so this was a perfect gift!!! Loved it and used it at work and also when we go camping. Speaker is awesome! More than worth it!!"},{"reviewerName":"chatara","rating":"4.0 out of 5 stars","reviewTitle":"Great buy!","reviewDate":"August 3, 2019","reviewText":"I absolutely love this bottle, the speaker is loud. And the bottle is really cute. Just what I was expecting. Only thing I don’t like is that it sweats a lot. Other than that I love it."},{"reviewerName":"DeLesa R","rating":"5.0 out of 5 stars","reviewTitle":"Love ICEWATER bottle","reviewDate":"November 6, 2019","reviewText":"It’s amazing!! The cutest water bottle I’ve ever owned and helpful. I love being able to listen to my music while walking. Glows every hour to remind me to drink up, it doesn’t get better than this!!"},{"reviewerName":"edna","rating":"5.0 out of 5 stars","reviewTitle":"Great gift.","reviewDate":"July 18, 2019","reviewText":"Perfect to take with you."},{"reviewerName":"octavio","rating":"5.0 out of 5 stars","reviewTitle":"Excellent Product!!!","reviewDate":"March 15, 2019","reviewText":"I love this Product!!! It doesn't spill water and very easy to carry. Also the speaker is a plus I can have my music everywhere I go! And also drink a lot of water."},{"reviewerName":"Sarah Guidi","rating":"5.0 out of 5 stars","reviewTitle":"Awesome water bottle!!","reviewDate":"November 8, 2019","reviewText":"Awesome water bottle, im terrible about drinking water and this reminds me the lights are really pretty and the speaker works really good!"},{"reviewerName":"Kelcee Orme","rating":"5.0 out of 5 stars","reviewTitle":"Will be buying more!!","reviewDate":"August 9, 2019","reviewText":"This is awesome! Bottle works good, Bluetooth works good, and the sound quality is great and the volume gets super loud especially for its size! We will be buying more for gifts!"},{"reviewerName":"Indra D. Sukhram","rating":"5.0 out of 5 stars","reviewTitle":"Great product!","reviewDate":"November 11, 2019","reviewText":"I really like this water bottle! It does a great job of reminding me to drink water every hour and lights up bright enough for you to see! The speaker also produces great sound!"},{"reviewerName":"Joselyn","rating":"1.0 out of 5 stars","reviewTitle":"the bottle will leak and the music sounds too low","reviewDate":"July 12, 2019","reviewText":"wont buy again"},{"reviewerName":"Toni girl","rating":"5.0 out of 5 stars","reviewTitle":"Super light weight","reviewDate":"July 20, 2019","reviewText":"Super excited already using it. I love the bright pink color"},{"reviewerName":"Chris Auto Repair & Sales","rating":"5.0 out of 5 stars","reviewTitle":"Ok","reviewDate":"June 4, 2019","reviewText":"Nice product good quality"},{"reviewerName":"Jamie","rating":"5.0 out of 5 stars","reviewTitle":"Toughand steardy","reviewDate":"April 2, 2019","reviewText":"I love this water bottle. It actually does help keep you hydrated. I also love the speaker as well, its noce to have if your in a kayak or ridding a bike ext"},{"reviewerName":"Randy","rating":"5.0 out of 5 stars","reviewTitle":"A must buy","reviewDate":"March 24, 2019","reviewText":"Love this product. Brought this product for me and a friend to go on a cruise and it did everything I asked and more. I liked it so much I brought one for my cuzin before I left........"},{"reviewerName":"Lupita","rating":"5.0 out of 5 stars","reviewTitle":"Great","reviewDate":"September 16, 2019","reviewText":"It works very well. I use it at work and it last for about 6-7 hours. Feels durable and good quality"},{"reviewerName":"Bourne","rating":"5.0 out of 5 stars","reviewTitle":"Great product for price","reviewDate":"April 26, 2019","reviewText":"I bought this for a co-worker birthday present and she loved it! Everyone else who seen it purchased one. Plays loud I was really impressed."},{"reviewerName":"KDMCCORKLE","rating":"4.0 out of 5 stars","reviewTitle":"Useful for those that struggle to drink water!","reviewDate":"September 6, 2019","reviewText":"Great smart water bottle for the price! I wasn't looking for a speaker built in, just a reminder to drink water. Easy to use and convenient."},{"reviewerName":"txblueyes58","rating":"5.0 out of 5 stars","reviewTitle":"It’s an awesome product","reviewDate":"November 4, 2019","reviewText":"I use this at work. We get so busy in the office that we forget to stay hydrated. This is perfect. I actually purchased 3. One for myself and 1 for each of my coworkers"},{"reviewerName":"Katana","rating":"5.0 out of 5 stars","reviewTitle":"Great sound","reviewDate":"November 6, 2019","reviewText":"Sound is great"},{"reviewerName":"Mona M Lopez","rating":"5.0 out of 5 stars","reviewTitle":"Comes all apart to wash","reviewDate":"May 17, 2019","reviewText":"Wish it was a louder"},{"reviewerName":"Crystal","rating":"5.0 out of 5 stars","reviewTitle":"L O V E IT","reviewDate":"March 31, 2019","reviewText":"I love that this water bottle glows up and reminds me to drink water! Also the speaker was surprisingly really good!! I think I might order a second one just in a different color :)"},{"reviewerName":"Lindsey Patterson","rating":"5.0 out of 5 stars","reviewTitle":"BUY IT, ITS WORTH IT.","reviewDate":"July 4, 2019","reviewText":" LOVE THIS WATERBOTTLE.\nTHE SPEAKER SOUNDS ABSOLUTELY AMAZING!\nITS A GIFT FOR MY NEICE. SHE WILL LOVE IT!!!!!"},{"reviewerName":"Dhairya Shah","rating":"5.0 out of 5 stars","reviewTitle":"Best water bottle for traveling b/c you can stay hydrated and can also listen to music","reviewDate":"September 10, 2019","reviewText":"Water bottle is super cute. It has colorful lights and a speaker thats really easy to connect to from phone. Sound quality is good. Looks really cool in the dark"},{"reviewerName":"Glena S. Huskey","rating":"5.0 out of 5 stars","reviewTitle":"Super LIT water bottle!","reviewDate":"October 23, 2019","reviewText":"Absolutely love the bottle. It’s sturdy and has impressive sound and bass! The lights are awesome and it’s easy to clean. Would highly recommend!"},{"reviewerName":"Jodi Pelton","rating":"5.0 out of 5 stars","reviewTitle":"Best purchase ever","reviewDate":"October 3, 2019","reviewText":"Unboxed it today and I already drank more water than yesterday. I have a real issue with staying hydrated and I love the small speaker. Best purchase I have made in a while!"},{"reviewerName":"Fernando Chacon","rating":"5.0 out of 5 stars","reviewTitle":"Health & Fun!","reviewDate":"March 18, 2019","reviewText":"Its a great option to be hydrated while having fun listening to your favorite music, I bought three bottles and I want some more, all my friends want to have one too!"},{"reviewerName":"Karly Johnsen","rating":"5.0 out of 5 stars","reviewTitle":"Amazing","reviewDate":"August 21, 2019","reviewText":"Absolutely love it! Will definitely be getting another one."},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Great speakers and battery","reviewDate":"April 5, 2019","reviewText":"The speaker is louder and sounds better than I was expecting, and the battery lasts a good while before it needs to be recharged. Definitely well worth it!"},{"reviewerName":"Chris","rating":"5.0 out of 5 stars","reviewTitle":"loved it....helped me drink more water","reviewDate":"April 1, 2019","reviewText":"My key to drinking more water"},{"reviewerName":"Dana","rating":"5.0 out of 5 stars","reviewTitle":"So far so good! Recommend!","reviewDate":"August 17, 2019","reviewText":"So far I love this water bottle! I’ve only had it less than a week but it is super easy to figure out and easy to clean. Seems very durable for my needs."},{"reviewerName":"Michelle F.","rating":"5.0 out of 5 stars","reviewTitle":"Encourages me ro drink more water. Not disappointed at all. And the bluetooth speaker is a bonus!","reviewDate":"April 2, 2019","reviewText":"Love!"},{"reviewerName":"Colman","rating":"5.0 out of 5 stars","reviewTitle":"The most useful water bottle you will ever buy","reviewDate":"September 17, 2019","reviewText":"The lighting and speaker functions are great and are perfect to use while I’m hiking."},{"reviewerName":"Jani","rating":"5.0 out of 5 stars","reviewTitle":"Beautiful Colors!","reviewDate":"November 6, 2019","reviewText":"Love the colors- bright and beautiful! Exactly what I imagined. Great customer service as well. I recommended it to a friend and he bought one as well. Great product!"},{"reviewerName":"Sean","rating":"5.0 out of 5 stars","reviewTitle":"Love it!!","reviewDate":"September 18, 2019","reviewText":"I havent have it for long yet i eill update later, but it looks so cool hubby got it for my birthday cuz i drink lots of water and i love it so far!! Now he wants one"},{"reviewerName":"Cody Smith","rating":"5.0 out of 5 stars","reviewTitle":"Perfect...... the bottle that I had needed.","reviewDate":"September 30, 2019","reviewText":"I love this bottle from the moment I had opened it up from the box. I like how the sound quality and the bass. My kids loves the lights."},{"reviewerName":"kris peter","rating":"5.0 out of 5 stars","reviewTitle":"100 percent satisfied buyer","reviewDate":"April 10, 2019","reviewText":"I really like this product, the reminder every two hours keeps me hydrated. 100 percent satisfied will recommend to friends to buy it because it is worth ur penny"},{"reviewerName":"Marc R.","rating":"5.0 out of 5 stars","reviewTitle":"Love it","reviewDate":"July 9, 2019","reviewText":"I got it as a birthday gift for my mother-in-law and she loves it. The speaker sounds great and it’s a great reminder to drink! I think I’ll buy one for myself!"},{"reviewerName":"Lorinda Coyle","rating":"5.0 out of 5 stars","reviewTitle":"Unbreakable and speakers are loud which puts me in a party mood!!","reviewDate":"April 2, 2019","reviewText":"I really enjoyed this product and have gotten a lot of compliments from members of the gym that I attended and asked where I purchased it. Thanks again love it!"},{"reviewerName":"Mags0227","rating":"5.0 out of 5 stars","reviewTitle":"Makes staying hydrated a little easier","reviewDate":"July 15, 2019","reviewText":" Such a great idea for a water bottle, for it to flash to remind you to stay hydrated"},{"reviewerName":"Kalee Schoepflin","rating":"5.0 out of 5 stars","reviewTitle":"Not good","reviewDate":"June 30, 2019","reviewText":"Broken really easy"},{"reviewerName":"Anne","rating":"5.0 out of 5 stars","reviewTitle":"I love it!","reviewDate":"August 13, 2019","reviewText":"This water bottle exceeded my expectations! It is durable, light, fun and easy to drink from. It is a speaker too!"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Great bottle!","reviewDate":"October 14, 2019","reviewText":"This bottle is so cool! The Bluetooth feature is amazing and the speaker is loud! I have definitely been drinking a lot more water since using this bottle!"},{"reviewerName":"Michael G. Wandell","rating":"5.0 out of 5 stars","reviewTitle":"Nice product.","reviewDate":"September 25, 2019","reviewText":"Liked it. Still don't understand drink reminder."},{"reviewerName":"Nicole","rating":"5.0 out of 5 stars","reviewTitle":"Bright Colors & Incredible Speaker","reviewDate":"June 24, 2019","reviewText":"This bottle is AMAZING! The color changing lights are very bright and the speaker is phenomenal! Absolutely worth the money!"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Great multifunctional water bottle","reviewDate":"March 18, 2019","reviewText":"I purchased this for my staff and the love it. One person uses it as a desk speaker and everyone uses the hydrate feature to notify them when to drink."},{"reviewerName":"And1","rating":"1.0 out of 5 stars","reviewTitle":"Dont last long","reviewDate":"July 3, 2019","reviewText":"Was awesome for like 2 weeks then both volume buttons broke and its haveing trouble connecting.doesnt last and aint built for extended use ."},{"reviewerName":"Camilla Sorum","rating":"5.0 out of 5 stars","reviewTitle":"💗LOVE IT💗 AWESOME PRODUCT & SERVICE","reviewDate":"September 10, 2019","reviewText":"I LOVE it!! 💗 Love the wireless speaker & how it reminds me to stay hydrated when it glows!! Delivery was so fast!! Thank you so much 😊"},{"reviewerName":"Amazon Customer","rating":"1.0 out of 5 stars","reviewTitle":"Breaks easily","reviewDate":"August 22, 2019","reviewText":"For the amount of money for this, disappointed. The pop cap randomly popped off and the light does not work as advertised"},{"reviewerName":"Katrina Botts","rating":"5.0 out of 5 stars","reviewTitle":"very reasonable in c ost","reviewDate":"April 6, 2019","reviewText":"This item is very nice and convient all my friends love it and purchased one themselves. The music plays really loud and th beverage stays very cold."},{"reviewerName":"Belle Blickenstaff","rating":"5.0 out of 5 stars","reviewTitle":"Hydration","reviewDate":"October 29, 2019","reviewText":"This product is great! I was getting so dehydrated at work, and this is exactly what I needed to remind me to drink more water! Definitely recommend!"},{"reviewerName":"Tiffanie Duggan","rating":"5.0 out of 5 stars","reviewTitle":"Love it!","reviewDate":"December 31, 2018","reviewText":"Very cool. Lights up and plays music!"},{"reviewerName":"Andrew","rating":"5.0 out of 5 stars","reviewTitle":"Cool","reviewDate":"March 17, 2019","reviewText":"Cool idea. Works great."},{"reviewerName":"Wrangler","rating":"5.0 out of 5 stars","reviewTitle":"Great reminder to stay hydrated","reviewDate":"July 11, 2019","reviewText":"Very wonderful product. Easy to use and has a nice clear sound. Use it at work and when I'm reading or playing games."},{"reviewerName":"Brittany","rating":"5.0 out of 5 stars","reviewTitle":"Easy to use","reviewDate":"July 15, 2019","reviewText":"Like the product great for work and working out very simple to function use."},{"reviewerName":"Wendy and Ray","rating":"5.0 out of 5 stars","reviewTitle":"Amazing","reviewDate":"September 24, 2019","reviewText":"It connects so easy to your phone. And the speaker is amazing it's super loud and clear. Definitely buying a few more for gifts!"},{"reviewerName":"Elizabeth","rating":"5.0 out of 5 stars","reviewTitle":"Just as described","reviewDate":"March 15, 2019","reviewText":"Ordered 2, one for myself and on for my husband. It was exactly whatvibwas expecting. I love the lights and my husbamd just adores the bluetooth speaker for working out"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Awesome water bottle","reviewDate":"March 15, 2019","reviewText":"My daughter absolutely loves her new Bluetooth water bottle."},{"reviewerName":"Bobbi Holland","rating":"5.0 out of 5 stars","reviewTitle":"Momma happy","reviewDate":"January 3, 2019","reviewText":"Great Concept! Kids love playing their music and mom's happy they are staying hydrated! Win for all!"},{"reviewerName":"Rashelle Anderson","rating":"5.0 out of 5 stars","reviewTitle":"Love it!","reviewDate":"July 11, 2019","reviewText":"I love the versatility of this bottle...great for on the go music and hydration. Would definitely buy again, just wish it came in other colors."},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Exactly what I wanted in the bottle!","reviewDate":"February 21, 2019","reviewText":"I honestly did not expect the quality for the low price. This bottle quality and quality of the speaker is better than expected!"},{"reviewerName":"Caitlin","rating":"5.0 out of 5 stars","reviewTitle":"Fun pretty useful water bottle!","reviewDate":"May 30, 2019","reviewText":"Love this water bottle! The colors are so pretty and help to remind me to drink every hour. The speaker sounds awesome, great quality"},{"reviewerName":"Amazon Customer","rating":"1.0 out of 5 stars","reviewTitle":"Can barely see the light","reviewDate":"June 18, 2019","reviewText":"You can barely tell the light is on. It's been on for 2 hours. I will be returning it."},{"reviewerName":"Peg sawyer","rating":"5.0 out of 5 stars","reviewTitle":"Great way to remember to drink","reviewDate":"July 20, 2019","reviewText":"Live the tiner"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Great Sound Great Price!","reviewDate":"August 27, 2019","reviewText":"I love my smart water bottle. It really puts out an excellent sound & the lights are really a great perk at night. This was a hit when boating"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Time to hydrate","reviewDate":"March 18, 2019","reviewText":"The changing colors help keep my eyes “thinking” about drinking water. I was amazed when the unit becag to “sound” the alarm that I needed to hydrate!"},{"reviewerName":"Dylan Franklin","rating":"5.0 out of 5 stars","reviewTitle":"great speaker","reviewDate":"September 5, 2019","reviewText":"Good size water bottle with pretty loud and good speaker quality. Only issue i have is the cap leaks a little if it is wet before you seal it"},{"reviewerName":"Kirk Teelucksingh","rating":"5.0 out of 5 stars","reviewTitle":"Best Water Bottle","reviewDate":"July 16, 2019","reviewText":"This is the best water cup ever! I am so glad I bought it. The lights are nice and moves with the music and the speaker is loud and clear. It"},{"reviewerName":"Ben Hintz","rating":"4.0 out of 5 stars","reviewTitle":"Drink and dance!","reviewDate":"June 9, 2019","reviewText":"The concept itself is just really fun"},{"reviewerName":"Rodrigo G.","rating":"5.0 out of 5 stars","reviewTitle":"Great product","reviewDate":"August 1, 2019","reviewText":"I like how easy was to use this water bottle even without reading the instructions. Speaker sounds great and lights dance to music! AWESOME."},{"reviewerName":"Angela Davis","rating":"5.0 out of 5 stars","reviewTitle":"Great gift for music lovers!","reviewDate":"August 1, 2019","reviewText":"Bought for my 10 year old daughter and she loves it! Such a neat gift! Can’t wait to see it light up to remind her to drink!"},{"reviewerName":"sad day when your necklace isn't what you though","rating":"5.0 out of 5 stars","reviewTitle":"Awesome","reviewDate":"February 14, 2019","reviewText":"LOVE, LOVE, LOVE this. Works great has amazing sound and love the lights."},{"reviewerName":"nibral2019","rating":"5.0 out of 5 stars","reviewTitle":"Worth the money","reviewDate":"August 1, 2019","reviewText":"The sound fro n the speaker is amazing! It lights up bright and it is spill proof which I love!"},{"reviewerName":"Leonor A.","rating":"1.0 out of 5 stars","reviewTitle":"Waste of money","reviewDate":"June 18, 2019","reviewText":"Piece of trash reminder light never went on"},{"reviewerName":"InuRin08","rating":"5.0 out of 5 stars","reviewTitle":"Love this bottle!!","reviewDate":"July 6, 2019","reviewText":"Still using this, which is awesome, and sometimes use the Bluetooth option to play music or audio books. Love this bottle."},{"reviewerName":"Shearod Bennett","rating":"1.0 out of 5 stars","reviewTitle":"Wish for more colors","reviewDate":"June 2, 2019","reviewText":"It Broke after 2 weeks and the speaker is losing power. And they ask for u info to sell"},{"reviewerName":"Silva","rating":"5.0 out of 5 stars","reviewTitle":"Fun and easy!","reviewDate":"July 16, 2019","reviewText":"This bottle is so fun! Very easy to set up with your phone and take apart to clean. Love the colored lights and bluetooth speakers."},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Must buy","reviewDate":"April 3, 2019","reviewText":"Love love love! It shipped super fast. It has helped me increase my water intake and everyone complaints me on it."},{"reviewerName":"Jenny Crump","rating":"5.0 out of 5 stars","reviewTitle":"Love this water bottle!","reviewDate":"February 18, 2019","reviewText":"This water bottle is great! We love how the bottle changes color and plays music! My son takes it to school and is the envy of all his friends."},{"reviewerName":"Tyrone","rating":"5.0 out of 5 stars","reviewTitle":"Great buy.","reviewDate":"June 26, 2019","reviewText":"I bought this for my daughter. She loves it. Speaker works great and she loves that it lights up."},{"reviewerName":"Davette J Cooper","rating":"5.0 out of 5 stars","reviewTitle":"Nice birthday gift.","reviewDate":"January 4, 2019","reviewText":"My 14 year old daughter loved it nice brith day gift."},{"reviewerName":"Ashley Donaldson","rating":"5.0 out of 5 stars","reviewTitle":"The whole sha-bang!","reviewDate":"July 22, 2019","reviewText":"The lights are bright. Speaker is loud. Even with speaker attached it’s still a pretty light weight bottle. It’s everything!"},{"reviewerName":"Patricia","rating":"4.0 out of 5 stars","reviewTitle":"Works great !!","reviewDate":"February 17, 2019","reviewText":"The speaker works great and the bottle is great as well"},{"reviewerName":"Leonard","rating":"5.0 out of 5 stars","reviewTitle":"This product is AWESOME!!!","reviewDate":"October 11, 2019","reviewText":"I absolutely love it!!!! Great product I wish I knew about it sooner!! The bluetooth speaker sounds GREAT!!!"},{"reviewerName":"T H","rating":"5.0 out of 5 stars","reviewTitle":"Good product","reviewDate":"March 15, 2019","reviewText":"Product was exactly like mentioned. My kids love it and use it daily. I would recommend this product."},{"reviewerName":"Tina","rating":"5.0 out of 5 stars","reviewTitle":"Dope!","reviewDate":"September 11, 2019","reviewText":"Better than expected. As a warehouse worker I was able to keep my music and water bottle on me all at once."},{"reviewerName":"Kathy Howard","rating":"5.0 out of 5 stars","reviewTitle":"Great product","reviewDate":"May 20, 2019","reviewText":"My husband loves this water bottle. We have issues with dehydration EVERY year. I believe we have found our solution."},{"reviewerName":"Jeanie Armstrong","rating":"5.0 out of 5 stars","reviewTitle":"Must have...great idea for Christmas gift exchange!","reviewDate":"September 29, 2019","reviewText":"Love it - the lights are pretty, and definitely catch my attention to drink my water. The speaker is a cool extra too."},{"reviewerName":"josue","rating":"5.0 out of 5 stars","reviewTitle":"Amazing product!!","reviewDate":"May 25, 2019","reviewText":"I love it! 5 stars!!👌"},{"reviewerName":"Jennifer Lamothe","rating":"5.0 out of 5 stars","reviewTitle":"It’s awesome","reviewDate":"September 30, 2019","reviewText":"Shipped fast and packaged right. Our daughter absolutely loves it and has not put it down since it came in the mail."},{"reviewerName":"Dani Cann","rating":"5.0 out of 5 stars","reviewTitle":"So fun!","reviewDate":"March 31, 2019","reviewText":"Absolutely love this water bottle! So easy to set up and the lights changing to the music makes it fun to drink from!"},{"reviewerName":"Richard Garcia","rating":"5.0 out of 5 stars","reviewTitle":"BEST WATER BOTTLE EVER! HIGHLY RECOMMENDED","reviewDate":"August 6, 2019","reviewText":"This is water bottle is amazing. The speaker is loud and the light show is awesome. Highly recommend!!"},{"reviewerName":"Margaret","rating":"5.0 out of 5 stars","reviewTitle":"Stay hydrated","reviewDate":"September 5, 2019","reviewText":"Awesome i love it as it reminds me when i havent had enough water to drink best thing i bought myself."},{"reviewerName":"Makevia Sutton","rating":"5.0 out of 5 stars","reviewTitle":"Great buy!!!","reviewDate":"March 17, 2019","reviewText":"Awesome water bottle. Speaker is actually really loud for it to be so small. Loved it so much I bought another for a gift for my sister!!!"},{"reviewerName":"Hannah","rating":"5.0 out of 5 stars","reviewTitle":"Great for people who suck at drinking water.","reviewDate":"November 4, 2019","reviewText":"It's great I'm terrible at drinking water so this has helped me greatly"},{"reviewerName":"Benjamin S.","rating":"4.0 out of 5 stars","reviewTitle":"Great for holding water and a mediocre speaker","reviewDate":"August 1, 2019","reviewText":"Get what you paid for and nice to have a speaker you don't have to pack since it connected to your water bottle."},{"reviewerName":"Amy Beane","rating":"5.0 out of 5 stars","reviewTitle":"Awesome!","reviewDate":"March 31, 2019","reviewText":"I love this product and the company I purchased it from!"},{"reviewerName":"Elizabeth Galli","rating":"5.0 out of 5 stars","reviewTitle":"User friendly Smart Water Bottle","reviewDate":"August 5, 2019","reviewText":"Thank you for this amazing smart water bottle. It is simple to pair.\n\nWhat a clever idea. Thank you."},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Great water bottle!!","reviewDate":"April 2, 2019","reviewText":"Love this bottle! Keeps my water cold and the music quality is prefect! Definitely happy with my purchase!!!"},{"reviewerName":"emily digby","rating":"4.0 out of 5 stars","reviewTitle":"How do I shut it off","reviewDate":"January 14, 2019","reviewText":"I like the bottle and the lights but now it wont shut off I even held down the power button like it said to"},{"reviewerName":"Claudia","rating":"1.0 out of 5 stars","reviewTitle":"It's a normal bottle, nothing special.","reviewDate":"June 20, 2019","reviewText":"It's a normal bottle, nothing special."},{"reviewerName":"Kaylie","rating":"5.0 out of 5 stars","reviewTitle":"My favorite water bottle","reviewDate":"September 23, 2019","reviewText":"I cannot get over this water bottle. It's amazing and will be an awesome gift."},{"reviewerName":"Amg","rating":"4.0 out of 5 stars","reviewTitle":"Great Gift","reviewDate":"October 23, 2019","reviewText":"Does just what it says, going to be purchasing more as Christmas gifts! Speaker has a nice output as well!"},{"reviewerName":"Bobbie","rating":"5.0 out of 5 stars","reviewTitle":"Easy for seniors","reviewDate":"October 13, 2019","reviewText":"Love the colors. Easy to install to Bluetooth."},{"reviewerName":"Carissa Tharp","rating":"5.0 out of 5 stars","reviewTitle":"Awesome!","reviewDate":"March 12, 2019","reviewText":"This is a great product. I actually use it all the time and I love the glow effect."},{"reviewerName":"Amazon Customer","rating":"4.0 out of 5 stars","reviewTitle":"Speaker work well","reviewDate":"September 29, 2019","reviewText":"Easy to carry . wish actual bottle was bigger"},{"reviewerName":"Doug","rating":"5.0 out of 5 stars","reviewTitle":"The greatest water bottle.","reviewDate":"September 6, 2019","reviewText":"Love this! Take it with me when I gotta have the chemo therapy. It is so wicked cool!"},{"reviewerName":"scotty nunez","rating":"3.0 out of 5 stars","reviewTitle":"Small","reviewDate":"February 28, 2019","reviewText":"Too small"},{"reviewerName":"petr slaninka","rating":"5.0 out of 5 stars","reviewTitle":"Cool Concept","reviewDate":"July 17, 2019","reviewText":"Bought for daughter and she loves it , can go for walks with music on! She loves the light feature!"},{"reviewerName":"Shenisha","rating":"5.0 out of 5 stars","reviewTitle":"Super cool!!!","reviewDate":"October 14, 2019","reviewText":"This water bottle is so cool I’m ordering more for Christmas gifts."},{"reviewerName":"Amazon Customer","rating":"3.0 out of 5 stars","reviewTitle":"Reminder feature doesn’t work","reviewDate":"March 20, 2019","reviewText":"I have the water bottle on but it doesn’t light up to remind me to drink water. Disappointed 😞"},{"reviewerName":"Ruth delgado","rating":"5.0 out of 5 stars","reviewTitle":"Perfect!!!!!!","reviewDate":"March 20, 2019","reviewText":"Just want I wanted"},{"reviewerName":"Jasmine brewer","rating":"5.0 out of 5 stars","reviewTitle":"Great sound","reviewDate":"May 1, 2019","reviewText":"This water bottle is great! The speaker sounds great! The lights are amazing!!!"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Great bottle","reviewDate":"July 25, 2019","reviewText":"This is a great bottle for the price!"},{"reviewerName":"Murielle Tejeda","rating":"5.0 out of 5 stars","reviewTitle":"Simplemente Genial!!!","reviewDate":"October 25, 2019","reviewText":"Me encantó, es más de lo que se espera. Es bonito y muy práctico. El material es resistente."},{"reviewerName":"Allison Badjue","rating":"4.0 out of 5 stars","reviewTitle":"drink your water.","reviewDate":"July 2, 2019","reviewText":"I really like this water bottle. It helped me to keep up drinking water throughout the day."},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Cool product!","reviewDate":"March 15, 2019","reviewText":"Love it! Very cool product and fun to use. Great sound from the speaker and the reminder to sip water is awesome."},{"reviewerName":"Shan","rating":"5.0 out of 5 stars","reviewTitle":"Loud sound","reviewDate":"June 27, 2019","reviewText":"This bottle is so cool. Sound is loud and clear. Great workout accessories."},{"reviewerName":"Mimie Green","rating":"5.0 out of 5 stars","reviewTitle":"Awesome product","reviewDate":"October 1, 2019","reviewText":"The sound quality is way better than expected. The size and design is great for my needs"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Perfect size","reviewDate":"October 4, 2019","reviewText":"Wish I could see the light better"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Quality and price can’t be beat.","reviewDate":"April 15, 2019","reviewText":"I bought them for my wife , daughter and daughter in-law and they absolutely love them."},{"reviewerName":"LeBrON RaHMaN","rating":"5.0 out of 5 stars","reviewTitle":"Nice overall water bottle","reviewDate":"August 15, 2019","reviewText":"Yo this bottle is pretty dope. Drink water while listening to music 👌🏾"},{"reviewerName":"Kelsea","rating":"5.0 out of 5 stars","reviewTitle":"Love it","reviewDate":"October 17, 2019","reviewText":"I Love Every Thing About This Cup Especially The Speaker. It Works Great And Is Loud."},{"reviewerName":"WAYNE","rating":"5.0 out of 5 stars","reviewTitle":"Loved it, better than expected.","reviewDate":"October 7, 2019","reviewText":"This product truly lives up to expectations. Loved it so much purchased more for gifts."},{"reviewerName":"cliente","rating":"5.0 out of 5 stars","reviewTitle":"bonito","reviewDate":"February 19, 2019","reviewText":"muy bueno me encanta mi botella"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Great purchase","reviewDate":"July 28, 2019","reviewText":"Loved this bottle. The speaker puts of an amazing amount of sound."},{"reviewerName":"Katie vantornhout","rating":"5.0 out of 5 stars","reviewTitle":"Amazing","reviewDate":"October 14, 2019","reviewText":"This bottle is badass!!!!! The sound quality from the speaker is phenomenal!!"},{"reviewerName":"stephan maxwell","rating":"5.0 out of 5 stars","reviewTitle":"The bluetooth water bottle","reviewDate":"May 16, 2019","reviewText":"Love the colors, sounds and the lite weight."},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Works well!","reviewDate":"March 31, 2019","reviewText":"My young niece needs reminders to stay hydrated. This water bottle did the trick!"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Awesome","reviewDate":"October 16, 2019","reviewText":"I really like this product and will be awesome to take to pool or dog park."},{"reviewerName":"Carollu","rating":"5.0 out of 5 stars","reviewTitle":"Super handy","reviewDate":"October 15, 2019","reviewText":"This a great bottle, bought it for my son and he’s enjoying it to the max"},{"reviewerName":"TEAM POD","rating":"5.0 out of 5 stars","reviewTitle":"Worth It","reviewDate":"July 10, 2019","reviewText":"Loved it so much had to buy another for a gift"},{"reviewerName":"Amazonian's","rating":"2.0 out of 5 stars","reviewTitle":"It's hard to Bush the power button off & on, which is why it ripped.","reviewDate":"March 20, 2019","reviewText":"The item wasn't as loud and the power button easily ripped."},{"reviewerName":"Briauna Neufeld","rating":"2.0 out of 5 stars","reviewTitle":"The light isn't visible","reviewDate":"September 4, 2019","reviewText":"The light is not visible during the day time. The speaker is nice though"},{"reviewerName":"romey aidrikdrik","rating":"5.0 out of 5 stars","reviewTitle":"best","reviewDate":"November 28, 2018","reviewText":"5 stars great song"},{"reviewerName":"Lane Reisig","rating":"5.0 out of 5 stars","reviewTitle":"Water bottle is efficient!!","reviewDate":"February 19, 2019","reviewText":"Speaker is loud and clear!!! Great product"},{"reviewerName":"Lizabeth Newton","rating":"1.0 out of 5 stars","reviewTitle":"Disappointed","reviewDate":"October 5, 2019","reviewText":"It came in broken and dirty!"},{"reviewerName":"Ashley Russell","rating":"5.0 out of 5 stars","reviewTitle":"Awesome!","reviewDate":"March 15, 2019","reviewText":"Love this water bottle! The speaker is amazing and sound is very clear!!! Worth the Money!!"},{"reviewerName":"LBombBA","rating":"5.0 out of 5 stars","reviewTitle":"Would buy again!","reviewDate":"October 27, 2019","reviewText":"Love this bottle! Great gift idea and great for bikes!"},{"reviewerName":"Shanikia Green","rating":"2.0 out of 5 stars","reviewTitle":"Defective","reviewDate":"July 1, 2019","reviewText":"The product will stop working after a day of used..."},{"reviewerName":"Christopher Ovrid","rating":"1.0 out of 5 stars","reviewTitle":"Eh","reviewDate":"June 30, 2019","reviewText":"works when it wants to."},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Great sound and x mad gift","reviewDate":"October 13, 2019","reviewText":"Love it I saw my coworker with it and had to get one it’s great"},{"reviewerName":"Javier Davila","rating":"5.0 out of 5 stars","reviewTitle":"Recomended 100%","reviewDate":"October 24, 2019","reviewText":"Great product!!!!!!!!!! High volumen, beautiful lights show!!!!"},{"reviewerName":"Christina henderson","rating":"3.0 out of 5 stars","reviewTitle":"Its an ok waterbottle!!","reviewDate":"April 26, 2019","reviewText":"I dont like the fact that there is no way to set the reminder."},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Surprisingly good quality speaker","reviewDate":"February 23, 2019","reviewText":"Speaker was way better than expected. Very innovative product."},{"reviewerName":"Ozgur YILMAZ","rating":"5.0 out of 5 stars","reviewTitle":"Excellent","reviewDate":"August 12, 2019","reviewText":"Excellent sound. Excellent product. Awesome price and delivery"},{"reviewerName":"Kindle Customer","rating":"5.0 out of 5 stars","reviewTitle":"The waterbottle","reviewDate":"July 3, 2019","reviewText":"I love it got to order my daughter and son one"},{"reviewerName":"Penny George","rating":"5.0 out of 5 stars","reviewTitle":"That its wayer proof","reviewDate":"July 14, 2019","reviewText":"Volume on the bluetooth device"},{"reviewerName":"Jessica","rating":"5.0 out of 5 stars","reviewTitle":"Recommended!","reviewDate":"September 27, 2019","reviewText":"Its pretty and perfect just what I needed"},{"reviewerName":"Renee","rating":"1.0 out of 5 stars","reviewTitle":"Does not work!!","reviewDate":"July 1, 2019","reviewText":"This broke almost immediately and never gave reminders"},{"reviewerName":"Jacqueline Kirstein","rating":"1.0 out of 5 stars","reviewTitle":"Leakage","reviewDate":"June 14, 2019","reviewText":"Horrible. It leaks."},{"reviewerName":"Alesia","rating":"2.0 out of 5 stars","reviewTitle":"That the product will last.","reviewDate":"March 7, 2019","reviewText":"I love the fact you can drink water and listen to music. This is my favorite cup. ❤️"},{"reviewerName":"Bobbi","rating":"5.0 out of 5 stars","reviewTitle":"Genius","reviewDate":"July 24, 2019","reviewText":"This water bottle is the best ever!"},{"reviewerName":"Marisol","rating":"5.0 out of 5 stars","reviewTitle":"Reminder to hydrate","reviewDate":"January 14, 2019","reviewText":"Awesome"},{"reviewerName":"sara","rating":"5.0 out of 5 stars","reviewTitle":"Great product!","reviewDate":"April 10, 2019","reviewText":"Product as decribed!"},{"reviewerName":"tameka","rating":"5.0 out of 5 stars","reviewTitle":"Nice","reviewDate":"September 18, 2019","reviewText":"Very good product"},{"reviewerName":"Tammie","rating":"5.0 out of 5 stars","reviewTitle":"Love the sound","reviewDate":"May 16, 2019","reviewText":"I love the lights and speaker"},{"reviewerName":"Victoria Ruiz","rating":"5.0 out of 5 stars","reviewTitle":"Nice water bottle","reviewDate":"September 16, 2019","reviewText":"It works good"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Excelente.","reviewDate":"October 19, 2019","reviewText":"Excelente."},{"reviewerName":"Janet Moreland","rating":"5.0 out of 5 stars","reviewTitle":"I love the product","reviewDate":"March 24, 2019","reviewText":"Easy use. Speaker feature."},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Great gift.","reviewDate":"September 10, 2019","reviewText":"Love this product!"},{"reviewerName":"Tekeveon Phillips","rating":"1.0 out of 5 stars","reviewTitle":"The Speaker","reviewDate":"April 12, 2019","reviewText":"the speaker broke."},{"reviewerName":"Tracy Thomas","rating":"5.0 out of 5 stars","reviewTitle":"Its very nice","reviewDate":"May 13, 2019","reviewText":"No dislikes"},{"reviewerName":"Daffany","rating":"5.0 out of 5 stars","reviewTitle":"Amazing","reviewDate":"February 19, 2019","reviewText":"Love. It. Great for working out going for a walk bikeing"},{"reviewerName":"Julie Trejodeleon","rating":"5.0 out of 5 stars","reviewTitle":"Love it","reviewDate":"March 16, 2019","reviewText":"I love it"},{"reviewerName":"Case Quarter","rating":"5.0 out of 5 stars","reviewTitle":"very functional, great idea","reviewDate":"December 13, 2018","reviewText":"Since my laptop was on when the bottle arrived, I charged the bottle through my computer. The cable included is universal. Charging time, about an hour and a half, I expect the time is faster charging from a strip or wall outlet. Bluetooth pairing is easy, but it doesn’t share with other devices. I could not use the sound bar and bottle speaker together.\n\nSo I paired with my android phone. If you like loud, this speaker can get loud. I haven’t experienced the increase in bass when placed on wood surfaces. Amazing range, I carried my phone upstairs, closing doors behind me, walked through all the rooms before returning downstairs and re-entering the kitchen where I left the bottle. The signal never dropped.\n\nThe lights change colors or can be set on a single color. Two or three of these bottles set on red and green would make a nice holiday decoration. It goes without saying, this is a neat gift, Christmas or any time of the year.\n\nThe power base screws free from the bottle and functions on its own. The bottle is plastic, flip top\n\nI forgot to turn the power off before going to bed and the battery was not dead when I woke this morning. So, you’re getting at least twenty-four hours on a single charge."},{"reviewerName":"Myra","rating":"2.0 out of 5 stars","reviewTitle":"What is the point of this?","reviewDate":"December 12, 2018","reviewText":"I liked the idea of the light prompting me to drink water, but it’s just not working.\nThe lights stay on for maybe an hour, then they go off. I couldn't figure out how to get it to light up to ‘remind’ me to drink… the light changes color, but it’s not very visible. Is it supposed to remind me merely by changing color? No idea.\n\nIt makes an annoying ding every time you turn the light on, because it’s turning the speaker on. Why do I need to run sound through… my water bottle? Kinda perplexing. On a picnic maybe. Or if you are one of those people who plays music out loud as you hike/run.\nWhen it's low on battery (which happens too quickly), it says loudly ‘low battery’ which is just unnecessary.\n\nThe lid is cheap and already cracking. I do like that it has a metal piece to hold it on so it won’t open accidentally.\n\nIt’s ok as a weird novelty gift I guess.\n\n---- Update a few days later ----\nI received an email and a text message from the seller of this, bribing me to remove/amend my review. For 1, they are NOT supposed to contact me like that (esp. using my phone number), and for 2 obviously it's wrong to influence my review in that way. I reported them to Amazon."},{"reviewerName":"Brian Baker","rating":"5.0 out of 5 stars","reviewTitle":"In case I forget I’m thirsty….","reviewDate":"December 4, 2018","reviewText":"This bottle will remind me!\n\nI’ve gotta say, how do you make an inherently mundane object like a bottle something people will want to buy? Load it with cool gimmicks!\n\nThis bottle is really pretty cool. It will light up periodically to “remind” you to hydrate. You can connect it via Bluetooth to your music source, and it really puts out nice sound in both quality and volume. It’s well-designed, and good quality.\n\nThe only problem we had was that the twist-cap was extremely tight when we fiorst got it and had trouble getting it off. But once we loosened it up, all was well from that point on.\n\nIf you’re going to be taking some water (or other liquid) around with you, why not take some entertainment at the same time?"},{"reviewerName":"Kindle Customer","rating":"5.0 out of 5 stars","reviewTitle":"Good bottle for water/music","reviewDate":"December 16, 2018","reviewText":"I never thought that I would own a water bottle that tells me to drink and plays songs from my phone. But.. here it is. The ICEWATER 3-1 Smart bottle does just that.\nIt is easy to set up the bluetooth and it charges in a reasonable time. The speaker sounds good and can be played quite loud.\nAs a water bottle, it does not leak and is easy to open. It has a metal wire clip to keep it closed. I have only one concern with the bottle and that is dropping it. It has a heavier bottom with a rubber pad so it will likely bounce if it falls in that direction. If it hits on the lid...I had a similar bottle with a plastic lid catch that broke the first time that I dropped it. I don't intend on testing this bottle by dropping it and I must emphasize that this is a concern not something that happened with this bottle.\nThe bottle itself seems to be tough and well designed to hold in your hand or place on a table."},{"reviewerName":"Spike D.","rating":"4.0 out of 5 stars","reviewTitle":"Nice bottle with extra features!","reviewDate":"December 17, 2018","reviewText":"The only complaint I have about this bottle is I could not take it with me on my bike ride. The hard plastic makes it difficult to put in/take out of the bottle cage. I think it is suited more to take in the office, when you could be working away and forget to drink water. However, if this is the main reason to get this bottle, there plenty of other things that remind you of something. My watch tells me to get up every hour, so I'd go and drink water at that time.\n\nThis water bottle is cool. Beside a decent bluetooth speaker at the bottom (that could be so convenient for a bike ride), you have changing colors that serve as a reminder. This also an opportunity for you to get up and stretch. The speaker can be detached from the bottle if you don't want to carry the whole thing."},{"reviewerName":"DF","rating":"4.0 out of 5 stars","reviewTitle":"Silly but I have no complaints","reviewDate":"December 30, 2018","reviewText":"This is everything it claims to be, a water bottle with pretty lighting that makes the water glow, with a built in bluetooth speaker that does sound good, with a reminder that you need to drink.\n\nIt's also kinda silly, and I'm constantly asked why my water bottle is playing music or talking.\n\nPairing was extremely easy, as was getting the lighting to work (hold pause and it glows and rotates colors, which is pretty if you're biking at night). Every 90 minutes I got an audible indicator to drink. The sound is loud and clear, and while the range isn't exactly home theater, it sounds a lot better than my phone and is great for music when you're out and about. I noticed battery life isn't amazing. Within three hours it was dead.\n\nAs a water bottle, I have no complaints. It didn't leak, it was easy to sip from, and the speaker is well isolated and safe when filling the bottle, which screws onto the speaker part. The plastic is tough, and though it gets little scratches, I've dropped mine hard and it's still working great.\n\nFor the money it's got a lot of features. They aren't featured you needed but they work as advertised and I think this is an amusing product."},{"reviewerName":"loce_the_wizard","rating":"3.0 out of 5 stars","reviewTitle":"It's a strange product that shows we live in strange times","reviewDate":"December 26, 2018","reviewText":"My daughter needs to up the amount of water she drinks and the idea of a water bottle that changes colors to remind one to guzzle water seemed an interesting gimmick. It sort of works but like everything else, the changing light becomes part of the background after a day or two. It does not keep ones attention. The speaker actually sounds better than expected but one should have pretty low expectation for a speaker melded into a water bottle, I suppose.\n\nIs it worth the money? Maybe for some folks who do need gimmicks to remind then to tend to their thirst or who want to listen to podcasts at the beach. It's a strange product that shows we live in strange times."},{"reviewerName":"Jeff Edwards","rating":"5.0 out of 5 stars","reviewTitle":"Damn Near Perfect","reviewDate":"March 18, 2019","reviewText":"I honestly thought this bottle had some color changing tech built-into the plastic, but no, that isn't it at all. It is not only a bottle, but also a mini bluetooth speaker which operates the colors in order to remind you hourly to drink your water or whatever it may be you are hydrating with.\n\nIt's always a good reminder to dink regularly, but an added bonus of a speaker too? Now that is pretty dang cool. The only way this could be better is if the case had been made so that it was more insulated in order to keep the contents cold or hot longer. Honestly, this is the only thing I can see that could be improved upon.\n\nThe speaker is not bad, especially considering how small it is. But with that said, it still is a pretty decent speaker. Don't compare it to an expensive JBL or Bose, but for what it is and what it does, I was pleasantly surprised how good it was. Just keep that in mind.\n\nAll in all I'm quite thrilled as to how cool this is. I highly recommend it."},{"reviewerName":"Dustin Williams","rating":"4.0 out of 5 stars","reviewTitle":"A Fun Conversation Starter...","reviewDate":"January 8, 2019","reviewText":"If you want an interesting conversation starter, this might be the right water bottle for you! Here’s what is good about this product:\n\n- Bottle lights up nicely after an hour (from the time you turn it on). You can choose from a variety of preset colors. This serves as an excellent reminder to stay hydrated.\n- The bottle seals up nicely without leakage. It also opens up / closes nicely. It includes a lock to prevent the bottle from accidentally opening up inside of a backpack, etc.)\n- It’s easy to clean, which is appreciated.\n\nWhat needs improvement:\n\n- The speaker does not play Bluetooth music well. I have an iPhone and tried to stream music to it (a couple of feet away); the signal cuts out every few seconds. It reminds me of a cellphone that’s just about ready to lose its signal. (The iPhone plays fine with other Bluetooth players, in case you’re curious.)\n\nOverall, it’s a fun conversation starter and a great way to keep hydrated."},{"reviewerName":"kim*designer","rating":"4.0 out of 5 stars","reviewTitle":"Surprisingly a hit product!","reviewDate":"January 6, 2019","reviewText":"Even though the ICEWATER 3-in-1 Smart Water Bottle seems a bit frivolous, it is delightful to my eight year old grandson, who loves to use it when he visits! The combo of lights and Bluetooth speaker are pure fun for him. The lights actually are intended to be reminders to drink, so they serve a very good purpose other than just being festive! This is a product I wouldn’t have really looked at, normally, but I am happy to have the opportunity to review it. It will continue to bring fun into my grandson’s life when he visits, especially since he’s at an age where technology has a great appeal to him. The speaker is such a fun feature - since he doesn’t have an IPod yet, he just uses mine. And the speaker is of a pretty good quality, too! The reminder feature (lights) is such a good idea that I might just start using this bottle myself, since I do forget to drink water. Recommended!"},{"reviewerName":"Ask_Krys","rating":"4.0 out of 5 stars","reviewTitle":"Very different.","reviewDate":"December 23, 2018","reviewText":"Very cool and durable bottle! It’s one of a kind for sure! I’ve never seen a bottle that plays music... haha... it’s not even heavy! It’s just as light weight as a regular bottle. Yes, the music part takes away from the bottle, but it should be enough for a workout session. Also, you’ll need to be close to something so that the bottle can connect and play the music. No headphones needed.\n\nI have attached photos showing the speakers, power, next and volume control buttons; also the actual bottle itself.\n\nIt’s very different, works fine, SAFE, and would make a cool gift."},{"reviewerName":"The Modernist Medium","rating":"5.0 out of 5 stars","reviewTitle":"Stay hydrated and look cool while doing it","reviewDate":"December 10, 2018","reviewText":"Everyone needs to drink more water, and this cute little water bottle will remind you to drink up. This cute bottle will light up periodically to remind you that it's time to chug some water and rehydrate. If you are gonna carry a water bottle around, get one that can multitask. This is not only a water bottle and healthy reminder system, it also has colored lights and a blue tooth speaker in the base. Seriously, it is such a great thing to have while riding a bike, hanging at the beach, picnic, working in the garage, etc...\n\nIt charges via USB with the included cord and you connect to your music via bluetooth. The speaker is surprisingly clear and loud for being little. The top is tight and water is not going to leak out if it falls over or is in a totebag. My friends were oohing and awwing over it, and they all want one now too."},{"reviewerName":"Ivy Reisner","rating":"2.0 out of 5 stars","reviewTitle":"Doesn't seem to work","reviewDate":"January 7, 2019","reviewText":"The little metal catch that keeps the lid closed had me baffled at first, so this could all be a matter of user error but I can hardly get it to work. It pairs for music, but I've had problems getting it to connect on the second go after being out of range for a while. The reminder feature went off once after about six hours of sitting on my desk at work idle, and that's about it. The lights are very pretty, but I've had them turn on in the middle of the night twice, and that was annoying. I'm not impressed."},{"reviewerName":"Michael Van Kleeck","rating":"4.0 out of 5 stars","reviewTitle":"Works great...","reviewDate":"January 21, 2019","reviewText":"Great water bottle. I was super excited about it and I do feel like it kept me hydrated. My husband charged it up for me and the charge lasted about 24 hours. Be warned though, it talks. My husband and I were in the bedroom and we hear a voice say something in the kitchen. We looked at each other funny and I walked out to see what the deal was. I probably jumped about a foot in the air because just as I walked into the kitchen I hear it again. It took me a second to process that it was the bottle saying in a computerized voice “low battery”. Just long enough to scare the crap out of me. It didn’t help that we have been into sci-fi thrillers lately. You think you are a strong independent person that can hold their own and protect your home... up until a water bottle about near gives you a heart attack."},{"reviewerName":"mistymae555","rating":"2.0 out of 5 stars","reviewTitle":"Meh... you get what you pay for","reviewDate":"February 11, 2019","reviewText":"I got this as a gift for my birthday. The bluetooth speaker is ok. I can't listen to it because I use this bottle while working and have to wear headphones.\n\nThe light feature is supposed to go off every hour but mine has just been sitting here for about 4 hours now with nothing but the soft glow of the power button."},{"reviewerName":"Bless Their Hearts Mom","rating":"4.0 out of 5 stars","reviewTitle":"who knew you needed one of these????","reviewDate":"December 16, 2018","reviewText":"I got this for my tween, who does Irish dance and needs a good amount of water for practice and also throughout the day. She's horrible on remembering to drink enough, so the color changing bottle was enough to grab her attention and to get her to remember! A bonus for her is the amazing speaker! Who knew decent sound could come from a water bottle? they had their speaker go out in class, so they hocked the teachers ipod to the bottle and bamm, they were back in business! It was more than loud enough for them!\n\nThese would be a great white elephant gift for parties, or for a coworkers birthday- its the gift you didnt know you wanted!"},{"reviewerName":"plyopowerd","rating":"5.0 out of 5 stars","reviewTitle":"Clever idea that sounds good","reviewDate":"December 7, 2018","reviewText":"This is one of my favorite gadgets in awhile. The speaker base, which easily unscrews from the bottle, charges up quickly and lasts several hours. It sounds very good for its size and I like how the rubber coating prevents sliding around. The flip top bottle lid is very secure and it has a wide mouth for ice cubes. I've washed it in the top rack of the dishwasher several times. Nice gift for people who want to work out or just drink their favorite drink to their favorite tunes."},{"reviewerName":"Courtland J. Carpenter","rating":"5.0 out of 5 stars","reviewTitle":"An unusual combination, a good priced bicycle water bottle and speaker.","reviewDate":"December 15, 2018","reviewText":"Current sale price of under 20 bucks makes this a bargain for a nice slimline bottle. Has an unusual color changing feature to remind you to drink, a rechargeable wireless speaker to connect to a phone or computer and play music. Additionally, the speaker on the bottom is designed to act as a mini-sub woofer, and will resonate if used on a wooden surface, plus the speaker itself is waterproof. Given the price an incredible bargain, and a useful thing for every cycle rider or just to have for the office. Recommended."},{"reviewerName":"Amazon Customer","rating":"4.0 out of 5 stars","reviewTitle":"This is such a great gadget!","reviewDate":"December 19, 2018","reviewText":"The concept of this water bottle is kind of funny, but it turned out to be super useful. I am always reminding my husband to drink more water, and he always tells me to hush up and that he's perfectly hydrated, and now we have a water bottle that monitors his water intake and reminds both of us that I am right and he needs to drink up! Ha ha ha I love it. And it has a (medium-quality) Bluetooth speaker, and super fun lights. What's not to love? This is so fun and cool, and a great value for the price."},{"reviewerName":"Lauren V","rating":"5.0 out of 5 stars","reviewTitle":"Awesome!","reviewDate":"February 9, 2019","reviewText":"My 9yo nephew was super excited to receive this as a Christmas gift, since his dad had received one and he was eyeballing it all morning! He uses it everywhere - when he rides his bike, when he’s playing basketball in the driveway, and even sometimes when he’s just hanging out in his room building a LEGO set or playing video games. It works great and the sound is pretty incredible!"},{"reviewerName":"Casey M. Cook","rating":"4.0 out of 5 stars","reviewTitle":"Great water bottle!","reviewDate":"August 23, 2019","reviewText":"I love this water bottle. I was looking for a bottle that lit up to remind me to drink water and the bluetooth speaker was really just a bonus. Great value for the price and definitely helps with getting my ounces in for the day.\n\nCons- hard to close and if its bright in the room you are in or you are outside, it's hard to notice the lights"},{"reviewerName":"Oliver DeMille, TJEd","rating":"4.0 out of 5 stars","reviewTitle":"fun","reviewDate":"December 8, 2018","reviewText":"Our 13yo daughter is delighted with this funky water bottle. What won't they add lighting and sound to next? Definitely the Star Trek generation here. As a water bottle, it's decent. The size is easy to put in a gym bag or a side pouch of a backpack. Fits in a standard cup holder in a car. No idea how long the electronic component will work, but whatever. It dispenses water just fine with our without."},{"reviewerName":"dsw","rating":"5.0 out of 5 stars","reviewTitle":"Exceeded Expectations","reviewDate":"September 10, 2019","reviewText":"For the price and the functionality, this is easily the smartest water bottle purchase I have ever made. The top works well both at securely sealing the container and making it easy to drink water, the lights and smart water feature work flawlessly, and the bluetooth speaker actually gets decent volume and sound quality, making it fully useable! Very pleasantly surprised that this bottle was this good."},{"reviewerName":"Yolanda S. Bean","rating":"5.0 out of 5 stars","reviewTitle":"Makes Drinking Water Fun!","reviewDate":"January 31, 2019","reviewText":"My husband had a smart bottle that had a similar water reminder, but this one is more like a party reminder! This bottle connects to your phone and you can use it to set up reminders to up your water intake and also as a speaker and an accompanying light show! It is easy to set up and great for reluctant water drinkers like myself. Handwash only though, is its only downside!"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Really nice gift","reviewDate":"August 15, 2019","reviewText":"Work gifted us these water bottles as a fitness motivation thing. I sit at a desk all day and I'm pretty sure Diet coke is all that runs through my veins. The remind feature is really cool works as it should. The speaker has good volume to it. My only complaint is that it was leaking first day but as long as you keep it closed between drinks and put the clasp back over the plastic it will not. I'm guessing it has something to do with keeping the airtight seal. speaker detaches from bottle so you can wash it. Over all highly satisfied!"},{"reviewerName":"Connie T","rating":"5.0 out of 5 stars","reviewTitle":"Awesome customer service","reviewDate":"May 27, 2019","reviewText":"I have always had difficulty drinking enough water. I think that I am drinking enough but at the end of the day I never have reached my goal. But now, with a water bottle reminding me I find that I easily have reached my goal. Plus, my granddaughter thinks that the bottle is cool, so now she has one and is also drinking water instead of sugary things. The bluetooth feature didn't work on the first bottle I received, but when I emailed the company, they immediately sent me a new one. Awesome customer service."},{"reviewerName":"Jenny","rating":"5.0 out of 5 stars","reviewTitle":"Amazing and affordable","reviewDate":"July 13, 2019","reviewText":"I was gifted this smart water bottle and at first I was unexcited. But when’s I actually used it, it’s so amazing. Not only does everything unscrew so it easy to use, the speaker is very loud for its small size. Sure the lights are also pretty but the best part is it reminds me to drink water often, a huge problem for a teen staying at home all day during summer. It’s also super affordable that i might even buy I think for a friend!"},{"reviewerName":"Ashlyn","rating":"3.0 out of 5 stars","reviewTitle":"Not sure where you would use this","reviewDate":"January 8, 2019","reviewText":"The sound is too loud for a public gym and too low for a solo workout at home. But decent speaker and it works as a water bottle. The charge lasted a couple workout sessions and it connects easily"},{"reviewerName":"Jessica Brennan","rating":"5.0 out of 5 stars","reviewTitle":"Awesome!","reviewDate":"July 24, 2019","reviewText":"I was scrolling through Amazon and I saw this water bottle, and thought \"cool it lights up to keep you hydrated\" But then I saw that it didn't only light up but it also played music and had disco lights that danced with the music. I searched other water bottles like this (just to see what else there was) and found another one that only lit up to remind you to stay hydrated. It did not play music or light up and it was $54. This is the best water bottle like this and its only $19. I recommend that you should get this water bottle."},{"reviewerName":"Sara Borne","rating":"5.0 out of 5 stars","reviewTitle":"Great product! A success in Italy!","reviewDate":"July 27, 2019","reviewText":"I bought this bottle for my mom as a gift. She loves it! She uses it every day! it works perfectly. It reminds her to drink every hour so it helps her to stay hydrate. It really comes handy because it's very hot here in Italy and she is going to the beach with it so she doesn't forget to drink. Our italian friends asked informations about it because it's impossible to find such an original bottle like this here! It has lights and bluetooth speaker! Fabulous! I highly recommend it!"},{"reviewerName":"iReview","rating":"5.0 out of 5 stars","reviewTitle":"Well made but not sure I really need this!","reviewDate":"January 24, 2019","reviewText":"Interesting to have a water bottle that glows in different colors and has a speaker. The sound isn't great. I am really not finding a purpose for this. I guess if you want to always have music and always have a water bottle around."},{"reviewerName":"vanessa","rating":"5.0 out of 5 stars","reviewTitle":"I love this water bottle!","reviewDate":"September 16, 2019","reviewText":"Someone gifted this water bottle to my husband but he gave it to me because he knows I carry a water bottle with me everywhere. Score for me! The lights are a fun reminder to hydrate. The speaker gives a great sound- much better than I expected. Even with the speaker at the bottom it is still lightweight enough. Also the clear cap that covers the drinking spout is very secure. I've had no problems with leaking when the bottle is sideways in my car or backpack."},{"reviewerName":"Anna Marucci","rating":"5.0 out of 5 stars","reviewTitle":"I love this water bottle!","reviewDate":"July 30, 2019","reviewText":"Wow! This is one cool water bottle and the sound from the speaker is unbelievable. I didn’t think I would really use the reminders but I do. Love them, especially when I’m busy at work. The size is great too. Not huge and bulky but not small where I have to fill it up all of the time. And the sound really is amazing. I take it to the beach and listen to the water bottle verses my phone because it has a better sound to it."},{"reviewerName":"KaylaWilde","rating":"5.0 out of 5 stars","reviewTitle":"Loving it","reviewDate":"October 18, 2019","reviewText":"Great bottle at a great price. Speaker is easy to pair and sound is pretty loud and of good quality. Lights work nicely as work, specially if bottle has ice in it. Overall very happy"},{"reviewerName":"Laura L. Wright","rating":"4.0 out of 5 stars","reviewTitle":"Nice item","reviewDate":"August 18, 2019","reviewText":"Easy to hook up blue tooth. Speaker worked great and I put it in the dash of my convertible and could hear fine driving."},{"reviewerName":"H.","rating":"5.0 out of 5 stars","reviewTitle":"Great for work","reviewDate":"January 4, 2019","reviewText":"Speaker may even be a little too powerful. But using it means I am drinking more water."},{"reviewerName":"Susan P.","rating":"4.0 out of 5 stars","reviewTitle":"Works as advertised!","reviewDate":"October 30, 2019","reviewText":"I received this water bottle as a gift from my husband. I absolutely love it! I was not remembering to drink water throughout the day and not feeling well because of it. The lights help to remind me that I need to take a sip. The Bluetooth speaker is an added bonus and sounds very clear. It is very easy to hand wash with soap and water. I would purchase again. Thanks for a great product at a reasonable price!"},{"reviewerName":"M. Wanchoo","rating":"5.0 out of 5 stars","reviewTitle":"When you want a dance party with your water","reviewDate":"February 5, 2019","reviewText":"Whoever thought of this product is an absolute genius. I loved the the lights and the boombastic sound that comes from this water bottle. Absolute genius this."},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Awesome!","reviewDate":"October 25, 2019","reviewText":"Wow! Absolutely love this water bottle. The bass is awesome. And colors are great! I wish it stated charged longer. Overall you can't beat this bottle or price! It's very unique and makes great gifts!"},{"reviewerName":"MK","rating":"5.0 out of 5 stars","reviewTitle":"Good waterminder","reviewDate":"March 14, 2019","reviewText":"I’m terrible at drinking water and thought this to be a neat reminder! It’s cool that the lights serve as a reminder to take slow deep breaths that mimick the changing lights. The speaker is actually an added bonus it sounds pretty good for being on a water bottle!!"},{"reviewerName":"Deb B","rating":"4.0 out of 5 stars","reviewTitle":"Nice way to drink your water and listen to your music","reviewDate":"October 25, 2019","reviewText":"Water bottle has a nice wide opening and the Bluetooth speaker has great sound! The colored lights are just fun!"},{"reviewerName":"bonnie moore","rating":"5.0 out of 5 stars","reviewTitle":"The best cup ever!!!!","reviewDate":"November 13, 2019","reviewText":"I absolutely love this cup!!!!!! This is great gift as well as for your own personal use!!!!"},{"reviewerName":"Christina Williams","rating":"5.0 out of 5 stars","reviewTitle":"Glowing lights to remind you to drink water","reviewDate":"August 3, 2019","reviewText":"I absolutely love this water bottle. I never leave home without it. I especially love the bluetooth speaker while I'm working out. The glow to remind me to drink more water while I'm at work is genius. Usually when at work I forget to drink as I'm so busy. Awesome product!!!!"},{"reviewerName":"Jana","rating":"5.0 out of 5 stars","reviewTitle":"Best purchase made!!!","reviewDate":"August 27, 2019","reviewText":"I LOVE this water bottle! I love that it has so many functions. Most of all I love that it reminds me to drink water. I used to go through my day and barely drink any. Now I feel like I’m properly hydrated. I’ve even lost some weight because of my upped water intake. Definitely recommend!"},{"reviewerName":"Matty","rating":"5.0 out of 5 stars","reviewTitle":"Great Gift for Kids","reviewDate":"June 2, 2019","reviewText":"12 year old niece absolutely loved. Great gift idea, especially for active people."},{"reviewerName":"Chevygirl","rating":"5.0 out of 5 stars","reviewTitle":"Fantastic product for the cheap cost","reviewDate":"March 8, 2019","reviewText":"First off the price for this product is amazing then the water bottle itself is fantastic works like a charm purchased one for my self and my husband and we both use them daily quick charge works all day the lights and Bluetooth for our music is a bonus beat product I’ve ever purchased"},{"reviewerName":"Mow","rating":"5.0 out of 5 stars","reviewTitle":"Great product","reviewDate":"October 21, 2019","reviewText":"I love this bottle i use it every Day at work and also to play my one year old music at the park this is goin to be a good christmas present for people that have seen my bottle and loved it aswell great product"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Hydration reminder","reviewDate":"September 29, 2019","reviewText":"Love this item. Mostly because it reminds you to drink water. This has been a life change. I’m more now more hydrated through out the day."},{"reviewerName":"Windi B","rating":"5.0 out of 5 stars","reviewTitle":"Amazong Waterbottle","reviewDate":"August 6, 2019","reviewText":"I asked for this for my birthday. I have trouble remembering to drink water and this is perfect!!!! It flashes as me as a reminder and i now drink far more water! Plus I can stream my music on it"},{"reviewerName":"Michelle Wagers","rating":"5.0 out of 5 stars","reviewTitle":"Great bluetooth sound","reviewDate":"July 18, 2019","reviewText":"I LOVE this water bottle. I was amazed how loud and clear the bluetooth speaker was. I love that I cam easily have access to my water and my music while working in my yard! I also like the spout, easy to drink out of."},{"reviewerName":"Stanley L. Carr","rating":"4.0 out of 5 stars","reviewTitle":"The distance between the water bottle and the phone can't be to far apart. Maybe 20ft max","reviewDate":"July 16, 2019","reviewText":"AWESOME WATER BOTTLE!! I'm not a huge water drinker like I should be but the light feature is a cool reminder. The bluetooth speaker is a bonus and oddly enough that feature reminds me to drink water. Probably because I can change the songs from the water bottle."},{"reviewerName":"Crystal Lyons","rating":"5.0 out of 5 stars","reviewTitle":"Greatest Water Bottle Ever!!","reviewDate":"October 18, 2019","reviewText":"I love that it came in my favorite Color ---PINK! I never heard or seen of this before so when I saw it I knew I had to try it out. It was a really good idea to make this! Speaker works very well and sounds good! The lights are really cool to!"},{"reviewerName":"Paul Carney","rating":"5.0 out of 5 stars","reviewTitle":"FUN!","reviewDate":"August 22, 2019","reviewText":"It is an easy to use water bottle that makes drinking water on the go FUN. We love taking walks with our children and listening to music with them and with this bottle, it makes it so easy to do! Really unique gift idea."},{"reviewerName":"Nicole Solt","rating":"5.0 out of 5 stars","reviewTitle":"worth every penny","reviewDate":"September 10, 2019","reviewText":"Bought this water bottle to remind me to drink enough water because I currenlyfound out I was pregnant!! Best decision ever, this water bottle not only is inexpensive but the Bluetooth is amazing and I absolutely love how it lights up to remind me!!!"},{"reviewerName":"C Powers","rating":"5.0 out of 5 stars","reviewTitle":"Great gift!","reviewDate":"September 30, 2019","reviewText":"I received this water bottle as a gift from my company and it’s great! The speaker is much louder/clearer than expected. I really like the design of the mouthpiece and the fact that it locks to help prevent spills in your bag."},{"reviewerName":"Chancey","rating":"5.0 out of 5 stars","reviewTitle":"Awesome reminder","reviewDate":"August 15, 2019","reviewText":"I ordered this water bottle because it's suppose to remind me to stay hydrated. JUST KNOW it did just that! The light is bright and noticeable and the speaker is nice and loud. Definitely a pretty cool water bottle!"},{"reviewerName":"Giovanna Mazzariello","rating":"5.0 out of 5 stars","reviewTitle":"Love this product!!!","reviewDate":"October 15, 2019","reviewText":"I absolutely love this product! It makes my workouts fun and I dont have to worry about setting up a speaker or where my phone is to have my music right in my hand. Colorful and fun for kids too!"},{"reviewerName":"john carlos fagundes","rating":"5.0 out of 5 stars","reviewTitle":"Just as described!","reviewDate":"July 11, 2019","reviewText":"It was a fast delivery! I like working out with music playing, so the bluetooth water bottle is very convient. The colorful lights are a helpful reminder to drink water & is very fun."},{"reviewerName":"nc","rating":"5.0 out of 5 stars","reviewTitle":"Makes for a great gift","reviewDate":"July 18, 2019","reviewText":"This is an amazing product that will motivate you to stay hydrated. Love that it has multiple uses and can't wait to use it poolside. Highly recommended!"},{"reviewerName":"Stephanie T.","rating":"5.0 out of 5 stars","reviewTitle":"Great Water Bottle","reviewDate":"October 18, 2019","reviewText":"This water bottle is great. I received it for a gift at work. We tested out the speaker right away and it worked great. My teens liked it so much that they want one too."},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Love it","reviewDate":"November 8, 2019","reviewText":"this water bottle is awesome. It has definitely made me drink more water by reminding me. and i love the lights and speaker option! great invention!"},{"reviewerName":"Hong Zhang","rating":"5.0 out of 5 stars","reviewTitle":"Awesome Speaker/Water Bottle","reviewDate":"August 22, 2019","reviewText":"Very useful and functional. Works fantastically with the speaker and the beat of the music even syncs up to the light"},{"reviewerName":"Helen","rating":"5.0 out of 5 stars","reviewTitle":"A Great reminder","reviewDate":"September 1, 2019","reviewText":"I love this bottle it tells me when to drink water. I don't like water but I drink it when this bottle tells me too. I like the dancing light."},{"reviewerName":"Randa Darwish","rating":"1.0 out of 5 stars","reviewTitle":"Great idea, poor implementation!","reviewDate":"August 12, 2019","reviewText":"The lights are not working and the bottle doesn't close well, it spilled all over the bag......and the reminder doesn't work"},{"reviewerName":"B T.","rating":"5.0 out of 5 stars","reviewTitle":"Fancy","reviewDate":"August 21, 2019","reviewText":"The bottle was fancy with speaker and light. The speaker was really good quality. It was really useful."},{"reviewerName":"Cheryl H.","rating":"5.0 out of 5 stars","reviewTitle":"The blue tooth speaker is awesome the sound is great","reviewDate":"August 11, 2019","reviewText":"I brought this Ice water Bluetooth water bottle and love it. The sound comes out so get through the speaker really like it alot.."},{"reviewerName":"Raymond P","rating":"4.0 out of 5 stars","reviewTitle":"Very nice to have, good bass","reviewDate":"October 7, 2019","reviewText":"Ordered a slightly different kind and loved this one for my kids, they love it also! Great product and its waterproof!"},{"reviewerName":"Dorrine Smith","rating":"5.0 out of 5 stars","reviewTitle":"A great tool for those who need to increase water intake.","reviewDate":"August 30, 2019","reviewText":"I love my 3 in 1 bottle would recommend to anyone interested. A great tool for those who need more water intake."},{"reviewerName":"lacarra jenkins","rating":"5.0 out of 5 stars","reviewTitle":"Most have","reviewDate":"August 18, 2019","reviewText":"Husband brought this as a gift. Really loved it I would really recommend it"},{"reviewerName":"Giavanni","rating":"5.0 out of 5 stars","reviewTitle":"Best water bottle ever!!","reviewDate":"October 27, 2019","reviewText":"I just received it and I love love love the water bottle so much and the speaker is high quality omg"},{"reviewerName":"Gayle Butcher","rating":"5.0 out of 5 stars","reviewTitle":"Bike Ride Companion","reviewDate":"August 2, 2019","reviewText":"I like the non intrusive light reminder. This is perfect for my bike rides. 👍👍"},{"reviewerName":"beautyandthebook","rating":"5.0 out of 5 stars","reviewTitle":"Reminds me to drink water","reviewDate":"August 22, 2019","reviewText":"I LOVE THIS!!!!\n\nHOW I HAVE LIVED WITHOUT ONE OF THESE..."},{"reviewerName":"Angelina Murch","rating":"5.0 out of 5 stars","reviewTitle":"Awesome sound","reviewDate":"March 30, 2019","reviewText":"This water bottle is great in the boat, the river and camping. I love it."},{"reviewerName":"Snake373","rating":"5.0 out of 5 stars","reviewTitle":"The Most Useful Item At Work!","reviewDate":"November 4, 2019","reviewText":"While searching for a music playing alternative for my job,which doesn’t allow earbuds anymore,I came across a Bluetooth speaker that is also a Water Bottle. And boy did the ICEWATER Smart Bottle do the trick.\n\nFor starters,the actual speaker has some good clarity and low end. Shakes the water inside like that one scene from Jurassic Park when the T-Rex First shows up. Truly sounds high quality went into the speaker itself.\n\nThe bottle holds just the right amount of fluids I would need working as a mechanic. You truly can pop this thing open with one hand. But Popping it back on requires some force. No biggie. What I don’t like is the latch can sometimes not pop off all the way and instead just “pops”. Lid stays on but now it isn’t locked and you can freely move it back, but that was just one thing I didn’t like that I had to mention.\n\nThe added light effects are bright enough for me during the day to notice and mesmerizing at night. The strobe effects blend well with whatever music is playing. Pretty great. What I would’ve wanted though were more patterns of colors and more colors to choose from. I know that maybe giving us more than just Dance Mode would’ve confused the Hydration Reminder with user presets but maybe different colors,haptic feedback? Probably ways to make the reminder stand out a little more than it does here.\n\nOther than that I can’t much complain. It more than delivers on what it says and I am completely satisfied with this product as a mechanic looking for music without getting into trouble and giving it more useful purpose to me than just play music. No part of the bottle offering is sacrificed in quality."},{"reviewerName":"Kim","rating":"5.0 out of 5 stars","reviewTitle":"Clever Way to Hydrate","reviewDate":"February 14, 2019","reviewText":"Quick shipping. Exactly as described. Quick customer service response to questions. Works great!"},{"reviewerName":"Joan06","rating":"5.0 out of 5 stars","reviewTitle":"Great","reviewDate":"June 11, 2019","reviewText":"I like it a lot. Very useful"},{"reviewerName":"Michele","rating":"5.0 out of 5 stars","reviewTitle":"Smart water bottles","reviewDate":"August 29, 2019","reviewText":"My kids aunt got them all smart water bottles to encourage them to drink more water. They love them and I think it has really helped them. The speakers work really good and they absolutely love their waterbottles."},{"reviewerName":"Eboney herbin","rating":"5.0 out of 5 stars","reviewTitle":"It's amazing","reviewDate":"July 16, 2019","reviewText":"My mother bought me a icewater 3-in-1 smart water bottle and i must say i am impressed. The speaker sounds amazing and i love how it lights up to remind me to stay hydrated. I would absolutely recommend this to anybody."},{"reviewerName":"Trisha","rating":"5.0 out of 5 stars","reviewTitle":"Awesome!!","reviewDate":"July 3, 2019","reviewText":"Water bottle is awesome! Great for walks, running, or just relaxing on the beach. Even at work I always forget to hydrate and this is the perfect way to stay on top of the amount of water I drink."},{"reviewerName":"Aidan Smith","rating":"5.0 out of 5 stars","reviewTitle":"Awesome","reviewDate":"July 21, 2019","reviewText":"Love this product now I dont have to worry about bringing a speaker and a water bottle becauce now they both in one. Also has great sound, and is affordable."},{"reviewerName":"ChillC","rating":"5.0 out of 5 stars","reviewTitle":"Perfect","reviewDate":"February 25, 2019","reviewText":"Lights up when it needs too, settings are easy, speaker is nice and the clasp is great. Exactly what I wanted."},{"reviewerName":"Shelli Scurka","rating":"5.0 out of 5 stars","reviewTitle":"Great product","reviewDate":"March 25, 2019","reviewText":"I bought this water bottle to help me drink more water, the colorful lights help me remember to drink water on a regular basis. It works great for that reason!!! Using this product is easy and the music sound fantastic. I would recommend it for both reasons. Stay hydrated!!!"}],"qAndA":[{"question":"Not sure what I’m doing wrong but the remind feature doesn’t work. Any suggestions on what I may be doing wrong?","answer":"Is it on? You have to make sure the power is on for it to remind you."},{"question":"The 1-hour reminder light does not seems to work, faulty bottle? Wi-Fi speaker works. But does not light-up as advertised...anyone has this problem?","answer":"Yes, same problem."},{"question":"How do i turn it off i used it once and was able to turn it off but the second time it wont turn off and i held the power button like it said to??","answer":"Mine turns off very time when I hold down the power button."},{"question":"How well does it keep water cold?","answer":"I think its fair at keeping water cold"},{"question":"How much water does it hold","answer":"22 oz"},{"question":"How do you get the bluetooth speaker to work","answer":"I just turned it on push the button and it went to Bluetooth on my phone and connected"},{"question":"Does it keep track of how much water you should be drinking?","answer":"Unfortunately, no"},{"question":"Can you put icewater in it??","answer":"My son does and it works fine"},{"question":"Can you turn the light off while using the speaker? As fun as the disco light thing'll be, it might be a bit distracting if I use it at work.","answer":"Yes!"},{"question":"How long does the speaker and glow last?","answer":"The speaker lasts at least 30-40 minutes unless you have it connect it to the charger. It's glow only for a minute and its turn off instantly."},{"question":"Does it keep track of how much water you should be drinking?","answer":"It doesn’t. It just reminds you to drink water every hour by lighting up."},{"question":"Does it glow at the top of every hour or does it glow an hour after you've turned it on?","answer":"I believe an hour after you’ve turned it on"},{"question":"Anyone actually get the remind function to work?","answer":"Nope"},{"question":"Why does my bottle not glow every hour ? It did the first day I got it ???","answer":"I didn’t think mine glowed every hour either but if you’re not near it you may not notice it. The glowing only lasts maybe 5-6 minutes. So if your not paying attention you’ll miss it."},{"question":"Timer does not work, how do I request a refund?","answer":"Same thing happened to me."},{"question":"So how do you know that it is reminding you to drink water","answer":"It lights up as it sits there. And you notice it even if you are working on something else. For me it reminds me that I haven't had anything to drink in a while."},{"question":"Does the bottle connect to androids?","answer":"Yeah you should"},{"question":"Does this sync with fitness apps? ie:fitbit, apple watch?","answer":"This is a Christmas present so I don't know yet. Sorry"},{"question":"Will this work if I don't want to connect the speaker via Bluetooth? Just light up every hour?","answer":"The Water bottle will light up every hour without connect the Bluetooth."},{"question":"Can I keep the speaker in the fridge with the water bottle?","answer":"I've never done it,the speaker screws off the bottom very easily"},{"question":"How long does it keep water cold?","answer":"It’s like any plastic water bottle. There’s no extra insulation, so it stays cold about as long as it would in a plastic cup."},{"question":"How does the icewater 3 in 1 remind you to drink water","answer":"It glows every so often. That works as a reminder."},{"question":"Reminder feature doesn’t work even when power is on. How do I make it work?","answer":"I'm having the same problem with this water-bottle. Wi-Fi speaker works fine, though. I let it sit w/power-on and no lights an hour later. :("},{"question":"does it fit in a car cup holder?","answer":"Yes, mine at least"},{"question":"Can I hook up to my I phone and use as a better speaker?","answer":"Yes i have an iphone and connect it via bluetooth its perfect when u go for hike 😍"},{"question":"Can I just have the light only?","answer":"You can,Press and Hold the Pause Button ,Turn on or off the Dancing Lights Mode ,Press the + or - Button to Change the Lights"},{"question":"Is this product Bpa free?","answer":"Yes"},{"question":"Does it ever make sound unexpectedly?","answer":"Yes it does. It did with me. 2 separate times, on the same day. Out of the blue, I hear a man's voice talking like a recording, but I didn't understand what it said. The bottle was on a table and I was sitting away from it. The next was just a sound. Scared me half to death."},{"question":"Can you set it to remind you every 10 minutes or is just per hour?","answer":"No"},{"question":"Resists hot liquids","answer":"I don't think I would use it for hot liquids, like coffee, for example. The \"user manual\" that comes with it has hardly any info. It does say 2 things related to your question. . . . It is called \"3-in-1 smart WATER bottle\", which makes me think not for hot drinks. It also has an email address where you can ask the man… see more"},{"question":"Do the buttons break or stop working from over use??","answer":"So far mine haven’t. I’m not sure of anyone else’s experience"},{"question":"Does it sync with fitbit app?","answer":"No"},{"question":"Can it play a sound when it reminds you to drink?","answer":"Can't play a sound when it reminds you to drink,Glows to remind only"},{"question":"How good is this bottle?","answer":"This bottle is very cool. SPEAKER is loud. Lights are great. Love the bottle. First one my kid hasn't lost."},{"question":"How many mice can this catch before the spring needs to be tightened?","answer":"None"},{"question":"How do you wash it without getting speaker wet?","answer":"The bottom screws off."},{"question":"What is the difference between the yellow bottle priced at 49.98 and the other colors priced at 19.98?","answer":"Nothing, these are all crap."},{"question":"Can someone actually provide instructions on how to set up the hour reminder? I have kept the power on & played with the color setting. What else?","answer":"At first mine went off every hour then after a day it went off sporadically. I’m not sure there is away to program. I looked through the directions and couldn’t find anything."},{"question":"Does it come with charging cable?","answer":"Yes it does"},{"question":"How do i connect it to bluetooth? it isn’t showing up in my device list. how do i pair it?","answer":"Under you phone settings. It only allows you to since for the music. It does not track your water intake"},{"question":"Why is there a hole in the lid over the mouthpiece? Straws don't fit it and it causes water to leak out?","answer":"Mine has a rubber seal that is in there and seals the cap even tighter. It sounds like yours may be missing the seal."},{"question":"How do u get the lights to work on the water bottle when playing music","answer":"The up n down button"},{"question":"What is so special about the yellow or blue colo choices that they are more expensive?","answer":"I can imagine making basic black is a color that is more common with bottles and the other options include color shades that would be more personalized to a smaller demographic who don’t prefer black."},{"question":"Is it insulated","answer":"No it isn’t insulated."},{"question":"Does the light reminder only go on when I haven't touched the bottle for an hour? The light reminder doesn't seem to work.","answer":"My lights flash when I turn it on and every hour after unless I'm using the speaker!"},{"question":"Is this product Bpa free?","answer":"100% BPA Free"},{"question":"Is the speaker water proof as in if it drops in the lake its ok?","answer":"It’s water resistant, so I’ve washed my bottle and condensation has dropped down it with no problems but haven’t submerged it in water, I would guess it’s ok as long as the cover for the charging cord is closed"},{"question":"Im a very indecisive person.... Trying to decide between this and the stainless steel model. Anyone have both? How durable is this see see thru model?","answer":"Don’t get it. That it’s main prob. It’s not durable. I had to exchange both of the two I bought. Then one had fell and the speaker just squeals a loud pitch noise. Had to throw it out. It is beyond the return date."},{"question":"What is the difference between black amd deep black?","answer":"Deep black is a darker, more intense shade of black. But honestly, it will not matter once you start using the bottles. I mean, you will not even notice the deep versus not deep black."},{"question":"One handed opening feature not working, any ideas? 😔","answer":"Do not buy minds broke the next day will never buy again"},{"question":"I cant connect my phone to the bottle.Do I have to download an app?","answer":"No you just have to connected to the Bluetooth"},{"question":"Just received my bottle yesterday. When I turn it on, there are pretty colors, then it turns off. Isn't it supposed to remain on?","answer":"Mine is doing the same thing. I tried to contact the senders about sending a new one but have not heard back from them"},{"question":"Good for seniors?","answer":"I didn't use it yet"},{"question":"I just got this water bottle and so far i like it. my question is, how do i or can i download songs from my cellphone to the bluetooth speaker.","answer":"You don’t download anything. You pair your device to the speaker and play things through it"},{"question":"Is it Dishwasher safe?","answer":"I hand wash it but I assume it would be. The speaker come off"},{"question":"Can I turn the music off and still have the bottle glow?","answer":"Yes!"},{"question":"Does it make a sound or does it just light up","answer":"It is a bluetooth speaker, so it only plays the music connected to your mobile device via bluetooth. You can set it to pulsate to the beat or not. Mine broke in 2 days, definitely would not recommend."},{"question":"Why is there a hole in the lid over the mouthpiece? Straws don't fit it and it causes water to leak out?","answer":"That hole is covered by a rubber piece. In which acts as a suction barrier. To keep your fluids from leaking."},{"question":"Once i turn the power on it just keep glowing and doesn’t stop? how do i let it know that i drank water and to remind me in one hour?","answer":"I haven't used it yet. I would contact the seller."},{"question":"Do you have to charge the speacker part or how does it work","answer":"Yes it comes with a charger - doesn’t run down that quickly"},{"question":"Is this BPA free?","answer":"I am not sure about that. It just has rubbed off faster than any other necklace I have ever had"},{"question":"Very upset it won’t turn off how do I turn it off?","answer":"You have to hold the power button until the light goes off."},{"question":"To help me with getting this to hook up with my cellphone?","answer":"I have an Android phone. Search for the bottle using the bluetooth option on your phone it should pop up for you."},{"question":"My Dad gave me this great bottle but he threw out the instruction manual, is there a pdf I can view?","answer":"Yes, we do. Please contact us"},{"question":"Is this 110V?","answer":"Charging via USB cable,It is 5V."},{"question":"Can you set it for less than an hour increments? Mayne 15 minutes?","answer":"No the color change happens on the hour."},{"question":"Can you put anything other than water in the bottle","answer":"You can fill it with any liquid."},{"question":"Is the glass? Or plastic?","answer":"It's a hard plastic."},{"question":"Does it remind you every hour or every 2 hours?","answer":"Every hour"},{"question":"My bottle work in the dishwasher can I order a new bottle not the bottom just the bottom","answer":"Idk"},{"question":"How do you sync it to your phone?","answer":"Blue tooth in your settings."},{"question":"My phone cant find the bluetooth connection 😢","answer":"You have to do a search lm both ends"},{"question":"does it work with the i pod","answer":"The name is miss-leading \"Smart\", it's not actually a smart device. The only part that interfaces with your phone is the bluetooth speaker function. The water-bottle itself, has a built-in timer that simply lights-up every hour. It automatically activates once turned on."},{"question":"How do you get the lights to dance? & I'm not sure it lighting up is working?","answer":"Press and Hold the Pause Button,Turn on or off the Dancing Lights Mode,In Dancing Lights Mode,Lights Will Dancing to Music"},{"question":"The 1-hour reminder light does not seems to work, faulty bottle? Wi-Fi speaker works. But does not light-up as advertised...anyone has this problem?","answer":"Yes, same issue."},{"question":"Will it Bluetooth to a Google pixel 3 xl?","answer":"Not sure about that one...however, google pixel 3 xl's operating system is android. So it should.\nGood luck"},{"question":"Can I keep the speaker in the fridge with the water bottle?","answer":"It doesn’t say that you shouldn’t , but it’s a loud speaker so i wouldnt Recommend doing so just incase it could damage it in some sort of way"},{"question":"Do I have to keep the light on a color constantly for it to glow every hour?","answer":"No"},{"question":"I figured out how to get the lights to change, but! I need some help with, the Bluetooth radio to hook up to my cellphone, could someone maybe be able","answer":"I have an android phone. Use the bluetooth option on your phone. It should pop up for you. Make sure it's not connected to someone else's phone. I had to figure that out."},{"question":"Cabot get the Bluetooth to sync with my phone","answer":"Yes of course"}]}