{"title":"Sonos One (Gen 2) - Voice Controlled Smart Speaker with Amazon Alexa Built-in - Black","manufacturer":"Sonos","currentPrice":"$198.98","rating":"3.9 out of 5 stars","totalRatings":"250 ratings","features":["The powerful smart speaker with voice control built in","Get rich, room filling sound with Sonos One, and control it with your voice, the Sonos app, Apple AirPlay 2, and more","The compact design fits just about any space. Put it on your kitchen countertop or tuck it away on your office bookshelf","Amazon Alexa is built right in so you can play music, check news, set alarms, get your questions answered, and more, completely hands free","Pair two Sonos Ones in the same room for stereo separation and more detailed sound","Alexa speaks English and Spanish"],"reviewsAspects":["sound quality","google assistant","play music","great sound","alexa integration","voice recognition","sounds great","google home","trouble understanding","echo dot","living room","multi room","voice control","easy to set","much better","works well","surround sound","understanding right","bottom line","different rooms"],"productInformation":[{"Product Dimensions":"4.7 x 4.7 x 6.3 inches"},{"Item Weight":"4.08 pounds"},{"Shipping Weight":"5.03 pounds (View shipping rates and policies)"},{"Manufacturer":"Sonos"},{"ASIN":"B07NJPXRBC"},{"Item model number":"ONEG2US1BLK"},{"Batteries":"1 Lithium ion batteries required."},{"Customer Reviews":"3.9 out of 5 stars\n    250 ratings\n3.9 out of 5 stars"},{"Best Sellers Rank":"#2,631 in Cell Phones & Accessories (See Top 100 in Cell Phones & Accessories)\n#82 in Portable Bluetooth Speakers\n#1,009 in MP3 & MP4 Player Accessories\n"},{"Date first listed on Amazon":"February 8, 2019"}],"productDescription":[],"reviews":[{"reviewerName":"M. Y. 'Photographer | Outdoor Enthusiast | Tech Pro'","rating":"5.0 out of 5 stars","reviewTitle":"Excellent, complete home audio system. Alexa/Google Assistant available, but not yet fully capable","reviewDate":"June 1, 2019","reviewText":"When I had just purchased a home, I was looking into having it wired for whole-house audio. Looking into multi-room systems on Amazon, it was apparent to me that it wouldn't be cheap: cost of the speakers, controllers, PLUS cost of running wires throughout the house. When I saw the SONOS PLAY:1 promotions, I found its wireless solution to be more cost effective, and with better speakers to boot. I have since tried the SONOS ONE speakers that were realized in late 2017. In 2019, the Sonos ONE (Gen 2) was released, which currently offers no significant advantages over its predecessor except for 2 areas: faster processor (for future expansion) and Bluetooth LE (for speaker setup via Bluetooth at this time).\n\nBelow are the pros and cons that led me to decide for the Sonos system.\n\nNOTE 1: a Sonos BRIDGE is NOT needed to use the PLAY:1 or ONE. See the INSTALLATION section of this review.\nNOTE 2: the PLAY:1 is the same as the ONE without voice and touch integration. As such, the PLAY:1 is less expensive.\nNOTE 3: the ONE (Gen 2) is virtually the same as the ONE (Gen 1) except for a faster processor and Bluetooth LE included. This makes it slightly more future proof.\n\nPROS\n- Hi-Fi. Speakers sound better than the multi-room, wired systems I looked at for less than $500.\n\n- Resale Value. Wired speakers don't add much resale value to your house. So, why spend $1000s, only to leave the audio system behind when you sell the property or move? With wireless, I could take my expensive speakers with me to my new home.\n\n- Freedom to move around.\nWith wireless, you are free to take the speakers anywhere you want throughout the whole house. For neighborhood block parties, I could even hook up the speakers to an extension cord out to the street, and stream music from my home. Or take it outside to your backyard. They are moisture-proof, but I wouldn't use them as permanent outdoor speakers unless you enclose them in protective casings.\n\nNOTE on wireless: each SONOS component is its own wireless client and repeater. Sonos wireless is a private, wireless \"mesh\" system, separate from your home WiFi. What does that mean to you? It routes music through its own wireless, leaving your home WiFi untouched. There's an additional benefit for that, as I'll explain after the installation note below. Most of the Sonos components (PLAY:1 and ONE are NOT one of them) have 2 network ports. This means, you can plug in the component into the network jack, and use the 2nd one on the speaker to connect your laptop.\n\n- Alexa integration: the speakers now support voice control, though it is a work-in-progress. Sonos updates the capabilities via software updates over time. Google Assistant support is scheduled to come in 2019, making the ONE a more desirable option than having a Google Home and Amazon Echo in the house. I do get frustrated far more often with Alexa not understanding me or my request. My whole family enjoys Google Assistant's better answers and ability to understand us. We can't wait for Sonos to bring the Google Assistant to the ONE. Note: we aren't fans of the Alexa on the Echo Dot either. Google Assistant is just that much better at recognizing commands and providing data. However, Alexa is a bit more advanced in the automation space. Pros and Cons, but that's for another review.\n\n[Update 5/2019 Google Assistant integration: it finally arrived and wow, the voice recognition is SO MUCH better! Our whole family is actually happy. Note that Assistant is not yet as fully capable as on Android smartphones or Google Home, but it is sufficient for answering queries and controlling smart devices.]\n\nINSTALLATION: First, the tech talk. You need 1 Sonos component to be plugged in to your home network (any of the PLAY speakers, Soundbar, Bridge, etc.) So, as an example, you must plug in either the BRIDGE or the ONE to your network with a network cable. This turns that component into a wireless access point (or as consumers tend to call it, a \"Wifi router\".) All other Sonos components will now be able to wirelessly talk to that plugged-in device. No other Sonos component has to be plugged in, as long as it's within wireless range of the plugged-in one. Should a component in your house be too far away (say, your garage) from the plugged-in one, you can connect it to your network via cable, if available, or set up a Sonos BRIDGE (or any other Sonos speaker) wirelessly somewhere between the plugged-in one and the Garage speaker. The BRIDGE or other speaker strengthens the wireless from the plugged-in one, and extends the range to the one in the Garage. Each Sonos component is both a wireless client, and a wireless access point/repeater. Each component talks to each other in a mesh network. Think of a spider net. Any part that is touched vibrates to the rest of the net.\n\nTech-talk aside, think about this: One person (Person 1) is at a corner of the house. When he shouts, the person in the garage (Person 2) can't hear Person 1. The only way Person 1 can talk to 2, is to pick up the phone (talking over a wired connection, or plugging a distant Sonos component to the wired network) or having Person 3 stand between them (having a Sonos component physically be between both speakers) and relaying the information back and forth (what WiFi mesh would do). So, with each Sonos component/speaker, the Sonos wireless range gets extended.\n\nWith the Sonos wireless mesh, you could humorously place a few speakers into each house in the neighborhood, and suddenly play the same music through each home. Try that with Bluetooth speakers. You wouldn't be able to.\n\nWiFi mesh TIP: if you have an Android device, you can Google \"Android devices on SonosNet\", and you will see instructions on how to use your Sonos wireless network (\"SonosNet\") to connect your Android phone/tablet. This allows you to use your mobile device further away from your home WiFi. This has disadvantages and advantages out of the scope of this review. I decided not to use SonosNet for my tablets.\n\nNOTE: a Sonos BRIDGE is NOT needed to use the ONE. Just plug in the ONE to the wired network (ie your router), and it will work just fine. You still control it with the Sonos App from your mobile device. Once the ONE is plugged in, you can add other Sonos components to the system. A BRIDGE is NOT needed for that either. It's only needed if you want to extend the Sonos wireless range to a farther part of your house or yard for $50 vs buying another PLAY speaker for $100+)\n\n- Small size. The BRIDGE is about the same size as an Apple TV/Roku/WD TV Live. The ONE is about 2-3 of them stacked on top of each other. The ONE has a fairly hefty weight, a good sign of the good sound coming from its components.\n\n- Ease of Pairing. To pair other Sonos components (or with the Sonos Controller App), simply hit the Play/Volume Up button on the speaker, and the same combination on the other speakers. If pairing with the BRIDGE, hit the pair button on that component.\n\n- LED. The Bright LED can be configured to turn on/off via the Sonos app.\n\n- Ease of music sync.\nYou can use the free Sonos app for your Android, iOS (iPhone/iPad/iPod), Windows Phone, Mac/Windows laptop/tablet (sadly, no Windows Store app yet) to control how the speakers play: you can easily choose which speakers to pair/unpair into groups. Grouping the speakers allows you to play the same music on those speakers. You can have up to 32 separate groups. You can also individually control each speaker from the app. Each group's volume is controlled by the Sonos app. So, if Speaker 1 is set to 50% volume, and Speaker 2 is set to 25%, lowering the volume by 5% will lower Speaker 1 to 45%, and 2 to 20%.\n\nOnce music is playing, you can leave the house, and it will continue to play -- as long as the music source is not coming from that mobile device (meaning: if you're playing MP3s from your phone, and your phone leaves, it will stop playing. But if you started Pandora from your phone, or you told the speaker to play music off one of your network shares, it will continue playing since the source is coming from a device that's still at home.)\n\nPARTIES: one cool feature is that once you download the Sonos Controller app and pair it to one of the Sonos speakers (which authorizes the app/phone to talk to your Sonos system -- this prevents unauthorized people outside your home from controlling your speakers), each device can control the playlist. So, if you have guests coming over, and each guest downloads and authorizes the Sonos app to your system, each guest can now add/remove songs from the queue. Everybody can now be a DJ.\n\n- Stereo pairing for ONE.\nYou can take two ONE speakers and set them up as Left & Right channels for stereo output. WARNING: you cannot pair ONE and the older PLAY:1 for stereo. You either have to use two PLAY:1 or two ONE.\n\n- Expandability.\nSonos did a smart thing. They released the less expensive PLAY:1/ONE to wet your/my appetite. As you use the system, you will likely buy more Sonos components to expand your sound system, resulting in more revenue for the company. You can add any Sonos component to your system, and they will all work in harmony. You can set up a complete home theater system that way too. I know, sounds pricey. It is. But it still is cheaper than having your whole house wired with nice speakers.\n\n- Alarm/Sleep timer.\nYou can set up each speaker (or Group of speakers) to play music at a specific time, day, and volume (Alarm) from a specific source for a specified amount of time. Or you can also set a Sleep timer to play music for a specific number of minutes to ease you into sleep. I love getting waken up by mellow music (ie. Norah Jones) in the morning, and when I leave the home, I don't have to worry about turning off the speakers. It'll automatically turn off after the 45 minutes I set up for the alarm.\n\n- Sound. Sound quality is quite good. I will leave you with the reviews by others to read more about that. With the Sonos app, you can control Bass, Treble, and volume. I have the speakers play between 15% to 25% volume in each room -- they are plenty loud enough. Setting them to 100% can be heard through the whole house -- and the potential for your neighbors to complain. Even at low volume, the sound is very good. It's definitely better than most Bluetooth speakers. If you put the ONE in the corner of a room, the sound seems a bit more muffled due to the amplification of the Bass by the walls on both ends. You can fix this by adding more Treble, or by moving the speaker away from the corner.\n\n- Design. The ONE and BRIDGE are beautiful devices. They don't look out-of-place in my home. I bought the White ones.\n\n- Capacitive touch control: works very well.\n\nCONS\nI couldn't find many cons with the ONE. But here are some that have annoyed me.\n\n- Lack of screw hole for mounting onto stands like the PLAY:1. The ONE replaced the PLAY:1's screw hole with the power button. As such, an entirely new stand needs to be purchased, and Sanus makes one that accommodates the ONE and Play:1.\n\n- Cost. The Sonos system is expensive. Just look at the price of the other components. Holy moly. Still, if you were to wire your house with Bose speakers, the Sonos system is comparatively inexpensive. Again, I chose Sonos because wiring the house won't add much resale value. I like the idea of being able to take my Sonos with me to my new home.\n\n- Sonos App Interface. The app is clunky and looks outdated. It took me a while to figure out where to go to do what (and I love gadgets/toys. I'm a technology tinkerer!). It's not very user friendly.\n\n- Music sources. Not all apps can play to the Sonos speakers. You have to use the Sonos App, add the approved source to it, then you can play from that source. I wish you could re-route any audio from any device to the speakers. Pandora, network shares (NAS), iTunes, TuneIt Radio (built-in), iPod/iPad/iPhone, media files on your own Android/Windows device are all possible sources. At one point (if I remember correctly), my not-so-tech-savvy dad was able to beam his iPad's YouTube sound to the speakers without using the Sonos App. I didn't get a chance to verify how he did it, but I did see the ONE being available as a target on his iPad. Perhaps it was playing via the DLNA protocol. Either way, that was neat.\n\n- Input source. I wish that the ONE had a Line-in/Aux port so that you can connect any music source to it for playback, such as your TV or existing home entertainment system. Yes, the Sonos CONNECT takes care of that, but look at the price of that component! Even then, the CONNECT doesn't support SPDIF/Optical input.\n\nWeren't it for the Amazon/Target promotions on Black Friday, I would have been EXTREMELY hesitant to buy these expensive speakers. I bought two ONE during the promotion. With that said, overall, I'm quite pleased with the purchase. It came out cheaper than wiring the house, and I get to control my music from any of the mobile devices. That's neat. Lower the prices of your other components, Sonos! I hope for increased competition in the market to drive the prices down -- as of today, I'm not aware of any good, alternate, wireless HiFi solution.\n\nIf you found this review helpful, please hit the \"Yes/Helpful\" button below to encourage me to write more. Thank you!"},{"reviewerName":"Bruce Wayne","rating":"2.0 out of 5 stars","reviewTitle":"False Advertising Alert!","reviewDate":"The manufacturer commented on the review below","reviewText":"I bought a few of these sonos gen 2 units and set them up. Easy breezy to do. Ran into a small hiccup with setting up Alexa but that was user error and I figured it out. It’s just a multi multi multi step process I wasn’t anticipating. The speakers are great. I love that I can take calls and not rely on regular Bluetooth speakers. However! I bought these with the intention to not have to purchase the amazon echo or dot or whatever because of sound quality. I’m finding that the Alexa function is incredibly limited. It WAS advertised that Alexa voice calls were unsupported. BUT it had no mention of other things, such as routines and other automatic processes. Why can’t I have an Alexa Routine work with SONOS? That’s one of Alexa’s features that are wonderful. Aaaaaaand now I have three speakers that are as helpful as coasters, in my opinion, with simple functionality that isn’t possible. This unit is 10 stars if they can fix with a firmware update. Otherwise I will likely send them back. It’s just not worth the cost to have limited Alexa functionality. It’s pitched as ‘use Alexa for everything but voice calls!’ Not true.\n\nUpdate: after three days? All of the speakers are out of connection and don’t work with Alexa or playing audio in general. I think there is a bug they need to fix where the device doesn’t connect to WiFi properly. I’m no tech wizard but I like to think I know mostly everything when it comes to easy-to-use devices and setups. I trouble shooted as best I could with customer service. Still no bueno."},{"reviewerName":"Radi0head","rating":"1.0 out of 5 stars","reviewTitle":"Sounds great but connection is a true nightmare","reviewDate":"March 12, 2019","reviewText":"The sound is amazing. So much better than my Echo speaker (obviously.)\n\nThe connection gets worse each day. I never had any problem with a device staying connected to my network so I’m not sure If I got a defective one but I’m about 2 days from returning this. The sonos app is terrible. I wrote to them for help which is my last try before returning. This speaker won’t stay connected and then the process to get it reconnected only works if I unplug it and connect it directly to the router. If you are planning on keeping it right next to your router maybe it would be tolerable to constantly go through this?\nAlexa is slower to respond on this device as well."},{"reviewerName":"BlindBoy1","rating":"5.0 out of 5 stars","reviewTitle":"Quality Speakers!","reviewDate":"March 13, 2019","reviewText":"Update:\nI’ve loved this speaker since I purchased it. I haven’t experienced connection issues like others.\nMy experience has improved ten fold with Google Assistant. Alexa sometimes needed a reboot after voice went offline. Not once with GA. I have both Alexa and GA powering my setup. Best of both worlds.\nI can't compare this to the 1st generation Sonos One, but I know it now has BLE and a faster processor. The sound is clear. I also have multiple Play One speakers... Not a big difference in sound.\nMy purpose in buying was the ability to use AirPlay. Playing music from a wider collection. Not locked into a specific app when playing from multiple libraries. Then the ability to group my nom AirPlay speakers.\nThe biggest plus for me... Not only can I group all my Sonos speakers. I can also play through my sound bar that is connected to my Apple TV 4k. This has given me the ability to play the same music throughout the entire house. Extremely easy to setup. I haven't experienced any dropouts. Strong signal from all access points.\nI love Sonos for producing quality speakers. Easy to setup and use. For a blind individual like myself, this is appreciated. I love tech, and gadgets.... It's refreshing when a manufacturer produces a product that does what it says it will.\nI can definitely recommend this product."},{"reviewerName":"damianicus","rating":"2.0 out of 5 stars","reviewTitle":"Was awesome for 10 minutes, reset, repeat","reviewDate":"April 8, 2019","reviewText":"My wife's brother has two Gen 1 of these so I bought one for my wife's birthday. Followed instructions, got it set up. Worked great. Then 10 to 20 minutes later Alexa would say \"I'm having trouble understanding\" Reset it. Re-set it up, same thing. Over and Over. Called Sonos help number and the wait was 45 minutes. No. Returned for the the Amazon speaker which is half the price. Sonos, get your stuff right before releasing."},{"reviewerName":"Colton J. Weingarden","rating":"1.0 out of 5 stars","reviewTitle":"Playlist Annoyance on a Meh smart speaker.","reviewDate":"The manufacturer commented on the review below","reviewText":"Seriously just want to be done with Sonos. Was excited at first but the introduction of the Sonos Playlist is pure cancer. I am listening to a song from the radio. We will take Google service for example. I can add it to my Google library which throws the song into oblivion or I can add it to my Sonos Playlist. Whoopie. I can't use Sonos Playlist anywhere except a place where I have Sonos. So I'm in my car... Nope, on my head phones, nope. At work... Still nope. I want to add songs that I listen to, to whatever Playlist I want. It would be so simple and it used to do this. Click add to Google or whatever Playlist and then choose one.\nAll I now get is Sonos. By doing this you take away my ability to be mobile and convent which I believe is the corner stone to the product. Alexa or Google assistant and extremely slow and most of the time doesn't recognize my voice if the music volume is up.\n\nLast piece I know Sonos Playlist is good for home allowing me to utilize multiple different playforms of music. But it should be an option not the only thing.\n\nPlease fix this and I will update my review."},{"reviewerName":"Carl Nenzen Loven","rating":"3.0 out of 5 stars","reviewTitle":"Bad connection, great sound.","reviewDate":"The manufacturer commented on the review below","reviewText":"If you are getting a Alexa speaker. This is it. The sound is amazing.\n\nI have a HomePod at home, and I got this for my GFs place. Sound is real good.\n\nBut.\n\nI got it for Alexa, she’s very into that eco system. She has a normal echo already, and it worked great. The Sonos is alright at best, we first try to connect them both to extend the Alexa reach, it worked. But the Sonos looses connection constantly and needs to be setup again.\n\nSince I bought it 2 months ago I have set it up more than 20 times for her. I was hoping it was just a software issue, but it’s still to be fixed.\n\nThe nights when it just randomly says “lost connection” is getting annoying."},{"reviewerName":"Alec S","rating":"3.0 out of 5 stars","reviewTitle":"Great sound, but Alexa integration needs work","reviewDate":"The manufacturer commented on the review below","reviewText":"The sound quality is great, far better than any other smart speaker I've tried, but the Alexa integration is awful. It won't respond to voice commands the first two or three tries, and the audible chime doesn't seem to work half the time. Hoping it's a software issue that will improve over time, but given the One has been on the market for awhile, not hopeful."},{"reviewerName":"Ralph Mason","rating":"1.0 out of 5 stars","reviewTitle":"STAY AWAY - WORST SONOS PRODUCT EVER, YOU WONT BE HAPPY","reviewDate":"The manufacturer commented on the review below","reviewText":"Worst Sonos product ever. If you use Alexa you’ll get skips incomplete sentences and nothing played until you get the ’sorry I'm having trouble right now’, so you unplug it and it works for a day. Even using the sonos of app when it gets like this it doesn't work. Spent an hour with a very nice support person trying to fix it sending diagnostic after diagnostic and resting after resetting, but in the end they are just broken, no amount of button pushing or resetting fixes them. Have two beams, an amp, three earlier ones and a three, each work flawlessly. These are crap. Until they fix the software stay away. Been a son is is fan for many years - if this was my introduction never would have spent another cent with them. I would return but trusted Sonos because of my long good history and threw away the boxes. :-(. DO NOT WASTE YOUR MONEY."},{"reviewerName":"Ivko Cvejic","rating":"3.0 out of 5 stars","reviewTitle":"a great idea with serious software issues","reviewDate":"The manufacturer commented on the review below","reviewText":"Depending on when you ask me, I will either tell you I love these speakers or kind of hate them with a white hot burning passion. I've been looking for a whole-house sound system for a while. I have a very strong mesh WiFi network, so when I saw these speakers and the reviews talking about how great the sound was, I decided to take the plunge and purchased a bunch of them (10) to hang everywhere around my house, basement to second floor.\n\nAt first, I absolutely loved them. Their sound, as reported by others, is excellent. And the addition of Alexa made controlling them so convenient. I really fell in love with them and started telling everyone about how great they were. Then, about 4 weeks in, I started running into issues which have plagued me ever since, and I can't seem to get the system back into a stable state.\n\nThe issue seems to stem from the integration with the Amazon Alexa software. The first odd thing I noticed was that occasionally, the speakers seem to just turn dumb, for lack of a better term. You wake them to ask for something and they ding indicating they are listening, but no matter how carefully you articulate your request, they pause for a few seconds and then just die. Or they respond to confirm a request for something that doesn't even remotely sound like what you requested. Or, perhaps most annoyingly, they respond correctly and start playing the thing you requested for about 10 seconds before just fading out and stopping without explanation.\n\nI have tried restarting the speakers, my cell phone, my WiFi, and my Internet router, all to no avail. When the speakers just decide to not work for some reason it seems you have no choice but to wait for 6 or 7 hours or so for them to start working again, for reasons as mysterious as the reasons they stopped. I can't tell you how aggravating that is, particularly since these speakers are supposed to be a nice mid-level solution that should just work.\n\nAnother annoyance I've noticed is that occasionally one of the speakers will simply drop from the Sonos software, causing that speaker to be completely unresponsive and uncontrollable no matter what you do. The only way to re-add it to a group when this happens is to stop all activity on every speaker and have them do their best impressions of expensive bricks until you open the Sonos software and find that the missing speaker has reappeared. Which leads to another bug, which is that sometimes the speakers will simply decide to not take commands, verbal or in the Sonos software. You tell them to 'stop' or 'cancel' and they don't. So you grab your phone and open the Sonos app, click on the speaker group, and click the stop button and...nothing happens. Just keeps right on playing. It's absolutely maddening to be ignored like this by your \"digital assistant\"; you are often left with no choice but to go around unplugging speakers around the house to get everything back to a base status.\n\nThese problems could be YMMV type issues; plenty of reviews practically glow when talking about them. It could also be that by buying so many I exposed myself to more hassle than most and would have been better off purchasing fewer of them and accepting some sound gaps. But my feeling is that as these are not cheap speakers, and that since at least according to the product literature I should be able to setup the speakers in a configuration like this, it shouldn't be this much hassle.\n\nMy gut feeling is that the integration between Sonos and Amazon is not very stable and that problems crop up over time. I say this because I have noticed that Alexa updates seem to happen at a breakneck pace, which introduces weirdness all on its own. For example, for over a month I could ask Alexa to 'play NPR' and the speaker would open the radio station without issue. Then one day the exact same request prompted a series of questions about where I lived, which station identifier I wanted, etc. What the heck? Why take something that worked and make it more complex for no reason whatsoever?\n\nThe bottom line is that when they do work they are amazing. I just wish Sonos and Amazon could get some more stability into their products, because otherwise this will never be more than a niche product."},{"reviewerName":"R. Potter","rating":"5.0 out of 5 stars","reviewTitle":"From frustration to perfection!","reviewDate":"May 16, 2019","reviewText":"First off, the sound is great! I use this speaker in a slightly non-traditional way: we already have the Sonos playbar in front of the TV. But we sit about 15' back from that. I wanted a speaker in between me and the wife, so we could better hear what's going on. So, discussed this on a chat-call with Sonos and they recommended this. All well and good, except I couldn't get it to work. Luckily, Sonos allows you send a diagnostic of your set-up directly to them via smartphone, detailing what you have etc. They diagnosed that my router had a setting deep in its controls that prevented the speaker from joining in (there's NO way I wold ever have found this myself). So, the speaker was working. But I wanted to to match exactly what was coming out of the playbar. Sonos explained how to \"group\" the speakers and, subsequently, how to keep them grouped permanently. The smartphone app makes it easy to adjust the volume level coming out of both speakers, so it creates the sound level most comfortable for you. Bottom line: it's wonderful! But kudos to the Sonos support staff. They were quick to respond and very precise in their fixes. They turned what was becoming a frustration into perfection. This is hands-down the best way to listen to your TV!"},{"reviewerName":"RandomITGuy","rating":"1.0 out of 5 stars","reviewTitle":"Device Looses connection randonly, 2.4ghz wifi?","reviewDate":"May 8, 2019","reviewText":"I wanted to like this device. However, the wifi connection is unstable even right beside any of my AP's. The alexa app often says \"uh ohh\"\n\nFor $200 you'd expect that the device would work, it doesn't.\n\nI never got around to toying with the other Sonos integrations before sending it back (a week of testing)"},{"reviewerName":"Denys N.","rating":"4.0 out of 5 stars","reviewTitle":"The best multi room speaker","reviewDate":"May 27, 2019","reviewText":"Not going to praise sound quality and design, it's all top. What I'll do instead is describe some tech limitations I didn't know about when was buying my Ones.\n1. AirPlay doesn't work when Ones are connected to the Bar or Beam as surround speakers.\n2. Google Assistant's Voice Match technology is not supported. So if you're using different Spotify accounts for different family members. Voice Match is amazing functionality to avoid your Spotify music suddenly stopped because someone else requested music with voice at home. Also, you can't ask for personalized routines because the speaker doesn't know who's talking to it. Sonos/Google, please doesn't do this to us!\n3. One can't be paired with any other speaker but One in a stereo pair.\n4. I don't know if it's Airplay or Sonos, but initiating playback through Airplay takes a while. Like 5-10 seconds or so. Annoying.\n\nDespite found limitations, want to buy more. Great design and sound wins."},{"reviewerName":"quincy","rating":"1.0 out of 5 stars","reviewTitle":"What an awful Alexa experience. Great speaker.","reviewDate":"June 24, 2019","reviewText":"What a shame of you to put out a product like this Sonos, I live overseas in Guam, still a US territory and it’s saying Alexa has not yet been released in my country which is absolutely ridiculous. FIX THIS NOW. Very unhappy customer does not work as advertised. Don’t you dare tell me alexa doesn’t work in this “country” when I can go down the street and literally buy an amazon echo from Macy’s, fix your stuff Sonos, I was expecting more from you. As a first time purchaser of your products, if this isn’t fixed, I likely will never buy Sonos products again in the future. This product will not work with Alexa AT ALL overseas do not buy this product very very poorly designed product. Fix the Alexa, and this would be a five star review. Later."},{"reviewerName":"RVwino","rating":"5.0 out of 5 stars","reviewTitle":"Seamless integration with existing speaker Sonos system.","reviewDate":"April 29, 2019","reviewText":"We bought these to have music in our courtyard and on our patio. Upon powering up and pressing the button, you use your phone/tablet’s sonos app to configure the speakers (room name, mono use or a stereo pair). It took just a few moments to get them dialed in. Then, when you decided to play music, you can choose one room or group them together to play the same tunes everywhere. Alexa is handy for controlling the music when you’re outside and don’t want to carry around a phone or tablet."},{"reviewerName":"Tech Infusion","rating":"4.0 out of 5 stars","reviewTitle":"Fantastic Speaker - But Not Perfect","reviewDate":"October 2, 2019","reviewText":"About a year ago I purchased a Sonos Beam, Sonos Sub and 2 Sonos One speakers. They sound absolutely amazing, I feel like I’m sitting in a movie theater. I then purchased another 2 of these 2nd gen speakers to add to different rooms.\n\nThe wireless connection concept of Sonos is both extremely convenient and yet slightly frustrating at the same time.\n\nI say that because when it works it’s so handy and so nice, but there have been times when I just can’t group my speakers together or one just won’t play. Now let me say, this issue does NOT happen a lot. Maybe once a month, so it’s not a huge deal breaker (which is why I still gave this 4 stars).\n\nSetup was super simple for me (I know other people seem like they’re having issues with initial connection). I have a very fast Netgear gaming router so I suspect that is why I have so few issues with connection. The app has definitely improved over the last 2 years so it helps walk you through adding it to a room and tuning the environment with your speakers.\n\nI’m not going to talk too much about speaker quality because I already shared my thoughts on it. They sound amazing for home theater/entertainment speakers. When using the Sonos Ones’ as ssurrounds, there’s just no beating it (when it comes to wireless options). I’m a sound engineer so I won’t say these are the best speakers I’ve heard, but for the convenience factor of wireless, you just can’t get anything better.\n\nBuild quality is outstanding. Which for the price of Sonos speakers in general, I would expect nothing less. Just nice to see they didn’t skimp out on quality.\n\nMost likely my biggest gripe with the Sonos One speaker is it’s built in microphones. When using the built-in smart assistants (Alexa and Google Assistant) unless you’re right next to the speaker, you have to speak loudly to get it to hear you. If there’s music playing, you might as well wake up the neighborhood because the volume in which you have to speak in to activate voice recognition will.\n\nNow don’t get me wrong, I can’t imagine going one day without my Sonos speakers, I love them. I just wish they could fix these issues. But unfortunately I don’t think the microphone sensitivity is something they could improve with a software update, so I’d have to upgrade all of my speakers. All that being said, if you don’t plan to rely heavily upon the smart assistants then this is a non-issue.\n\nBefore buying Sonos speakers, I had a HomePod (I loved it). But they’re very expensive and I wanted a multi room speaker setup. If you’re looking to fill your house with smart speakers, get Sonos. If you’re going with a single speaker setup (and you have exclusively apple devices) go with the HomePod. Now the Sonos One gen 2 speakers work with Airplay 2 which is a huge game changer for those who are stuck in the Apple ecosystem. Because now you can airplay to these from any Apple device, rather than having to go through the Sonos app to play music. You can also group them up together and stream music to many different rooms which is so nice.\n\nWhen it comes to the Sonos One vs. HomePod, the HomePod sounds better. However when you pair two Sonos Ones’ together, they sound better.\n\nSo it really just depends on which eco system you are in. If you don’t use Apple Music, go with Sonos. Definitely have and would recommend building a Sonos system to anyone who doesn’t want to worry about wiring up speakers and connecting amps. The wireless protocol is just too convenient to pass up.\n\nThe Sonos One gen 2 makes for a perfect addition to your home and they work as great surround speakers if you ever get the full home theater setup!"},{"reviewerName":"B. Ware","rating":"5.0 out of 5 stars","reviewTitle":"SONOS ONE (GEN 2) continues the dominance of Sonos in streaming audio","reviewDate":"June 5, 2019","reviewText":"I am a longtime user of Sonos products. I had a full CONNECT system back in the days when there was a dedicated handheld controller, the only product color was white, and you supplied your own speakers. I have also owned Play:1 and BEAM speakers. I recently sold my BEAM soundbar in order to buy the two SONOS ONE (GEN2) speakers that I am reviewing today.\n\nI was using the BEAM as my TV sound and for music as well. The BEAM was fine, especially for TV. But I just missed the versatility and stereo separation of having two speakers. The inclusion of Airplay 2 in the SONOS ONE speakers was the answer. I now have the two SONOS ONE speakers set up as paired stereo and they connect via Airplay 2 to my Apple TV unit.\n\nThe sound from the Apple TV is great and there appears to be no lag. The sound syncs perfectly with the video displayed on my TV. I play music from Apple Music, Spotify, and Pandora flawlessly using the SONOS app. The Alexa functionality works well, although as one reviewer has mentioned you might want to use the Alexa app to set up your SONOS devices to use the \"Computer\" prompt if you have additional Alexa devices in the area. I have had no connection or network issues.\n\nA few tips for setup:\n\nDo not plug all your new SONOS devices into power all at once. Just plug in one and follow the setup on the SONOS app from there.\n\nIf you are replacing a previous SONOS setup like I was, you may want to disable the SONOS skill in your Alexa app and then re-enable it once your speakers are fully setup. Be sure to have your SONOS username/password handy.\n\nSONOS uses 2.4ghz networking for the speakers. I have multiple networks on 2.4ghz and 5ghz frequencies and the SONOS setup process automatically found the 2.4. Not sure but this might be why some users report connection difficulties despite their other devices working properly. It shouldn't be a problem for most users.\n\nAirplay 2 functionality requires a few steps. For instance, I went to Airplay in my Apple TV settings and enabled Airplay. Then I added my Apple TV and the SONOS pair (seen as one device in the Home app) to the Home app. Next I went to Video and Audio in my Apple TV settings and selected the speakers as my Audio Output.\n\nBe patient. The setup can take a little time. If you are impatient like me you may end up having to unplug a speaker to restart the setup process. It's no big deal.\n\nOverall, I think SONOS has done it again. I have tried other cheaper multiroom and streaming audio products. You just can't beat a product that works this well with such great sound. People are always impressed with the sound and the ability to play almost any song in seconds. Being able to use these speakers for great TV sound instead of a dedicated soundbar (or even a BEAM) makes them my best home sound purchase."},{"reviewerName":"Mad Arab","rating":"1.0 out of 5 stars","reviewTitle":"Don't expect any suppport from Sonos","reviewDate":"The manufacturer commented on the review below","reviewText":"Bought 4 of these for my 72 year old mother. Figured they'd be the easiest for her to use once they were installed.\nInstall was way more of an ordeal than it needed to be but a couple days later, they stop connecting to Amazon, so I go back and set them up again.\nThree weeks go by, she's used them maybe a dozen times. They stop connecting again. So I go back. More troubleshooting. The app won't connect... reboot the router...still nothing... call support. Support's closed. Wait for Support to open... 27 minutes on hold.... Support transfers to customer service... another 10 minutes on hold... Customer Service can't help because we bought them on Amazon ... Transferred again... Again no help. $180 a piece and this company just plain sucks."},{"reviewerName":"J. Sanchez","rating":"3.0 out of 5 stars","reviewTitle":"Simply excellent product, but...","reviewDate":"August 25, 2019","reviewText":"I received this smart speaker as a birthday gift from my wife. Since we were having a party, I wanted to get it set up to use it and put it through its paces.\n\nThe setup was quick and easy. I downloaded the Sonos app on my iPhone, and followed the steps in the easy to follow instructions included. Initial setup took less than 10 minutes. However, it does take longer to customize the Sonos setup by connecting your music streaming services, enabling the smart features with either Google or Amazon, and tailoring the sound and other features to your liking.\n\nI very much like the quality and feel of this speaker. It is heavy and solid for it's compact size. And once I got the music playing, I was blown away. The sound quality of this speaker is simply amazing! Now I realize that sound quality is a very subjective thing, and that what sounds good to one may sound awful to someone else. However, this speaker is a pleasure to listen to. The treble is smooth and reproduces silky highs, and the bass is deep, resonant and powerful.\n\nI have the Sonos situated on the top of my computer desk right in the middle of the main room of our house and it very easily fills the whole space with rich sounding music while not even being near full volume. I had 30 guests over and the music was easily heard throughout the house. In my opinion, the sound quality of the Sonos One is on the same level as the impressive Apple Homepod and is $100 cheaper to boot!\n\nThe Amazon Alexa voice control on this speaker works just as well as my Amazon Echo Dot. I haven't noticed any decline in functionality.\n\nWhile I understand that $200 is on the expensive side, this is an amazing speaker and I definitely recommend it to anyone who is in the market for a smart speaker. I find myself listening to all of my music again just because it sounds so good with the Sonos One. I plan on getting another one for Christmas and placing it in the back of my house to enhance the sound stage even more.\n\nUpdate 10/23/19: Like other reviewers have said, I have experienced several connection issues and even had to remove the device and reinstall it as if it were new. Alexa voice commands lag slightly but worse have suddenly stopped working or work only intermittently. I will say \"Alexa, shuffle my rock playlist\" and she will respond \"OK, shuffling your rock playlist on Amazon music\" but no music plays. My connection is wireless but it is within 15 feet of my router so it isn't a distance issue.\n\nThe connection and Alexa issues are frustrating because this is an excellent speaker. I hope Sonos is working on a firmware or software update to address this glaring issue."},{"reviewerName":"Wahoo","rating":"1.0 out of 5 stars","reviewTitle":"ALEXA VOICE CONTROL DOES NOT WORK OUTSIDE OF USA!","reviewDate":"The manufacturer commented on the review below","reviewText":"Do not buy if you plan on controlling directly with Alexa Voice Control outside of the USA."},{"reviewerName":"PHarvey","rating":"5.0 out of 5 stars","reviewTitle":"Amazing quality for a high price","reviewDate":"August 3, 2019","reviewText":"These sound amazing! I bought a set of two because I needed a wireless stereo setup that would have two speakers on opposite sides of a desk. Multi room speakers ended up being the right solution for me.\n\niOS users: you have two options to use this:\n1) Sonos app. It’s ok; it’s not very convenient but it works for any apps available in the app. Like using a Roku to use most of your streaming services and if you want to use an unsupported service you’re out of luck!\n2) The control panel when you swipe down in the top-right of your screen and cast the audio. I’m on an iPhone Xs 12.3.1 and an iPad Pro (11-inch) 12.3.1, and as of 08/2019 I can cast audio to All audio playing on the device including Netflix!\n\nThe only downside is for the cost I expect simple Bluetooth. That said; there isn’t a great solution tech-wise to getting wireless multi room speaker systems to work via mesh and using Bluetooth to accessing that mesh network. But for the cost I want magic!\n\nI’ve had no stoppages or dropping out, no blips, and Google Assistant works as well as Google Assistant on any device. Alexa works the same.\n\nBuy this if you can afford the sticker price and you won’t regret it. If it’s out of your price range you can go the echo route"},{"reviewerName":"Kyle","rating":"2.0 out of 5 stars","reviewTitle":"Honestly just got for something cheaper","reviewDate":"July 17, 2019","reviewText":"Nothing but problems from this item. Sonos looks awesome but their ecosystem is just a bit of a pain.\n\nFirst, it takes forever to get set up. Between registration and then syncing I probably spent 30 minutes from box to playing.\n\nAlexa integration is lacking as well. We had to search well into the app to figure out how to get it going, now half the time Alexa doesn't recognize it, the other half of the time it can't find what we're looking for.\n\nSound quality is good but now what you would expect for the price. If you want the premium ecosystem it makes sense, me...I'm leaning towards trying something else."},{"reviewerName":"Hobby Poppy","rating":"3.0 out of 5 stars","reviewTitle":"Cutting-edge sound; Infant-like voice recognition","reviewDate":"September 4, 2019","reviewText":"I a-b-s-o-l-u-t-e-l-y love the sound of this device.\n\nThe Alexa support is however mediocre to a fault: no variable wake-word support is the one that riles me; if you have systems in different rooms and more than one hears \"Alexa\", they all respond even when you don't want them to do so. Doing an Interweb search will however unearth many more faults, most of which appear to be several years old.\n\nIf it weren't for the sound quality by way of the TruPlay room adjustment function, I would give this device a single-star.\n\nIt bothers me to be so negative about what is an amazing product, but at this price point, the stage of Alexa support in the marketplace at this time, and the years of not addressing basic issues, it's difficult to be kind about it."},{"reviewerName":"Howard E Holtz","rating":"5.0 out of 5 stars","reviewTitle":"The latest app works great","reviewDate":"May 28, 2019","reviewText":"The Sonos app is fantastic. I was Leary about using it after reading so many negative comments but I have not experienced any of them, and it is very intuitive and simple to set up. I have a large 7 bedroom home and have at least one large get together of friends and family every week, and had to rely on my large sound system in the living room, with various devices playing different music around the home and property. All of my friends are amazed.\n\nI am using several Sonos ones and a couple fives along with a connect to bring my large sound system into the overall system. I have no problem controlling everything with either Alexa, Google Assistant, or cell phones, and can play virtually anything including Pandora and other music services even SiriusXM via Dishnet, CDs, music on anybody's cell phone, even live music when we have a band over for our parties.\n\nAmazon also has used items in excellent condition usually saving you approximately 10%"},{"reviewerName":"Robert J. Hamburger","rating":"1.0 out of 5 stars","reviewTitle":"Very hard to link with Alexa","reviewDate":"July 22, 2019","reviewText":"I could not get it to work or stay connected -Spent two days on it with another person .Does not work with Alexa - disconnects -others have the same issue . Not good with Alexa. Surprised that Amazon/Sonos has not perfected this\nspeaker. It was very frustrating and I would not recommend it -I am returning mine and going back to the straight d]forward Alexa whose sound might not be as good but it is more reliable perhaps Amazon will come out with a better speaker in the future ). The 24/7 support turned out to be Mon-Friday and certain times. The web site not good and I needed to use my iPhone rater than my PC. Read some of the reviews that say it is hard to connect or disconnects -they are correct. It might be a great speaker system but NOT for connecting to Alexa."},{"reviewerName":"Jason@reefbreak.co.uk","rating":"3.0 out of 5 stars","reviewTitle":"Can't change the 'wake' word, stuck with Alexa","reviewDate":"June 20, 2019","reviewText":"It's not possible to change the wake word, and there doesn't seem to be a plan to fix this. So you're stuck with 'Alexa...' when you have an 'Alex' in the house this gets a little tedious with false triggers."},{"reviewerName":"M. Thomas","rating":"5.0 out of 5 stars","reviewTitle":"Another solid Sonos speaker","reviewDate":"October 9, 2019","reviewText":"This speaker has a great sound for such a small footprint. I have Sonos 3 and Play 5 mk2 in my home and this was a solid addition for a smaller bedroom. It keeps up with the other speakers in terms of sonic quality and it’s built nicely for the price.\n\nThe voice recognition is good for the built-in microphone provided on the unit, but the classic “my voice assistant of choice doesn’t ‘get’ me” still applies here. Tried Alexa and it’s only as smart as the voice assistant is currently (which leaves a lot of room for improvement). I don’t fault the speaker for this though of course but just wanted to make mention of this point I noticed during usage. Otherwise it’s 4 stars because I wish Sonos were more aggressive with their pricing, they still have a bit of pricing bloat on their products and that includes these budget small speakers.\n\nI would still recommend these though to anybody who wants a small speaker that doesn’t sound like a small speaker, that can talk to any music service a user subscribes to, and is generally well-made and stylish to fit any decor. Sonos has another winner here!"},{"reviewerName":"Christi L.","rating":"2.0 out of 5 stars","reviewTitle":"Good sound but NOT compatible with other echo devices","reviewDate":"August 3, 2019","reviewText":"I purchased this Sonos speaker with the intention of using it as part of a multi room music group in Alexa, but you can’t unless you purchase more Sonos speakers! I have an Echo Plus in my kitchen, and wanted the Sonos in another room for better quality sound; however it is not available to use at the same time as any Echo device in a multi room music group. Ugh! I am soooo disappointed because the sound is good! My Echo Plus sounds alright, but I wanted better sound in other rooms. So bummed! I am returning to purchase an Echo Input to “hopefully” use with my Bose Sounddock 10. Wish me luck!"},{"reviewerName":"Gene Whitney","rating":"4.0 out of 5 stars","reviewTitle":"Great speakers but.....","reviewDate":"August 13, 2019","reviewText":"I own five Sonos One speakers. They operate on my home wifi network for whole-house music and radio. The original installation and setup was pretty easy using my Android phone and the system continues to work well with the original Android controller. However, Sonos has failed to make their system work with a variety of common systems. For example, if you have a Google Mesh wifi router, it's complicated. If you have a Mac, it's complicated. Why does the system only work with 2.4 GHz wifi? Why is the installation of a new control device so difficult? It's almost like the software guys at Sonos quit when they were half done. Whatever happened to plug-and-play? Users can spend hours or days trying to make their Sonos One speaker work with their Mac, PC, or mesh wifi systems. The quality and sound of the speakers is excellent, but the software really sucks, and Sonos provides very poor guidance despite a large user community that keeps asking for help."},{"reviewerName":"Kareemy-Wan Kenobi","rating":"1.0 out of 5 stars","reviewTitle":"Just a big pain to deal with","reviewDate":"The manufacturer commented on the review below","reviewText":"I have two Sonos Play 5's that I love, and decided to get this Play One for voice control features. It has been an utter disappointment. I am constantly having to unplug it because it is either not responsive or fails to actually play what I ask it to play. It goes something like this: \"Alexa, play my Sweet Stuff playlist on the Speakers.\" Sonos One Alexa responds, \"Playing your Sweet Stuff Playlist on Speakers.\" Then nothing happens. Occasionally it actually plays, and my family and I laugh because it actually worked. It's a joke at this point. A very expensive joke. I've contacted Sonos support, and it goes something like this, \"please send us the report via the app.\" Ok, no problem, sent. Then they response, \"Please send us a video of the unit acting up.\" Like really? I need to record a video of this now? And attach it to an email? Very frustrating. Not worth it in my humble opinion. I wish I had never bothered with this thing."},{"reviewerName":"T. Stack","rating":"4.0 out of 5 stars","reviewTitle":"Meets 95% of my wants/needs.","reviewDate":"March 25, 2019","reviewText":"I love having Alexa and the associated skills built-in. My one quibble is not being able to adjust the volume when it is used as a destination for Airplay 2 audio. I need to adjust via the Apple Remote app. I'd like to be able to do that via voice."},{"reviewerName":"Ann","rating":"1.0 out of 5 stars","reviewTitle":"Terrible Customer Service","reviewDate":"October 14, 2019","reviewText":"It took me over 3 months to configure the speaker because of WiFi issues (both mine and the speaker itself). Their customer support is awful, taking up to 30 minutes to pick up the phone despite the system always saying there's a \"5-minute estimated wait time\". If they knew their products well they could have saved a lot of time working with me, and save my time working on the system.\n\nThe speaker itself is great and I'm satisfied with it - the setup was just awful and Sonos has awful customer service."},{"reviewerName":"anon","rating":"1.0 out of 5 stars","reviewTitle":"Useless out of the box","reviewDate":"The manufacturer commented on the review below","reviewText":"I unwrapped the Sonos One from the box. Packaging untouched. Downloaded app, followed instructions, but it can't connect to my wifi. I use the same password as my Apple MacBook and iPhone, which connect to wifi, but this Sonos One doesn't. It doesn't have bluetooth so it's currently useless. Terrible wifi connectivity for a product that only functions with wifi and no customer support. Wtf."},{"reviewerName":"Gordon P.","rating":"4.0 out of 5 stars","reviewTitle":"Speaker is great, but microphone needs work","reviewDate":"May 8, 2019","reviewText":"It has a rIch bass, with a good quality sound. But the microphone is subpar. With my Echo devices, commands for Alexa are nearly always understood the first time. For the Sonos, it often does not pick up what I am saying. This morning my request to \"Play my playlist Colossians\" got the response, \"I don't see your playlist 'Together.'\" Not even close on that one!"},{"reviewerName":"TEE","rating":"5.0 out of 5 stars","reviewTitle":"2 speakers stereo set up + echo dot = on cloud 9","reviewDate":"August 23, 2019","reviewText":"Save every penny you earn and get 2 speakers for stereo set up, that extra 200 for second speaker is worth every penny you saved and spent. Forget the Alexa assistance on Sonos One, add the amazon echo for the \"real\" Alexa; set your Sonos One speakers as preferred speakers. Loving my Sonos one set up and can't wait every morning to listen a few songs before greeting a brand new day; life is good. ITS A BUY!"},{"reviewerName":"Martin Briggs","rating":"4.0 out of 5 stars","reviewTitle":"Great product. good sound quality at low/med volumes. Mic not perfect.","reviewDate":"June 22, 2019","reviewText":"Replaced an old Sonos zone player linked to my hifi. Alexa sometimes doesnt acknowledge me first time. I use spotify for music and probably not as good as using with amazon music service. but still pretty acceptable. at full volume , you hear distortion in the bass. its good for a small room but not loud enough or enough base for a party. perfect for everyday use though."},{"reviewerName":"PsychoPro","rating":"5.0 out of 5 stars","reviewTitle":"Superb sound. Great audio interface.","reviewDate":"August 13, 2019","reviewText":"Just like the old edition, these are awesome and sounds wonderful! Plus, Alexa plays all my music and orders things for me when I ask. She's getting more convincingly human every day. I got to the point where I say please and thank you to Alexa. Don't disrespect my Alexa. I want the robot or AI Invaders to know I treated her with respect when Alexa was just a toy."},{"reviewerName":"Chuck","rating":"4.0 out of 5 stars","reviewTitle":"Excellent but could use some tweaks","reviewDate":"The manufacturer commented on the review below","reviewText":"Sound quality is excellent for the price. I think the echo devices that I replaced with the sinus units were more accurate etc. the sonus seems to lose network more easily than a dot even though they are in the same location. But luv the sonus."},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Get It From Amazon Warehouse..?","reviewDate":"September 10, 2019","reviewText":"I like this speaker. It is solid, producing good, clean sound. Setup was a bit more complicated than Echo products, but it worked out for the second unit. The first had an annoying issue. It was discounted because it had been returned. The prior owner installed it, but when they returned it, they did not “deregister” it. Consequently, I could not finish the installation. There does not appear to be a workaround, and Amazon apparently does not check this. They had to replace it. Caveat emptor."},{"reviewerName":"Missoula woodworker","rating":"5.0 out of 5 stars","reviewTitle":"Great sound, easy setup, a bit finicky","reviewDate":"July 29, 2019","reviewText":"Could not be happier with the sound, which has great bass, and can be tuned to its environment (room) using your smart phone/iPad, etc. I use Alexa for voice recognition. Sometimes, however, even with a strong wifi signal, the speaker (or Alexa) seem to trip over \"her\" initial response, uttering only a non-descript part of one. Most of the time, \"she\" will respond appropriately, and the vocabulary for input seems pretty large. Pretty good reception range, even to an apartment two doors over."},{"reviewerName":"T. S. Lunquist","rating":"5.0 out of 5 stars","reviewTitle":"Great self-contained sound system!","reviewDate":"October 22, 2019","reviewText":"This is a fantastic speaker for the size and price. The sound fills the room with richness and depth, good at both high and low end. Super easy to set up and use. I have not used the voice recognition feature so cannot comment on that, but in all the ways I have used it, I'm really happy with this device. Perfect in a space where you want a complete sound solution but don't want to spend a pile of money or set up multiple speakers. I use mine in my kitchen."},{"reviewerName":"kara","rating":"1.0 out of 5 stars","reviewTitle":"Doesn’t play iTunes from iPhone - WTAF","reviewDate":"October 25, 2019","reviewText":"I bought two Sonos One speakers to put in my living room and kitchen, and there’s apparently no way to play my music from iTunes on my phone. Wut. This makes zero sense. Without this feature activated (and can we even call it a feature when YOU LITERALLY HAVE ONE JOB SONOS) these speakers are just two heavy paperweights."},{"reviewerName":"lovesBug","rating":"4.0 out of 5 stars","reviewTitle":"Amazing Speakers when you get them to work. Awful setup for surround sound.","reviewDate":"July 24, 2019","reviewText":"It took a few days of extreme patience to set these up to work with Sonos playbar. It shouldn't be this hard in 2019. On the plus side, when they work, they are amazing. LOVE them. Which is why I gave them a four-star.\n\nSonos, you really need to improve the setup/connectivity and your APP."},{"reviewerName":"Pfoxco","rating":"5.0 out of 5 stars","reviewTitle":"Love it","reviewDate":"June 5, 2019","reviewText":"Love this speaker. I have had a few issues with the bluetooth not connecting, but its only been a few times. The sound is awesome."},{"reviewerName":"Mark P.","rating":"5.0 out of 5 stars","reviewTitle":"They're Great!","reviewDate":"October 23, 2019","reviewText":"This is my first experience with Alexa and it's been terrific. I like to be able to turn on background music with a simple voice command. I also like that you can set a maximum volume level for the speaker - keeps those who like to blast music too loud at a more reasonable level. As always, Sonos delivered a quality product which fits my needs. I highly recommend these speakers from Sonos."},{"reviewerName":"Abdulaziz","rating":"5.0 out of 5 stars","reviewTitle":"Love it","reviewDate":"October 24, 2019","reviewText":"Great speaker with impressive sound quality for its size. I was first introduced to Sonos One by staying at an airbnb apartment that had three of them. I Fell in love with it and decided to purchase one for my bedroom.\nI like the sound clarity and quality. The voice control system could use a lot of improvements. Tried using Alexa but I disliked the fact that it revolves around Amazon and the focus of increasing Amazon sales. I switched to Google Assistant, which works much better for me that Alexa. However, it’s capabilities are limited and can only do few things. It doesn’t pick up all the orders even if they’re related to the services I linked with the Sonos system. For example, it doesn’t understand when I say “stop the music” but answers to “pause the music”.\nI recommend this speaker as a stand alone speaker for your room and as part of a home audio system all over the house.\nSeller is reliable and shipped the item to me fairly quickly (to Saudi Arabia)."},{"reviewerName":"eyeshop2much","rating":"1.0 out of 5 stars","reviewTitle":"worst electronic device I have ever owned","reviewDate":"August 7, 2019","reviewText":"Tired of yelling at Alexa to cooperate. Music will not play, despite Alexa indicating \"playing Pandora\". Music plays intermittently and shuts off. Alexa also advises me the skill is not active in the Alexa app when clearly it is. Amazon tech support cannot help. Sonos tech support is never available. No device is worth this much aggravation. Total piece of crap."},{"reviewerName":"Ham2293","rating":"4.0 out of 5 stars","reviewTitle":"Great speaker","reviewDate":"June 21, 2019","reviewText":"Great speaker. Sound quality is great. Alexa integration has issues now and then. I will purchase more."},{"reviewerName":"Rob M","rating":"1.0 out of 5 stars","reviewTitle":"Alexa doesn't work if you have two different WiFi's either at home or home/gym","reviewDate":"The manufacturer commented on the review below","reviewText":"Disappointingly, you can't use the Alexa function to run your music applications (Sonos makes you chose from where you want to run your app) nor will Alexa register your device as a controllable device as any other Echo device.\nThey could if the companies (Amazon Alexa or Sonos) wanted but they add restrictions without letting you know in advance!"},{"reviewerName":"John W Clark","rating":"3.0 out of 5 stars","reviewTitle":"Speaker Good. Alexa Bad","reviewDate":"The manufacturer commented on the review below","reviewText":"Great speaker. Purchased it to use for z-wave alerts from my Homeseer and it works as expected. HOWEVER, I also expected it to replace my echo dot, and that did no go so well. The Alex constantly locks up, fails to connect and has other issues requiring ongoing reboots. I am going to just disable it and put my dot back in use, because its too frustrating and undependable.\n\nAlso while researching the problem, I saw the manufacturer support deflecting and appearing to blame owners WiFi, and other network issues for their devices Alex problems, which has me wondering if they have any intention of ever correcting it.\n\nBottom line, great speaker, bad Alexa implementation."},{"reviewerName":"Rootul Patel","rating":"2.0 out of 5 stars","reviewTitle":"Frequently disconnects and poor Alexa UX","reviewDate":"The manufacturer commented on the review below","reviewText":"Sonos speakers frequently get unpaired from the group or lose WiFi connection. To remediate you must unplug and replay them or open the Sonos app and repair them. I’ve had issues with the audible integration and Sonos speakers. Alexa voice recognition can also fail to pick up clear commands."},{"reviewerName":"Junebug","rating":"5.0 out of 5 stars","reviewTitle":"Best speaker ever.","reviewDate":"March 22, 2019","reviewText":"Sounds great easy to load songs on to the app. Love it."},{"reviewerName":"Jack","rating":"5.0 out of 5 stars","reviewTitle":"Great compliment to a Sonos soundbar","reviewDate":"July 29, 2019","reviewText":"I got this to add onto my Beam sound bar and it works and sounds amazing. Integration was easy and you can tune it using the Sonos app. I am not sure how it sounds as a stand alone speaker but as the rears for my surround sound, its amazing and a must if you have a sonos soundbar."},{"reviewerName":"Texas Star","rating":"5.0 out of 5 stars","reviewTitle":"sound quality is superb!","reviewDate":"July 9, 2019","reviewText":"Sound quality is the best I have experienced in a small bluetooth/wifi speaker. It sounds way better than google home(also have). Still waiting for google home integration(dissapointment). Alexa may be good for home control but you can't beat google for answering questions in my opinion. Using mine in a moderatly sized bathroom."},{"reviewerName":"tmacc","rating":"5.0 out of 5 stars","reviewTitle":"Highly Recommend Joining the Sonos Family of Products!","reviewDate":"July 20, 2019","reviewText":"The Sonos One, (Gen2) seem to do a great job for me around the home. The sound is amazing for a speaker of its size, and the integration with Alexa is excellent. I can even incorporate Airplay2 and send to all my Sonos equipment including my Apple gear, HomePod, and Apple TV. Highly recommend!"},{"reviewerName":"GBJR","rating":"1.0 out of 5 stars","reviewTitle":"Cannot comment on sound quality; cant get them to work","reviewDate":"The manufacturer commented on the review below","reviewText":"Bought a set of 4 of these, tried to install, get to the point where sonos wants to update the software on the speaker, and it fails, error 30. Called sonos which was no help at all, so now I have 4 very expensive yet attractive paperweights."},{"reviewerName":"Catnap","rating":"5.0 out of 5 stars","reviewTitle":"Excellent speakers","reviewDate":"October 16, 2019","reviewText":"very good sound quality. easy to access multiple music sources. I had a problem connecting one speaker of a pair. Support helped online; I was able to send an information dump, and they corrected the problem online. Excellent support."},{"reviewerName":"ps51_boston","rating":"1.0 out of 5 stars","reviewTitle":"Can't use as normal speaker, only for music services","reviewDate":"October 17, 2019","reviewText":"Don't buy this, you can't use it as a general audio device, you can only stream music via services like Spotify, Google play etc. and only via WiFi (no Bluetooth)."},{"reviewerName":"Jac","rating":"1.0 out of 5 stars","reviewTitle":"Tried Hard to make it work ....","reviewDate":"The manufacturer commented on the review below","reviewText":"Returned the first one thinking it was defective, set-up the replacement and have the same issues (see Everone else’s 1 Star reviews) ... we have worked with Tech team to no avail. Would like to return it and buy a Sonos One (Gen 1), but am now outside the return window by 9 days. So Sad..."},{"reviewerName":"Bay33saw","rating":"4.0 out of 5 stars","reviewTitle":"Killer sound","reviewDate":"July 10, 2019","reviewText":"I only live in a small apartment so having monster sound was not my top priority. Set up was super easy and Alexa is a nice touch, I like you can add more speakers along the line if you want to.\nOverall great quality."},{"reviewerName":"keving","rating":"4.0 out of 5 stars","reviewTitle":"Great sound and easy setup","reviewDate":"August 21, 2019","reviewText":"Speaker has a great sound and it's nice that Alexa is active for voice controls. I'm having some issues trying to configure this with my echo dot and streaming (i.e. Alexa plays 1 song and stops rather than continue to stream \"play songs by...\")but pretty sure that's an Amazon issue so no issues with Sonos."},{"reviewerName":"Faye O.","rating":"5.0 out of 5 stars","reviewTitle":"Quality speakers!!!!!","reviewDate":"October 1, 2019","reviewText":"Bought two of these for myself 3 months ago. Super easy install (I did it by myself). I have one in the kitchen and the other in bedroom and they sync perfectly well. I play music from Amazon Music, Pandora and my own device. I love how I can play music that is separate from what I'm doing on my phone. I can play background music and still listen to things on my phone. Sound quality, especially for its size, is amazing. I love the idea of knowing I can also add more speakers to this... expandability."},{"reviewerName":"Brenden","rating":"2.0 out of 5 stars","reviewTitle":"Headache","reviewDate":"July 2, 2019","reviewText":"Set up was finicky, Alexa did not integrate well and was actually annoying as compared to my echo show. I ended up getting Play 1 speakers and those were way easier to set up and Alexa worked much better."},{"reviewerName":"Ilovebooks","rating":"1.0 out of 5 stars","reviewTitle":"Issues with Alexa integration","reviewDate":"The manufacturer commented on the review below","reviewText":"Alexa stops working after a few commands. Ir"},{"reviewerName":"Mitchell","rating":"3.0 out of 5 stars","reviewTitle":"Awesome quality but annoying","reviewDate":"The manufacturer commented on the review below","reviewText":"I love the quality of these speakers! However, they lose connection at least 10 times a day! I have to constantly reset the speakers in order to use them and it's incredibly annoying."},{"reviewerName":"David Waters","rating":"5.0 out of 5 stars","reviewTitle":"Wish it cost less","reviewDate":"August 3, 2019","reviewText":"Superb sound. Wish it cost less. I bought a pair and sync them. The stereo separation is so much better than my stereo speakers and clarity and bass better than any bluetooth speaker I've had."},{"reviewerName":"Felix Dominguez","rating":"1.0 out of 5 stars","reviewTitle":"No good WiFi connection.","reviewDate":"The manufacturer commented on the review below","reviewText":"She isn’t good"},{"reviewerName":"T","rating":"5.0 out of 5 stars","reviewTitle":"Excellent speaker","reviewDate":"April 14, 2019","reviewText":"I use this in the bathroom and having the inter grated amazon Alexa is amazing.\nSyncs with my homes Sonos system like a charm even though it’s quite far from the WiFi routers it works flawlessly."},{"reviewerName":"Jeff Hallen","rating":"5.0 out of 5 stars","reviewTitle":"Great product","reviewDate":"November 3, 2019","reviewText":"The Sonos speakers are the most versatile on the market. They have great sound and can be placed anywhere there is an electrical outlet. In addition, you can play music on a speaker in one room and play different music on a speaker in another room at the same time. I highly endorse this product."},{"reviewerName":"jrh","rating":"5.0 out of 5 stars","reviewTitle":"just OK","reviewDate":"July 8, 2019","reviewText":"Spotty Alexa connection. Sound quality OK for how I use it."},{"reviewerName":"john p watson","rating":"1.0 out of 5 stars","reviewTitle":"Not a good buy","reviewDate":"The manufacturer commented on the review below","reviewText":"Would not recommend as continues to disconnect with Wi-Fi. Same problem at two locations, required long complex phone calls to correct then lost signal again.\nAll while very strong wifi connections\nWill euter try to sell them if can't return to Amazon. At 87 just wanted to \"be with it\"\nJohn Watson Savannah Ga 407 620 6580"},{"reviewerName":"I buy too much crap on Amazon","rating":"5.0 out of 5 stars","reviewTitle":"If u can afford them buy them","reviewDate":"November 3, 2019","reviewText":"Wonderful WiFi speakers. I love the sound quality although I think they could be better but the features and WiFi make up for anything else. Easy to use and modern. I don’t use the Alexa feature because it’s too creepy"},{"reviewerName":"SW","rating":"1.0 out of 5 stars","reviewTitle":"never worked, don't recommend","reviewDate":"October 28, 2019","reviewText":"Spent 3 hours on the item - exercise in torture as it would never work. Had to perform a factory reset on the speaker, use ethernet cable, it messed up our normal wifi for a while but would never leave \"updating\" mode. Disaster The closest refund place is not our normal UPS either - have to drive 30 minutes to the closest place to send it back. Don't recommend"},{"reviewerName":"Brad F.","rating":"5.0 out of 5 stars","reviewTitle":"Unbelievable sound quality for the size","reviewDate":"August 3, 2019","reviewText":"Unbelievable sound for it’s size at all volume levels. I paired this with another Sonos One as a stereo for our dining room. So easy to set up, just plug it in. Sonos products are expensive but you get what you pay for. The Sonos engineers are geniuses."},{"reviewerName":"Amazon Customer","rating":"1.0 out of 5 stars","reviewTitle":"Does not work with smart tv","reviewDate":"September 21, 2019","reviewText":"I bought this speaker to install with my smart tv. The write up did not indicate that it was only usable for pandora etc. After numerous calls to the service and looking on line for support I was told that it will not work for the tv. By this time I was over the 30 days and they refused to do a return."},{"reviewerName":"Courtney Fugere","rating":"5.0 out of 5 stars","reviewTitle":"I really love Sonos","reviewDate":"August 30, 2019","reviewText":"I have to say, I really love these speakers. I have a surround sound set for my TV, a Play 5 in my office, the amp for the pool, and just got of the Ones for my bathrooms. They are great, sound greta, Im really happy with them."},{"reviewerName":"Dorothy B","rating":"5.0 out of 5 stars","reviewTitle":"You need more than marginal wifi.","reviewDate":"July 29, 2019","reviewText":"My sonos is great but my wifi connection where I live is marginal at best. I therefore can not always use my son is. When I can I love it"},{"reviewerName":"Nilesh Likhite","rating":"5.0 out of 5 stars","reviewTitle":"Great sound. Don’t expect any bass","reviewDate":"August 28, 2019","reviewText":"Serves the purpose that I was looking. The only issue I noticed while using is that you need to have premium subscription to music streaming apps to use them from within Sonos app"},{"reviewerName":"clark raborn","rating":"5.0 out of 5 stars","reviewTitle":"simply a game changer","reviewDate":"May 23, 2019","reviewText":"no doubt the very best speaker on the market. it is so good the only downside is that you will want the entire system - its hard to listen to music or watch shows any other way now"},{"reviewerName":"joel cook","rating":"5.0 out of 5 stars","reviewTitle":"Works great","reviewDate":"September 11, 2019","reviewText":"I own not 1.. but 5 of these and they all work 100% of the time. Not sure how some people are commenting bad reviews. 10/10 would buy again. I love these things!"},{"reviewerName":"Daniel Ruiz","rating":"5.0 out of 5 stars","reviewTitle":"Impressive loud sound","reviewDate":"March 20, 2019","reviewText":"Alexa works seemlessly with speakers. I have a pair that I use for surround sound with a playbar. They can get REALLY LOUD but don’t lose sound quality. Expensive but I know I’m getting the quality."},{"reviewerName":"Charlie","rating":"1.0 out of 5 stars","reviewTitle":"Doesn't work with 5Gz Wifi","reviewDate":"The manufacturer commented on the review below","reviewText":"Incredibly unclear why that's the case - the option doesn't even exist! the 2.4Gz doesn't work in my room because there are so many competing signals. This makes this speaker totally useless."},{"reviewerName":"A_user","rating":"2.0 out of 5 stars","reviewTitle":"Poor integration","reviewDate":"The manufacturer commented on the review below","reviewText":"Cannot be (easily or even possibly?) integrated into multiroom sound group."},{"reviewerName":"NBA","rating":"4.0 out of 5 stars","reviewTitle":"Sounds good, easy setup","reviewDate":"September 16, 2019","reviewText":"Sounds great, super easy to set up. Voice recognition works, but not as well as my Echo (I have to repeat myself sometimes). Expensive but not absurdly so. Others reported syncing problems or setup hassles, I haven’t had any issues in three months of using the unit."},{"reviewerName":"DRio","rating":"5.0 out of 5 stars","reviewTitle":"Amazing","reviewDate":"October 2, 2019","reviewText":"Why are you reading reviews? These are awesome. You'll never buy BT again. Wifi is where it's at. You're welcome."},{"reviewerName":"RKM","rating":"5.0 out of 5 stars","reviewTitle":"Great sound. Great product.","reviewDate":"April 30, 2019","reviewText":"All around a great speaker that provides excellent sound and is easy to set up and use. Very pleased."},{"reviewerName":"MerryBee","rating":"5.0 out of 5 stars","reviewTitle":"Alexa, come on!","reviewDate":"May 29, 2019","reviewText":"The integration is something we are still struggling with, but the sound is great!"},{"reviewerName":"Bobby","rating":"5.0 out of 5 stars","reviewTitle":"Alexa with base","reviewDate":"May 3, 2019","reviewText":"people who don't want to be listened to needs to hang-up the phone too.."},{"reviewerName":"Tom","rating":"5.0 out of 5 stars","reviewTitle":"Bose.... The Best!","reviewDate":"July 5, 2019","reviewText":"Sound Quality! Ease of setup!"},{"reviewerName":"Antt Antt","rating":"4.0 out of 5 stars","reviewTitle":"Great sound. Needs an update regarding Alexa","reviewDate":"The manufacturer commented on the review below","reviewText":"Alexa app glitchy and somewhat functions."},{"reviewerName":"J Wakefield","rating":"5.0 out of 5 stars","reviewTitle":"Awesome sound especially when paired with another one","reviewDate":"September 5, 2019","reviewText":"I enjoyed the sound quality from my Sonos One Gen 2, but when I got a second one and paired it (which is very easy), I was blown away by the sound quality."},{"reviewerName":"Ilene Goldman","rating":"5.0 out of 5 stars","reviewTitle":"It's wonderful.","reviewDate":"April 12, 2019","reviewText":"Sonos is wonderful!! I have filled both my homes with this product and could not be more pleased!"},{"reviewerName":"JB","rating":"4.0 out of 5 stars","reviewTitle":"Great sound!!!","reviewDate":"July 28, 2019","reviewText":"The SONOS app says ALEXA service is not available in the country I’m trying to use it (Argentina). I was not aware it was a waste to buy the with Alexa integrated."},{"reviewerName":"Jim's kindle","rating":"5.0 out of 5 stars","reviewTitle":"Great sound","reviewDate":"August 23, 2019","reviewText":"This little speaker puts out a quality sound and when combined with several throughout the house its great!"},{"reviewerName":"Laurentiff","rating":"5.0 out of 5 stars","reviewTitle":"The best!","reviewDate":"September 22, 2019","reviewText":"Love my Sonos. Highly recommend."},{"reviewerName":"Kaylee","rating":"5.0 out of 5 stars","reviewTitle":"Highly recommend","reviewDate":"June 26, 2019","reviewText":"I love these. So worth the cost. The app is awesome too"},{"reviewerName":"Alejandro Arcia","rating":"5.0 out of 5 stars","reviewTitle":"Excellent","reviewDate":"August 28, 2019","reviewText":"Excellent"},{"reviewerName":"Annie Macko","rating":"5.0 out of 5 stars","reviewTitle":"Life-changing","reviewDate":"July 28, 2019","reviewText":"Changes your life for music in your home… Sound quality is absolutely amazing and all the added features make it simply fantastic"},{"reviewerName":"richard","rating":"5.0 out of 5 stars","reviewTitle":"great audio quality","reviewDate":"April 10, 2019","reviewText":"Amazing surround sound. Only able to use it with apple tv though. Don't buy it thinking on connecting with tv or any other device in the house only works with Airplay devices. But besides that is a great speaker."},{"reviewerName":"Amar","rating":"5.0 out of 5 stars","reviewTitle":"Better than echo and I’m so satisfied","reviewDate":"July 2, 2019","reviewText":"Way better than echo device . So glad that I chose to go with this one."},{"reviewerName":"Cindy Crenshaw","rating":"5.0 out of 5 stars","reviewTitle":"Great sound quality and easy to set up.","reviewDate":"July 11, 2019","reviewText":"Best sounds ever come out of this speaker, and I can play music from any room in my house where ever my phone is!"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Great. Best value","reviewDate":"June 4, 2019","reviewText":"Great for large gatherings"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Awesome quality","reviewDate":"September 24, 2019","reviewText":"I love this speaker, good lows and and nice highs. Pretty simple to hook up and operate. Long term goal is to set these up as my surround sound with other Sonos components. Only negative is I wish it had bluetooth"},{"reviewerName":"AMBARISH HS","rating":"5.0 out of 5 stars","reviewTitle":"Gud to have a surround plus voice controlable!!","reviewDate":"November 4, 2019","reviewText":"Fully voice controlable and just pair with soundbar to make a complete surround sound system."},{"reviewerName":"Nano-Nano","rating":"1.0 out of 5 stars","reviewTitle":"Not so much","reviewDate":"August 15, 2019","reviewText":"Sound quality is good but it didn't function as we hoped for voice recognition. Got a Google Max instead, much happier with that."},{"reviewerName":"Graham H.","rating":"5.0 out of 5 stars","reviewTitle":"Easy to set up home wide sound.","reviewDate":"September 30, 2019","reviewText":"Great sound quality. Kind of on the expensive side but it easily achieves a goal that I’ve always wanted to have in my life to have unified sound throughout my home"},{"reviewerName":"brian","rating":"5.0 out of 5 stars","reviewTitle":"But it!","reviewDate":"October 23, 2019","reviewText":"Just the best!!!"},{"reviewerName":"Daniel J Wansten","rating":"5.0 out of 5 stars","reviewTitle":"Great for a low end speaker","reviewDate":"October 31, 2019","reviewText":"Love these speakers. But they are not Sonos 5. Just sayin."},{"reviewerName":"JAY JOHNSON","rating":"5.0 out of 5 stars","reviewTitle":"Great speaker","reviewDate":"October 2, 2019","reviewText":"Great speaker, sounds incredible and with Alexa voice control that’s a plus. Truly an amazing speaker."},{"reviewerName":"Polestar Dad","rating":"3.0 out of 5 stars","reviewTitle":"Sound not as good as Gen 1","reviewDate":"October 6, 2019","reviewText":"Bought a pair with voice control included. Disappointed, the quality of sound is not as good as the old Play Ones."},{"reviewerName":"RM in DC","rating":"3.0 out of 5 stars","reviewTitle":"Adding to an existing system","reviewDate":"July 6, 2019","reviewText":"Alexa is slower to respond than on a Amazon device. Also it is difficult (I haven’t figured it out) to add the Sonos to an existing group of Amazon speakers to play simultaneous (ie - Everywhere Group)"},{"reviewerName":"HMM","rating":"5.0 out of 5 stars","reviewTitle":"Excellent","reviewDate":"August 19, 2019","reviewText":"Excellent sound, easy to install"},{"reviewerName":"Fredy D.","rating":"5.0 out of 5 stars","reviewTitle":"Excellent Sound!","reviewDate":"August 15, 2019","reviewText":"I enjoyed the first Sonos One Gen 2 so much that I ended up purchasing a 2nd one during Prime Day! I really enjoy being able to swap speakers when I move from room to room."},{"reviewerName":"Blh","rating":"5.0 out of 5 stars","reviewTitle":"What sound is great","reviewDate":"September 19, 2019","reviewText":"The sound is great."},{"reviewerName":"Donna Kohlhausen","rating":"5.0 out of 5 stars","reviewTitle":"love sonos speakers","reviewDate":"October 3, 2019","reviewText":"Hard to set up but great speakers."},{"reviewerName":"Mica","rating":"4.0 out of 5 stars","reviewTitle":"Good sound. Poor interface","reviewDate":"September 11, 2019","reviewText":"Not a simple setup. Hard to pair with a desktop or phone. Works fine with a TV or monitor. Great sound but not user friendly or Intuitive"},{"reviewerName":"Shawn Wilkerson","rating":"5.0 out of 5 stars","reviewTitle":"Killer surround sound","reviewDate":"October 10, 2019","reviewText":"Makes movie watching so dramatic"},{"reviewerName":"dcletzer","rating":"5.0 out of 5 stars","reviewTitle":"Love getting news and my favorite music !!","reviewDate":"July 8, 2019","reviewText":"Great product"},{"reviewerName":"Guven Ekmekci","rating":"1.0 out of 5 stars","reviewTitle":"iNTERNET","reviewDate":"The manufacturer commented on the review below","reviewText":"iT'S NOT WORKING!"},{"reviewerName":"edward Hunter","rating":"5.0 out of 5 stars","reviewTitle":"Sonos sounds great!","reviewDate":"June 12, 2019","reviewText":"Sonos as good as advertised! The speakers easy to set up sound great look great\nAlexa Google voice a little confusing but overall excellent product"},{"reviewerName":"James T. Lawson","rating":"5.0 out of 5 stars","reviewTitle":"Good sound, easy to install","reviewDate":"September 14, 2019","reviewText":"Easy to get hooked up, very good sound."},{"reviewerName":"Daniel","rating":"5.0 out of 5 stars","reviewTitle":"Perfect!","reviewDate":"October 7, 2019","reviewText":"Works with alexa and easy to get going!"},{"reviewerName":"M. Turner","rating":"5.0 out of 5 stars","reviewTitle":"Works as advertised.","reviewDate":"March 15, 2019","reviewText":"Easy setup with Apple AirPort Extreme router. Sound is very good. I’m purchasing a few more for my house."},{"reviewerName":"JAYSON RILEY","rating":"5.0 out of 5 stars","reviewTitle":"Flawless","reviewDate":"October 11, 2019","reviewText":"Flawless"},{"reviewerName":"juan","rating":"1.0 out of 5 stars","reviewTitle":"NO LLEGO EL ARTICULO","reviewDate":"July 4, 2019","reviewText":"el producto no llego a mi domicilio."},{"reviewerName":"Willman","rating":"4.0 out of 5 stars","reviewTitle":"Set up not easy or always straight forward","reviewDate":"July 17, 2019","reviewText":"Satisfied with product . Set up can be confusing."},{"reviewerName":"Cliente Amazon","rating":"5.0 out of 5 stars","reviewTitle":"Very nice sound quality","reviewDate":"April 16, 2019","reviewText":"Very nice sound quality i bought two to Replace my Google home max."},{"reviewerName":"Johnny Ramirez","rating":"5.0 out of 5 stars","reviewTitle":"Very nice","reviewDate":"October 9, 2019","reviewText":"Super"},{"reviewerName":"Steve","rating":"5.0 out of 5 stars","reviewTitle":"Works well with Alexia","reviewDate":"July 1, 2019","reviewText":"Terrific product; easy to install and use."},{"reviewerName":"Jeremy Rapp","rating":"4.0 out of 5 stars","reviewTitle":"Great product, needs work with Google Mesh networks","reviewDate":"September 23, 2019","reviewText":"This may be Google’s fault, but Sonos does not work well with Google mesh networks."},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Great sound","reviewDate":"August 27, 2019","reviewText":"Love !!!!!"},{"reviewerName":"Charlie Goetz","rating":"2.0 out of 5 stars","reviewTitle":"I bought it with Alexa and didn't come with it. Very disappointed and misled","reviewDate":"The manufacturer commented on the review below","reviewText":"I bought it with Alexa and didn't come with it. Very disappointed and misled"},{"reviewerName":"Robert hibbs","rating":"5.0 out of 5 stars","reviewTitle":"Setup is very easy","reviewDate":"November 10, 2019","reviewText":"This is by far the best wifi speaker on the market today"},{"reviewerName":"Michael Roberts","rating":"4.0 out of 5 stars","reviewTitle":"Excellent speaker","reviewDate":"September 29, 2019","reviewText":"As advertised which is exactly what I wanted"},{"reviewerName":"Randall B.","rating":"5.0 out of 5 stars","reviewTitle":"Great product","reviewDate":"July 14, 2019","reviewText":"Great product"},{"reviewerName":"alejandro rodriguez fermin","rating":"5.0 out of 5 stars","reviewTitle":"Excelente","reviewDate":"August 11, 2019","reviewText":"Excelente"},{"reviewerName":"Ilda","rating":"5.0 out of 5 stars","reviewTitle":"Amazing speaker","reviewDate":"June 25, 2019","reviewText":"Easy set up and amazing sound!"},{"reviewerName":"Aries N.","rating":"5.0 out of 5 stars","reviewTitle":"Good quality sound","reviewDate":"October 29, 2019","reviewText":"3rd purchase will buy again for sure"},{"reviewerName":"Richard Niedomys","rating":"4.0 out of 5 stars","reviewTitle":"quality","reviewDate":"August 13, 2019","reviewText":"good value"},{"reviewerName":"Rob O","rating":"5.0 out of 5 stars","reviewTitle":"A quality product.","reviewDate":"May 1, 2019","reviewText":"The sound is awesome."},{"reviewerName":"Jonathan Schickman","rating":"3.0 out of 5 stars","reviewTitle":"Not compatible with him computers so no Netflix, No media player, no YouTube, etc","reviewDate":"March 20, 2019","reviewText":"Think about all the ways you enjoy audio. For me I stream video from Netflix, YouTube, & Xfinity. I have a vast library of wav files on my hard drive. As with many folks my HTPC (Home Theater Personal Computer) is at the heart of my multi media experience. Therefore it’s shocking to me that there is absolutely no way to make a connection from a computer to the SONOS network. It begs the question “what’s the point of having the SONOS at all?”\n\nThe speakers sound great & one can enjoy audio from digital radio & apple airplay which is great.\n\nBut I find my first point so disappointing I can’t get over it."},{"reviewerName":"Rachel Louque","rating":"3.0 out of 5 stars","reviewTitle":"Sounds Great but Terrible Connection","reviewDate":"The manufacturer commented on the review below","reviewText":"This speaker is great in terms of the quality of the sound, but other than that it falls short in other categories. It comes with Alexa yet I rarely use the Alexa for it's main purpose (which is to request music to play) because it fails to work. Alexa will respond and it seems like things work but then the music will never actually play. I had a different problem when I lived in a different house which was that the speaker kept disconnecting from the internet, causing long pauses in the music which made it nearly impossible to listen to. Another issue is that the app for this speaker is terrible and extremely glitchy. It often crashes and also doesn't allow music connected through Spotify to be shuffled which means that you are listening to the same order of songs every time if you have your own playlist. Terrible speaker in terms of the setup of things but at least the sound is good. Definitely would not purchase again though. It seems to be known that this speaker has a multitude of problems that go ignored by the company."},{"reviewerName":"H. Carson","rating":"2.0 out of 5 stars","reviewTitle":"Horrible user interface, Alexa to Sonos does not work","reviewDate":"The manufacturer commented on the review below","reviewText":"At first, these speakers seemed easy to set up, it took about 15 minutes and all seemed ok linking with Alexa. A few hours later, the Alexa interface stopped working, there were no issues with our wifi, which had a very strong signal. I have reset the speakers and uninstalled and reinstalled the Sonos and Alexa apps at least a dozen times. I have ensured that the speakers and the apps are connected to the same network, and I have followed the instructions from Sonos support, all to no avail. I have wasted hours and still nothing. These speakers are well overrated, do not waste your money, buy a quality bluetooth speaker and save at least 50%"},{"reviewerName":"Milan New England Mom","rating":"1.0 out of 5 stars","reviewTitle":"Useless - Sonos breaks promise of brand","reviewDate":"July 24, 2019","reviewText":"If you were thinking of purchasing this speaker for the Alexa integration, don’t. This speaker is pretty useless. It was almost impossible to review the sound quality, as the Alexa integration is so bad. It has “trouble understanding” and registers as offline most of the time –far more often than the Dot we wanted to replace (in the exact same location) or any other Alexa device we have in the house. It is also does not support many of the Alexa features of the Dot such as “calling” and “drop in.”\n\nIf you were thinking of using it as just a regular Sonos One speaker, then think twice on that too. It does not pair with previous generations, so bye-bye to adding it as one more surround speaker in the living room. (Confirmed with Sonos chat support)\n\nAnd, if out of desperation, you were thinking of using it as a wireless speaker with your phone, then you’d better have an iphone, because it won’t work directly with an Android. (Also confirmed with Sonos)\n\nThe whole premise of Sonos is supposed to be flexible and scalable. Sonos needs to go back to the drawing board on this product specifically, and previous generation compatibility needs to be imperative for all products. The lack of generational compatibility not only reflects poorly on this product but also the brand as a whole. The promise to consumers was start with one and continue to grow your sound system. Sonos broke that promise."},{"reviewerName":"Dave C.","rating":"2.0 out of 5 stars","reviewTitle":"Overrated on so Many Levels : (","reviewDate":"May 23, 2019","reviewText":"Sonos is one of those companies that over-promises and under-delivers. The sound is fine; on par with many of the better speakers in its price range. Unfortunately, the con’s outweigh the pro’s after that:\n\n* No Bluetooth\n* Setup is easy... until there’s a problem\n* Routinely drops WiFi connection\n* Alexa integration? 10%, tops\n* Listen to anything you want... as long as Sonos has the programming for it (forget about YouTube)\n* The more you add to the system, the more issues you have making it all work together correctly\n* Add a few more speakers and get FAKE surround sound\n* Is it really wireless if it has to be plugged into an outlet to work? Hmmm....\n\nBottom line, Sonos continues to be WAY behind technologically. You’ll get much better sound and more dependable performance from a wired system, or just get a high end Bluetooth speaker with its own rechargeable battery and enjoy."},{"reviewerName":"max goodstein","rating":"5.0 out of 5 stars","reviewTitle":"Same sound as gen 1 but with improved internals","reviewDate":"March 10, 2019","reviewText":"Same sound quality as gen 1, improved Bluetooth and processor. The speaker was super easy and fast to set up. I use this speaker with Google play music and it works flawlessly with excellent sound. Just waiting for the Google assistant update to add voice functionality that isn't Alexa."},{"reviewerName":"Mark Worley","rating":"4.0 out of 5 stars","reviewTitle":"Nice wireless streaming speaker, Google Assistant not quite as nice","reviewDate":"July 26, 2019","reviewText":"I bought this during the Prime Day sale. I had been looking at getting a new Google Home to pair with the one I have already and hopefully get better streaming quality. The Sonos is much cheaper than a Google Max, especially on sale.\n\nI use Google Home to control my lights and listen to music and interact with my Harmony Hub occasionally. As a streaming music speaker, the Sonos is much better than the Home. The sound quality is pretty good and I like the idea of being able to get another one to pair with it for stereo. I also like the idea of the 'party mode' with Sonos that allows you to play the same music on all the speakers in your house. I am building a new house and will have some ceiling speakers, so I plan to get more Sonos gear eventually. The Sonos app itself is also quite nice and works quite well for streaming. It has way more streaming options than any other smart speaker, which is nice to have flexibility for the future. The interface is quite nice and it is good to have an interface for searching for music without having to pair with bluetooth first.\n\nAs a digital assistant, however, the Sonos One isn't quite as good. I'm not terribly surprised, since they just added Google Assistant support, but it doesn't function as well as my Home. The main problem is that it often mishears what I say. When I tell it to turn on the lamps in the living room, it frequently tells me that it will turn them OFF instead. That probably happens about 1 out of every 3 times. Maybe it is learning my voice, but I had less problems with my Home. On the plus side, if I am closer to another Google Home, it will allow that one to take the lead, so that functionality works as expected. It also doesn't seem to know what my Harmony Hub is, even though the Google Home does. It tells me that I \"have to enable personal notifications if I want those results\" which makes no sense and seems to have nothing to do with the Harmony Hub. I don't actually use voice control for the Hub much though, so I'm less concerned about that. I'm hoping that Google Assistant will get better over time, but I'm quite pleased with the sound quality and would give a recommendation for this speaker if you are willing to live with some growing pains and the Sonos functionality appeals to you."},{"reviewerName":"Sean Logue","rating":"5.0 out of 5 stars","reviewTitle":"Outstanding speaker and Echo replacement","reviewDate":"July 12, 2019","reviewText":"I bought this because I wanted to upgrade the Amazon Echo device in my bedroom. I wanted better sound quality, and the sharp good looks wasn't bad either. I ended up liking it so much that I bought a second for stereo sound, then more of them for other rooms. The reliability increased a lot when I plugged a Sonos Booster directly into my router. When this is done, or when one of the speakers is connected, they form their own small network and don't have to compete with other devices on the main home wifi. This worked really well for me as I have a lot of other connected devices. Big thumbs up for these speakers - I love them!"},{"reviewerName":"JB","rating":"5.0 out of 5 stars","reviewTitle":"Worth the Extra Money over the Sonos 1","reviewDate":"April 16, 2019","reviewText":"I went back and forth on the Sone One vs the Play 1.\n\nI ended up buying the One. Because the built in Alexa is not full function and has the annoying beep that you cannot shut off, I silenced the Alexa on this unit. I use my actual Alexa devices to interact with Alexa. You may ask why then did I buy this if I do not sue the Alexa that is built in? The answer is simple. The Alexa capability is a software function and I am betting that will improve over time with new releases. This unit has better smarts than the Paly 1 and is more likely and more capable to receive updates; both Alexa and just normal Sonos updates. If and when the Alexa function catches up, I will turn it back on.\n\nI also preferred the aesthetics. The all black is cleaner than the black/gray. The touch buttons are superior in look and feel to traditional push buttons. Overall, it is a more elegant looking speaker.\n\nAs far as sound goes, it is quite good for my needs. If you want a large and loud sound these are not for you. For me,I have a few these in difference rooms and I can keep it a low volume and yet hear the music fine in every room. For gatherings, I don't have to have it blasting in one room and too low in another. I can keep a consistent sound level through all rooms.\n\nThe Sonos App is great to organize play lists. I general just control it with Alexa but use the Sonos App to manage long playlist. If you keep the Rime Music subscription that is also a convenient way to manage playlists and favorites.\n\nI also have the Lutron Caseta home system and hence there is some integration that I use with that. The Lutron Pico Audio remote is a nice thing to have to control the unit from a distance without having to talk to Alexa."},{"reviewerName":"-CT","rating":"1.0 out of 5 stars","reviewTitle":"Stay Away - Only plays music through proprietary app!","reviewDate":"April 27, 2019","reviewText":"These not-so-cheap speakers only play MUSIC through their proprietary app. You can't connect them to your TV or your computer. Sent them back on day 1. Sticking with Bose."},{"reviewerName":"Guitar Micheal","rating":"3.0 out of 5 stars","reviewTitle":"Historically lacking product support over time.","reviewDate":"The manufacturer commented on the review below","reviewText":"Love the sound. Easy setup. Wi-Fi connectivity is finicky. The worst and I mean the worst thing about this brand, and it's scary, is down the road they just decide to not support the product and it is worthless. It has happened to me on two different items in the past. One day there is an update and all of a sudden it no longer recognizes their own product on the network. Their response, we no longer support that. You now have several hundred dollars in garbage. It is a terrible corporate decision."},{"reviewerName":"SimpsonsTX","rating":"3.0 out of 5 stars","reviewTitle":"Alexa support is prehistoric..","reviewDate":"The manufacturer commented on the review below","reviewText":"Sorely lacking for Alexa functionality. It's really like having Alexa when she was first released years ago. Very basic things like time or weather are fine, but everything else is either unavailable or unreliable. Sending messages to kids rooms or playing music on all speakers... Nope.. wish I had returned when I had a chance."},{"reviewerName":"Filboid Studge","rating":"3.0 out of 5 stars","reviewTitle":"Great sound, incredibly unstable on WiFi","reviewDate":"The manufacturer commented on the review below","reviewText":"I have a small house (~1800 sq ft) with a decent mesh WiFi system (Google WiFi, 4 pucks). Nothing else falls off the network, and I can stream 4K video on the TV in my bedroom, which is farthest away from the main puck in the living room. Throughput within the house - from an Odroid XU4 that serves as a DLNA server to my Macbook Air is anywhere from 600-800 Mbps (megabits/sec), and my internet connection from Cox gives anywhere from 120-150 Mbps.\n\nI bought a Sonos One (2nd generation) 2-pack, so I could place a speaker in my bedroom and a speaker in the living room. On the pro-side, the sound quality is excellent; the speakers are easy to group. The Alexa integration is sufficient for my needs - because the speakers can be grouped, I like it that I can play the same music/radio shows on both speakers.\n\nWhat was remarkably bad is the WiFi stability. These things drop off the WiFi network at the drop off a hat. Within one day, I had to reset both speakers twice. Because I have Google WiFi, my solution was plug each speaker directly into a WiFi puck - this works well; they haven't dropped off yet. But its terrible that one has to use ethernet to get these things to work.\n\nI actually wonder if they would do better with a non-mesh WiFi system. In any event, for now, I'm satisfied with they way the work. But at nearly $200 apiece, surely Sonos could have got the WiFi working better."},{"reviewerName":"Lee Richardson","rating":"3.0 out of 5 stars","reviewTitle":"Doesn't work with Alexa alarms","reviewDate":"July 17, 2019","reviewText":"I bought a Sonos One Gen 2 to replace an Echo Dot, looking for better sound quality while keeping Alexa voice commands. It was only somewhat more expensive than an Echo Plus 2nd Gen with allegedly better sound quality during Prime Day. HOWEVER... Alexa on Sonos One doesn't support alarms, meaning you can't say \"Alexa, wake me at 7:30 tomorrow morning to KCSM Jazz.\" You can set alarms through the Sonos iApp, which is functional if inelegant, but that takes away the whole point of a voice-activated assistant.\n\nI confirmed the lack of alarm support through a number of sources, including Sonos support.\n\nMy experience with the Sonos One is overall disappointing, and I'm contemplating sending it back. The sound quality is good, way better than the Echo Dot, but it's not \"OMG that's amazing\" good. It works with more services than the Echo, including AirPlay, at the cost of finding services and figuring out how to access them. However... the Echo just worked, with minimal fussing. The One is going to take figuring out, setting preferences, workarounds... feh."},{"reviewerName":"Bradley F. Smith","rating":"2.0 out of 5 stars","reviewTitle":"Alexa integration is a joke.","reviewDate":"The manufacturer commented on the review below","reviewText":"Alexa integration is a joke. Good luck with that.\nSound quality is mediocre at best if you actually know what good sound is.\nThis is a speaker for background use when trying a hamburger or falling asleep.\nThe Sonos app also needs much improvement."},{"reviewerName":"Igor R","rating":"3.0 out of 5 stars","reviewTitle":"Excellent audio but not yet fully smart with Google Assistant","reviewDate":"August 29, 2019","reviewText":"It is very confusing: yes, it supports Google Assistant, but it is not a fully capable Google Assistant speaker.\nA true Google Assistant capable speaker allows you to control its volume and content via Google Home app. Sonos does not allow that. Technically speaking, it has Google Assistant but it doesn't have Chromecast capability. So, if you ask Sonos (by voice for example) to play your favorite radio station, it won't work, because you have to setup everything again in the Sonos app, even though everything is linked in the Google Home app.\nIf this is the only speaker in your home, it might work. I already have all setup in the Google Home and I'm not willing to keep track of all settings in a separate app (Sonos app)."},{"reviewerName":"davejkp","rating":"1.0 out of 5 stars","reviewTitle":"Connection issues destroy an otherwise good system","reviewDate":"The manufacturer commented on the review below","reviewText":"This worked fine for a while, but now when I ask Alexa to play any music or radio stations through the Sonos One, 2nd Edition, the response I get is, \"Hmmm. To do that first enable the skill on your Alexa app, and then discover devices.\" Of course, the skill shows up as enabled already, but I go ahead and discover devices anyway, but it makes no difference. To make matters worse, adding this Sonos device to my system now means that NONE of my Alexa devices will play radio stations or music. They all tell me to enable the Sonos One skill, which, of course, is already enabled. Oddly, Alexa via Sonos will still tell me the weather, give me my flash briefing, etc., but it won't play music or radio stations. Go figure. I went to the Sonos' support page and tried the fixes available there, but they didn't work. The speaker does still work as part of my Sonos' system, so it's not a total waste, but I bought it for the Alexa integration, so it's almost a total waste."},{"reviewerName":"Jim Owen","rating":"2.0 out of 5 stars","reviewTitle":"Total nightmare","reviewDate":"The manufacturer commented on the review below","reviewText":"Everything about my Sonos speakers experience was frustrating. The smart tuning thing never worked, they disconnected from Alexa regularly, setting up multiple speakers in a group is confusing. Here’s what they don’t tell you: YOU CAN’T DO EVERYTHING ALEXA DOES WITH THE SPEAKERS! Sonos speakers will NOT replace a regular Alexa device. And though they try very hard to make setup easy, god forbid you need to go in and change anything. Plain and simple: it’s complicated. I found myself messing with the apps ( Sonos, Alexa and Spotify in some combination depending on the problem) and still couldn’t get it to work consistently. My wife who is not tech savvy gave up trying to listen to her music at all because it was just not reliable.\n\nAnd even disconnecting them from Alexa is a pain. They still aren’t completely disconnected even though they are unplugged. Alexa wants to look for them and I can’t figure out how to get rid of that.\n\nThe whole Sonos experience was a disappointing nightmare from the day I bought them. The sound quality is fine, and the idea of having music in different time and being able to control that sounds cool, but like so much cutting edge technology, it’s not really cooked yet. Good riddance."},{"reviewerName":"Skidaddy","rating":"2.0 out of 5 stars","reviewTitle":"Great Sound, Alexa integration glitch","reviewDate":"The manufacturer commented on the review below","reviewText":"I ordered two of the Gen2 speakers. Sonos sounds is great; however, if you purchase for the Alexa integration you will be very disappointed. Please read the reviews as well as Google. There seems to be a common problem in which the Alexa integration does not work. You receive a response \" I am having trouble understanding right now\". when you call upon Alexa. You can reset/unplug and it will work for awhile and then the same issue occurs."},{"reviewerName":"RH","rating":"3.0 out of 5 stars","reviewTitle":"Wifi issues weekly","reviewDate":"The manufacturer commented on the review below","reviewText":"Looses WiFi weekly. I usually have to power cycle the speakers weekly and sometimes I have to totally reset them and setup again. I have a lot of wifi in my house with commercial ubiquiti access points - connectivity is not an issue. The sound is quite good and turning off the wake beep for Alexa makes that tolerable. There is a slight delay in response but it's not terrible. I could see myself getting \"the next gen\" speakers for the bedroom and I will use these as surrounds or something. They sound great, but as many people have complained about wifi, that is Major issue for this speaker."},{"reviewerName":"DJC","rating":"4.0 out of 5 stars","reviewTitle":"Amazing sound quality, but missing some connectivity options","reviewDate":"August 19, 2019","reviewText":"Starting this by saying, I didn't buy this to add to an existing Sonos setup. I wanted a speaker in my lounge room to play music on while I was puttering around. The sound itself is amazing, no matter where you put it the sound is truly worth it. The only problem is the connectivity. It requires WiFi and requires the Sonos app to play.\n\nAdding bluetooth would make this an absolute winner in my opinion. I regularly have friends over that want to play music and when I tell them they need to install the Sonos app and connect to my WiFi to play their music it kind of quickly derails the fun we are having.\n\nI knew full well buying this that it didn't have bluetooth, but I didn't realize it would be such a problem. The Sonos app is also missing some flexibility. I like to open iTunes, find an artist, go to their songs (which lists every song from every album) and just play it. I can't seem to do that with the Sonos App.\n\nI think this is a must buy if you are extending an existing Sonos Network. But if you are after just a standalone speaker I'd probably look for something else. Which is a real shame to say, because the sound quality is exceptional."},{"reviewerName":"gregj","rating":"5.0 out of 5 stars","reviewTitle":"Happy Sonas.","reviewDate":"June 27, 2019","reviewText":"I've had my sonas one for about a year and love it. I want to buy my second one unit and was reading some of the reviews and shocked to not see all 5 star ratings! Maybe they have weak or spotty WiFi systems is my guess? Mine works flawlessly around my whole house and yard. So happy to get Iheart radio and create my own free playlist on Amazon. Very, very happy!"},{"reviewerName":"E. Bolton","rating":"1.0 out of 5 stars","reviewTitle":"SONOS App is Broken, don't buy any SONOS products","reviewDate":"September 21, 2019","reviewText":"SONOS recently made a change to their app that doesn't let you play music from your iPhone or iPad (music that you already OWN) without subscribing to PAID services or buying additional SONOS hardware. Features that worked fine in the past, and let you and friends queue up songs and play different music as long as everyone was connected to the same wifi network.\n\nDon't buy any of this equipment from this greedy and unethical company. ANY OF IT! They will make software changes that will make the equipment obsolete in the future."},{"reviewerName":"Parker Thompson","rating":"1.0 out of 5 stars","reviewTitle":"Does not work with Alexa Multi Room Music (MRM), not mentioned on product page","reviewDate":"July 13, 2019","reviewText":"Sonos One cannot be added to an MRM group with other Echo devices. Not making this clear on the product page is deceiving. Unfotunately, I after intially trying and failing to include it, I waited to try grouping it again, and now I'm stuck with it. Basically useless to me, will be giving it to a friend."},{"reviewerName":"Randy","rating":"3.0 out of 5 stars","reviewTitle":"Great sound, Alexa is questionable","reviewDate":"The manufacturer commented on the review below","reviewText":"I love the Sonos speakers. As a pair, they have a fantastic sound. The only issue I encounter is that I have to reboot the speaker every other day due to \"Alexa\" not working. i.e. when asking: \"Alexa, do this or do that\" it replies, Sorry, I'm having trouble understanding right now, please try again later. Once I reboot the speaker, all is fine."},{"reviewerName":"Jo C","rating":"2.0 out of 5 stars","reviewTitle":"Great when it works, but very unreliable for Airplay 2","reviewDate":"June 22, 2019","reviewText":"I was super excited to get my Sonos One for multi room use, for streaming music/podcasts over Airplay 2. When it works, it’s awesome, I can stream to my 2 Sonos 1 and Sonos Beam and it’s really cool. Unfortunately, the system is completely unreliable over Airplay 2, drops in and out, sometimes will connect and sometimes won’t, sometimes says it’s connected when it isn’t so no audio, and it regularly gets out of sync between the 3 products. While it works over the Sonos app, I specifically bought these for Airplay 2. Customer service is very responsive over messenger, but ultimately largely unhelpful - continually blames either my network or phone (I even bought new router) rather than its product. The wireless network works for everything else with no issues (Alexa Echo, Apple TV, Smart TV, various home connected plugs and lights, my phone). After 6 months of issues I have caved in and connected one speaker to the router with a wire, which has fixed the issue - but given it says it can be an entirely wireless system this should not have been necessary. I struggle with the recommendation - it is great - but only if you’re prepared to connect one speaker by wire. Otherwise I can’t recommend it for wholly wireless use over Airplay 2, it is just to unreliable. The sound quality when it is working is excellent."},{"reviewerName":"Ben","rating":"5.0 out of 5 stars","reviewTitle":"Sonos little speaker big sound","reviewDate":"August 27, 2019","reviewText":"This is a very good wifi smart speaker. You have options of Alexa/Google and it works quite well. The speaker itself sounds every bit as good as any other sonos 1 speaker, lots of reviews of those exist. The lack of physical buttons on top are slightly annoying but not a real problem.\n\nSonos is designed for people who want multiple speakers in their house and can sync them. If you only want 1, you can find less expensive options but if you want to walk through your entire house hearing the same music throughout, you can't beat a good Sonos setup! The playbar is expensive but once you have that, you now have your TV sound throughout your entire Sonos system and adding some One's to that makes for a great listening experience"},{"reviewerName":"Amazon Customer","rating":"1.0 out of 5 stars","reviewTitle":"Cannot Add Sonos speaker to group of Echo Speakers - Function removed Feb 2019","reviewDate":"July 18, 2019","reviewText":"Sonos speaker sounds great, However many reviewers state that it can be added to echo groups. This function is no longer available. info direct from Sonos Help desk! it will work as an independent single speaker with Alexa no grouping with other Alexia devices is possible. Also will not be supported in the future. Bummer!"},{"reviewerName":"R.K.","rating":"5.0 out of 5 stars","reviewTitle":"First day trials turned out well!","reviewDate":"July 19, 2019","reviewText":"Pros:\n-Really good sound quality. As they tout, you can tell there is a difference in vocal clarity.\n-It's got some heft so you know it's got solid drivers in there.\n-The touch-sensitive controls are slick.\n-There's a long power cord for more placement options - seems like that is key in the room.\n-The app's EQ and other controls are handy.\n\nCons:\n-Definitely can't put out the bass I was looking for even at max in the app - might be room's config with vaulted ceilings and openness that doesn't let the bass bounce off walls as much.\n-There is a lag when you skip tracks...like a noticeable 2 second lag. Will have to do more testing on this to see if it's an Airplay from Spotify vs playing through Sonos app thing.\n-The Trueplay tuning procedure seems hocus pocus to me but, again, I'll test some more and place it in a different part of the room to see if it makes a difference.\n-Alexa can't do everything on this device that she could on an Amazon-branded device.\n-Fairly expensive for what you get - I only bit because there was a decent $70 Prime Day discount.\n\nOverall it's a great connected speaker and has added plus of being able to pair with multiple Sonos devices should you decide to do that."},{"reviewerName":"Dan","rating":"5.0 out of 5 stars","reviewTitle":"Wow. Great sound from such a small body","reviewDate":"July 18, 2019","reviewText":"I got this as a prime day deal, so basically 35% off. My parents have two of the sonos play:1 speakers, and they sound great in their large home. I elected to buy just one of the new sonos one (gen 2) for my much smaller condo.\n\nThe sound is fantastic - more than enough for my space. Love the fact that it can integrate with both google assistant and alexa, so I'm not trapped in one ecosystem, and love that I don't have to be tied to a specific streaming service for it to work.\n\nVery happy customer so far!"},{"reviewerName":"Kristen P. Garrett","rating":"1.0 out of 5 stars","reviewTitle":"Waste my time once a month with \"update\" and disconnect","reviewDate":"The manufacturer commented on the review below","reviewText":"Long term Sonos user. About once a month bam no service. At least 1/2 hour of troubleshooting, updating the software etc. to get the system I HAVE HAD FOR YEARS to just play music. Stay away. Note to Sonos, every time your software bugs out you will get at least one sh!t review from me. Stop wasting my time."},{"reviewerName":"Nyrac","rating":"2.0 out of 5 stars","reviewTitle":"The sound is awesome.......","reviewDate":"July 18, 2019","reviewText":"But Alexa is another story. Every time I talk to her she replies “I’m sorry I am having trouble understanding you right now, try again later”.\nIf I unplug the speaker and try again, then she works. Happens at least twice a day. I have the Dot also and I never have this problem. Not sure what the problem is.\nBut the speaker sounds great!"},{"reviewerName":"Strasselm","rating":"3.0 out of 5 stars","reviewTitle":"Wish I knew the Echo Studio was coming...","reviewDate":"The manufacturer commented on the review below","reviewText":"I wanted a high end wireless speaker with Alexa integration, this was the best I could find at the time. The sound quality is really good for its size. The Alexa integration is a 3rd party rip off at best. If I had a nickel for every time it said \"I'm sorry I can't understand you right now\" I would have an Echo Studio. Given Sonos reputation I am really disappointed, and maybe it was rushed initially but I've had it for quite awhile and so far no amount of updates have made the errors stop."},{"reviewerName":"Ed D.","rating":"3.0 out of 5 stars","reviewTitle":"Taking away iPhone app function","reviewDate":"July 12, 2019","reviewText":"Sound quality is great quality of products is great I use it all the time using my iPhone which they are discontinuing so speakers are going to be almost useless I would have not bought them without this feature."},{"reviewerName":"D. Dychkowski","rating":"5.0 out of 5 stars","reviewTitle":"Best Sounding WiFi Speaker","reviewDate":"July 20, 2019","reviewText":"If you are looking for high quality sound, look no further. I've tried both Google and Amazon products (mostly because they were more affordable) and I'm glad I saved up for this product. Sonos app is great, setup is a little wonky at times, but the sound is fantastic - better than a stereo pair of Alexas, which was my other option. If you're on the fence, I would highly suggest making the leap into the Sonos atmosphere, especially with the inexpensive Ikea Symfonisk arriving in August, 2019."},{"reviewerName":"G.R.","rating":"2.0 out of 5 stars","reviewTitle":"Mediocre Google Home; Excellent Sonos Speaker","reviewDate":"The manufacturer commented on the review below","reviewText":"It's just not as good as a Google Home. Here's a typical interaction:\nme : Hey Google, Play the news\nSonos one : device starts playing the news\nMe : Hey Google, Stop\nSonos one : (pauses for a moment to think, then continues playing the news)\nMe : *gets up and hits pause on the device*\n\nMost stuff fine and it sounds good but some of the interactions just don't feel polished."},{"reviewerName":"RPHNOCK","rating":"2.0 out of 5 stars","reviewTitle":"If you’re buying for Alexa, don’t bother","reviewDate":"The manufacturer commented on the review below","reviewText":"The sound is great, when it works. I bought this and the Sonos beam mostly for the Alexa connection. What a disaster. I’ve spent countless frustrating hours with Sonos support, including literally 2-hours on the phone with them trying to get these things to work, which they couldn’t do. Hugely frustrating. My suggestion is if you want Alexa based speakers, look elsewhere. You’ll thank me for it."},{"reviewerName":"Anh Dao","rating":"1.0 out of 5 stars","reviewTitle":"Terrible device, connection drops constantly and Alexa integration does not work.","reviewDate":"July 23, 2019","reviewText":"This device does not work. The connection drops out repeatedly. I’ve tried various solutions that they’ve suggested to no avail. I have multiple other smart devices, including a google max and echo, multiple TVs and streaming devices without any issues with the WiFi. Alexa also does not work well with the speaker. I’ll be returning the speakers and won’t buy anything from Sonos anytime soon."},{"reviewerName":"D. Lee","rating":"2.0 out of 5 stars","reviewTitle":"painful, time-consuming setup","reviewDate":"The manufacturer commented on the review below","reviewText":"These work great once they are setup, but every time I've had to reconnect it to a new/different wifi network, it takes multiple tries and sometimes hours to get it to work. This happens even if I have it right next to the router/modem."},{"reviewerName":"Jeremy","rating":"5.0 out of 5 stars","reviewTitle":"Powerful Speaker","reviewDate":"October 31, 2019","reviewText":"I use this as a single speaker, and it is powerful enough for an entire room. I love being able to use Alexa through the speaker to play music, check the traffic, etc and the sound quality is very nice.\n\nJust remember that this isn't a Bluetooth speaker, so you have to connect to the internet through a wireless connection or using an ethernet cable."},{"reviewerName":"L.W","rating":"1.0 out of 5 stars","reviewTitle":"Poor sound quality. Waste of money","reviewDate":"The manufacturer commented on the review below","reviewText":"I got this product as a birthday gift, and was really excited.\nWhen I connected the system, I immediately felt cheated. I've read a lot of reviews saying this product has a good audio quality. I don't know how can anyone say something like this.\nMy cheap portable speaker has a better audio quality than this.\nSuch a disappointment. I would return this if I could.\nSpare your money and buy something else. Anything else."},{"reviewerName":"Angela M","rating":"5.0 out of 5 stars","reviewTitle":"Great Sound in a Small Package","reviewDate":"August 7, 2019","reviewText":"These have a terrific sound. We have several of them now in different rooms, and the sound is fantastic. I also love how easy it is to manage them - from an iPad or iPhone you can pretty much play whatever you have one and tons of options for streaming. They aren't cheap, but the quality is outstanding."},{"reviewerName":"ca christianson","rating":"5.0 out of 5 stars","reviewTitle":"Get rid of those CDs and simplify your life","reviewDate":"September 28, 2019","reviewText":"This speaker is small with wonderful sound. Get two for stereo.\nAlexa sometimes plays what she decides not what I tell her, but I can control it from my phone.\nWhen I learned that I could listen to jazz from around the world and CNN and other news shows on Tune-In I cancelled my TV service."},{"reviewerName":"Bruce B.","rating":"1.0 out of 5 stars","reviewTitle":"DO NOT BUY","reviewDate":"The manufacturer commented on the review below","reviewText":"DO NOT BUY unless you are committed to spending money on a monthly music subscription service for the rest of your life. For some reason Sonos has decided it is not enough to spend hundreds or thousand of dollars on speakers to outfit your home. Now you can no longer play music that you have purchased from your phone. They have sold out to the subscription music services so now in order to play music on your very expensive speakers you also have to subscribe to a monthly music service!!"},{"reviewerName":"Will Mitchell","rating":"1.0 out of 5 stars","reviewTitle":"Works about 20% of the time","reviewDate":"The manufacturer commented on the review below","reviewText":"Sounds great when it worked. Plagued by connection issues like most other reviewers. It seems like we can never get this speaker playing properly without 5-15min of troubleshooting. Such a waste of time owning Sonos devices - they should be paying me as a tester at this point."},{"reviewerName":"mutatedmonkeygenes","rating":"1.0 out of 5 stars","reviewTitle":"\"i'm having trouble understanding right now\" - Alexa","reviewDate":"The manufacturer commented on the review below","reviewText":"Bought the Gen2 version after having owned (and loved the Gen1). Unfortunately somethings amiss, as this product constantly loses the connection to Alexa after a few days. There were a few other comments in the Amazon reviews regarding this issue, but I of course dismissed them! Anyway, please run this google search \"i'm having trouble understanding right now Alexa Sonos One\" and draw your own conclusion. thanks!"},{"reviewerName":"Run2Swim","rating":"5.0 out of 5 stars","reviewTitle":"Perfect Marriage","reviewDate":"August 9, 2019","reviewText":"The marriage of Alexa with the Sonos speaker is brilliant! The sounds quality is excellent, what you would expect of a Sonos product. We also love the fact that we can integrate it with the rest of the Sonos ecosystem in our home."},{"reviewerName":"Stuart A. Reis","rating":"5.0 out of 5 stars","reviewTitle":"Very impressive!","reviewDate":"August 16, 2019","reviewText":"Initially thought I’d use this soundbar solely for the TV...but found I’m using it more just to listen to music. The “Alexa” feature is an added benefit...taking verbal commands very well. Overall, very impressive."},{"reviewerName":"aubri","rating":"5.0 out of 5 stars","reviewTitle":"amazing sound in small speaker","reviewDate":"August 5, 2019","reviewText":"Amazing sound for movies and music in a tiny speaker, bass sounds amazing, I have the beam and 2 sonos ones in my living room. I have only turned the volume about halfway up so far and feel like I am at the movie theater. I have not set up alexa so I cannot comment on that but this is the best purchase I have ever made and is worth the money."},{"reviewerName":"David","rating":"1.0 out of 5 stars","reviewTitle":"Removed features ... hard to use now","reviewDate":"The manufacturer commented on the review below","reviewText":"Sound quality is good. However, Sonos has regularly reduced features that were a part of the reason I bought this set. Unreliable pairing of units means that I have to repair and rebalance these speaker sets once every 6-8 weeks. At some point you think... is it worth it? There are a lot of options out there. If only these guys didn’t suck so much !"},{"reviewerName":"Mattereaterlad","rating":"3.0 out of 5 stars","reviewTitle":"AirPlay is touch and go","reviewDate":"The manufacturer commented on the review below","reviewText":"Of course as a Sonos speaker, it sounds great. But, if you're looking to use it as an Apple AirPlay gateway to your whole Sonos system, it's not very reliable. I'd say it works about 50% of the time as an AirPlay option."},{"reviewerName":"Shawn","rating":"1.0 out of 5 stars","reviewTitle":"Great speaker sound but Alexa hardly works","reviewDate":"The manufacturer commented on the review below","reviewText":"The speaker sounds great and the app is awesome but Alexa barely works. If you’re looking to use Alexa I’d suggest going elsewhere. If you’re looking for great sound this speaker delivers.\n\n---\n\nDowngraded review to one star. Def not worth the money. Save yourself some cash and just purchase an echo from Amazon"},{"reviewerName":"Andrew Bodsford","rating":"2.0 out of 5 stars","reviewTitle":"No multi-room support","reviewDate":"June 6, 2019","reviewText":"Sonos speakers can NOT be added to Amazon Multi-Room Music groups. I verified this with both Sonos and Amazon technical support."},{"reviewerName":"J. F. Shanley","rating":"2.0 out of 5 stars","reviewTitle":"Completely disappointed by the (lack of) Alexa integration","reviewDate":"The manufacturer commented on the review below","reviewText":"This product claims to be Alexa compatible, but the degree to which it works is completely random. Returning for an Amazon capable speaker (although I love the sound.)"},{"reviewerName":"Jim McKay","rating":"1.0 out of 5 stars","reviewTitle":"Doesn't work with alexa","reviewDate":"The manufacturer commented on the review below","reviewText":"Doesn't work with alexa"},{"reviewerName":"Peaceful Person","rating":"5.0 out of 5 stars","reviewTitle":"Sonos Rocks!","reviewDate":"August 21, 2019","reviewText":"Haven't played with Alexa on this much, but the sound quality is fabulous. I plan to add two Sonos speakers next time they go on sale. I'm a Bose person, but Sonos has won my ears! :)"},{"reviewerName":"Saul","rating":"5.0 out of 5 stars","reviewTitle":"Great Sound Quality","reviewDate":"July 28, 2019","reviewText":"I think the Alexa “integration” didn’t do a great favor to this otherwise great speaker. Alexa is not very capable and is limited by country specific applications, for example I’m not able to control Apple Music with it. The sound is perfect for a small room. The features such as alarms and the Sonos app are great additions. I really like that this is airplay compatible."},{"reviewerName":"abiteontheapplea","rating":"5.0 out of 5 stars","reviewTitle":"Awesome sound. Google assistant to be improved.","reviewDate":"August 16, 2019","reviewText":"Google needs to work on getting the assistant complete. It can’t support night mode and sleep timers. Else excellent music quality and setup is easy."},{"reviewerName":"Benjamin Bray","rating":"5.0 out of 5 stars","reviewTitle":"Great sound and control, occasionally troyblesome.","reviewDate":"September 4, 2019","reviewText":"The sonos one has great sounds and syncs with most of the apps I use. I does crap out occasionally and I have to hard reset (unplug the speaker). This may be a local internet issue but I do have a brand new modem/router for convenience."},{"reviewerName":"cwb","rating":"5.0 out of 5 stars","reviewTitle":"I can hear over my noisy fan.","reviewDate":"August 7, 2019","reviewText":"Nice and loud in my room with a loud window fan. Louder than my apple HomePod but still connects to apple devices using AirPlay."},{"reviewerName":"rtapp","rating":"1.0 out of 5 stars","reviewTitle":"Wasted time","reviewDate":"July 19, 2019","reviewText":"Worked through the start up process - ended up spending about 3 hours and contacting customer support to walk me through the same process to get no where. Still haven’t heard the speakers.\n\nEdit: Through google - not customer support I found out you can use a speaker via airplay. Still waiting for an update on their system. 12+ hours"},{"reviewerName":"Shirley Gao","rating":"5.0 out of 5 stars","reviewTitle":"Great sound!","reviewDate":"July 24, 2019","reviewText":"Set up is a little bit long but other than that, the sound system is just amazing! would greatly buy this for my friends' as wedding gifts."},{"reviewerName":"Tony Schmidt","rating":"5.0 out of 5 stars","reviewTitle":"Excellent voice assistant and high quality sound from a compact speaker","reviewDate":"October 4, 2019","reviewText":"Small speaker produces large sound. Excellent set of microphones to use with Google Assistant or Amazon Alexa!"},{"reviewerName":"Jennifer","rating":"5.0 out of 5 stars","reviewTitle":"Amazing speakers for the size and price!","reviewDate":"July 30, 2019","reviewText":"Highly recommended these Sonos Speakers! They pack a big punch for their small size and sound very good!"},{"reviewerName":"Raymond","rating":"5.0 out of 5 stars","reviewTitle":"Hoping Sonos can Work with Siri Someday","reviewDate":"September 1, 2019","reviewText":"Otherwise this is a great standalone speaker. I just disable the alexa/google voce capabilities."},{"reviewerName":"Susanne","rating":"5.0 out of 5 stars","reviewTitle":"Love these speakers.","reviewDate":"September 30, 2019","reviewText":"Love these speakers. Just adding a third one to my collection."},{"reviewerName":"Good Fella","rating":"5.0 out of 5 stars","reviewTitle":"Great quality - Big sound...","reviewDate":"July 25, 2019","reviewText":"I love this speaker. It fills up all the main living areas of my home- and it’s just one speaker!! I love being able to control it from my phone and sync all my Spotify playlists to it as well.\n\nCan’t wait to get more!"},{"reviewerName":"B. Joe","rating":"5.0 out of 5 stars","reviewTitle":"High Quality Speaker","reviewDate":"August 15, 2019","reviewText":"These speakers are the best I've ever owned. The surround sound is great. I also like that I can group them and continue listening to my music seamlessly in another room."},{"reviewerName":"Amazon Customer","rating":"3.0 out of 5 stars","reviewTitle":"Good sound, connection issues","reviewDate":"The manufacturer commented on the review below","reviewText":"Bought a pair for stereo, good sound for speakers this size. Only serious complaint is ongoing connection issues, requiring turning shutting down and then powering up the speakers. Sonos should do something to address this problem."},{"reviewerName":"Mr. Fish","rating":"5.0 out of 5 stars","reviewTitle":"Really happy!","reviewDate":"October 25, 2019","reviewText":"Love my sonos. Can't beat the ease of use."},{"reviewerName":"JMT","rating":"5.0 out of 5 stars","reviewTitle":"Great value.","reviewDate":"October 25, 2019","reviewText":"Great addition to my music system."},{"reviewerName":"D Mc Sandman","rating":"5.0 out of 5 stars","reviewTitle":"Excellent choice.","reviewDate":"July 31, 2019","reviewText":"Easy to set up. Low latency. So far, excellent choice!"},{"reviewerName":"Carly E","rating":"2.0 out of 5 stars","reviewTitle":"Returning","reviewDate":"August 5, 2019","reviewText":"They are not worth the price"},{"reviewerName":"Melissa and Kevin","rating":"5.0 out of 5 stars","reviewTitle":"Sonos one","reviewDate":"September 3, 2019","reviewText":"Great sound. Highs are not as good as expected for price point"},{"reviewerName":"Kristin Lee","rating":"5.0 out of 5 stars","reviewTitle":"Great speaker","reviewDate":"August 31, 2019","reviewText":"We in 2 and will buy more."},{"reviewerName":"sh3","rating":"5.0 out of 5 stars","reviewTitle":"sonos is great","reviewDate":"September 24, 2019","reviewText":"expensive but great"},{"reviewerName":"The Maker","rating":"1.0 out of 5 stars","reviewTitle":"Horrible product","reviewDate":"The manufacturer commented on the review below","reviewText":"They are horrible. Do not get any Sonos products. They do you work with WiFi. Customer service is horrible"},{"reviewerName":"H9807","rating":"2.0 out of 5 stars","reviewTitle":"Disappointing...","reviewDate":"The manufacturer commented on the review below","reviewText":"Sound quality is good but always having trouble with Alexa."},{"reviewerName":"Eliu","rating":"5.0 out of 5 stars","reviewTitle":"Amazing","reviewDate":"August 10, 2019","reviewText":"Perfect sounds and performance"},{"reviewerName":"Vanessa V.","rating":"5.0 out of 5 stars","reviewTitle":"Awesome sound quality!","reviewDate":"August 13, 2019","reviewText":"Really crisp and clear sound."},{"reviewerName":"cmeyer","rating":"5.0 out of 5 stars","reviewTitle":"A great choice for flexible listening","reviewDate":"August 31, 2019","reviewText":"I love how simple the Sonos speaker is to set up and use. For its size, it has good sound."},{"reviewerName":"Ashley Terrell","rating":"3.0 out of 5 stars","reviewTitle":"Just ok.","reviewDate":"September 7, 2019","reviewText":"Sounds great but doesn’t link to other Alex devices well. Cannot play music on echo and Sonos at the same time."},{"reviewerName":"RK","rating":"5.0 out of 5 stars","reviewTitle":"Love Sonos","reviewDate":"August 19, 2019","reviewText":"Great product. I wish it was lease expensive given it is a single speaker but the technology is excellent"},{"reviewerName":"Maricela Guevara","rating":"5.0 out of 5 stars","reviewTitle":"Easy to connect","reviewDate":"July 27, 2019","reviewText":"For the size it is a good sound and I like how you can have one in different rooms and control from your phone."},{"reviewerName":"Brandon Heimer","rating":"5.0 out of 5 stars","reviewTitle":"Great Sound","reviewDate":"August 7, 2019","reviewText":"Speaker sounds GREAT! Also seems to respond better than the Echo Dot we replaced."},{"reviewerName":"Amazon Customer","rating":"1.0 out of 5 stars","reviewTitle":"CREATE AN ACCOUNT BEFORE YOU CAN USE IT AND SITE IS DOWN - GARBAGE","reviewDate":"June 2, 2019","reviewText":"have a party in a few hours, can't create an account and can't use it via bluetooth or alexa without an account. TOTAL POS"},{"reviewerName":"Senthilkumar Manickavelu","rating":"5.0 out of 5 stars","reviewTitle":"Amazing product for great price","reviewDate":"September 19, 2019","reviewText":"King of wireless streaming period."},{"reviewerName":"Farid Guliyev","rating":"5.0 out of 5 stars","reviewTitle":"Very good and impressive sound. IMHO has unbalanced and high bass.","reviewDate":"September 18, 2019","reviewText":"Clear and vibrant sound. IMHO too much bass, even with the lowest EQ settings."},{"reviewerName":"Esteban E. Villa","rating":"5.0 out of 5 stars","reviewTitle":"The sound is amazing!","reviewDate":"July 30, 2019","reviewText":"Very excited for this. Adding to my collection."},{"reviewerName":"t3sla4ever","rating":"5.0 out of 5 stars","reviewTitle":"The usual Sonos quality","reviewDate":"September 10, 2019","reviewText":"No surprise here, Sonos continues to deliver top-notch sound. Got this on Prime Day, which was a no brainer."},{"reviewerName":"Supaflash9000","rating":"5.0 out of 5 stars","reviewTitle":"Great sound, looks good, works well in my ecosysten","reviewDate":"March 18, 2019","reviewText":"bought two for my living room -- great sound and easy to set up and the addition of bluetooth is great for guests. Would recommend!"}]}