{"title":"Heimvision HM205 1080P Security Camera, Works with Alexa, Night Vision, 2 Way Audio, Motion Detection, 2.4G Wireless Home Surveillance Camera for Baby/Pet/Nanny Monitor, Cloud Service/Microsd Support","manufacturer":"heimvision","currentPrice":"$29.99","rating":"4.0 out of 5 stars","totalRatings":"451 ratings","features":["\n         Make sure this fits\n                by entering your model number.\n        \n","360 Degree Coverage: Get a full view of your home with 110 degree wide viewing angle and 355 degree pan plus 55 degree tilt, and keep more of what matters to you safe. You can put your HM205 home security camera on a shelf, mount it to the wall or mount it to your ceiling.","1080P HD Video w/ Night Vision: Your HeimVision HM205 home camera delivers crystal clear 1080P HD video. Night vision range up to 33 feet in low light or in the dark. With HeimVision indoor camera, you can keep an eye on your baby, pet, nanny or elder at anytime from anywhere using your smartphone or computer. 24/7 live streaming.","Motion Detection and 2-way Audio: When there's movement, your HeimVision IP camera senses it and sends alert to you via message or email. The HM205 security camera has a built-in speaker and mic, so you can hear what is happening at home. Or tell the dog to get off the couch.","Optional Cloud Storage Service: Support ONLY 1-month AWS cloud of 72 hours storage (with no charge) recording to avoid risk of losing footage from a microSD card, and ensures all your footage is safe, secure, and protected with the most efficient compression and highest protection of data. You can review, save, playback and share footage at any time. Also supports local backup by microSD card up to 128 GB.","Easy setup and Works with Alexa: Quick setup via iOS and Android devices by the user-friendly App Pixplus-EN/Pixplus. Connecting the 2.4Ghz WiFi(5Ghz is not supported), and follow instructions step by step to set up. The wireless security camera supports remotely view via mobile phone app. Get to know what's happening in your house whenever and wherever. Compatible with Alexa, you can view your live video with a simple voice command."],"reviewsAspects":["night vision","motion detection","picture quality","easy to set","keep an eye","easy to install","way audio","highly recommend","easy to use","easy to setup","echo show","cloud storage","great camera","user friendly","stopped working","motion sensor","great price","work with alexa","micro sd card","cloud service"],"productInformation":[{"Product Dimensions":"5.5 x 4.7 x 4.7 inches"},{"Item Weight":"12 ounces"},{"Shipping Weight":"12 ounces (View shipping rates and policies)"},{"ASIN":"B07R6HVN3K"},{"Customer Reviews":"4.0 out of 5 stars\n    451 ratings\n4.0 out of 5 stars"},{"Best Sellers Rank":"#283 in Camera & Photo (See Top 100 in Camera & Photo)\n#34 in Dome Surveillance Cameras\n"},{"Date first listed on Amazon":"April 28, 2019"}],"productDescription":["The wireless security camera achieves a 360° view via Pan 355° & Tilt 55° and 110° wide-angle lens. Quick access to important locations by preseting/ bookmark desired positions. Either put the camera on the book shelf or mount it to wall/ ceiling for broader view.","Featuring a 2MP camera, HeimVision HM205 1080P WiFi camera delivers clearer HD images than those of 720P. Monitor what happens in your home clearly through real time view or recorded videos by your mobile App. The App supports to view 4 cameras at the same time.","Set your camera to auto tracking, or record videos when movements are detected. You can customize when and how often to receive notification. Detection sensitivity, device off time period and notification sending time period & frequency, etc. can also be set as you like.","Night vision ranges up to 32 feet in low light or even in pitch dark with clear image, which could act as a deterrent against theft, burglaries, and vandalism. You can monitor your baby or pet clearly and easily at night. Night vision will be on automatically based on light change, or manually by mobile App.","Optional cloud service ensure that you never miss anything. Log in to instantly pinpoint your footage through an intelligent timeline and playback seamlessly in brilliant quality. Receive the first 30 days cloud service for FREE. You can also use a memory card for alternative recording.","Playback videos of your toddler, naughter pets or kids playing from the cloud/ microSD card to see what happened. Never miss a moment by setting to recording all day/ event recording.","Click the power button on your mobile app to turn off the camera recording and enjoy your private time. Or set the device off during your private moments. Your HM205 would not record anything then.","Share camera access with your family or instant sharing pictures and videos from camera with families is convenient. Always get to know what your kids learn, what funny things happen, etc in real time or playback the videos at anytime and anywhere.","\t\t\n\tHeimVision HM205\tHeimVision HM203\nHD Resolution\t1080P\t1080P\nAlexa\t✓\tx\nConnection Type\tWi-Fi (2.4Ghz)\tWi-Fi (2.4Ghz)/ LAN cable\nPan/Titlt/Zoom\tPan 355°/Tilt 55°/4xZoom\tPan 355°/Tilt 65°/4xZoom\nStorage Type\tCloud storage/ MicroSD card(up to 128GB)\tCloud storage/ MicroSD card(up to 128GB)\nNight Vision\t✓\t✓\nFeatures\tMotion/sound detection, two way audio\tMotion/sound detection, two way audio"],"reviews":[{"reviewerName":"Michelle Cox","rating":"5.0 out of 5 stars","reviewTitle":"Great Product!","reviewDate":"June 25, 2019","reviewText":"Product was super easy to setup with the app. The app has poor reviews, but this is due to people not reading the instructions. You need to click \"register\" instead of trying to login immediately. That's how you create your username and password. The video works great to watch live, both in daylight and at nighttime. The night vision works well. The only downside to all night vision cameras that are indoors, if you point it out the window, the infrared will glare off the window. I turned the night vision off for that camera. It makes it hard to see outside at night, but it will detect cars passing by and I wanted it for the daytime. The motion sensor is sensitive. Even on low, it will pick up my cats walking by on the floor. Great product! I liked it so much I purchased 3 of them!"},{"reviewerName":"Steve G","rating":"5.0 out of 5 stars","reviewTitle":"Easy Setup. Good Picture Quality. App Controls Everything","reviewDate":"June 12, 2019","reviewText":"This HeimVision is a nice security camera but it could also be used as a baby monitor, Nanny cam, pet monitor, or to check on an elderly family member. Included in the box are the camera, user manual, mount & screws, and power adapter & cable. Some of the features are night vision, 2-way audio, intelligent tracking, and motion detection. It can also tilt and pan and is easy to control within the app. The camera panning and tilting are almost completely silent. It also has 4x digital zoom. It also works with Amazon Alexa but you need something with a screen such as the Echo Show. I’m just using the camera through an app on my iPhone and iPad. The camera has 1080p resolution and can support up to a 128GB micro SD card. The files are saved as mp4 files. Cloud service is also available but there is an extra cost for it. The camera also has a wide angle lens so you’re able to see the majority of a room. The Infrared night vision is capable of about 35 feet. Setup is very quick and easy. You download an app via a QR code on the box to your phone or device. Once the app is installed, you install the camera via a QR code within the app. The entire process was less than 5 minutes. You have to use a 2.4 GHz Wi-Fi connection. Once installed, you can view from anywhere. The 2-way audio works really well and is pretty clear but I have noticed the sound coming out of the camera is better than the sound coming out of the app. Another feature I like is the ability to set presets so that you don’t have to manually scan to different areas of the room. You can also take manual snapshots or manually record video. You can also add multiple cameras and view/control them through a single app. There are several options within the app to control night vision, sound, tracking, etc. Overall, it’s a very good camera especially considering the price."},{"reviewerName":"KC","rating":"4.0 out of 5 stars","reviewTitle":"Good (not great, not yet)","reviewDate":"July 23, 2019","reviewText":"For those looking for a good all-around security solution for their home, this camera is a pretty solid choice. Some of the things that I really enjoy about it are:\n- it has motion tracking! This is actually pretty cool… Once at a text motion it will begin to follow you around the house. Is it perfect, no. It will sometimes lose you as you’re moving. But the fact of the camera sitting there turning and following you at all is creepy cool and definitely feels like a deterrent to anyone who comes into your house.\n- it has an alarm! This is also one of the things that I really did want for my home security. I would rather deterrent than getting alerted and just being able to watch somebody rob my house. This camera has the option of sounding an alarm when it detects motion.\n- it has a local storage option. For those who don’t want to pay for cloud storage, it does have local storage using a microSD card.\n- it sends alerts to your phone. Setting it to motion detection, the camera will send you an alert when it detects motion.\n\nWhat I don’t like:\n- notifications are sketchy. Sometimes I don’t receive any notification when it detects motion. Sometimes I receive a notification when, for the life of me, I have no idea what it detected!\n- The playback feature is stupid. It’s possible that I am the one who stupid, but the playback feature is not the most intuitive. It basically opens up a timeline and shows highlighted the sections where it began to record as it detected motion. This is for the ST play back. Maybe cloud storage is a little better and it will actually record the events separately.\n- panning up and down is limited. I actually wanted to install this thing sticking out of the wall. However, the “ball“ of the camera can’t pan up and down all the way. As you reach it’s maximum limit upward, panning left or right ends up panning in an ark, making the type of installation that I wanted not practical.\n\nWhat I’m “meh” about:\n- you can talk through the camera - The audio for features like this is never very good. And I feel that it’s pretty much the same with this camera. My Kuna is MUCH better in this regard.\n\nOverall- I’m glad I got this camera. Whether I receive the notifications every single time or not, the camera did detect motion consistently. If you have it set to sound an alarm, even if you don’t receive a notification, I feel that would be enough of a deterrent to send any intruders running. That said, I received notifications accurately probably 90% of the time."},{"reviewerName":"xiangchun","rating":"5.0 out of 5 stars","reviewTitle":"The wifi cam is easily installed","reviewDate":"August 9, 2019","reviewText":" The wifi cam is easily installed in a few minutes. App is easy to use. You hardly hear the engine when it pans (360 degrees). It sends a notification to the phone when something moves in the apartment (you can also turn off) and you can access the entire apartment via live image from anywhere in the world. It's really great. Sharp picture, fast transmission, no matter whether I am at home in the wireless network or at work. The night vision works flawlessly. For recordings, I'll insert a Micro SD card, otherwise I can only watch live videos as I don't want to subscribe to the cloud service. Worth for the money!"},{"reviewerName":"Shsaam","rating":"5.0 out of 5 stars","reviewTitle":"Protecting my house...","reviewDate":"September 12, 2019","reviewText":"I like them. I have two one in dogs room to see them when I'm out...another in livingroom/kitchen...the one in kitchen...I move it and it moves back in spot it was in before I moved it...and not sure if it's the way it is on wall but picture is side ways...I may wind up moving it so pic is right side up... not sure what pic or video you want...I dont want to show my house..set up was easy to an extent...explaintion of the wifi could be a little easier ...did not understand the AP hotspot what wifi is that...so far I like this give it a week or two and will re evaluate them...the picture is clear...\n\nre-eval- I still like them they need longer cords for where they are...."},{"reviewerName":"Brandon","rating":"5.0 out of 5 stars","reviewTitle":"Easy set up, good quality, great features. A good choice!","reviewDate":"May 28, 2019","reviewText":"This camera was a surprisingly good value. The features that it has far outweigh the price. I love all of the features which are quite user friendly. I see that the older models had some issues with the app that you need to use with it, but with this new model, I have not had a single issue on my S8+. The picture quality is very adequate, even in the night vision mode. I really like that you have control to turn on/off all of the features, or the camera entirely. The set up was easy, and problem free."},{"reviewerName":"Twistedwankel","rating":"5.0 out of 5 stars","reviewTitle":"It works flawlessly recording 24/7 to SD or the Cloud and Easy to install.","reviewDate":"July 26, 2019","reviewText":"I received my HM205 camera kit today. In only 2 hours I had the system up and running. One delay is I didn't know how far 20cm was so I held the bar code much too close to the camera. The voice prompts worked perfectly telling me what it was doing and it's status. The image is very impressive and I was able to move the camera nearly 30ft away from the router to a front entrance and it works just as well as when within a few feet of the router. Impressive as we have steel studs in our modern home. It is working flawlessly and I will spend more time hooking it up to Alexa than it took me to get it working thru my smart phone. A real bargain. Costs 1/2 what the RING does and thieves cannot just rip it off the outside wall. Provides very good image even thru a window screen. I'll be getting another one for the back of the house."},{"reviewerName":"Stacey","rating":"5.0 out of 5 stars","reviewTitle":"Easy Set up!","reviewDate":"June 11, 2019","reviewText":"There are many pro's to this security camera: night vision, time stamp, easy set up, control with finger tip on your phone or smart tablet. The best feature is the two way audio. My husband was out of town and received a notification when we got home. He was able to say hello to our daughter. She was so excited to hear his voice. I highly recommend this security camera."},{"reviewerName":"r0ckerm0m","rating":"5.0 out of 5 stars","reviewTitle":"Awesome Value, Great Product!","reviewDate":"October 21, 2019","reviewText":"Purchased for my single, young daughter for her personal home security and so she can keep an eye on her Dog when she is away. The price, 2 way audio, night vision, & ability to view from an app were the selling points. It was easy to set up and the app works wonderfully. Anything more than 3 days of tape you have to pay for, but that is pretty reasonable.\n\nIt’s new, but so far so great. We will update our review later. The photo provided is a screenshot from the app. You can make the pic bigger, and turn your phone, but you won’t see the details and the option to use the microphone will go away. Some of that isn’t necessary every time of course.\n\nThe notification of movement are a little much with a dog at home, but you can adjust those as well 😁"},{"reviewerName":"Junqi Qik","rating":"5.0 out of 5 stars","reviewTitle":"It was breeze to setup","reviewDate":"July 7, 2019","reviewText":"Right out of the box it was breeze to setup. The app is simple to use and easy to understand. The camera connects to your WiFi right through app. The 2 way audio is loud, crisp and clear from both the camera and through the app. The video and still shots are clear. I like that as soon as motion is detected get a notification sent to my phone, I can also take snapshots of video. I put one camera in my son's room to check on him throughout the night. It swivels all over, allowing me to see his whole room. I can keep an eye on the kids whenever I go to the grocery store or if we're not home I can make sure the house is safe and secure. I set up the motion detect and within seconds my phone will notify me. Click on the notification and it takes you straight to videos to see what happened. Downloading the video to your phone was just a click of button. You can also take pictures through the app. There are many ways to utilize the camera through the app. You can scan using the controls in the app, take a 360 picture, speak through the camera, and even zoom."},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Easy set up!","reviewDate":"June 28, 2019","reviewText":"So far so good! Set up was very easy! We have a router with both 2.4 and 5Hz WiFi and it still works!\nI read A LOT of reviews on different cameras to find one that was going to work with our router and also would not be hacked.\nI read a couple bad reviews for this camera and one of them stated there is a free gift with a review. There is but it does state leave an HONEST review. It can lag but I’m not using it for a security camera, just to watch my dogs. I did not have to type in anything, scanning the codes worked just fine with my phone.\nI would highly recommend it!"},{"reviewerName":"Kacey","rating":"5.0 out of 5 stars","reviewTitle":"Works great to watch my dog while I'm at work!","reviewDate":"September 27, 2019","reviewText":"We recently adopted a dog and I hate having a crate in the house so I bought this camera so I could monitor her while we were gone! I've caught her doing things she shouldn't be doing and she can hear me over the speaker when I tell her \"NO\" or \"STOP,\" which is exactly what we needed it for. The motion detector is super sensitive. I swear nothing happens and I get a motion notification. My boyfriend, the dog, and I have all been out of the house and I've received motion notification and when I check there's nothing there. The camera is also perfect for the limited space that we have. My apartment runs from front door straight back to the bathroom door so I'm able to position the camera in various positions without have much blindspots."},{"reviewerName":"Fred B.","rating":"4.0 out of 5 stars","reviewTitle":"Very Satisfied & Highly recommend","reviewDate":"September 19, 2019","reviewText":"Update:\nI had left a very detailed and less than positive review for the product a few days after purchasing and installing this cam in my home. To recap the cons from that previous review; I think the quality is substandard for a 1080p resolution camera. But as I said then, this is my opinion when compared to a $25. 720p camera that I have owned for the last 2 years.\nAfter dealing with this company over the last couple weeks regarding a couple things, both related to the camera and other unrelated topics, I have to say that their communication and customer service have both been stellar and unsurpassed by any other company I've dealt with after making a purchase from them. The fact that there are companies still around that care so much about their customers that they are willing to go above and beyond what is usually expected of them restores my confidence in consumer products and faith in the people within the company. And it's for this reason that I will return to them to buy more of what their selling even at the cost of less than 100% satisfaction with the Item. So I highly recommend this camera and any other of their cameras if customer service tops your list of reasons to make a purchase."},{"reviewerName":"Destini","rating":"5.0 out of 5 stars","reviewTitle":"Setup a little struggle but the best product I've seen","reviewDate":"October 21, 2019","reviewText":"This is an outstanding security cam I've been checking reviews and had to get one and compared to Walmart who can beat the price. So far I love the camera quality beautiful view perfect color. I love the night view perfect and I can still see details. It actually moves when something is detected. I have the app on my phone so when I got to work it popped up a notification on my phone that someone was in my apartment. There is even in the settings where an a police type siren alarm goes off if you choose when movement is detected. Free 3 day recordings plus live feed, I just can't believe how it fits perfectly for my home. Now the set up was a little struggle but I'm good at tech so we got it online and connected to wifi and phone app in 30 minutes."},{"reviewerName":"Emily Vorenkamp","rating":"5.0 out of 5 stars","reviewTitle":"Worth every penny","reviewDate":"July 29, 2019","reviewText":" I wasn't sure I would fee about this camera. I've had more expensive baby monitors than this but this camera topped those ones! The quality of the picture is extremely impressive! Even including the night vision. I can see things on the camera that I couldn't see with my own two eyes. I love the fact that the camera moves with motion. I can watch my children knowing it will catch whoever really was misbehaving. I would recommend this camera for security as well."},{"reviewerName":"MamaBear4501","rating":"5.0 out of 5 stars","reviewTitle":"Great features, easy to use!","reviewDate":"May 28, 2019","reviewText":"Great little camera for the money. If you have problems with the setup, don’t use the QR code, set it up manually and it works right away. Love that not only can I hear what’s going on, but I can speak from the camera. Super convenient!! Very small, but has a great range of motion. The app is very user friendly."},{"reviewerName":"Josh Patterson","rating":"5.0 out of 5 stars","reviewTitle":"Good wifi camera for the money","reviewDate":"May 24, 2019","reviewText":"This wifi webcame is surprisingly jam packed with features. Full 360 degree control from you phone with two way audio.\n\nPackage/set up: Camera comes with power cable and mounting screws. Set up was an easy 3-4 steps following instructions. I didn't really have any issue getting the camera going.\n\nVideo: HD lagged on my internet service. 1 button click to standard definition helped the streaming significantly.\n\nAudio: hearing over the camera to your phone is a decent quality. Transmitting voice from your phone to the camera is adequate.\n\nStorage: current options are SD card that the buyer will have to add to the camera. Or pay for a cloud service to store the camera footage. Video and pictures can also be saved live stream to your viewing device.\n\nMotion detection: pretty spot on. Notifications were sent to my phone when the motion sensor picked up movement.\n\nNightvision: worked rather well in dark areas."},{"reviewerName":"Brian Rose","rating":"5.0 out of 5 stars","reviewTitle":"Great Camera, especially for the Price","reviewDate":"August 29, 2019","reviewText":"The camera is very easy to use with superb quality and 360° views, which I love. I can access the camera anytime with the app interface that is simple and easy to use. I also appreciate Alexa compatibility. I watched videos online aid my decision making, and I cannot be happier with this camera. I have a very expensive outdoor security system that I wish worked as well and consistently as my two HeimVison cams. It’s loaded with feature that I would think might only come with a more expensive cam. I’m happy with the night vision and the motion detection, and even the 2-way audio is decent. The online videos seemed to suggest the 2-way audio was weak, but I’ve found it to be pretty good, better than a fancy smart doorbell that I have. I have yet to figure out the microSD storage but hope to get that up and going soon. All in all, I cannot be happier with this camera, as I have said. I’ve paid 4-times as much and feel like I’ve gotten less of a camera."},{"reviewerName":"Sara Behmer","rating":"5.0 out of 5 stars","reviewTitle":"Met my expectations","reviewDate":"July 5, 2019","reviewText":"This camera did meet my expectation. The installation was easy. In my home I use to watch the dogs. Following the step-by-step instruction, I was able to set it up fairly quickly. I really like the video recording. Motion detection is great. You can set device notification so that you can be notified when someone is in your house. Recordings can be stored in the cloud for free in the first 30 days. And it supports local storage by micro SD card up to 128 GB. All in all, the camera did meet my expectation, I would recommend this product to friends and family."},{"reviewerName":"Common Critic","rating":"5.0 out of 5 stars","reviewTitle":"Great security cams and Alexa enabled","reviewDate":"July 4, 2019","reviewText":"I bought these cameras because they were on a big discount, but was shocked by how great they work. Setup was easy. Download the app and simply plug in the camera. It came with a 30-day cloud trial to store all of the videos, but I ended up buying 128GB miniSD cards to avoid paying a monthly charge on four cameras. The video quality can switch from standard to HD with a click on the app. Sometimes the app can respond slowly when controlling the camera on HD mode. But the picture looks incredible. I love how it pans and tilts through the app. It’s also cool that it links to Alexa and I can tell “Alexa, show me the garage” and it streams the garage camera onto my tv. I can’t say enough about how great these cameras are so far. It’s only the first week of use though. So I’ll update if anything breaks or doesn’t work correctly down the road."},{"reviewerName":"jokerb19","rating":"5.0 out of 5 stars","reviewTitle":"Great for the price","reviewDate":"August 6, 2019","reviewText":"I wasn't sure what to expect when ordering this camera to be honest. I was happy with the price, and the performance is more than enough to make me very happy with this purchase! The resolution of the camera is everything I hoped it would be. I can easily keep tabs on what my kids are doing if they are in another part of the house. The audio quality is great as well! I can hear the cute things my kiddo's say to each other while they play. This really adds confidence to letting my kids play and knowing they are safe!"},{"reviewerName":"Seth","rating":"5.0 out of 5 stars","reviewTitle":"Easy to install. Great video quality.","reviewDate":"June 24, 2019","reviewText":"This is an amazing camera. Use it to interact with my kids while I'm at work. The 2 way communication is so cool. The picture quality is very nice and controls are very responsive in the app. Has good night vision and had motion control notifications. Would reccomend for anyone that needs an easy to install camera."},{"reviewerName":"Luis Serrano","rating":"5.0 out of 5 stars","reviewTitle":"Great product","reviewDate":"July 7, 2019","reviewText":"What a great product. I purchased this camera for added security. Setup was easy and once connected to the WiFi I was surprised that the video quality was really nice. I setup the motion detection which was great. I attached a photo of my room in complete darkness so you can see the night vision quality. I really like this camera. I have a bigger pet cam and this one offers a little more as far as motion detection. I use a memory card vs the cloud to store video."},{"reviewerName":"lizet","rating":"5.0 out of 5 stars","reviewTitle":"More than I imagined.","reviewDate":"July 29, 2019","reviewText":"I got this product originally because my dog had gotten spayed and I wanted to keep an eye her while I was at work. Overall I wanted to rate this on..\nSet up:\nThe set up in this device was not that hard, it comes with a little manual that’s pretty explanatory and takes you step-by-step how to do the process is and even shows you pictures of what your screen should look like.\nQuality:\nThere is a picture posted below of the quality. I want to say that my camera is about a foot away from her maybe a little more. Obvious in the picture I had zoomed in on her. And it looks great.\nHearing:\nI connected my camera with Alexa and sometimes I play music for her and I can hear the music in my room pretty well when it is on so the hearing is kind of fantastic.\n*** One of the best things that I like about this camera is that I can hear what is going on in the room. And I can also speak to whoever is in the room. It has a little microphone that allows you to speak back-and-forth with the individual in the room or your fur baby(:"},{"reviewerName":"Rockin' Robin","rating":"5.0 out of 5 stars","reviewTitle":"Surprised","reviewDate":"August 12, 2019","reviewText":"Sorry, this video is unsupported on this browser.\n When I opened the box, I was surprised. It is a small camera, with good features. I included a combined video taken at night, along with Night Vision. The pic is from a day time recording. I bought the camera so I can check on my cat when I'm out of the house."},{"reviewerName":"Suzanne Salazar","rating":"5.0 out of 5 stars","reviewTitle":"Wireless?","reviewDate":"August 28, 2019","reviewText":"This review is my personal experience and may not be similar to other people.\nPROS: Set up was easy, it comes with set up instructions.\nThis camera is awesome for the price! It does what it says it does.\nI like the daytime picture quality, it's clear.\nI love that it follows when it detects movement and sends an alert to your phone.\nThe alarm sound is quite useful\nand you can turn it on and off via app.\nI love the night vision feature.\nI like the idea that it stores segments of videos when it detects movement so you can review it in your phone.\nIt also offers cloud storage service for a fee.\n\nCONS:\nThis camera would have been perfect if it doesn't have to be plugged at all times. I thought the cord that came with it is just for charging but it seems like it is the power cord. Everytime I pull it out from the camera, the camera does not function and there's no indicator that it's fully charged. It seems not right coz you can put this camera upside down from a ceiling (it comes with the hardware) for a much better view so it must be wireless.\nThe night vision quality is not that perfect but it's acceptable.\nDetection of movement is limited in terms of distance. It appears like it can't detect movement more than 10-15 feet from the camera."},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Senior Friendly","reviewDate":"September 2, 2019","reviewText":"My wife and I are at an advanced age and are usually more testy than techy. This great gadget has allowed us to cross the gulf of gigabits and capture the ramparts of ram. Thanks to Amazon Prime, the HM 205 arrived promptly but regrettably by delivery truck, not drone. Setup was a little daunting for the elderly, but we managed to get our little R2 D2 linked to wifi. It was worth the effort. The high definition picture quality rivals the best TV and the features are quite impressive. The night vision works in a pitch black house and the tracking feature is amazing. Its like your third grade teacher watching your every move. The zoom allows you to check to see if your doors are locked and your appliances are off while you are states away. With the two way audio it is perfect for keeping an eye on small children and big pets, and to at least tell the bad guy to cut off the lights when he leaves your house! The ability to use a micro SD card instead of cloud storage is a nice option for the budget conscience. All in all, an exceptional security camera at a very senior friendly price point. We would highly recommend."},{"reviewerName":"Equatorialthoughts","rating":"1.0 out of 5 stars","reviewTitle":"Really disappointing","reviewDate":"June 25, 2019","reviewText":"There is a card for a free 64 GB SD or $20 Amazon gift card when you open the box, hence the positive reviews.\n\nThe code on the cameras cannot be scanned with your phone. Manual entry is the only way you can set it up.\n\nYou cannot add spaces when you try to change the name of a device, so changing the name means you need to totally remove the item and start over.\n\nTheir app is bad and has bad reviews. The other app they use to power the cameras has solid one stars, doesn’t work, and is in a lot of Chinese. There are ads when you first open their app.\n\nThis does not work on my network of Echos. It can never discover the camera. Bottom line, this will not currently work with Alexa.\n\nI have eight of these and they’re all going back. Avoid."},{"reviewerName":"MLWhite","rating":"1.0 out of 5 stars","reviewTitle":"Don't.","reviewDate":"July 29, 2019","reviewText":"The picture quality is just fine bit the app takes too long to load so it's useless to try to look back at prior footage.\nUpdated: AND- write an honest review about it and you get emails from their customer service department offering a refund if you alter your review. Don’t buy this product. It’s not worth it - and Colin in customer service - stop emailing me!"},{"reviewerName":"Alicia","rating":"1.0 out of 5 stars","reviewTitle":"Camera didn’t work long","reviewDate":"September 29, 2019","reviewText":"Only good thing about this camera is that it records and has night vision. Problem is, the recordings dont play the full video. It also continues to need reconnecting. So when I want to see live feed of my house, sometimes it says “uh oh, disconnected” and I cannot redo it unless I am at home. Right now it is doing that very thing. I cannot get it to work anymore. I have deleted the app and downloaded it again. I have rebooted and unplugged the camera numerous times. So when it actually wants to work, I think it is great. But most of the time I have had it, it has failed me. Not sure what the problem is. I don’t have time to call support line all the time. They told me to redownload the app. That didn’t work. Hopefully others are having a better experience than I am."},{"reviewerName":"Randy S Huang","rating":"5.0 out of 5 stars","reviewTitle":"It's a every nice security camera","reviewDate":"June 7, 2019","reviewText":"I bought a HM205 security camera. I downloaded the app according to the instructions. I also set the entire camera according to the program. It is also convenient to install. Just plug it in with the USB cable and l can put the camera in anyway of my house.I can useing the app from my phone to watching my house is very convenient. I think I still need to buy a few more and install it in to my parents’ house .so that I can security my parents house through the mobile phone. We are very satisfied with this HM205 security camera."},{"reviewerName":"Bruce","rating":"4.0 out of 5 stars","reviewTitle":"Other than sound, I like everything about it","reviewDate":"July 11, 2019","reviewText":"I only have been disappointed with the sound. The TV playing at a normal volume across a small-to-medium sized room can't be heard through the camera. But I have loud kids and I can usually hear them more or less. Oh, the motion controls are glitchy and slightly unresponsive, but I mostly only use 2 presets and do not use them that often, so it doesn't bother me too much.\nI love being able to watch from my phone or laptop, and with the option to share the feed if I wanted to. The setup was very easy for me. The HD video lags understandably about 15 seconds, and is glitchy with my 25Mb/s interent. SD video lags only a few seconds and is a lot less glitchy, but still a good quality resolution. I was impressed with the night-vision, too."},{"reviewerName":"Luxembourg Manhattan","rating":"5.0 out of 5 stars","reviewTitle":"Great camera","reviewDate":"May 26, 2019","reviewText":"I love this camera. It was easy to install with the instructions in the box. You can install this camera wireless through a QR code. The setup took approximately 2-5 minutes and I was all setup to see live feed. There is an option to setup up with Alexa but I opted out of that right now. The camera also has a service option for 24 hrs recording. The camera definatly is a steal for the price."},{"reviewerName":"Mrs.Chris","rating":"2.0 out of 5 stars","reviewTitle":"Does NOT work with Alexa. App desperately needs work.","reviewDate":"July 24, 2019","reviewText":"Pros and cons.\nPros: Clear picture. Zoom and pan work well. Choice of SD or HD. Price for this cam is good. SD card for playback. App opens to live video.\nCons: Does not work with Alexa. 90% false alarms. Indoor use only. App complicated to navigate. Yellow banner running across screen, (iCloud trial expired) unable to remove.\nBought this cam to work with Alexa. Company needs to fix this or stop advertising 'Works with Alexa'.\nDisappointed overall."},{"reviewerName":"scarletbutterfly","rating":"1.0 out of 5 stars","reviewTitle":"Won't Connect","reviewDate":"August 10, 2019","reviewText":"It's So Frustrating! I spent over an hour trying to get this thing to connect to my wifi. I followed the instructions and even saw a video on youtube to check if I was missing something. I guess I got a dud. I had also ordered other cameras from another brand & they connected with no problems & will be using those instead. This one has to go back because it just doesn't work. It's really cute but I can't rate its features because I can't use it."},{"reviewerName":"Bob Allen","rating":"4.0 out of 5 stars","reviewTitle":"A Camera That Just Works at a Good Price","reviewDate":"October 19, 2019","reviewText":"The price was right. The picture quality is excellent (though I can't figure out why, sometimes, it's monochromatic rather than color). I like the wide angle. I like that we can remotely reposition the camera and can check it anywhere we have an internet connection. There are a few things that prevent this from being a 5-star camera — these are more annoying than serious flaws:\n1. Occasionally, the app just freezes and we have to quit and restart the app.\n2. Every few days, the cameral loses its connection to our router.\n3. It's hit-or-miss on the camera recognizing the QR code to reconnect it to the router. That technology works extremely well in other applications (for example, my iPhone recognizes and reads a QR code very, very quickly), but is **VERY** tricky with this camera.\n4. The voice prompts when rebooting and reconnecting the camera to the router are annoyingly loud\n\nI wish that there was at least a free online storage account for a few days of video."},{"reviewerName":"iLovePrime","rating":"1.0 out of 5 stars","reviewTitle":"Won't connect to the Wifi","reviewDate":"July 30, 2019","reviewText":"I tried using the QR code, the AP mode, 15 times with the camera next to the router. I have 2.4ghz wifi, so it wasn't that. I have plenty of devices connected with no issues. This failed every single time. Extremely frustrating. Would not recommend."},{"reviewerName":"Karen","rating":"1.0 out of 5 stars","reviewTitle":"\"wait for a connection\"","reviewDate":"August 13, 2019","reviewText":"I can't believe all of these reviews that setup was \"so easy.\" I'm having The Worst time. Unit just keeps repeating \"wait for a connection\" The video Guide within the app doesn't even play on my phone. I have a dual band router and went through the whole process of disabling 5ghz to make this work on 2.4-- not even a hint that it was ever going to work. I'm very very very skeptical of the other reviews."},{"reviewerName":"erinj","rating":"1.0 out of 5 stars","reviewTitle":"Well I liked it while it still worked","reviewDate":"July 1, 2019","reviewText":"I had this camera less than a week and it stopped working. When you plug it in and it powers on, you are supposed to hear a voice. Well, I stopped hearing the voice and the red lights stopped coming on. I could not get it reconnected to the wifi either. I tried different cords as well as a different plug. Maybe I just got a dud but I will be returning it."},{"reviewerName":"Pen Name","rating":"1.0 out of 5 stars","reviewTitle":"I was dissapointed","reviewDate":"July 30, 2019","reviewText":"I was really excited about this item. The box showed a lot of features that would be perfect for daily use. I carefully read the set up instructions. I could not connect to wifi after trying for a whole hour. It suggested that the phone and camera be placed as close as possible to my router. I had the camerasitting ON TOP of the router and it still would not connect. Never got it to go any further because of this defect"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Good","reviewDate":"November 10, 2019","reviewText":"I'm a father of two kids and i have two cats one dog, my little girl is just 6 month.I bought this wifi camera to keep an eye on my families while I’m at work. I’m always work too late cuz i am designer.The package include a camera, user manual, mount & screws, and power adapter & cable, very easy to install just follow the instruction,the features of night vision, 2-way audio, intelligent tracking, and motion detection has exceeded my expectations,I can also talk to them at anytime anywhere,especially the motion detection trigger email alert make my families safer even in the night. I like being able to pan, tilt, and zoom with the app,I’m just using the camera through an app on my iPhone and iPad and the night vision still provide a clear image in the evening,the motion sensor is sensitive for detected car passed by, this make me very happy.\nOverall this camera has worked really well for me and what I need it for. It's packed full of lots of features and does everything it advertises really well. Works great with your phone from anywhere and the video quality is pretty impressive and detailed as well. It's also at a great price for the quality. Highly recommend."},{"reviewerName":"Russ Lefebvre","rating":"4.0 out of 5 stars","reviewTitle":"Worked once set up","reviewDate":"July 6, 2019","reviewText":"The instructions are misleading. When setting up it tells you to point to the QR code until it is clear and then move closer or farther until you hear the sound. So, like most other set ups you would point your PHONE at the QR code on the camera but the phone's camera never turns on so you can't line up the the very small QR code on the device. But, a QR code does display on your phone and you're suppose to point the CAMERA at your phone. Since there's no screen on the camera how can you point it at the QR code until it is clear? Other than that the camera seems to be working fine."},{"reviewerName":"sman","rating":"1.0 out of 5 stars","reviewTitle":"Defective after one week","reviewDate":"September 1, 2019","reviewText":"The camera worked fine for about a week. After that motion sensor quit working . At least that’s what I believe is going on. Red lights around edges stopped working and motion sensor alerts stopped coming to my phone. I’ve tried resetting device , rebooting device via the app and removing completely and reinstalling device. None of these options worked. I also contacted customer service but haven’t heard from them yet. Possibly some one knows of a fix for this problem if so it would be greatly appreciated. I bought this device for my dog that has seizures and the motion sensor is critical to help me keep an eye on her. As stated above it worked fine for a week so possibly it’s something i did with app although I’m very savvy with software and computers and I have checked all settings that may pertain to this problem but haven’t had any luck fixing. It may be a hardware issue. Please help"},{"reviewerName":"Daniel Navarro","rating":"4.0 out of 5 stars","reviewTitle":"Heimvision HM205 1080P Security Camera","reviewDate":"July 16, 2019","reviewText":"I purchased 2 of these cameras a few months back to replace my sons baby cam, as well as the living room cam. So I have previous experience with this exact model. Other than the occasional loss of connection and the annoyance of constant messages about signing up for the subscription service, (Which is not necessary for recording to an SD card).; the only real problem I have with this device is the fact that you can't watch live continuously without having to \"resume\" your viewing session. I use it primarily to watch my toddler son sleep and it's annoying having to resume each session while your sleeping and the audio would alert you to him waking up. Other than those issues, which could be improved with Developer updates... I recommend this camera for an affordable home security/baby cam."},{"reviewerName":"Emily A.","rating":"5.0 out of 5 stars","reviewTitle":"Nice compact camera","reviewDate":"June 6, 2019","reviewText":"*UPDATE* The humanoid detection needs some work. I left the house one day and received an alert that a human was detected and my heart dropped. It ended up just being my dog. Disabled the function and continue to receive similar alerts... Over all, the camera is small and compact. The clarity of the video is pretty good. Glad I purchased this camera."},{"reviewerName":"ADantzMan","rating":"3.0 out of 5 stars","reviewTitle":"Great value for the price, but lacking in useful features.","reviewDate":"July 20, 2019","reviewText":"The devices were easy to hook up and have a good picture quality. The night vision distance is a bit limited, but they seem good otherwise.\n\nThe downside to the cameras is there is no sound notifications within the app or on Alexa. We bought these as baby monitors and they are pointless if we can’t hear that a child is crying.\n\nAlexa functionality has good picture quality, but takes some time to actually connect. You also cannot control the camera via Alexa."},{"reviewerName":"shelby","rating":"1.0 out of 5 stars","reviewTitle":"Poor App","reviewDate":"September 8, 2019","reviewText":"I ordered this to be a pet monitor while I am away but I could never get the camera to connect to my wi-fi but had not issues when connected my Heimvision HMD2. When I originally downloaded the pixplus app it had poor rating in the apple store but I figured I would try anyways. I am returning this camera and getting another HMD2 for my intro monitoring. I really did not want to spend the extra money to have 2 cameras but I now know that HMD2 works well. Another feature I do not like about the Heimvision cameras is that they all use different smartphone apps. This does not make sense to me. Its all from the same company so they should all use the same application....another reason why I just ordered a second HMD2. You also have to pay for cloud storage but thats a whole other issue"},{"reviewerName":"Born on a Monday","rating":"5.0 out of 5 stars","reviewTitle":"Good little camera","reviewDate":"October 26, 2019","reviewText":"This camera was easy to hide on my kitchen window sill at the front door. So anyone entering and leaving activates the camera. It has settings to differentiate between \"humanoid\" and \"motion detection\" but I would not be bragging about that. When the cat gets on the counter it warns me that a \"humanoid\" was detected. Now, I love my cats but......\nIt is small enough that no one who has come into the house has noticed it. It films in color during the day and when the lights are off it is in black and white. It pans up and down and all around. I like being able to look at my phone to see what is going on. It is a great little camera."},{"reviewerName":"Cindi","rating":"5.0 out of 5 stars","reviewTitle":"Good for the price","reviewDate":"October 8, 2019","reviewText":"Very good product for the price! I wanted a camera in my house to check in on my teen and dog when necessary as well as keep an eye on the house when I'm away. The motion detection so far is mostly good, but only when in the field of view of the camera. It does not detect sound and move the lens towards the sound- but that would be a much more advanced device. It was easy to set up and I used a micro SD card. I'm not looking for something to pay monthly or yearly for (which is offered). This does not have any sort of battery, so it needs to remain plugged in to function (not what I expected when I ordered it) so I had to alter my plan for placement of the device."},{"reviewerName":"S. Vestal","rating":"3.0 out of 5 stars","reviewTitle":"HM205 Camera","reviewDate":"September 14, 2019","reviewText":"I purchased this camera in order to monitor my inside property while away from home. The setup of the camera was fairly simple and it worked as advertised. The camera does not have set points as the 203 version advertises, this would be a big plus if added. The zoom was just okay, there was a lot of distortion at the 4X setting. The two way voice was delayed and almost unrecognizable. The movement with the arrow keys does work but it is sooo slow. I was expecting a lot more since I have high speed internet. I do have other cameras and it is almost normal movement. Overall, I gave it 3-stars since it was not up with my other cameras. If you just need a simple monitoring devise this would probably work great. I did not check the night vision but I always leave light on so it should do okay. The tracking of a person was a plus. If you want to monitor your child or pet this would work great."},{"reviewerName":"Tim E.","rating":"4.0 out of 5 stars","reviewTitle":"Picture quality is very good","reviewDate":"August 21, 2019","reviewText":"I put this camera in my garage so I can see why my garage doors are still open and to make sure I can close them remotely. The camera picture quality is very good in both daylight and night vision. The only issue I have is with the two way audio. When I use it, the volume seems to be low so that is hard to hear sound coming from the camera. There maybe a setting that I am missing to adjust the volume. But overall very good camera."},{"reviewerName":"Dawn","rating":"3.0 out of 5 stars","reviewTitle":"Too sensitive to changes in light.","reviewDate":"July 26, 2019","reviewText":"For a cheap camera it's ok. Motion tracking works well. Quick notification on the app.\nUnfortunately it goes off when a light comes on or the sunlight shifts on the window. I'm sure my neighbors don't appreciate the alarm sounding every few minutes. Have changed the sensitivity to the least sensitive but it doesn't help.\nThere is a timer function so you can turn it off during a set time frame. Unfortunately it does not disable the alarm. I have an Echo dot and can tell it to torn on the camera, but it does not work to turn it off.\nProbably going to send this back if I can find a better one."},{"reviewerName":"L. K. Wells","rating":"5.0 out of 5 stars","reviewTitle":"Best value for the cost!","reviewDate":"October 5, 2019","reviewText":"I needed a budget video camera to see which of my cats was eliminating inappropriately. I can’t say enough about this one! It is fantastic - quick set up; clear, crisp images; and easy to use via the user-friendly app! I wish the cloud service was a bit less, we’ve had to switch to checking the SD card when reviewing. Once in a while the camera disconnects, but it’s so easy to reconnect it (sometimes it does it on its own, which leads me to believe its my fiber internet, not the camera itself). My son also bought one and it’s been perfect for him as well!"},{"reviewerName":"ja-jaaa","rating":"2.0 out of 5 stars","reviewTitle":"Much worse quality than HM211","reviewDate":"October 30, 2019","reviewText":"I bought a HM211 and decided to add another camera. Price of this one was slightly cheaper than the HM211 but not by much and I figured that was just due to the durability and additional antenna on the HM211. Nope.\nThis HM205 is junk. The image quality is horrible, and it can't see anything in low light.\nThe HM211 was so great in low light that it can see in the dark with the street lights. The HM205 can't see anything even with a light right in front of it. Terrible image sensor quality and must have like a f4 or higher aperture."},{"reviewerName":"Amazon Customer","rating":"4.0 out of 5 stars","reviewTitle":"Great camera for its price; nice features; average streaming speed","reviewDate":"September 25, 2019","reviewText":"I paid $30 for this camera; and I can say for its price its a great camera. Night vision really impressed me. In full darkness I'm able to see my living room and balcony very clear. The motion detection works as expected. You can receive a notification right away after the camera detects any motion; very fast response in that part. The video quality its pretty good; the optical zoom also is good. The camera rotates 360 degrees; so I put the camera at the top of my front door in which it has a crystal panel; I can see outside and it can rotate completely and I can see also my living room. It has presets so you can set and save different spots thats very nice. It has an alarm also in which you can enable if you want; Remotely you can speak by using the app no matter where you are and audio sounds right away loud and clear. My only concern is the streaming; its a bit slow when you want to see a recorded video that is on the cloud. You can set it with 2 options; to record it 24hr constantly or to record only when a motion is detected. Using the app you can see when a motion was detected and go straight to that part of the video and verify whats happening; the only drawback its that its not so fast; even that I have a 150MBps download / 15Mbps upload internet service. Another thing is that streaming is free just the 1st month; after that then you have to pay if $7 for 24hr record service or $5 for only when motion is detected. You can opt to use an SD card but you CANT access remotely the SD Card to check your videos; you have to remove the SD card from the camera; so sad that you cant access the SD card remotely. I hope HeimVision improves the streaming service to me faster then it would be an excellent camera. I highly recommend this camera for low budget buyers. Its the best low budget camera you can get."},{"reviewerName":"Leslie","rating":"3.0 out of 5 stars","reviewTitle":"Really should come with micro SD card","reviewDate":"October 17, 2019","reviewText":"The camera is fine. Extremely easy to set-up. They aren't kidding when they tell you to be near your router. It is a different app (PIXPLUS) than the battery powered camera HMD2 (HeimVision app) and that is really annoying and not disclosed until you get the camera home. The sensitivity is fine. Not the most outstanding picture. They really need to include the micro SD card. I happened to have a couple floating around the house so I can go back and view history on the app. Gotta have. I do not have the cloud service."},{"reviewerName":"MirceaT","rating":"5.0 out of 5 stars","reviewTitle":"Good wifi camera","reviewDate":"October 12, 2019","reviewText":"Very good camera. It delivers clearer HD images than those of 720P. I setup the camera to auto tracking and I use it to check what the cat does when alone at home. Detection sensitivity, off time period and sending time for notifications, the period & frequency, can be set as you wish and I really appreciate it. Up to 10 meters the night vision in low light provides a clear image. I would like it to have a longer range (15-18 m). I did not use the cloud service but a SD card. Great product! I like it so much, therefore I will purchase 2 more. It works on 110-220V ."},{"reviewerName":"Reagan Chan","rating":"2.0 out of 5 stars","reviewTitle":"Doesn't have a stable connection and sound quality is poor","reviewDate":"September 9, 2019","reviewText":"I've have been using this camera for about 2 months now. At first, the camera seemed okay. Everything was working like it should. However, about a month into using this product, I began to experience issues. The camera's video quality is okay but it constantly drops the connection. 1 in 5 times when I check the camera, it says \"offline.\" I have to unplug it and plug it back in for it to reboot. I tried doing a device reboot from the app but it didn't do anything. Also, the sound quality is not good. I have to turn my phone volume all the way up before I start to hear anything. When talking, there is a lag. I see the person's mouth moving, but the voice lags. It's almost like watching an old martial arts movie. I would not recommend this product."},{"reviewerName":"Angel Payton","rating":"1.0 out of 5 stars","reviewTitle":"Terrible","reviewDate":"August 16, 2019","reviewText":"UPDATE: this camera worked a month then it continued to crash, and the app stopped supporting my WiFi. Completely waste of money!!\nI purchased this can on prime day, so I got a good deal. The picture quality is blotchy and the color is very faded. It also has a delayed alert for motion. I gave this camera a 4 because it's able to pick up motion and follow the source, as well as the night vision is good. I personally wouldn't use this as a primary security camera, due to the delays and quality."},{"reviewerName":"Eric","rating":"5.0 out of 5 stars","reviewTitle":"Easy set up picture quality is good for price.","reviewDate":"October 18, 2019","reviewText":"The set up for the camera was beyond easy. It took less than ten minutes. Next, I was impressed with the camera’s ability to stay connected even in areas with a weak WiFi connection. Currently I am using it to keep an eye on my new axolotl. I have found that even though the room gets not an incredible amount of sunlight, at almost all times, the camera remains in night mode which is rather annoying as it diminishes the picture. I would recommend but I would say it is better in light than dark. Good buy for the money."},{"reviewerName":"Jeff M","rating":"3.0 out of 5 stars","reviewTitle":"Was better until they 'updated' the app","reviewDate":"September 8, 2019","reviewText":"Was much better until they 'updated' the app. Used to go landscape by merely turning the phone sideways either clockwise or counter clockwise, now you must hit an icon, then it only goes landscape in one direction, counter clockwise. This is a pain when the plug is attached from the left.\nAlso, it has dropped signal numerous times since updating the app. I had to come home to reboot. Not what I want when monitoring things at home.\nHad to return."},{"reviewerName":"neicy","rating":"1.0 out of 5 stars","reviewTitle":"HAVING A REAL PROBLEM WITH APP/WIFI /CAMERA CONNECTION","reviewDate":"August 8, 2019","reviewText":"I AM HAVING THE WORSE TIME WITH THE APP ON MY IPHONE-- I CANNOT GET A CONNECTION FROM CAMERA TO WIF-- THE STARTER GUIDE VIDEO WILL NOT LOAD--- I BOUGHT TWO OF THESE CAMERAS THINKING I WOULD BE ABLE TO INSTALL OUTSIDE -- NOT POSSIBLE. I WILL HAVE TO SIT THEM ON THE INSIDE WINDOW SILL --IF I EVER GET A CONNECTION. I WILL GIVE A REVIEW--IF I EVER GET INSTALLED."},{"reviewerName":"Shortgirl1307","rating":"5.0 out of 5 stars","reviewTitle":"Incredible product for an even more impressive price","reviewDate":"September 21, 2019","reviewText":"This is my second Heimvision camera and it is better than the first one which was the HM203 model. I use them mainly to watch my son while he is napping and home security. I 100% recommend this camera!! The are inexpensive and there are settings in the app where you can have it record any time a sound or motion is detected without subscribing to the cloud (which is easier but I don't have the money to spare). I use a 128GB Class 10 micro SD card and everything is stored there."},{"reviewerName":"MyName","rating":"1.0 out of 5 stars","reviewTitle":"Do Not Buy - Amazing in one way....What complete garbage it is.","reviewDate":"June 25, 2019","reviewText":"Besides the camera being the slowest camera I've ever had experience with when moving it up/down & left/right.\nOn top of that, (at least without a subscription, The thing never detects motion and thusly never alerts me.\nAs to subscription, if this company thinks that I am going to PAY FOR A subscription , they NEED TO RETHINK THEIR BUSINESS MODEL.\nI've read the direction. I found it easy to setup. It is simply a garbage device that Amazon will be getting back."},{"reviewerName":"Pahu3","rating":"5.0 out of 5 stars","reviewTitle":"Heimvision HM205 Camera is a very good quailty item","reviewDate":"September 2, 2019","reviewText":"The Heimvision HM205 1080P Security Camera is just what we needed. It came to us in a timely manner and was packaged very well. We plan to use it in our RV and at home when we are not traveling in our RV. Our main reason for purchasing it to what our 3 dogs. I set it up today in our RV and I was amazed at how easy it was to setup and how well it functions. The video is clear and flows perectly. I highly recommend it."},{"reviewerName":"Jake","rating":"5.0 out of 5 stars","reviewTitle":"Excellent quality for DIY camera","reviewDate":"October 15, 2019","reviewText":"It's pretty incredible what you can get for such low prices these days. I purchased this camera for a friend with a special needs child. My friend was extremely happy with the motion detection in the hallway viewing the staircase. he showed me how he could check in on his son and warn him if he were getting into something he shouldn't. For the cost, I would certainly recommend this for a Wifi camera application."},{"reviewerName":"Mike & Kim","rating":"5.0 out of 5 stars","reviewTitle":"Easy to use app with camera!","reviewDate":"September 11, 2019","reviewText":"Easy to use app on the phone (picture included) able to preset angles of the camera to see certain common areas with your camera so you don’t have to joystick the image all the time. Sound to talk through the camera isn’t the greatest, but we don’t use that feature anyway. Sometimes false always movement when sun intensity changes in the day, but rather over detect than under detect! So far, very happy with this camera."},{"reviewerName":"Holly","rating":"5.0 out of 5 stars","reviewTitle":"Highly recommended","reviewDate":"June 18, 2019","reviewText":"This camera has a great picture and really works well for me to check on my aging dog while I am at work. The set up was a little difficult for me but due to no fault of the camera. It runs on 2.4GHz and we usually use 5 so getting this to connect to the 2.4 was not an easy task. Once we figured it out though it was incredibly easy. My daughter loves talking to the dogs through it and we can check on them anywhere. I would highly recommend this camera!"},{"reviewerName":"Eric O.","rating":"4.0 out of 5 stars","reviewTitle":"Quality camera for basic security","reviewDate":"June 29, 2019","reviewText":"Works as advertised at a great price. Picture quality is excellent and you can zoom and pan using the touch screen on your device. Sometimes you need to relaunch the program for the camera to go live (not a big deal) and lots of prompts to purchase cloud storage for video recording. So far so good. Haven't really tested motion detection, but settings available for motion sensitivity. Recommended for basic security to keep an eye on the house."},{"reviewerName":"-anon-","rating":"4.0 out of 5 stars","reviewTitle":"Simple to setup, easy app to use and quality is good","reviewDate":"September 15, 2019","reviewText":"You can switch between SD and HD quality and it does make a difference.\nImages are from three scenarios, with light, only monitor light, and lights out respectively.\nFor the price I paid, the camera is well worth it and comparable with more expensive camera.\n\nAs for the automatic detection feature, it is a hit or miss for me.. sometimes it is too aggressive and when the room is quite you can make out the cameras motor adjusting the camera.\n\nAnd the quality image when it is all dark is abit washed when I compare to my Mi 360 HD camera.\n\nFor now, the basic features works for me and I use the SD card for storage and not the cloud (you have a special offer if you want to opt for that option).\n\nWill leave feature update after using this for a while."},{"reviewerName":"Caleb hill","rating":"1.0 out of 5 stars","reviewTitle":"Stopped working after 12 hours","reviewDate":"July 2, 2019","reviewText":"Pain in the butt to setup but finally had it working. Woke up after first night to a message that the camera was disconnected. Would not turn on after that. Picture quality is NOT 1080! Spend a few more dollars for a better product."},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Easy to install & AFFORDABLE!!!","reviewDate":"September 23, 2019","reviewText":"I was looking for a security camera that can notify me when my kids leave for school and arrive home safely. After researching on the best and affordable camera this was the one I decided i was going to try out and if it wasn't what I expected i could simply return it. But to honest, i have no regrets! Easy to install, Easy to understand. Night vision is awesome. The human intelligence detection on point. I am notified when the outside camera detects anything going in and out my front door. With its 360° turning smart camera, it can record and pick up any movements outside with its motion sensored features. I feel less worried knowing my kids arrived home safely and knowing I can watch what they're doing inside the house. Monitoring the studies and best yet, i can speak directly to them 2-way using the camera. It is very Affordable. I feel its better that the $100+ security cameras out there."},{"reviewerName":"Stefanie","rating":"5.0 out of 5 stars","reviewTitle":"EXCELLENT CUSTOMER SERVICE","reviewDate":"August 21, 2019","reviewText":"UPDATE: the company saw my review and immediately reached out to me and offered to replace my camera at no cost. They shipped it out and I got it a couple days later. Works great! Thank you so much for such excellent customer service!\n\nOriginal Review (3 stars)\nI got this in order to check up on my dog during the day. The image and sound are awesome - and I love the size of the camera. the one negative is the camera wont rotate more than half the time. I have had to reboot it already several times and still have these issues."},{"reviewerName":"Natickma","rating":"1.0 out of 5 stars","reviewTitle":"Doesn't work with Alexa","reviewDate":"August 3, 2019","reviewText":"Connecting the camera to my network wasn't too bad. Using the camera through my phone worked also but, I don't stare at my phone all day like some people. Trying to connect to Alexa didn't happen. The camera is made by Heimvision but to connect to Alexa a skill called Closeli is needed. There were 15 reviews of Closeli all one star with very negative comments. The only way to view this camera is through your phone. No thanks."},{"reviewerName":"Jayson D.","rating":"4.0 out of 5 stars","reviewTitle":"Great overall camera for viewing or recording when not at home!","reviewDate":"August 17, 2019","reviewText":"Great camera that serves its purpose to record and view an area when your not at home. I used it specifically to watch my kitten when she was held in a confined area of the living room to see how she was doing and what mischief she was getting into. The picture quality is quite good as well as the night vision. The ability for the camera to act as a 2 way communication device as well as nearly 360 rotate ability is great to check up on my kitten and scold her if I see her getting into any mischief. The motion detection was a bit buggy as it would constantly move and the notification system isn't that great as you get random notifications. Overall a very decent home surveillance camera!"},{"reviewerName":"Addicted Shopper","rating":"5.0 out of 5 stars","reviewTitle":"Good camera for the price!","reviewDate":"October 26, 2019","reviewText":"Nice little camera for a good price! I was impressed how well it works for how much I spent. The app was easy to set up but set it up manually, don’t scan code. I like that I can see what’s going on with my kids, dogs, if I’m gone. Night vision is good too as long as there aren’t bright lights shining in the camera. Motion detection works well too."},{"reviewerName":"Robert J Lorimer","rating":"5.0 out of 5 stars","reviewTitle":"Great Camera!","reviewDate":"August 1, 2019","reviewText":"I purchased the HM205 camera because I read the reviews and decided to take a chance. And I’m glad I did! I love this little camera. It does everything I want / need and it works so well. And the app is very easy to use. I saw some negative comments about connecting to the internet and the app but I had no problems with either. The camera works so well I purchased two more!! I would recommend it to anyone looking for a good camera at a great price!"},{"reviewerName":"CARTI","rating":"5.0 out of 5 stars","reviewTitle":"Great buy","reviewDate":"October 2, 2019","reviewText":"Camera was easy to install and setup. I bought it for all the features including Alexa capability. I have used it on my Echo Show 5. It was really convenient, no need to get the phone and open the app. It has motion detection, night vision, pan/tilt, audio, notifications. The audio is good enough for my cat to get interested and knock it off the shelf :) I am happy with this camera and hope it will last a long time."},{"reviewerName":"Tinka608","rating":"5.0 out of 5 stars","reviewTitle":"Great sound","reviewDate":"July 28, 2019","reviewText":"This camera came in as a whole unit ( no assembly\nrequired ) with easy to follow instructions and once plugged in gives you prompts for easy connection. The 2 way audio is really clear and easy to understand the person speaking. The video is remarkably clear considering the affordable purchuse price. Considering buying one for my 3 year olds room as well."},{"reviewerName":"Wendell","rating":"5.0 out of 5 stars","reviewTitle":"Low cost, high quality indoor cam, software needs an improvement","reviewDate":"June 22, 2019","reviewText":"Using it to monitor the basement activities. It appears to be low cost but well made. Did not realize that the the iOS app on camera installation only works with iPhone and not iPad. Also, the image can only be watched on app, not on browsers like Safari. Once setup, the image is excellent and the night vision also works well on my iPhone. I especially like it’s ability to remotely control lens rotation/tilt from the iPhone app.\n\nUpdate: reinstalled the app on my iPad Pro and I am able to view the image, making it a 5 star product. However, I still want to see the app a bit friendly in installation on iPad."},{"reviewerName":"jimmy","rating":"5.0 out of 5 stars","reviewTitle":"it tracks and follows motion. nice camera","reviewDate":"July 17, 2019","reviewText":"it was really easy to setup... instruction was easy to follow. all around picture quality is really good. the motion is great, camera follows moment with intelligent tracking. speaker is nice and clear."},{"reviewerName":"V. OConno","rating":"5.0 out of 5 stars","reviewTitle":"Love this!","reviewDate":"September 6, 2019","reviewText":"I purchased two of these to keep an eye on my cat who suffers from separation anxiety while I am away. They are quiet when panning and have good picture quality in both light and dark situations. I love that I can talk to her and reassure her when I can't be there with her.... much better than trying to give her medication! They are a good quality product at a good price. The only caveat is the software to for viewing doesn't work as I'd like. There is a scheduling option, but it only turns off the camera, but not back on. I have not been able to figure out how to cancel the setting so I have to turn it back on everyday."},{"reviewerName":"Rick S.","rating":"3.0 out of 5 stars","reviewTitle":"okay","reviewDate":"July 21, 2019","reviewText":"I have other brand security cameras. Set up was easy. Picture not so great. Instruction manual doesn't describe how to use all the features. Youtube reviews are not using the current PixPlus app I have. Takes a while for the live video to show on your phone screen and there is quite a long lag compared to my other brand security cameras. Not ecstatic with this camera, but will keep."},{"reviewerName":"David","rating":"4.0 out of 5 stars","reviewTitle":"A good purchase.","reviewDate":"July 21, 2019","reviewText":"So far very pleased with this camera. I previously had several cams from a different maker for home security and viewing but they began to lag and have spotty connection. So I have replaced them all with the HM205 and connection is great. Previous cams had slightly better image quality but these are more than acceptable and reliability has been awesome. Notifications are quick. It's great for the price."},{"reviewerName":"tomwadek","rating":"4.0 out of 5 stars","reviewTitle":"So far better than wyze camera","reviewDate":"September 22, 2019","reviewText":"So far so good. I bought this to replace my wyze camera. That camera is too unreliable. It keeps resetting. This camera has better functions and I like the pan angles a lot more.\n\nI wish the event recording was free for 3 days or so. I wish we could have the option to event record for certain durations like 10, 20, 30 seconds."},{"reviewerName":"McBRIDE","rating":"4.0 out of 5 stars","reviewTitle":"Doesn’t use same viewing application/camera registration","reviewDate":"September 16, 2019","reviewText":"I purchased with the Heimvision wireless rechargeable devices and will have to return this wired camera. They don’t use the same viewing application. It’s the same company so why not? I find it to be an inconvenience. I also didn’t think about that each camera is charged individually for cloud space."},{"reviewerName":"Dennis W.","rating":"2.0 out of 5 stars","reviewTitle":"glitchy","reviewDate":"September 1, 2019","reviewText":"There are few things i am not satisfied with. Lag for 1. Notifications stopped even though its on, and its got no schedule. I cant reach the support through the app because I dont speak, chinese IDK? I only know english so I have no idea what the questions are to ask for more support. It doesnt Motion track well, and cuts off after a certain point, even though its set up to follow for a while. . The cameras does not work with black dogs, incase you have black pets to watch. The mic is useless."},{"reviewerName":"Whipster1","rating":"4.0 out of 5 stars","reviewTitle":"Good Camera","reviewDate":"July 3, 2019","reviewText":"We had a little trouble connecting the camera to the network but did get it done. We did lose our free month of cloud storage due to having to remove and reload the app/camera on the phone. Once we got the camera synced up it worked well. I would recommend buying this product but take the installation slow and careful. I have contacted the manufacturer to get our free month of cloud storage reinstated. I will follow up on this review when I receive word back from them."},{"reviewerName":"Amazon shopper","rating":"1.0 out of 5 stars","reviewTitle":"junk","reviewDate":"October 2, 2019","reviewText":"This camera is a piece of junk. 0 stars.\n\nThe motion sensing, even when turned up to max sensitivity does not alert 100% of the time. This camera is being used to track cat litterbox issues so missing alerts is not helping my situation.\n\nIn addition to the missing motion alerts this canera disconnects from the wifi often, too often. I even bought a wifi booster to help it get enough signal; it still disconnects every couple days. And then today i couldnt get it to reconnect at all.\n\nNot worth the lower price. Ill be searching for a better option."},{"reviewerName":"DangerMouse___","rating":"5.0 out of 5 stars","reviewTitle":"Great cam for the money, very user friendly.","reviewDate":"July 22, 2019","reviewText":"Super easy set up, and if you choose to use the cloud subscription, it's easy to enroll in and easy to cancel. Also extremely easy to pair with Alexa. Smooth room planning...instantly tracks where you are trying to look from the app when you drag your finger in the direction you want to look. Great camera for the money. I would suggest buying an extra long power cable if you want to mount it up high."},{"reviewerName":"Suzie","rating":"4.0 out of 5 stars","reviewTitle":"No picture delay.","reviewDate":"July 22, 2019","reviewText":"Picture with light is clean and clear. Night vision is not as good as my previous camera but there is no picture delay like I had on previous camera so satisfied. Setup was easy if you followed directions and received email immediately. Just received today so will update review if necessary."},{"reviewerName":"joy","rating":"5.0 out of 5 stars","reviewTitle":"It’s a great little camera!","reviewDate":"August 7, 2019","reviewText":"Great little camera!The camera is super clear.Install was super easy too. Downloaded the app, followed the instructions and it all took about 10 minutes. I love that the camera itself can turn around and go up and down. I am probably going to get another one for in our house. I highly recommend this camera!"},{"reviewerName":"Remy","rating":"5.0 out of 5 stars","reviewTitle":"Easy set up - great price","reviewDate":"July 7, 2019","reviewText":"This is by far the best camera that I’ve purchased from amazon. I’ve tried other before but had trouble setting them up. This one was very easy to set up and it works great. I love that I can watch the video stream on my phone to keep an eye out on my dog while I’m away from home. I highly recommend this camera"},{"reviewerName":"KS","rating":"5.0 out of 5 stars","reviewTitle":"Reliable inexpensive camera","reviewDate":"August 1, 2019","reviewText":"This camera works well, use to watch dogs when I'm not home. Need to mount on wall or ceiling to get picture to view right side up. Can set camera for motion control and track movements. Can talk through camera if want. The only negative thing for me is the app to control camera can freeze at times. App needs improvement."},{"reviewerName":"Judy Sanderlin","rating":"4.0 out of 5 stars","reviewTitle":"Buy This Product!!","reviewDate":"September 27, 2019","reviewText":"I love this product for the price I paid! I've had more problems with the ring camera than this one and I bought three for the price of one ring camera. The quality is good and with the right SD card you do not have to pay for the monitoring services. I just use my camera to watch my cats which it does very well! The only set back is that I cannot use it with my echo show and the instructions don't match up."},{"reviewerName":"JustHonest","rating":"5.0 out of 5 stars","reviewTitle":"Great cam to have and it works surprisingly well!","reviewDate":"August 19, 2019","reviewText":"Easy. Simple. Intuitive. Stylish. Reminds me of Eve from Wall-E movie in a way. lol. This is what I just needed and the value was perfect for me. I live in an apartment and as a just in case I wanted to make sure I was protected a little more. Picture quality is pretty clear. Comes packaged very nicely and protected as you see in the picture I provided and not just thrown around. I would buy another to have it look out the window for my car. Again just a little extra protection. Hehe."},{"reviewerName":"Charis Khavin","rating":"5.0 out of 5 stars","reviewTitle":"Good for the squirrels","reviewDate":"June 11, 2019","reviewText":"Perfect for watching my animals! I elected to use an SD Card and set this device up in under 10 mins to watch my squirrels. Night vision is clear enough and app controls are easy to use. The message feature is pretty neat. I am a bit confused on Alexi interaction ad also struggled with wifi connection set up."},{"reviewerName":"JJ","rating":"1.0 out of 5 stars","reviewTitle":"Very disappointed...","reviewDate":"September 1, 2019","reviewText":"Set up was pretty easy but didn't have to use them until recently and they are junk. The app shows them disconnected but they were tracking me. Then the app wouldn't work and while out of town, no alerts.\n\nNow I'm stuck with them and going with Reolink which works flawlessly."},{"reviewerName":"Jayllen","rating":"5.0 out of 5 stars","reviewTitle":"Useful features","reviewDate":"July 25, 2019","reviewText":"I received this item like a week ago and I must say the install process and getting it up and running where great! We were very happy that it was able to cover my baby’s room. The best part is it has a two way speaker so u can talk through it and hear what’s going on in the room when I am not at room with my boy. The camera is very small and easy to use. I would definitely recommend to anyone."},{"reviewerName":"cuse165","rating":"5.0 out of 5 stars","reviewTitle":"Really like them","reviewDate":"October 12, 2019","reviewText":"I love the cameras they are super simple to use. Picture quality is very good and all the features work nicely. I love the Android app that the cameras use its very easy and simple works good. Setup was easy a few steps and you are done. I like how the camera talks and tells you what state its in. If your looking for a cheap camera I recommend this product."},{"reviewerName":"magid","rating":"5.0 out of 5 stars","reviewTitle":"Installation is easy","reviewDate":"June 22, 2019","reviewText":"This camera was exactly what we needed for front and back door surveillance from the inside.\nEasy installation was key and the price made is commit."},{"reviewerName":"Mei Ku","rating":"5.0 out of 5 stars","reviewTitle":"Awesome camera","reviewDate":"July 31, 2019","reviewText":"Easy to install, Instructions is very clear. I use to monitor my dog in the house! I can use to watch around the house and see what he’s doing. It have multi function, he can hear what i say from the camera , when my dog walk by the camera, the motion detect function will alert me, one more important function, the night Vision of the camera is very clear too!!!Great camera, great price!!!"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"I like to confuse my dog","reviewDate":"October 10, 2019","reviewText":"I like this camera a lot. It gives me a piece of mind while I'm not home. The night vision is really good as well although it lights up red around it on night vision which is a tad creepy. My favorite part is using the speaker to ask my dog if he's supposed to be on the couch (he's not) just to watch the confused look on his face. I'm a terrible person ."},{"reviewerName":"Quality Checker Dan","rating":"3.0 out of 5 stars","reviewTitle":"Okay camera","reviewDate":"June 3, 2019","reviewText":"Good entry level indoor security camera. Very easy to operate in the app to move it in direction you want. Solid build feel to it. I like that you can place a SD card in it. Wish better video quality sharpness and I wish cloud storage was free, and google home support would be nice as well."},{"reviewerName":"thisismypenname","rating":"5.0 out of 5 stars","reviewTitle":"Well with the money !","reviewDate":"August 9, 2019","reviewText":"Very fast shipping, the set up with QR scan was a bit tricky and couldn’t get it to connect to the network after a few tries, as the connection always failed, but after switching to the 2nd method with hot spot, it finally worked on the first try, after that everything went smoothly. Connection to Alexa was quite easy too. So far it seems to be working very well. I pointed the camera to my front door, and every time someone goes near or comes in, I get an alert on my phone that reports this activity- great for peace of mind"},{"reviewerName":"JenniM","rating":"4.0 out of 5 stars","reviewTitle":"Definitely worth it!","reviewDate":"June 29, 2019","reviewText":"Love the Heimvision camera! Took off one star as its advertised that you get 30 days free cloud service and I only got 3. Can’t beat it for the price nice little cam, great app and really clear picture. Love the night vision and ability to pan."},{"reviewerName":"Justin Brisbon","rating":"5.0 out of 5 stars","reviewTitle":"Very Easy to use and set up","reviewDate":"November 13, 2019","reviewText":"For the price point great product. light, easy to set up and easy to use. The only thing I do not like about it is the delay in motion. there is also a delay in sound. but this will be great to keep an eye on a sleeping baby in the next room. all in all good product. I also like it comes with hardware to mount on you wall. I will be mounting on my wall tonight, but may not want to punch holes in my wall, so maybe Command Strips will work since it is so light. (lbs strips should do the trick."},{"reviewerName":"Hannah Parker","rating":"2.0 out of 5 stars","reviewTitle":"Bummer","reviewDate":"November 7, 2019","reviewText":"This camera has a clear picture, even with night vision. The motion sensor works, although the alert is a little lagging. That's not my problem with this device.\nI originally got it because it came with the mounting equipment and was a bit cheaper. Big mistake.\n\nIt constantly disconnects itself, the two way microphone system/movement is lagging, and it just seems cheap overall. I'm pretty bummed about it. I will now be spending even more money on some more reputable devices, like I should have done in the first place."},{"reviewerName":"beww","rating":"5.0 out of 5 stars","reviewTitle":"Great Camera for a Great Price","reviewDate":"August 14, 2019","reviewText":"Does everything it claimed to do quite well.\nI was getting false motion detection, turned out to be shadows on my metal blinds from outside. Reducing sensitivity solved this.\nThe best thing I can say is I bought one, skeptically, mainly due to the low price. When I received it and tested it out I immediately ordered 2 more. :-)"},{"reviewerName":"Leshock Household","rating":"5.0 out of 5 stars","reviewTitle":"Great picture!","reviewDate":"August 15, 2019","reviewText":"Easy to setup and has a really good quality picture. The night vision is also very clear. One second behind or so, but that isn't an issue for me. The two-way audio also works well. The 3 day storage for free is also a plus! Overall I'm happy with this purchase."},{"reviewerName":"GB","rating":"4.0 out of 5 stars","reviewTitle":"Great for the money","reviewDate":"September 2, 2019","reviewText":"I purchased 3 of these wireless cameras to monitor elderly relative and pets, while on vacation.\nCameras worked fine for approximately two weeks, when they disconnected one by one (not at the same time, several minutes apart, so it wasn’t power failure).\nUpon coming home and unplugging and plugging them back in, everything seems to be working fine again.\nDon’t know if disconnection was a fluke, or it happens regularly, as I owed the cameras for only a month.\nG.B."},{"reviewerName":"Jessica","rating":"2.0 out of 5 stars","reviewTitle":"Connection not working","reviewDate":"October 22, 2019","reviewText":"I loved this camera. The value for the price was perfect until it stopped working. I tried to reach out to the company for assistance and got a bounce back email. I basically paid for something that stopped working for no apparent reason. It won’t connect to my network no matter how many times I restart my router, delete and re-download the app, or try to uninstall and re-install it. Lots of time wasted trying to make it work."},{"reviewerName":"Adontai","rating":"1.0 out of 5 stars","reviewTitle":"Not what I expected","reviewDate":"September 20, 2019","reviewText":"This camera did not live up to the hype. Very unhappy with this purchase and the user interface is odd and possibly misleading. I couldn't tell whether i was suppose to pay for cloud storage or what and could not figure out where video files and photos were saved."},{"reviewerName":"shawn","rating":"5.0 out of 5 stars","reviewTitle":"Worth to buy","reviewDate":"September 25, 2019","reviewText":"Easy to setup step by step if you following instruction.After you connect your cellphones to camera,it can notice you if someone go in your house or room when you go out .You can control camera 360 degrees look around your house and see the pictures clearly but at night you can barely see the someone’s face through camera.I’m ok with this purchase because the camera can tell me if someone go in my room that is all I need."},{"reviewerName":"Alexandra Agosto","rating":"3.0 out of 5 stars","reviewTitle":"Not bad for the price","reviewDate":"August 26, 2019","reviewText":"Honestly, this camera works well for what we wanted. It has pretty good quality and I like being able to check on my son when he is sleeping or if someone else is watching him. It does work with Alexa but it was really difficult to get it to work. I had to completely reset my camera and struggled for a while to get it to load properly. Also it is very dependent on wifi. So if you wifi is not strong enough in the room it is in it's going to give you a hard time. The wifi and struggle with alexa is what is making me give it 3 stars. If it wasn't for those it would easily be a 5 star camera"},{"reviewerName":"Splash","rating":"5.0 out of 5 stars","reviewTitle":"Heimvision HM205","reviewDate":"August 24, 2019","reviewText":"Excellent security camera. I use it to monitor our dog. Excellent two-way communication. I did own Guardzilla cameras but changed to Heimvision because of the quality of the camera and the technical support with a live person when you need it."},{"reviewerName":"Lisa Gabriel","rating":"4.0 out of 5 stars","reviewTitle":"Decent camera for the price.","reviewDate":"August 23, 2019","reviewText":"I love the camera, when it actually works. Gave it 4 stars bc for the price I paid it works well, however I am CONSTANTLY resetting it and it will go offline when I am trying to view the video. Night vision works well. I also really like the 360 turn around view."},{"reviewerName":"Utmost","rating":"5.0 out of 5 stars","reviewTitle":"Cant beat it for the price","reviewDate":"October 20, 2019","reviewText":"My wife and I wanted a camera that could check in with the dog throughout the day. this camera allows us to easily see within the app what the animals are doing and you can even talk to them through a built in speaker. Awesome value for the price."},{"reviewerName":"Hinton Brenda","rating":"5.0 out of 5 stars","reviewTitle":"Good camera for dog monitor","reviewDate":"June 27, 2019","reviewText":"It’s a great camera with the easiest setup and usability. I was very impressed with this camera for it’s excellent vision. Because I am always busy in working. I bought a camera record my dog's daily life. I use it as dog monitor. This camera can move around automatically or controlled on mobile. The room can be observed clearly. The motion tracking and detection is great, it works well. You can use a memeory card for recording. In order to use the camera you need connect your phone with camera. setup is very straightforward as following instruction. All in all, it’s worth buying."},{"reviewerName":"Susie Q","rating":"4.0 out of 5 stars","reviewTitle":"Easy to install and use","reviewDate":"September 12, 2019","reviewText":"The camera is easy to install - hardest part was remembering my network password. Picture quality is good. Has alarms that are easy to turn on and off. Motion and humanoid detection good. Will use as a Granny Cam to watch over my mom!"},{"reviewerName":"Seda","rating":"4.0 out of 5 stars","reviewTitle":"Pros cons","reviewDate":"August 24, 2019","reviewText":"Great for use. Not best if you traveling. Troubleshooting must be done physically. So if you are away and 2 days later something is up with it you need to get back to camera and do reset. Cameras volume cant be lowered. So when there is a problem or lost of connection camera is keep talking:) a bit annoying. Other than theese i didnt see any issues"},{"reviewerName":"CBL","rating":"4.0 out of 5 stars","reviewTitle":"Heimvision HM205 For the price is great option","reviewDate":"August 19, 2019","reviewText":"I bought the cam for basic security, to watch my dogs when I not in home and its great.\nEasy to setup with the app, if you read the instruction.\nThe video works great to watch live, both in daylight and at nighttime. The night vision works well.\nwith Amazon Alexa (for example, with my Echo Show), is that you need to buy an ADDITIONAL 1-year storage contract with the camera company for the camera to work with Alexa!"},{"reviewerName":"ABELARDO JOSE BANEGAS","rating":"4.0 out of 5 stars","reviewTitle":"Very good product!!","reviewDate":"September 5, 2019","reviewText":"So far, so good. Great camera for the money. Product was easy to setup with the app, but the instructions could be better, not 100% clear. Works as advertised, the picture quality is good and you can zoom and pan using the touch screen on your device. I have only used the product for a month"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"love this!!!","reviewDate":"August 5, 2019","reviewText":"I got it fast. It sits on my refrigerator and watches my back door. The humanoid tracking camera feature is space age! the camera will follow and take continuous video of whatever human walks by. It has night vision. It has two way communication and I get to say \"hi\" to my brother and he wakes up after I leave for work when he's making himself coffee in the kitchen. I am going to get another. There is also a coupon with this camera. Easy to install."},{"reviewerName":"Trezur","rating":"5.0 out of 5 stars","reviewTitle":"HONEST REVIEW!","reviewDate":"August 18, 2019","reviewText":"We just purchased our HeimVision camera from amazon expected arrival time next Tuesday and it arrived this Saturday afternoon. We hooked it up, downloaded the app and it instantly started working the minute we connected to wifi. We love this camera although recording is a small fee it is worth your time and money. I spent a little over $30 with a automatic 10% discount with a 3- year protection plan.Very High Quality for a great deal I would Highly recommend it to anyone who experiences unexpected property management or for any security purposes. 5 Stars!!!"},{"reviewerName":"Raqz","rating":"4.0 out of 5 stars","reviewTitle":"Pretty good camera for the price!","reviewDate":"September 30, 2019","reviewText":"It is small and very light, has a pretty good video quality although when it views outside with the bright sunlight it gets a bit blurry. Otherwise picture is good. There are just 2 things i didn't like about it: 1: one time from work the camera just failed and showed error and cant view anything and have to reset the camera with my phone again. 2: There is about a 3-4 second delay in the audio when you are trying to talk to the other person/side."},{"reviewerName":"Ro","rating":"4.0 out of 5 stars","reviewTitle":"Excellent camera but REQUIRES a SUBSCRIPTION to work with Amazon Alexa!!","reviewDate":"July 22, 2019","reviewText":"Very easy to set up; excellent picture quality on iPhone, BUT what you are not told upfront when they say it works with Amazon Alexa (for example, with my Echo Show), is that you need to buy an ADDITIONAL 1-year storage contract with the camera company for the camera to work with Alexa!"},{"reviewerName":"headclouds","rating":"5.0 out of 5 stars","reviewTitle":"Does it's job","reviewDate":"August 22, 2019","reviewText":"No complaints from me. I use it to monitor the dogs and house and it works. Haven't had any issues yet. Haven't tried night-vision, so can't comment on that, but otherwise a clear daytime image. Does detect motion and sends out alerts. Haven't timed it so not sure if there's a delay or how much of a delay."},{"reviewerName":"Eliz","rating":"4.0 out of 5 stars","reviewTitle":"Good value","reviewDate":"August 22, 2019","reviewText":"This camera was very easy to set up. I just needed a camera to monitor my puppy while I'm away and I'm glad to say this works as expected. It has pretty good night vision and decent picture quality for the price. The audio works well too! I like that you can move the camera around and zoom in/out from your phone. I've had it for 4 weeks now and so far it's serving its purpose. I plan on purchasing a 2nd camera!"},{"reviewerName":"Anthony XJ","rating":"1.0 out of 5 stars","reviewTitle":"Arrived broken in half","reviewDate":"July 31, 2019","reviewText":"This is the last time I'll buy a product from this company. Arrived not even assembled, at first I thought it had broken during shipping but no, it wasn't actually fully assembled at the factory. What a joke"},{"reviewerName":"Kendra Pratt","rating":"5.0 out of 5 stars","reviewTitle":"Great camera for the price! Would buy again","reviewDate":"August 26, 2019","reviewText":"This camera is perfect for what I needed it for. My dog had surgery, so I wanted to be able to keep an eye on him while I wasn’t home. It is very easy to set up, I just followed the instructions and did not have an issue. It was set up within 10 minutes of opening it. The picture quality is the greatest but for the price it is great and I am able to keep an eye on him. Thinking of buying another to have in other areas of my house. The motion detector works great as well!"},{"reviewerName":"Lin zhuo","rating":"5.0 out of 5 stars","reviewTitle":"Very affordable","reviewDate":"October 31, 2019","reviewText":"Very affordable, this is a greaet pet camera to watch our cats and dogs. It looks very exquisite and modern, and is easy to use. The scope of monitoring is throughout the entire range of rooms, so I can see all the movements in our house. I was surprised how good of this camera especially the night vision! WIth it, I don’t have to worry about my home security, because the security camera will send an alarm notification if it detect dangerous movements. Even at night, it can still work well and show a 1080P HD video/ pictures, love it!!!"},{"reviewerName":"Talley Elena","rating":"5.0 out of 5 stars","reviewTitle":"It really works!","reviewDate":"August 9, 2019","reviewText":"Purchased it to monitor the dog. Simple and quick installation. I had only a moment of difficulty because in the instruction it was different that on smart phone via app. The notifications of motion detection are sent, and recording can be saved to SD card. Simple and functional app, image quality far beyond expectations. Highly recommended!"},{"reviewerName":"Charlotte","rating":"5.0 out of 5 stars","reviewTitle":"Just what I wanted","reviewDate":"July 6, 2019","reviewText":"I suck at setting up electronics. This camera was so easy for me. It has simple easy to follow instructions. I tested the night view, panning it, motion detection and the voice setting. I loved it. I did not even have to call tech support. I'll get some more camera soon."},{"reviewerName":"Brian patrick","rating":"1.0 out of 5 stars","reviewTitle":"Doesnt really work with amazon alexa","reviewDate":"October 26, 2019","reviewText":"Got this specifically to use with my echo show. I didnt bother testing the rest of the features because it just constantly buffers every 2 seconds so you cant see anything on the show"},{"reviewerName":"Amazon Customer","rating":"1.0 out of 5 stars","reviewTitle":"didnt work for me...","reviewDate":"November 6, 2019","reviewText":"returning this product. wont sync through my iphone or internet. I do not have 5g internet, and my internet is working for other items in my home... Amazon customer service and heimvision tried to help, which is appreciated, but the product overall did not work for me.."},{"reviewerName":"Rebecca Taylor","rating":"1.0 out of 5 stars","reviewTitle":"Never connected","reviewDate":"November 3, 2019","reviewText":"I do not know if it works bc it never connected. It was a pain in the ass and I’m tired of dealing with it. I do not have 5g so it’s another issue. Don’t waste your time and money!"},{"reviewerName":"Harrison Jin","rating":"5.0 out of 5 stars","reviewTitle":"GREAT！","reviewDate":"July 8, 2019","reviewText":"I have to give this camera 5 stars because it is so good that i am able to watch my cat when i am outdoor. I can even talk to her by the mic. I would by one more for my living room to see what my cat happens right there! like it!"},{"reviewerName":"Deborah S. Blankenship","rating":"4.0 out of 5 stars","reviewTitle":"Great camera","reviewDate":"October 19, 2019","reviewText":"I've got 2 of these now, the picture on them is great and the app is very responsive. The motion detection doesn't work great it goes off randomly and never anything there."},{"reviewerName":"Jon Wagner","rating":"5.0 out of 5 stars","reviewTitle":"Quality camera for the price.","reviewDate":"October 14, 2019","reviewText":"So far, I’m pleasantly surprised and pleased by its capabilities and quality, especially for the affordable price.\n\nIf I need more cameras, I’d definitely buy this again."},{"reviewerName":"jezz","rating":"5.0 out of 5 stars","reviewTitle":"Easy to install.","reviewDate":"June 4, 2019","reviewText":"The only downside I noticed was the night vision wasn’t the highest quality, but for the price it’s still better than expected. Very happy with my purchase and would recommend for living rooms and baby rooms."},{"reviewerName":"Michael Abbott","rating":"5.0 out of 5 stars","reviewTitle":"No cost to record or watch.","reviewDate":"September 21, 2019","reviewText":"It works really well. I put a 128gb sd card in it and don't need the cloud. You can set it to record to the sd card and you can see live. 5 stars in my opinion. And I'm technically challenged..."},{"reviewerName":"Apple","rating":"5.0 out of 5 stars","reviewTitle":"Recommend","reviewDate":"July 7, 2019","reviewText":"Seemingly complex camera, installation is actually very easy, as long as follow the instructions of three to four steps to install, I put it in the living room, through the phone can clearly see every corner."},{"reviewerName":"KT Valentine","rating":"4.0 out of 5 stars","reviewTitle":"Good camera. Mediocre audio transmission.","reviewDate":"August 25, 2019","reviewText":"Good camera for the price. Nice picture quality and mobility. The audio is fine for listening, but poor for talking. I can only transmit 1-2 seconds of audio, which just sounds scary and weird. Got it to snoop on my dog while I'm at work and already stopped two garbage eating escapades. Success."},{"reviewerName":"S. Giles","rating":"2.0 out of 5 stars","reviewTitle":"\"Not Compatible With 5G\"","reviewDate":"June 25, 2019","reviewText":"Will NOT work on my wi-fi, which I'm pretty sure isn't 5G. Very annoying."},{"reviewerName":"Mrs Greene","rating":"5.0 out of 5 stars","reviewTitle":"Great camera for price","reviewDate":"September 3, 2019","reviewText":"I took a chance on this camera vs a more expensive one and I am so glad I did. The picture quality and sound are great. The motion detection could use some adjusting but otherwise great camera."},{"reviewerName":"Kerstin P.","rating":"1.0 out of 5 stars","reviewTitle":"Would not connect","reviewDate":"October 10, 2019","reviewText":"Couldn’t get it to work. Followed every step. Tried everything, but it wouldn’t connect. We even turned off the 5GHz on our router and still nothing. Ended up returning it."},{"reviewerName":"david","rating":"5.0 out of 5 stars","reviewTitle":"with easy set up!!!","reviewDate":"October 14, 2019","reviewText":"We finally found the best camera to keep an eye on the dogs. One of the best features is how you can move the camera and zoom in so easily. Being able to let our doggies hear our voice is a huge plus! Image quality is clear too. Overall It’s a great app. Installing the camera and app was easy. We had it up and going in just a few minutes. So far this has proven to be a wonderful buy!!!!"},{"reviewerName":"Armen","rating":"5.0 out of 5 stars","reviewTitle":"Good Camera!","reviewDate":"September 7, 2019","reviewText":"This awesome smart baby monitor works very well watching over my pets. It is easy to set up and use (even much easier to operate using its dedicated app). The image quality is extremely high and is vividly clear. It has plenty of features that I love; motion detection; ability to share with my family; night vision; and two-way audio and of course top-level data security. Basically, it’s all great. I love this camera!!!"},{"reviewerName":"Grace","rating":"5.0 out of 5 stars","reviewTitle":"Great value","reviewDate":"August 21, 2019","reviewText":"The webcam and the app that is used with it were both very quick and easy to setup. We bought this webcam to be able to check on our dogs while we are out, and the features of this webcam have worked really well for that purpose. When trying to control the camera angle from within the app it can lag a bit, but for the price of the webcam that's okay. Other than that, all of the other features within the app work great and the video quality is good."},{"reviewerName":"cateye22","rating":"1.0 out of 5 stars","reviewTitle":"Do Not Recommend","reviewDate":"September 12, 2019","reviewText":"False advertising. It does not actually work with Alexa. It will continually buffer. Also, camera is very slow to respond."},{"reviewerName":"Frank B. Ferrante","rating":"5.0 out of 5 stars","reviewTitle":"Great value!","reviewDate":"June 20, 2019","reviewText":"I’ve come by many security cameras in my experience yet for simplicity of setup, ease of use, functional variety, clarity of image, cost and convenience, this camera truly excels."},{"reviewerName":"Lena","rating":"5.0 out of 5 stars","reviewTitle":"good product","reviewDate":"August 8, 2019","reviewText":"i love this camera then other one。 this camera have motion detection。last time i brought one dont have montion detection 。 one more thing that camera i can close or restart by my phone mean i can control by phone"},{"reviewerName":"Lisamarie63","rating":"5.0 out of 5 stars","reviewTitle":"Good Product","reviewDate":"May 27, 2019","reviewText":"Easy to set up and use camera! Seller very good to work with. I like that I get alerts and can go back to see what was going on. It is also nice to be able to direct camera from my phone."},{"reviewerName":"Yujing Chen","rating":"5.0 out of 5 stars","reviewTitle":"No","reviewDate":"June 17, 2019","reviewText":"Very beautiful and stylish, it is very nice to look at in the living room, the quality is also very good, you can talk, you can turn to see the surrounding environment, very good thanks."},{"reviewerName":"hanke","rating":"5.0 out of 5 stars","reviewTitle":"Great item","reviewDate":"October 30, 2019","reviewText":"I really need one. Let me watch what my child is doing at home when I am not at home。 And my mother always can't hear me calling her. With this I can talk to them。Feeling great。"},{"reviewerName":"Nicole Conrad","rating":"5.0 out of 5 stars","reviewTitle":"Great product","reviewDate":"July 23, 2019","reviewText":"I love that it has 360 capability and two way audio. I now can watch my home and control the camera while I’m away. Price was excellent and so far the product works great!"},{"reviewerName":"Alex","rating":"5.0 out of 5 stars","reviewTitle":"Good for baby/pet","reviewDate":"August 6, 2019","reviewText":"I bought this camera as baby camera even tho it stated as per camera. However, it does the job that I need. I can hear baby cry in second floor via this camera while I'm in first floor. I can also see baby using night mode!! Highly recommended."},{"reviewerName":"Nemolee","rating":"5.0 out of 5 stars","reviewTitle":"Nifty little device","reviewDate":"June 24, 2019","reviewText":"This is a dope little camera system that moves around with ease. It’s funny because it resembles a little Star Wars robot. Real cool and very user friendly. We like it!"},{"reviewerName":"JKiah","rating":"2.0 out of 5 stars","reviewTitle":"Eh","reviewDate":"August 26, 2019","reviewText":"Not the best. And the motion detection got annoying because it only detected part of the reason and others detected nothing but said it did."},{"reviewerName":"Lacy j jackson","rating":"5.0 out of 5 stars","reviewTitle":"Customizable times for alerts and alarm!","reviewDate":"August 27, 2019","reviewText":"I had a camera that we were just settling with but decided to give this one a try. It’s great for night vision and I love that you can customize times for the alarm!"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Easy to set up","reviewDate":"June 27, 2019","reviewText":"I am so glad that I bought two of these security cameras. They work great! I’m not very tech savvy and these were so easy to set up. The app that comes with it it is very easy to understand and work.\nThe price is perfect for what this camera does. I don’t need all the bells and whistle‘s of other security devices. I just wanted something to be able to check on the house when I’m on vacation or away. I would highly recommend these cameras."},{"reviewerName":"Chris Montanye","rating":"2.0 out of 5 stars","reviewTitle":"Glitchy","reviewDate":"October 6, 2019","reviewText":"I have it set to detect motion at highest sensitivity and it’s still not recording. I get the alerts that movement was detected but no recording."},{"reviewerName":"perfectmama","rating":"5.0 out of 5 stars","reviewTitle":"Just what I needed","reviewDate":"June 24, 2019","reviewText":"So easy set up. Works with Alexia!! And wireless connection. App was easy. Now i can see what my pup is up to and who my teen is bringing home when I'm out."},{"reviewerName":"Sophia0420","rating":"5.0 out of 5 stars","reviewTitle":"We like it","reviewDate":"June 17, 2019","reviewText":"I was always wondering what my cats are doing when I am at work, and I didn’t know that they have this for pets instead of baby. Just got it, I like it so far"},{"reviewerName":"dana b.","rating":"2.0 out of 5 stars","reviewTitle":"Update..night vision already stopped working.","reviewDate":"October 18, 2019","reviewText":"*Update...night vision stopped working already so only good for during the day.\nBetter quality than I thought for the price"},{"reviewerName":"Nicole Cagle","rating":"5.0 out of 5 stars","reviewTitle":"Works great","reviewDate":"June 28, 2019","reviewText":"Super cool camera! I use it all the time to check on my dog or just to peep in while I’m gone. Really good price and good quality. Easy to set up too."},{"reviewerName":"Amazon Customer","rating":"4.0 out of 5 stars","reviewTitle":"Quality of Video is great","reviewDate":"October 31, 2019","reviewText":"Quality of the video is great. My biggest complaint is that the string is very short so we couldn't mount it on the ceiling or put it where we want. Please make longer string like 12' or so."},{"reviewerName":"Matt","rating":"5.0 out of 5 stars","reviewTitle":"Good camera","reviewDate":"August 28, 2019","reviewText":"Was very excited to get my camera. It looks really cool. It looks like it would be a very nice camera. But it will not connect to my 2.4ghz wifi network no matter how many times I try and following the instructions to the T. UPDATE: I had too many connections on my router. I installed a new router and the camera connected no problem!"},{"reviewerName":"Adin Putnam","rating":"5.0 out of 5 stars","reviewTitle":"Excellent IP Werb Cam","reviewDate":"August 25, 2019","reviewText":"Great web cam. Easy to set up and simple to place or mount. Image is clear and sharp. Night vision works well and covers a large area. The tracking feature works great and the camera's motion is fast, smooth and quiet."},{"reviewerName":"Kevin the great","rating":"5.0 out of 5 stars","reviewTitle":"Crystal clear","reviewDate":"October 14, 2019","reviewText":"We got our camera and hooked it up! Hook up was easy and the picture is crystal clear. Love the camera very user friendly"},{"reviewerName":"Carolyn Fuller","rating":"5.0 out of 5 stars","reviewTitle":"Good value and works great!","reviewDate":"September 15, 2019","reviewText":"Works great for the price. I bought this to keep an eye on my dogs during the day and it does the job. Not super high quality but I wasn’t looking for that."},{"reviewerName":"John A. Angelone","rating":"1.0 out of 5 stars","reviewTitle":"Cheap product that doesn't connect","reviewDate":"October 11, 2019","reviewText":"Cheap product that does not connect. This product is very cheaply made. The head that swivels is loose and bobbles around. Both the first one I ordered and the replacement do not connect to the wifi network(2.4Ghz per instructions). I have 14 other wifi cameras that connect with no problem. I sent both back and would not recommend wasting your time with these."},{"reviewerName":"Lukas","rating":"5.0 out of 5 stars","reviewTitle":"Better than Arlo!","reviewDate":"October 10, 2019","reviewText":"I had an expensive camera before this an I hated it! I thought why not try this \"cheap\" one since so many people had great reviews. I am blown away at how great this camera is for the price! Better than my Arlo camera forsure! I even ordered a 2nd one! Only thing I dont like is I cant rotate my image only 90° but oh well. You can not beat this camera for the price!"},{"reviewerName":"GiulianCR","rating":"5.0 out of 5 stars","reviewTitle":"Easy to set up!","reviewDate":"August 10, 2019","reviewText":"Once I unboxed the camera I followed the instructions and I have to say I'm impressed with the ease of setting it up, the camera has been working great, resolution is just fine. Great value for the price."},{"reviewerName":"Kenzie Peterson","rating":"4.0 out of 5 stars","reviewTitle":"Great for the price.","reviewDate":"July 17, 2019","reviewText":"Bought this to monitor my dog while I'm not home. The two way audio is great! My dog can clearly hear my voice when I talk to him. The swiveling and video have a bit of a lag so it's kind of hard to get my camera right on my dog before he moves again."},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Great camera for the cost","reviewDate":"September 20, 2019","reviewText":"Great night vision quality and overall design.\nI had a problem with my first camera - there was some buzzing sound on the records. The replacement was delivered promptly and I had no problem with the quality anymore.\nProbably one of the best quality for this price."},{"reviewerName":"Lissy","rating":"5.0 out of 5 stars","reviewTitle":"Works good","reviewDate":"July 27, 2019","reviewText":"This camera works good - I do wish that it was wireless as it is a bit awkward to hang on the ceiling with the wires but we made it work"},{"reviewerName":"Nishawn","rating":"3.0 out of 5 stars","reviewTitle":"Good quality","reviewDate":"October 9, 2019","reviewText":"So overall it’s a pretty decent camera. However, it doesn’t send me alerts when it detects motion. It is impossible for me to sit and watch the camera all day and i attempted to watch the recording but who wants to sit and watch that all day?\n\nPros :\nGood camera quality\nMicrophone\nNight vision\nFamily sharing\nRecording optional\n\nCons:\nNo text alert"},{"reviewerName":"Betty mtz","rating":"5.0 out of 5 stars","reviewTitle":"works great","reviewDate":"October 13, 2019","reviewText":"I really like this security camera. I ordered two since I have a 2 year old baby and he loves to hide in different places of the house, but with this camera I can see all the time where he is with the (motion detection) it is really simple and easy to install. It looks a little blurry when you try to zoom but for what I need it and for the price it works very well for me"},{"reviewerName":"Xiaomei he","rating":"5.0 out of 5 stars","reviewTitle":"Cool and well function camera","reviewDate":"October 16, 2019","reviewText":"I use this camera in my kids room and my work area, it’s easy to install, it’s coming with an installation kit. And through this camera, everything is clear and reliable. The best part is it’s night vision function, I can see everything clearly. Recommended!"},{"reviewerName":"Heartwill","rating":"4.0 out of 5 stars","reviewTitle":"Good for the price","reviewDate":"September 3, 2019","reviewText":"I like this camera because of the price. It is reasonably priced and worth every penny I spent. The set up was easy. It has a motion detector which send you a message when ever motion is detected . I really liked the preset options because I am able to zoom it to the exact location that I wanted. I will definitely recommend this camera to anyone looking for a reasonable Security camera."},{"reviewerName":"Ramsey Mahmoud","rating":"5.0 out of 5 stars","reviewTitle":"Absolutely, amazing must buy!","reviewDate":"October 19, 2019","reviewText":"This camera is absolutely amazing for being under 30.00 I have two currently and have two more in order. It was so easy and quick to set up plus love that I can use with Alexa, the two way communication, the notification when someone come near the area , you can set the camera to follow the person around the room. Truly the best camera for its Value!"},{"reviewerName":"Pennington Kayleigh","rating":"5.0 out of 5 stars","reviewTitle":"So far so good!","reviewDate":"August 8, 2019","reviewText":"Good looking design that does not give the bad impression of having a camera pointed at you. The app is well made. I can easily control the camera via my phone. Bought it to check my car. I installed it as if it were a surveillance camera and with a portable Wi-Fi router I was able to have an internet connection to monitor outside in front of window. Great camera for home use. Very very satisfied!"},{"reviewerName":"qinlinchen","rating":"5.0 out of 5 stars","reviewTitle":"Very nice camera","reviewDate":"October 29, 2019","reviewText":"This is a good match. The picture is very clear. It also feels great to rotate 360 ​​degrees. Mainly can also talk to children at home. Let me see what they are doing at work. I like it very much"},{"reviewerName":"ST","rating":"5.0 out of 5 stars","reviewTitle":"Thieves Beware","reviewDate":"October 24, 2019","reviewText":"Camera came as described! I was looking for something inexpensive for in home surveillance. It’s everything I was looking for."},{"reviewerName":"Carl Yoo","rating":"5.0 out of 5 stars","reviewTitle":"Nice camera to have","reviewDate":"July 29, 2019","reviewText":"This is a good budget camera to have to check in remotely. I have a 100 gallon fish tank that I've been wanting to monitor. After the recent earthquake I wanted a way to check on it remotely in an instant so this is the solution to my problem."},{"reviewerName":"K Lith","rating":"5.0 out of 5 stars","reviewTitle":"Great picture","reviewDate":"August 17, 2019","reviewText":"The setup was easy, and the mounting was simple. The instructions were easy and straight forward."},{"reviewerName":"Tony S","rating":"5.0 out of 5 stars","reviewTitle":"Wont stay active","reviewDate":"October 27, 2019","reviewText":"Not sure why it won't stay online, House is wireless .everything else good. Have 2, same problem"},{"reviewerName":"Amazon Customer","rating":"1.0 out of 5 stars","reviewTitle":"JUST PUT YOUR MONEY IN THE TRASH CAN","reviewDate":"September 29, 2019","reviewText":"This is the worst item I have ever got from Amazon. You have to use 2 apps and link them with alexa. The apps don't work. By the time it stops buffering you could just go upstairs and check for yourself. Stop and have coffee and donuts. Then it may work if the apps don't stop working. VERY BAD PRODUCT"},{"reviewerName":"sharling","rating":"5.0 out of 5 stars","reviewTitle":"great item","reviewDate":"August 24, 2019","reviewText":"I really love this camera. It allows me to check in on my home, am also able to look in on my kids to make sure all is well and normal ."},{"reviewerName":"Marietta","rating":"4.0 out of 5 stars","reviewTitle":"Camera","reviewDate":"November 12, 2019","reviewText":"I really like this camera for the price. Great vision. Easy to connect. The only complaint is disconnects itself periodically."},{"reviewerName":"Mary C. Borel","rating":"3.0 out of 5 stars","reviewTitle":"Average","reviewDate":"October 10, 2019","reviewText":"Overly sensitive even on highest level. Pictures are not very clear when zoom in. Videos cut in and out and don’t give you a complete picture of what was going on when the motion was detected. Are use these inside and outside but would get something better for outside when I\npurchase another camera."},{"reviewerName":"Kevin","rating":"5.0 out of 5 stars","reviewTitle":"GREAT CAMERA","reviewDate":"October 12, 2019","reviewText":"This product is amazing! Great picture, great features, tracking, recording, and Alexa compatible. You won't find a better for a better price."},{"reviewerName":"Maverick","rating":"1.0 out of 5 stars","reviewTitle":"Ok you get what you pay for.","reviewDate":"August 28, 2019","reviewText":"The value is decent and stable not the best on the market.\nA but difficult to install."},{"reviewerName":"steve","rating":"5.0 out of 5 stars","reviewTitle":"Very Happy!","reviewDate":"July 20, 2019","reviewText":"I am very happy with this camera! It was easy to set up and lets me keep an eye on my dogs during the day. Would definitely recommend it!"},{"reviewerName":"Gabriel Guidry III","rating":"5.0 out of 5 stars","reviewTitle":"Ease of installation","reviewDate":"July 21, 2019","reviewText":"Great little video camera for the price, ordered an exterior security camera from them after the set up of this one. If the installation is easy for me anyone can install this product."},{"reviewerName":"Noreen Stendalen","rating":"5.0 out of 5 stars","reviewTitle":"Easy set up and the best for a fraction of the price.","reviewDate":"August 30, 2019","reviewText":"We love the item! It does alot for the price. Was hesitant at first but when we tried it, it does what we expected. Picture is great too! Now i can talk to my kids while i'm away."},{"reviewerName":"LaDonna","rating":"1.0 out of 5 stars","reviewTitle":"Bad camera","reviewDate":"October 23, 2019","reviewText":"Bad camera, I could never get it hooked up to the app to use it. App is terrible. Dont buy"},{"reviewerName":"Harold Koch","rating":"4.0 out of 5 stars","reviewTitle":"Great for the price!","reviewDate":"November 13, 2019","reviewText":"So far I am impressed with the camera for it's great price. The picture is good and it is able to be moved around. The only complaint is that for 2 cameras you would have to pay twice rather than just once for an account regardless of how many cameras you have."},{"reviewerName":"Ronald Flores","rating":"1.0 out of 5 stars","reviewTitle":"not good for b baby monitor","reviewDate":"September 4, 2019","reviewText":"the screen freezes after only a few minutes, i can't hear or see my baby, can't rely on it to hear my baby at night, returned it. terrible customer support."},{"reviewerName":"johnjay fith","rating":"1.0 out of 5 stars","reviewTitle":"couldn't get onto the wifi","reviewDate":"August 11, 2019","reviewText":"this camera set up is so complicated , tried for an hour to get it online , called the help center they couldn't get it online\nlol got and return it the same day"},{"reviewerName":"Jacqueline Cooper","rating":"5.0 out of 5 stars","reviewTitle":"Great camera with super easy set up!","reviewDate":"July 20, 2019","reviewText":"Perfect camera for stalking my cats at all hours of the day. Super easy instructions and set up. Took about 2 minutes. Notifications straight to my IPhone. 😻"},{"reviewerName":"Jeremiah Johnson","rating":"5.0 out of 5 stars","reviewTitle":"Great product. Great App","reviewDate":"September 4, 2019","reviewText":"The app is really easy to use. And it came with a mount which was a breeze to install."},{"reviewerName":"Kaiying h.","rating":"5.0 out of 5 stars","reviewTitle":"Good price for the product","reviewDate":"August 10, 2019","reviewText":"Work perfectly, easy to install and I can access the camera anytime, the only thing I don’t like is that you can only get alarm if you pay for it monthly, if you don’t pay, you can only watch live, but the price is fair. So far so good, hd camera, I love it."},{"reviewerName":"Marcy L Johnson","rating":"1.0 out of 5 stars","reviewTitle":"Only worked for 2.5 months, tech support couldn’t help!","reviewDate":"November 10, 2019","reviewText":"I purchased one of these and it connected super easy and was working great. The motion sensor was nice and the picture was clear. I enjoyed it so much that I bought a second one. Now 2.5 months later neither camera will stay connected to my WiFi. I called tech support to trouble shoot with no luck. Now unfortunately I have two useless cameras!"},{"reviewerName":"Jacob Wood","rating":"5.0 out of 5 stars","reviewTitle":"Great inexpensive in home camera!","reviewDate":"October 27, 2019","reviewText":"This is our first in house camera we have purchased. It has a very easy set up. The image quality and response time are great for the price range."},{"reviewerName":"James L. Montgomery","rating":"5.0 out of 5 stars","reviewTitle":"Nice product, nice price.","reviewDate":"July 24, 2019","reviewText":"Got this camera mainly as a replacement for a fixed position camera as the grandson no longer stays in his bed. Now I can follow him around his bedroom and keep an ear on him too. Worked so well I bought more to cover more rooms."},{"reviewerName":"Ariel Brown","rating":"4.0 out of 5 stars","reviewTitle":"good value","reviewDate":"October 25, 2019","reviewText":"Great device considering the price. One issue is the volume coming from the device (if you speak to the person/ animal that is in the room with the device) is way too quiet. I have searched and have not found a way to adjust the volume."},{"reviewerName":"Ben Ramskugler","rating":"4.0 out of 5 stars","reviewTitle":"Good for money","reviewDate":"August 7, 2019","reviewText":"Using this as a baby monitor. Works great at night (our bedroom is next to baby’s room so we can hear if our baby wakes up but we like to be able to check on her without going in the room). Our old monitor did not zoom and the night vision was terrible. During the day, I think you would have to keep the app open on your phone which would be counterproductive."},{"reviewerName":"Drew","rating":"5.0 out of 5 stars","reviewTitle":"Great Product","reviewDate":"June 7, 2019","reviewText":"Great camera! It’s super easy to set up and easy to control through your phone! Very impressed."},{"reviewerName":"Kevin Richter","rating":"3.0 out of 5 stars","reviewTitle":"Does not sync well with Alexa devices.","reviewDate":"September 9, 2019","reviewText":"This camera is great! Picture quality was amazing and set up was pretty easy...until we tried to sync it up with our Alexa devices. They use a 3rd party skill that would not link up no mater how hard we tried. After 2 hours, we called it quits and are returning it. As long as you are not intending on using it with an Alexa device, it's a great wifi camera."},{"reviewerName":"Experienced Customer","rating":"5.0 out of 5 stars","reviewTitle":"Worth every penny!","reviewDate":"September 29, 2019","reviewText":"This was the easiest one o own to install and get connected to my phone."},{"reviewerName":"Dtung","rating":"1.0 out of 5 stars","reviewTitle":"Never connected","reviewDate":"October 12, 2019","reviewText":"The reviews about connection problems are right. Don't waste your time with this one."},{"reviewerName":"Heather","rating":"4.0 out of 5 stars","reviewTitle":"Monthly fees","reviewDate":"August 1, 2019","reviewText":"You have to pay for a monthly cloud fee. If your ok with that the camera works great"},{"reviewerName":"Franscena","rating":"5.0 out of 5 stars","reviewTitle":"It’s the best","reviewDate":"August 12, 2019","reviewText":"Love this product. Caught a thief red handed. I highly recommend this product for everyone"},{"reviewerName":"Jonah Chen","rating":"5.0 out of 5 stars","reviewTitle":"Everything is great except quality was slightly disappointing","reviewDate":"August 7, 2019","reviewText":"I had great expectations for this product, love the motion notifications on my phone: the only feedback is that the quality is not what I expected."},{"reviewerName":"Shane37","rating":"5.0 out of 5 stars","reviewTitle":"Camera","reviewDate":"September 6, 2019","reviewText":"This is a great little camera. I definitely recommend this one."},{"reviewerName":"A. Stark","rating":"5.0 out of 5 stars","reviewTitle":"Great camera, great capabilities","reviewDate":"November 4, 2019","reviewText":"I love this camera and for the price you can't do better. I installed it in my front door and I love it."},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"love this for watching my puppy while away","reviewDate":"August 29, 2019","reviewText":"nice picture.....good sensitivity to movement.....great buy!"},{"reviewerName":"Phylicia","rating":"3.0 out of 5 stars","reviewTitle":"I follows you even when you turn it off!","reviewDate":"November 7, 2019","reviewText":"The picture is not as clear as the 203. The motion detector works well but it scares my kids because even when you turn the camera off it still moves like someone else is watching. It lags a bit while following people in the room. Its an ok video camera as long as your ok with it following you even while its off."},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Great camera","reviewDate":"August 3, 2019","reviewText":"This camera is really great. It has given me a sense of security in my house. You get quick alerts when it detects motion. I like how you can move the camera around from your phone. The app is easy to understand. I feel that que quality of the night vision could be better but it doesn’t bother me. Overall, so far its been great."},{"reviewerName":"dakota boucher","rating":"5.0 out of 5 stars","reviewTitle":"Incredible Value","reviewDate":"September 4, 2019","reviewText":"This thing does a ton for the money. I love watching it track people."},{"reviewerName":"mitch vandomelen","rating":"5.0 out of 5 stars","reviewTitle":"Good price, works well","reviewDate":"September 7, 2019","reviewText":"I was very impressed at the capabilities and quality. It’s on par or better than cameras I’ve had that were more expensive, and it makes a perfect dog camera and security camera for me. I will probably buy a second one."},{"reviewerName":"Redflash","rating":"4.0 out of 5 stars","reviewTitle":"Not too bad for the money","reviewDate":"July 24, 2019","reviewText":"Not the best but plays well with Echo Show 5 and Echo Spot 2"},{"reviewerName":"Ping Ni","rating":"5.0 out of 5 stars","reviewTitle":"Great security camera","reviewDate":"October 1, 2019","reviewText":" It’s a definitely awesome security camera, it works really good in my restaurant!! It turns when it feels movements. It also can stay at one spot if you wanted to.. liked it a lot! And also you can talk on it which is fun sometimes. Nice buy"},{"reviewerName":"DC Rico","rating":"5.0 out of 5 stars","reviewTitle":"Very nice camera.","reviewDate":"September 2, 2019","reviewText":"Very reliable camera the picture quality is good. This is our second one and was easy to install."},{"reviewerName":"Ashley","rating":"5.0 out of 5 stars","reviewTitle":"Great camera for less","reviewDate":"September 28, 2019","reviewText":"Great camera for less. Easy installation."},{"reviewerName":"ktfinch","rating":"4.0 out of 5 stars","reviewTitle":"Decent camera for the money","reviewDate":"June 28, 2019","reviewText":"Decent camera for the money. Feels a little cheaply made but works fine."},{"reviewerName":"Laura Cass","rating":"5.0 out of 5 stars","reviewTitle":"Works great, would work better with faster internet","reviewDate":"September 3, 2019","reviewText":"It works very well, but would work better if my internet was faster. I got it to see how my son was escaping his crib, but can also keep an eye out on him when I have baby sitters!"},{"reviewerName":"Wendy","rating":"2.0 out of 5 stars","reviewTitle":"Disappointed","reviewDate":"August 1, 2019","reviewText":"Kept shutting down, couldn’t use microphone, app kept quitting. Very disappointed!!!!"},{"reviewerName":"Ray","rating":"1.0 out of 5 stars","reviewTitle":"Waste of time!!!","reviewDate":"September 15, 2019","reviewText":"Horrible product. It's not compatible with my wifi. I put it as close as possible to my router and still no luck."},{"reviewerName":"Monica Y. Castellon","rating":"5.0 out of 5 stars","reviewTitle":"Like it!","reviewDate":"September 15, 2019","reviewText":"Very good for indoor camera."},{"reviewerName":"Begineer rider","rating":"5.0 out of 5 stars","reviewTitle":"Easy Setup and Use!","reviewDate":"October 6, 2019","reviewText":"Very easy to set up and use with the App. Good picture and controlling the camera is also very easy and simple.\n\nGreat addition to our security system."},{"reviewerName":"Home By The Lake","rating":"5.0 out of 5 stars","reviewTitle":"Baby gift.","reviewDate":"August 21, 2019","reviewText":"Bought as gift for a new baby."},{"reviewerName":"chxh","rating":"5.0 out of 5 stars","reviewTitle":"Nice camera","reviewDate":"November 4, 2019","reviewText":"I love this camera, and it was easy enough for an old woman to set up. Took me a few minutes to figure it all out but not bad at all. And it works great."},{"reviewerName":"Carolyn","rating":"5.0 out of 5 stars","reviewTitle":"Great Camera Great Price Well Worth it.","reviewDate":"October 22, 2019","reviewText":"The picture quality is great. Once the app is installed the app is really easy to use. I would only suggest that the instructions be reviewed to be clear, but I still got it working and it love it."},{"reviewerName":"Julia","rating":"5.0 out of 5 stars","reviewTitle":"You do need a mini sd card of you dont want to save to cloud","reviewDate":"September 20, 2019","reviewText":"Picture quality is amazing! Recording to cloud service is only $6.99 a month. Totally worth the investment. You can save even more of you purchase for the year"},{"reviewerName":"Marvin E. Roberson","rating":"4.0 out of 5 stars","reviewTitle":"Excellent Picture Quality for the Price!","reviewDate":"July 18, 2019","reviewText":"Bought these (2) HM205s for alerts while on vacation. Setup was easy. SDCard goes in upside-down. No instructions for SDCard. Appears to be usable without the Cloud storage being pushed. App is ok, but has a few bugs. Needs new version.\n\nDecent quality for the price! Will buy again."},{"reviewerName":"Patti","rating":"1.0 out of 5 stars","reviewTitle":"What a waste","reviewDate":"July 22, 2019","reviewText":"Well this was either defective or just bad...not great night vision and play back was jumpy at best....it was returned"},{"reviewerName":"Krista Pedroza","rating":"5.0 out of 5 stars","reviewTitle":"Runs off of wi-fi, make sure that everything is 100% in working order. Trust me you won't regret it!","reviewDate":"May 30, 2019","reviewText":"Absolutely loved that I can see so many angles from it just the only thing that bothers me is the blue tint to it!!! Other than that I'm in love it was well worth every penny spent and I highly recommend to anyone on a budget and wanting to see what's going on at home!!!"},{"reviewerName":"Jeanine Haddow","rating":"5.0 out of 5 stars","reviewTitle":"Great quality","reviewDate":"August 7, 2019","reviewText":"Just got my camera and I am really enjoying it. I love that I can control the camera from my phone and aim it in any direction. It was easy to set up and the picture quality is very good. I will be buying more. I’m hooked."},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"You need one!","reviewDate":"August 20, 2019","reviewText":"You can tell it’s a cheaper camera but holy moly do I LOVE snooping on my dogs while they’re getting into mischief. Two way audio has a delay but hilarious to use with them. Setup is fairly easy once you figure it out, the directions are strange. Love it, works great, you need one!"},{"reviewerName":"JR","rating":"1.0 out of 5 stars","reviewTitle":"Bad connection","reviewDate":"August 22, 2019","reviewText":"Couldn't tell you much about quality because it constantly lost connection and never could find unless everything reset"},{"reviewerName":"Ahl302","rating":"5.0 out of 5 stars","reviewTitle":"2 way communication option!","reviewDate":"July 20, 2019","reviewText":"Easy set up and works great! I highly recommend!"},{"reviewerName":"stephen tucker","rating":"5.0 out of 5 stars","reviewTitle":"Good product 👍","reviewDate":"July 29, 2019","reviewText":"Works perfectly"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Cheap but good quality!","reviewDate":"September 9, 2019","reviewText":"I loved this! I just got a puppy and wanted a way to check up on him throughout the day while at work. It worked really well and was super easy to setup."},{"reviewerName":"KelV","rating":"5.0 out of 5 stars","reviewTitle":"User Friendly","reviewDate":"July 17, 2019","reviewText":"Great camera! Easy to set up, user friendly and easily connects to WiFi & to Amazon Echo Show 5. Good for regular monitoring or for a baby monitor. I love the two way microphone."},{"reviewerName":"Tina","rating":"5.0 out of 5 stars","reviewTitle":"Nice product","reviewDate":"June 19, 2019","reviewText":"Nice clean pic. Easy set up on phones."},{"reviewerName":"kayla schramm","rating":"5.0 out of 5 stars","reviewTitle":"Love it","reviewDate":"May 29, 2019","reviewText":"I’ve been searching for a camera for when I️ go on vacations for my pets, this one is absolutely perfect! Easy to install and simple to use."},{"reviewerName":"Joseph","rating":"3.0 out of 5 stars","reviewTitle":"Product ok. Does not work with alexa","reviewDate":"October 10, 2019","reviewText":"Product is fine for the most part. Uses Closeli app which automatically closes with Alex'a (amazon show). Contacted support who replied quickly but only responded with a set-up YouTube video that did not fix the alexa problem"},{"reviewerName":"Rachel","rating":"3.0 out of 5 stars","reviewTitle":"it works well enough","reviewDate":"August 23, 2019","reviewText":"I ordered this to watch my dog while I am not home and it does this well. It's low quality but for the price paid its worth it. I did have some trouble getting it paired to my echo spot but I eventually did it with google help. Overall, I would say it is a good product!"},{"reviewerName":"Kemronpa","rating":"5.0 out of 5 stars","reviewTitle":"Great product","reviewDate":"September 1, 2019","reviewText":"I liked how easy it was to setup with its qr code scan option and how it capture video and audio directly to my phone allowing me to see who is in my home and if they belong or not. Really great camera, and would definitely recommend to a friend or family member."},{"reviewerName":"Monte crosby","rating":"4.0 out of 5 stars","reviewTitle":"Can’t beat it for the price","reviewDate":"October 13, 2019","reviewText":"As a way to look in on our new born son this camera has been a life saver. The automatic night vision setting works great. I’m sure there are better cameras out there but this one is worth every penny"},{"reviewerName":"Christopher","rating":"5.0 out of 5 stars","reviewTitle":"Great Indoor Monitor","reviewDate":"August 30, 2019","reviewText":"These is my 2nd camera from Heim Vision and so far I am impressed. It is my first time also to try video camera security and so far everything seems to be a good experienced. Camera and APP works great, can't complain. Will recommend to my friends and family."},{"reviewerName":"carla","rating":"3.0 out of 5 stars","reviewTitle":"Stop working","reviewDate":"September 2, 2019","reviewText":"Stopped working when iCloud expired"},{"reviewerName":"XU, JIA","rating":"5.0 out of 5 stars","reviewTitle":"great","reviewDate":"July 29, 2019","reviewText":"awesome product"},{"reviewerName":"Mama T","rating":"5.0 out of 5 stars","reviewTitle":"Great camera for the price!","reviewDate":"May 28, 2019","reviewText":"The camera came as described with easy to follow setup instructions via a code you scan on your phone. The two-way voice option is great for keeping an eye on my kids when I’m not in the room, and the night vision was clearer than expected."},{"reviewerName":"Stephanie Jewell","rating":"5.0 out of 5 stars","reviewTitle":"Excellent Security Camera","reviewDate":"June 10, 2019","reviewText":"I absolutely love this product. I can watch my kids when I'm not home. I can move the camera, record, and take pictures as well. The picture quality is very good during day and night vision. We are actually ordering a few more cameras to go into other rooms in our home."},{"reviewerName":"Amazon Customer","rating":"4.0 out of 5 stars","reviewTitle":"It works","reviewDate":"August 14, 2019","reviewText":"It is doing what we wanted. It wasn't too hard to setup."},{"reviewerName":"Princess C","rating":"4.0 out of 5 stars","reviewTitle":"Great camera","reviewDate":"July 18, 2019","reviewText":"Lag with motion detection."},{"reviewerName":"L Moree","rating":"4.0 out of 5 stars","reviewTitle":"Easy setup, easy link to Alexa app !👍","reviewDate":"July 17, 2019","reviewText":"Easy setup, quick link to Alexa app. Camera controls in Pixplus app work well. Doesn't link to 5G wireless, but I don't think that will be a big issue"},{"reviewerName":"JC","rating":"5.0 out of 5 stars","reviewTitle":"Exactly as advertised","reviewDate":"October 19, 2019","reviewText":"It took like 2 mins to set up and connect and was very easy. I’m still working out the system but the cameras are working well. Note these are not for outside use."},{"reviewerName":"Ebony Stewart","rating":"1.0 out of 5 stars","reviewTitle":"Don’t waste your money","reviewDate":"October 10, 2019","reviewText":"Don’t waste your money it’ll go out in a few months the warranty through Asurion is useless and a waste of money they’ll tell you to contact heimvision they’ll provide a number that doesn’t work guess you get what you pay for it work find at first"},{"reviewerName":"Ally","rating":"5.0 out of 5 stars","reviewTitle":"Works for Jax","reviewDate":"July 23, 2019","reviewText":"Pet camera for two cats. One blind and one with good vision. Works well. Does have some pixel issues, but for the most part no issues."},{"reviewerName":"Amazon Customer","rating":"4.0 out of 5 stars","reviewTitle":"Value for money","reviewDate":"October 19, 2019","reviewText":"Camera is quite good for the pricing.\nThe cloud storage package is little expensive than some other vendors but overall quality is satisfactory."},{"reviewerName":"Courts","rating":"1.0 out of 5 stars","reviewTitle":"Bamboozled!","reviewDate":"August 7, 2019","reviewText":"Sending back...does NOT work with Alexa even though it is “Amazon Certified” to do so. Even has 3 pages of instructions on how to set up the Alexa skill only for it to continually “try to connect” for time on end."},{"reviewerName":"H.M","rating":"5.0 out of 5 stars","reviewTitle":"Works as described","reviewDate":"August 8, 2019","reviewText":"It works fine day or night, I am running it on wifi and no issues setting it up or monitoring remotely."},{"reviewerName":"Christopher Subleski","rating":"5.0 out of 5 stars","reviewTitle":"Great little camera","reviewDate":"September 13, 2019","reviewText":"Added 2nd camera to home. I wish it used same app as the outside camera."},{"reviewerName":"Amazon Customer","rating":"4.0 out of 5 stars","reviewTitle":"Easy set up/nice camera","reviewDate":"July 20, 2019","reviewText":"I didn’t know what to expect when it came to this camera. However, it has exceeded my expectations! I just set it up today so I don’t know how the night vision is but the motion detection is accurate and the camera is pretty good quality!!!"},{"reviewerName":"Amazon Customer","rating":"4.0 out of 5 stars","reviewTitle":"Works fair.","reviewDate":"November 1, 2019","reviewText":"Has trouble not detecting motion."},{"reviewerName":"Michele Vinci","rating":"1.0 out of 5 stars","reviewTitle":"Stopped working after 2 months","reviewDate":"October 15, 2019","reviewText":"Great little camera to have when it worked. Completely died after 2 months. I had bought the 1 year cloud service so I have 9 more months and no camera. Was great while it lasted."},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"You can putthis camera anywhere convenient for you!","reviewDate":"October 20, 2019","reviewText":"Connecting was a bit difficult for me because of where im located but this camera is amazing! Always get notifications for movement and sound quality is great! I have used this camera everyday since my shippment and its worked perfectly."},{"reviewerName":"Amazon Customer","rating":"4.0 out of 5 stars","reviewTitle":"Great all around camera for the price","reviewDate":"October 8, 2019","reviewText":"Great little camera for watching the kids a little slow to update as for 2 way talk. Better then expected picture. Super easy to set up only thing is your WiFi needs to have 2.5 ghz availability. Other then that great all around camera."},{"reviewerName":"Thomas M. Adkins","rating":"5.0 out of 5 stars","reviewTitle":"Well worth the money impressive actually!!","reviewDate":"September 24, 2019","reviewText":"Set up with my dual band router 2.4ghz and 5.0 took 10 minutes: most of that was me rereading the directions which are pretty good except small print for older eyes; camera doesn’t disappoint especially for the price;"},{"reviewerName":"kyle boyer","rating":"4.0 out of 5 stars","reviewTitle":"Great picture","reviewDate":"June 27, 2019","reviewText":"Its lil but works exactly how we want it to work. It took a minute for us to figure out how to add more than one phone onto the account but once we did that we were fine. Having some challenges adding it to our Alexa. But it works with out Alexa."},{"reviewerName":"Sepideh","rating":"5.0 out of 5 stars","reviewTitle":"Features + quality vs. price","reviewDate":"October 5, 2019","reviewText":"I always wanted to have a camera at home to check the surroundings when I am out. I’m enjoying the Hemivision camera; I especially like its motion detection feature and ability to watch around through my cellphone."},{"reviewerName":"kingGhost &Browneyez","rating":"5.0 out of 5 stars","reviewTitle":"Would buy again","reviewDate":"August 28, 2019","reviewText":"Love this 📷❤️"},{"reviewerName":"AH","rating":"5.0 out of 5 stars","reviewTitle":"It blew my mind away how great these were being so inexpensive","reviewDate":"October 27, 2019","reviewText":"For the money you spend this camera is amazing. I bought a second one after realizing how awesome they were."},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Great-used for baby monitor","reviewDate":"July 30, 2019","reviewText":"Used for a baby monitor. Worked great especially 2 way audio and real time view! Night vision was perfect for what we used it for. Easy install and set up."},{"reviewerName":"wiley fullmer","rating":"3.0 out of 5 stars","reviewTitle":"Nice cameras","reviewDate":"August 5, 2019","reviewText":"Picture quality on these is great and they are very user friendly. However, had to reorder cameras after one month as mine stopped working. Sometimes they go offline and you have to reboot. Overall though for the price they are good cameras."},{"reviewerName":"Amazon Customer","rating":"4.0 out of 5 stars","reviewTitle":"Echo Show Buffering","reviewDate":"July 23, 2019","reviewText":"Camera works great! Had connectivity issues with Echo Show. Video would load and proceed to intermittently Buffer.\nMy home internet does not have any issues and the Echo show works great with other items."},{"reviewerName":"Kasey Smith","rating":"5.0 out of 5 stars","reviewTitle":"Pretty Good So Far","reviewDate":"July 23, 2019","reviewText":"So far, I'm looking it. Easy to set up. I bought this because I get worried about leaving my home unattended while at work and after someone climbed through my window and stole some items from me. This will definitely help deter thieves."},{"reviewerName":"Theressa Simmons","rating":"5.0 out of 5 stars","reviewTitle":"Worth the money","reviewDate":"July 16, 2019","reviewText":"High tech quality at an affordable price. Great picture view from phone app. Would like unlimited storage and playback capabilities at no charge."},{"reviewerName":"A disappointed traveler","rating":"2.0 out of 5 stars","reviewTitle":"It will cost you","reviewDate":"October 27, 2019","reviewText":"Great product to have until the trial period ends and then it’s another monthly invoice to keep the videos available."},{"reviewerName":"Michael Sheehan","rating":"5.0 out of 5 stars","reviewTitle":"Great camera for the price","reviewDate":"June 30, 2019","reviewText":"What a great camera for the price. Great field of vision and it even had options to track movement and send alerts for motion detection. Would buy again."},{"reviewerName":"Kenlyn","rating":"5.0 out of 5 stars","reviewTitle":"Great price, great quality, great product","reviewDate":"August 6, 2019","reviewText":"This camera is amazing. I love that I can control the camera directly from my phone. The night vision is amazing, and the overall video quality is the best I've seen."},{"reviewerName":"B D","rating":"4.0 out of 5 stars","reviewTitle":"Easy set-up","reviewDate":"July 23, 2019","reviewText":"Set-up in a few minutes on first try with QR code.\nHumanoid detection works as advertised."},{"reviewerName":"Stacie M","rating":"5.0 out of 5 stars","reviewTitle":"I’m glad I got it despite the poor ratings...","reviewDate":"July 13, 2019","reviewText":"We just got it and we really like it so far."},{"reviewerName":"Rachel Courtney","rating":"5.0 out of 5 stars","reviewTitle":"good surveillance","reviewDate":"August 25, 2019","reviewText":"I love my new camera. I keep in in my college apartment room. The quality is awesome when there's light. The night vision isn't the best. I have it set to move when it detects motion and it really does a good job at that."},{"reviewerName":"Laura Rath","rating":"5.0 out of 5 stars","reviewTitle":"As advertised !","reviewDate":"August 20, 2019","reviewText":"Great product! Our only issue has been linking an iPhone. Our androids were very straightforward."},{"reviewerName":"Amazon Customer","rating":"2.0 out of 5 stars","reviewTitle":"3 Months","reviewDate":"October 29, 2019","reviewText":"Stopped working after 3 months. Will no longer connect to wifi. I gave 2 stars because when it did work I liked it, just expected it to last longer than 3 months but I guess you get what you pay for."},{"reviewerName":"Amazon Customer","rating":"1.0 out of 5 stars","reviewTitle":"item doesn't work at all and picture is unclear.","reviewDate":"October 2, 2019","reviewText":"worst product I have ever bought from Amazon. Very disappointed in this product."},{"reviewerName":"Robb D. Schaefer","rating":"5.0 out of 5 stars","reviewTitle":"Good reasonably priced HD security camera","reviewDate":"September 7, 2019","reviewText":"Purchased this product to watch our puppy during the day while we are at work. So far it has worked as advertised. Installation was a bit difficult with my wifi network and took several tries but is working now."},{"reviewerName":"Bless","rating":"3.0 out of 5 stars","reviewTitle":"Motion camera","reviewDate":"September 27, 2019","reviewText":"Loses internet often. Motion is super sensitive. Overall does its job."},{"reviewerName":"Damon Clark","rating":"5.0 out of 5 stars","reviewTitle":"Works as advertised. Nice.","reviewDate":"October 20, 2019","reviewText":"Works as advertised. Very easy to set up. Having a hard time getting Alexa to cooperate, but that’s an Alexa problem, not the camera. Overall: Very happy"},{"reviewerName":"Robin Loper","rating":"4.0 out of 5 stars","reviewTitle":"Picture quality","reviewDate":"August 11, 2019","reviewText":"Great camera, night vision is really good can see everything and picture during the day is clear only down side is I couldn't hook multiple screens to it but over great and will be purchasing more."},{"reviewerName":"lia minshew","rating":"4.0 out of 5 stars","reviewTitle":"Great camera","reviewDate":"August 28, 2019","reviewText":"Great camera for a great price. Easy to set up. Great picture. Already ordered another one"},{"reviewerName":"eric","rating":"2.0 out of 5 stars","reviewTitle":"Product reviews","reviewDate":"July 21, 2019","reviewText":"Did not come any paperwork. Had to look online for directions."},{"reviewerName":"Trisha","rating":"5.0 out of 5 stars","reviewTitle":"Worth the money!","reviewDate":"October 23, 2019","reviewText":"Honestly, I was kind of skeptical about buying this, it was cheap and the reviews were mixed.. that being said, I’m so glad i did. It was worth the $30!"},{"reviewerName":"Ryan","rating":"1.0 out of 5 stars","reviewTitle":"Not worth it","reviewDate":"September 28, 2019","reviewText":"Doesn’t stay connected and isn’t worth the money."},{"reviewerName":"Alex Sharick","rating":"5.0 out of 5 stars","reviewTitle":"Love!!","reviewDate":"September 2, 2019","reviewText":"Really love this camera! It works really well and does exactly what it says it does. I was skeptical due to the price being so much lower than others I’ve looked at, but it proved to be perfect?"},{"reviewerName":"Jose Canessa","rating":"5.0 out of 5 stars","reviewTitle":"Good for the price.","reviewDate":"October 14, 2019","reviewText":"Very friendly app. Good picture qualities.\nTiny size. Fast PTZ response."},{"reviewerName":"amazon customer","rating":"4.0 out of 5 stars","reviewTitle":"Great camera at a great price","reviewDate":"July 23, 2019","reviewText":"What I liked most about this camera was the clear instructions and ease of installation. I have also been impressed with the range over WiFi, even without an external antenna. So far so good."},{"reviewerName":"Derek C.","rating":"5.0 out of 5 stars","reviewTitle":"Great wireless camera. I highly recommend it.","reviewDate":"November 13, 2019","reviewText":"Easy to set up. Tested it out using my phone and laptop. Picture quality is fantastic with no lag. Quality product at a great price. I will be purchasing more of these cameras in the future."},{"reviewerName":"caroline McManus","rating":"5.0 out of 5 stars","reviewTitle":"I need one more","reviewDate":"July 25, 2019","reviewText":"works great. I can keep an eye on my elderly mother while I'm at work."},{"reviewerName":"Martha Tyner","rating":"5.0 out of 5 stars","reviewTitle":"Does What We Wanted it To Do","reviewDate":"September 12, 2019","reviewText":"Easy to set up and install. Clear picture. Easy to use with the App. Let's us keep an eye on our pets. That's the reason we bought it and it works great."},{"reviewerName":"Piper","rating":"5.0 out of 5 stars","reviewTitle":"High quality security camera","reviewDate":"October 23, 2019","reviewText":"The camera is easy to install. It can remind me if there is exercise, I can record it, have motion sensor lights, and the night vision effect is great. The application is also easy to use"},{"reviewerName":"dan magill","rating":"5.0 out of 5 stars","reviewTitle":"Peace of mind knowing what's going on.","reviewDate":"October 15, 2019","reviewText":"What I like about this product. 1st of all I like the price about $35 apiece I purchased 3. I rent the 2nd floor of a 1 family home. So access my happen. Now I see all."},{"reviewerName":"silvia suarez","rating":"5.0 out of 5 stars","reviewTitle":"good product at the best price","reviewDate":"August 10, 2019","reviewText":"It is an excellent product!\n\nprojects very clear images and is easy to install"},{"reviewerName":"Peggy Smith","rating":"5.0 out of 5 stars","reviewTitle":"Great choice on my purchase","reviewDate":"July 11, 2019","reviewText":"Using this camera to watch my dogs when I am away . Great choice . Like the features , panning, night vision, and the ability to communicate with them ."},{"reviewerName":"Farah A","rating":"5.0 out of 5 stars","reviewTitle":"Clarity","reviewDate":"October 19, 2019","reviewText":"I like the picture quality"},{"reviewerName":"junfeng","rating":"5.0 out of 5 stars","reviewTitle":"Good","reviewDate":"July 12, 2019","reviewText":"Good camera. Can talk to pets. Also can moves perfectly, easy set ups"},{"reviewerName":"Chris Roxas","rating":"2.0 out of 5 stars","reviewTitle":"Disconnects from wifi often","reviewDate":"October 23, 2019","reviewText":"Keeps getting disconnected from the wifi even though it's literally next to the modem. Can't rely on it to stay connected."},{"reviewerName":"Valencia Livia","rating":"5.0 out of 5 stars","reviewTitle":"clear view quality","reviewDate":"August 7, 2019","reviewText":"The camera fulfills all the purposes you need. The app control works without problems, app is easy to use. The vision function shows a clear picture and you can see everything clean."},{"reviewerName":"Kimi 13","rating":"5.0 out of 5 stars","reviewTitle":"HD camera","reviewDate":"August 25, 2019","reviewText":"HD feature is fair. Overall worth the purchase."},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Easy set up great quality for price","reviewDate":"July 3, 2019","reviewText":"Incredibly impressed esp for the price. We are definitely going to be buying another camera or two."},{"reviewerName":"Stephanie Gurrola","rating":"4.0 out of 5 stars","reviewTitle":"Easy Set up","reviewDate":"July 16, 2019","reviewText":"Great product for the money. My box was pretty banged up upon arrival, but everything seems to be working fine. Picture quality is wonderful and user friendly."},{"reviewerName":"Erica Hernandez","rating":"1.0 out of 5 stars","reviewTitle":"Not connecting to WiFi","reviewDate":"October 27, 2019","reviewText":"The reason I give this product a one start is that after having it for only two months, it doesn’t want to connect to my WiFi! It’s great on everything else, I wish it would work again!!!"},{"reviewerName":"kimberly miles","rating":"5.0 out of 5 stars","reviewTitle":"Night vision works great","reviewDate":"August 23, 2019","reviewText":"Got it in June to put in living to watch when I'm not home and check on my dogs and my house. So far it works great."},{"reviewerName":"Carmen Adorno","rating":"1.0 out of 5 stars","reviewTitle":"wifi not compatible","reviewDate":"October 8, 2019","reviewText":"i had to give it bad review because it was not compatible with my wifi"},{"reviewerName":"Temis","rating":"5.0 out of 5 stars","reviewTitle":"Great product","reviewDate":"October 18, 2019","reviewText":"Im just happy whit"},{"reviewerName":"Joshua","rating":"5.0 out of 5 stars","reviewTitle":"Perfect quality","reviewDate":"July 22, 2019","reviewText":"Love the camera the picture quality is amazing, I'd definitely buy a few more for the house... props to the seller! Great buy😁"},{"reviewerName":"Amazon Customer","rating":"1.0 out of 5 stars","reviewTitle":"VERY HARD TO CONNECT TO WIFI!!!","reviewDate":"August 22, 2019","reviewText":"One of those camera's where it doesn't connect to the wifi and when it does always disconnects. I'm sticking with Ring products from now on!"},{"reviewerName":"Jacob R","rating":"5.0 out of 5 stars","reviewTitle":"Excellent camera!","reviewDate":"June 30, 2019","reviewText":"The camera quality is awesome! I love that you can turn it almost completely around so you can get an entire view of the room! The only thing I would change is adding zoom feature!"},{"reviewerName":"Pen Name","rating":"5.0 out of 5 stars","reviewTitle":"Perfect for security!","reviewDate":"September 10, 2019","reviewText":"This camera is ideal for my small business. Excellent all around."},{"reviewerName":"david","rating":"4.0 out of 5 stars","reviewTitle":"Great for the price!!!","reviewDate":"July 3, 2019","reviewText":"So far so good, have not done night vision yet hence the 3 stars. Great product for price for sure."},{"reviewerName":"Lisa Mitchell","rating":"2.0 out of 5 stars","reviewTitle":"Picture quality","reviewDate":"July 17, 2019","reviewText":"Slow response time"},{"reviewerName":"Zenia Soto","rating":"5.0 out of 5 stars","reviewTitle":"Cool new cam!","reviewDate":"October 31, 2019","reviewText":"Easy set up and clear vision. The booklet comes with step by step instructions to connect to Alexa. You can get a wide angle once installed. SD card not included."},{"reviewerName":"Justin","rating":"5.0 out of 5 stars","reviewTitle":"Nice camera and easy to use","reviewDate":"July 30, 2019","reviewText":"It’s very clear camera. The night shot is amazing. It also can send the voice to the camera."},{"reviewerName":"Elizabeth Hill","rating":"5.0 out of 5 stars","reviewTitle":"$ we’ll spent.","reviewDate":"October 21, 2019","reviewText":"Not a bad camera at all. Especially for under $30. Works as described. I can also watch the cam on my echo show."},{"reviewerName":"Okie79","rating":"5.0 out of 5 stars","reviewTitle":"Works great!","reviewDate":"September 26, 2019","reviewText":"This camera was easy to hook up to my WiFi. I have been using it for my dogs and it has worked really well."},{"reviewerName":"Dana Judd","rating":"5.0 out of 5 stars","reviewTitle":"Good buy","reviewDate":"October 26, 2019","reviewText":"Great especially for the cost."},{"reviewerName":"Amazon Customer","rating":"1.0 out of 5 stars","reviewTitle":"Complete trasg","reviewDate":"August 3, 2019","reviewText":"Complete garbage, app on iOS doesn’t pair the camera, instructions are inaccurate, it’s basically just a paperweight."},{"reviewerName":"Lee T.","rating":"4.0 out of 5 stars","reviewTitle":"Volume control needed","reviewDate":"August 24, 2019","reviewText":"Everything works as advertised but the volume is really low and there is no adjustment"},{"reviewerName":"michael gary","rating":"5.0 out of 5 stars","reviewTitle":"Excellent price","reviewDate":"August 28, 2019","reviewText":"Very good product @ a great price👍"},{"reviewerName":"Marie Siler","rating":"4.0 out of 5 stars","reviewTitle":"Security camera","reviewDate":"August 28, 2019","reviewText":"So far so good with this product. The only down is the ref lights on the camera are constantly on. Not going to be a steak attack camera."},{"reviewerName":"melissa luna","rating":"5.0 out of 5 stars","reviewTitle":"Good","reviewDate":"August 27, 2019","reviewText":"I get notifications for every movement my dog makes lol"},{"reviewerName":"Mary Keller","rating":"3.0 out of 5 stars","reviewTitle":"Not wireless","reviewDate":"August 21, 2019","reviewText":"Lags really bad, Also was under the impression it was wireless. Other wise it would be perfect"},{"reviewerName":"Christina Riendeau","rating":"4.0 out of 5 stars","reviewTitle":"Works well","reviewDate":"July 28, 2019","reviewText":"Very good product for the price."},{"reviewerName":"Jay Hammer","rating":"5.0 out of 5 stars","reviewTitle":"Great camera for great price","reviewDate":"August 13, 2019","reviewText":"So far they work really good! Will probably add a few more later."},{"reviewerName":"Emilymc","rating":"5.0 out of 5 stars","reviewTitle":"Great quality","reviewDate":"July 19, 2019","reviewText":"This camera is great! The HD quality is super clear and the night vision is very clear as well. The motion detection works well too!"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Easy to use and good quality","reviewDate":"August 23, 2019","reviewText":"Pleasantly surprised at the quality picture, sound and motion for the price."},{"reviewerName":"Brandon","rating":"5.0 out of 5 stars","reviewTitle":"Cost effective and easy to usr","reviewDate":"August 5, 2019","reviewText":"Cost effective camera that is easy to use. Great picture quality. Was alittle finicky to get it setup but it may have been my wifi."},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Quality cam","reviewDate":"August 25, 2019","reviewText":"Great picture quality, love the tracking feature. Great value for the money"},{"reviewerName":"mark lampley","rating":"1.0 out of 5 stars","reviewTitle":"sucks","reviewDate":"October 3, 2019","reviewText":"not very good in the dark doesn't zoom in easily"},{"reviewerName":"kayla","rating":"4.0 out of 5 stars","reviewTitle":"Worth the money","reviewDate":"August 23, 2019","reviewText":"Works well.. Good picture, 2 way audio works as it should.\nMuch better and cheaper than a video baby monitor."},{"reviewerName":"Lisa Maysonet Massachusetts","rating":"5.0 out of 5 stars","reviewTitle":"Easy to use","reviewDate":"June 21, 2019","reviewText":"Easy to install, easy to use & picture is crystal clear. No matter where you are you can check in on love ones."},{"reviewerName":"Rudolf Stock","rating":"5.0 out of 5 stars","reviewTitle":"Would buy it again","reviewDate":"November 3, 2019","reviewText":"Great cleat picture and sound. No problems."},{"reviewerName":"Michael Paquin","rating":"5.0 out of 5 stars","reviewTitle":"Awesome Security Camera","reviewDate":"October 16, 2019","reviewText":"Just installed this camera. It works awesome and was only 29 bucks on Amazon. Pan and tilt, night vision and Alexa enabled."},{"reviewerName":"Robert","rating":"1.0 out of 5 stars","reviewTitle":"dont buy","reviewDate":"October 3, 2019","reviewText":"doesn't work with Alexa as it says, very very slow, don't buy!!!"},{"reviewerName":"Barbara Heliodora Eloi do Nascimento","rating":"5.0 out of 5 stars","reviewTitle":"very Good product!","reviewDate":"August 15, 2019","reviewText":"Very Good, since I can always be checking back on my dogs at home, really liked the product."},{"reviewerName":"Kat","rating":"5.0 out of 5 stars","reviewTitle":"Very good quality. A good buy in my book","reviewDate":"August 13, 2019","reviewText":"Love this camera. I didn't expect much for the price but I will be buying more"},{"reviewerName":"Jrich Lacson","rating":"5.0 out of 5 stars","reviewTitle":"Work Great","reviewDate":"September 23, 2019","reviewText":"Notifications, sensors and motion detection working great. Minus point on the USB cord tho to bulky"},{"reviewerName":"Cardoan","rating":"5.0 out of 5 stars","reviewTitle":"Easy setup and use","reviewDate":"July 22, 2019","reviewText":"The setup for this camera is very simple and it’s a great quality for the price. The app is easy to use and works with Alexa."},{"reviewerName":"Michael Gentile","rating":"5.0 out of 5 stars","reviewTitle":"5 stars!","reviewDate":"August 28, 2019","reviewText":"Works great! Easy to setup! Works from your phone, motion detection as nigh vision are great too!"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Just tried you won’t regret","reviewDate":"November 4, 2019","reviewText":"It is amazing. Now I can watch my kids activities from everywhere. I just like it"},{"reviewerName":"Flowerlily65","rating":"4.0 out of 5 stars","reviewTitle":"Great price for the camera!!","reviewDate":"September 1, 2019","reviewText":"Easy setup, great picture 1080p need the security for at work, home or vacation."},{"reviewerName":"tiebinlu","rating":"5.0 out of 5 stars","reviewTitle":"Recommended to buy","reviewDate":"June 14, 2019","reviewText":"Easy installation, clear picture, quick response, really recommend to buy"},{"reviewerName":"Amazon Customer","rating":"4.0 out of 5 stars","reviewTitle":"Needed something simple","reviewDate":"August 27, 2019","reviewText":"Very quick and easy to setup to start using. Motion sensor seems to work quite well."},{"reviewerName":"C. Thomas","rating":"5.0 out of 5 stars","reviewTitle":"Clear view!","reviewDate":"September 20, 2019","reviewText":"Easy to set up, clear picture for the price of the cam ."},{"reviewerName":"Ana","rating":"5.0 out of 5 stars","reviewTitle":"Good quality for the price","reviewDate":"August 31, 2019","reviewText":"I like my mini camera! looks like a robat and It works very well all day and night."},{"reviewerName":"Daniel Mitov","rating":"5.0 out of 5 stars","reviewTitle":"Good camera","reviewDate":"July 22, 2019","reviewText":"Great value for the money. Picture quality it's crisp"},{"reviewerName":"Geralyn Phillips","rating":"5.0 out of 5 stars","reviewTitle":"Great security camera","reviewDate":"September 26, 2019","reviewText":"Easy setup, great picture quality, app works easily, will buy again"},{"reviewerName":"Isabel","rating":"5.0 out of 5 stars","reviewTitle":"Muy útil mucho benefició","reviewDate":"September 15, 2019","reviewText":"Si me agradó la tengo dentro de la casa"},{"reviewerName":"Mark Digilio","rating":"5.0 out of 5 stars","reviewTitle":"You have to on this camera!","reviewDate":"August 24, 2019","reviewText":"This camera is awesome! I highly recommend it!"},{"reviewerName":"PJ Pollock","rating":"5.0 out of 5 stars","reviewTitle":"Easy Setup","reviewDate":"September 4, 2019","reviewText":"Great easy setup of the device. It quickly met my needs as a pet monitor."},{"reviewerName":"Thanh","rating":"4.0 out of 5 stars","reviewTitle":"Something worth to get hand on.","reviewDate":"July 8, 2019","reviewText":"Clear picture, sound clear at the great price. So far everything is good."},{"reviewerName":"Amazon Customer","rating":"4.0 out of 5 stars","reviewTitle":"Satisfied","reviewDate":"October 2, 2019","reviewText":"Have had to reboot a few times to get device back on line"},{"reviewerName":"Jeremy crowley","rating":"4.0 out of 5 stars","reviewTitle":"Affordable","reviewDate":"September 5, 2019","reviewText":"Wide view and excellent pic."},{"reviewerName":"Debbie","rating":"4.0 out of 5 stars","reviewTitle":"Great camera!","reviewDate":"November 10, 2019","reviewText":"The picture quality is really good. The movement is an awesome feature"},{"reviewerName":"PAULA MORGAN","rating":"5.0 out of 5 stars","reviewTitle":"Awesome product for a great price","reviewDate":"September 25, 2019","reviewText":"This is amazing! I will be purchasing more for each floor in my home!"},{"reviewerName":"Sierra Stores","rating":"5.0 out of 5 stars","reviewTitle":"Very good camera to spy on my dogs","reviewDate":"August 16, 2019","reviewText":"Great camera. Very easy to set up and use."},{"reviewerName":"yushuo chang","rating":"5.0 out of 5 stars","reviewTitle":"It is affordable security camera with good price","reviewDate":"September 9, 2019","reviewText":"easy to install and operate. I am planning to purchase another one."},{"reviewerName":"Junior Leon","rating":"5.0 out of 5 stars","reviewTitle":"Amazing camera!","reviewDate":"October 7, 2019","reviewText":"Amazing camera, you can move the camera and talk thru the camera from your phone."},{"reviewerName":"Kyle glover","rating":"5.0 out of 5 stars","reviewTitle":"Perfect for sketchy roommates","reviewDate":"October 12, 2019","reviewText":"Works perfect for monitoring my room while I am away."},{"reviewerName":"JOHN E.","rating":"5.0 out of 5 stars","reviewTitle":"Works Great","reviewDate":"July 25, 2019","reviewText":"Easy setup and great for checking on dog while im out"},{"reviewerName":"Michelle Boudreaux","rating":"4.0 out of 5 stars","reviewTitle":"Great pet cam!","reviewDate":"July 23, 2019","reviewText":"Great but freezes up more than I'd care for. May be the wifi but great product."},{"reviewerName":"DCL","rating":"1.0 out of 5 stars","reviewTitle":"Difficult to set up and keep working","reviewDate":"November 12, 2019","reviewText":"I do not recommend, the camera or the app(s). Not user friendly"},{"reviewerName":"Yessica Gonzales","rating":"1.0 out of 5 stars","reviewTitle":"Update: 2 months after purchase","reviewDate":"August 1, 2019","reviewText":"Update: 2 months later cameras wont connect to Network. Ughhhhh"},{"reviewerName":"Alex","rating":"1.0 out of 5 stars","reviewTitle":"Not worth it","reviewDate":"November 5, 2019","reviewText":"Never could get it to connect to my wifi. Everything is also in Japanese"},{"reviewerName":"Douglas E Krause","rating":"4.0 out of 5 stars","reviewTitle":"Nice little camera","reviewDate":"September 13, 2019","reviewText":"Nice little camera to check in on the cats when I am away. Good price !"},{"reviewerName":"Matt Smith","rating":"5.0 out of 5 stars","reviewTitle":"Product as described","reviewDate":"October 18, 2019","reviewText":"The motion detection works well, great quality"},{"reviewerName":"Lad","rating":"4.0 out of 5 stars","reviewTitle":"All in all, not a bad camera","reviewDate":"May 30, 2019","reviewText":"Received product 2day. Initial setup was a little iffy due to setup not stating that u 'Must have' an account setup and an email verified by the app B4 u can proceed on hooking the app/camera up. Also, about 15 to 20 minutes on email response for app. After that tho, the Alexa shoe setup was \"Very Easy\", like it should be. It linked straight up with no errors.\nCamera has very good pic for the price and features. I like it, not too bad. There is a lag in the app as far as controls and looks to be a little buggy but nothing that should stop u from buying I wouldn't think. (Does only connect to 2.4gig internet), as most cheaper priced cameras do. The android app, seems to work as the rest, not too bad."},{"reviewerName":"Donna Gumbs","rating":"1.0 out of 5 stars","reviewTitle":"Did not like this device","reviewDate":"July 23, 2019","reviewText":"Could not get camera to setup. I would not pickup my wi-fi"},{"reviewerName":"mcn","rating":"1.0 out of 5 stars","reviewTitle":"Couldn't get it to work with my internet","reviewDate":"September 3, 2019","reviewText":"It wouldn't connect to my internet."},{"reviewerName":"sam","rating":"5.0 out of 5 stars","reviewTitle":"Wonderful camera","reviewDate":"July 18, 2019","reviewText":"Great camera and has all nice features, easy to install."},{"reviewerName":"Richard","rating":"5.0 out of 5 stars","reviewTitle":"Camera","reviewDate":"October 11, 2019","reviewText":"Great security camera highly recommended"},{"reviewerName":"Cyndi","rating":"5.0 out of 5 stars","reviewTitle":"Great value","reviewDate":"September 16, 2019","reviewText":"Great price! Works well."},{"reviewerName":"Cody Cowan","rating":"1.0 out of 5 stars","reviewTitle":"Extremely disappointed","reviewDate":"October 19, 2019","reviewText":"It’s junk!"},{"reviewerName":"Carl","rating":"3.0 out of 5 stars","reviewTitle":"Review","reviewDate":"August 28, 2019","reviewText":"It took some time to set up. I much rather a wireless one."},{"reviewerName":"Greg","rating":"5.0 out of 5 stars","reviewTitle":"HM205","reviewDate":"October 21, 2019","reviewText":"Video quality is good, nice camera for the price."},{"reviewerName":"R. Brannon","rating":"5.0 out of 5 stars","reviewTitle":"Worth every penny","reviewDate":"August 6, 2019","reviewText":"Good product and good camera and easy setup."},{"reviewerName":"Wall Ronald","rating":"1.0 out of 5 stars","reviewTitle":"Not Good","reviewDate":"July 23, 2019","reviewText":"This camera never worked and would not connect with network"},{"reviewerName":"Evan","rating":"5.0 out of 5 stars","reviewTitle":"Very happy","reviewDate":"July 27, 2019","reviewText":"Overall still very satisfied"},{"reviewerName":"Ahmedov","rating":"5.0 out of 5 stars","reviewTitle":"Easy to install","reviewDate":"October 11, 2019","reviewText":"Easy to install and connect. Good design."},{"reviewerName":"Dennis Wilson","rating":"5.0 out of 5 stars","reviewTitle":"Works out of box","reviewDate":"September 4, 2019","reviewText":"Easy setup"},{"reviewerName":"Sandra","rating":"1.0 out of 5 stars","reviewTitle":"Not able to return","reviewDate":"September 16, 2019","reviewText":"Charger port broke within a month"},{"reviewerName":"Eileen","rating":"1.0 out of 5 stars","reviewTitle":"No compatible con la red","reviewDate":"September 28, 2019","reviewText":"No funciona en Costa Rica"},{"reviewerName":"Arnold","rating":"5.0 out of 5 stars","reviewTitle":"Good camera","reviewDate":"September 7, 2019","reviewText":"It is a good camera."},{"reviewerName":"Lucy Pangelinan","rating":"5.0 out of 5 stars","reviewTitle":"Works well for a great price!","reviewDate":"August 28, 2019","reviewText":"For the price, I am pleasantly surprised by the quality and the ease of setup. I could be wrong but I think this originated from China but the manual/instructions did have the proper English so it was not confusing like many instruction manuals from Chinese products. I like the fact that you can mount it or have it sit on a surface. The microphone is a useful feature to communicate with somebody in the room when you're far away without picking up the phone. This will be great when I have a vacation & need to keep an eye on my home when I'm away. I'll purchase more to cover other areas at home since it supports up to 4 cams."},{"reviewerName":"Alexandra Alazio","rating":"4.0 out of 5 stars","reviewTitle":"Good low cost monitor","reviewDate":"August 24, 2019","reviewText":"We received this monitor as a baby shower gift and we are currently testing it on our dog since the baby isn't here yet! It was easy to set up and the app has been easy to use. So far, it tracks his motion really well and we can see him pretty clearly when the lights are off. The audio feature is a little iffy (the voice quality isn't great) but overall we think this will work well for our needs. I also like that the camera doesn't take up alot of room and we can just use our phone to view. Overall good value for the price."},{"reviewerName":"Dean","rating":"1.0 out of 5 stars","reviewTitle":"Did not work out for me","reviewDate":"October 30, 2019","reviewText":"For some reason I was not able to make it work on my 2.4 Wi-Fi it had bad instructions I had it working I thought it took the code at first and never worked I had to return it very disappointed"},{"reviewerName":"krudar","rating":"5.0 out of 5 stars","reviewTitle":"Easy install","reviewDate":"August 16, 2019","reviewText":"Very easy to install n app also very easy to use.i use this camera instead of baby monitor n i am very happy with this product"},{"reviewerName":"Amazon Customer","rating":"1.0 out of 5 stars","reviewTitle":"No good if router has 5g as well as 2.4","reviewDate":"September 24, 2019","reviewText":"I'm unable to use this. My router is both 2.4 and 5g. It will not connect, customer service is on China time. I will return"},{"reviewerName":"ru","rating":"1.0 out of 5 stars","reviewTitle":"Motion detection way too sensitive. Not wireless.","reviewDate":"August 28, 2019","reviewText":"Note this is not a wireless camera, but must be plugged in for power.\n\nThe motion detection alert goes off every few minutes, regardless of the sensitivity setting.\n\nWould not buy again."},{"reviewerName":"mia meno","rating":"5.0 out of 5 stars","reviewTitle":"Awesome camera","reviewDate":"October 23, 2019","reviewText":"I love this WiFi camera. Just purchased it tonight from Cost-U-Less for $49+. The camera is a tiny bit slow but does it’s job. Very affordable and easy to set up. I would recommend this product."},{"reviewerName":"Matthew","rating":"1.0 out of 5 stars","reviewTitle":"Not what I expected!","reviewDate":"November 11, 2019","reviewText":"We used this product for baby’s room. Had problems with it not running all night. Kept pausing! When it disconnected which was a lot you would have to restart the whole camera and reset it. Not what I was hoping for very disappointed!"},{"reviewerName":"real one719","rating":"5.0 out of 5 stars","reviewTitle":"Must buy","reviewDate":"September 18, 2019","reviewText":"Great buy strongly recommended"},{"reviewerName":"Ming","rating":"4.0 out of 5 stars","reviewTitle":"Very useful!","reviewDate":"August 17, 2019","reviewText":"I use this product for my parents' house. I can check what's going on inside the house when I cannot reach out to them through telephone. It's very convenient for us to stay in contact and prepare for emergency situations."},{"reviewerName":"Jeremy","rating":"4.0 out of 5 stars","reviewTitle":"Good camera for the price","reviewDate":"September 5, 2019","reviewText":"Good camera for the price, not super responsive but the decent image quality, you can be multiple people looking at the camera at the same time, the night vision is pretty cool and the motion detection works well"},{"reviewerName":"Ernest Adams","rating":"5.0 out of 5 stars","reviewTitle":"Great camera to see and hear what your dog is doing","reviewDate":"October 28, 2019","reviewText":"Camera works well. We use it to monitor our dog while we are away."},{"reviewerName":"Zhaley","rating":"4.0 out of 5 stars","reviewTitle":"Very good camera","reviewDate":"September 28, 2019","reviewText":"I bought this camera mainly for security reasons and so far am very pleased with it. Would definitely recommend buying this product."},{"reviewerName":"Darcy Davenport","rating":"1.0 out of 5 stars","reviewTitle":"Sucks","reviewDate":"October 9, 2019","reviewText":"I disslike it! Its too noticeable. I want to return it."},{"reviewerName":"Leah","rating":"5.0 out of 5 stars","reviewTitle":"Great quality video","reviewDate":"June 30, 2019","reviewText":"Sorry, this video is unsupported on this browser.\n Wow! So this camera comes with its own app where you can control the camera from. You’re able to get a 360 view from the room, it includes sound and two way audio. The picture quality is perfect when using HD. I am extremely impressed! It also has motion detection and a ton of other features. It took me 5 mins total to get it setup to my wireless network. Night vision works well too and has good quality picture. There’s a lot of features on this and for the price and quality of video I am extremely impressed."},{"reviewerName":"Jordan and John","rating":"5.0 out of 5 stars","reviewTitle":"Superb quality and price!","reviewDate":"July 2, 2019","reviewText":"This nanny cam exceeded my expectations. The camera and instructions came well packaged and with easy to follow directions. Only took a few minutes to download the app, plug in the camera and get started. I really enjoy the fact that you can move the camera at such wide angles with your phone. The Audio on both ends are great. Either from the cam to the phone or from the phone to the camera. For fun, my wife and I watched our cats play around the house as we were out and about. I got to see the motion detection first hand when I got up for work the other day. It also followed me around as I walked around the kitchen. I highly recommend this for the quality and price."},{"reviewerName":"Yausio","rating":"5.0 out of 5 stars","reviewTitle":"The video quality is really great!","reviewDate":"October 28, 2019","reviewText":"Pros:\n1. Comes with the user manual, easy to install\n2. Comes with the usb cable and plug\n3. Can control the angle on your phone\n4. Can record your voice and play it through the camera\n5. Motion detector is great\n\nCons:\n1. It took me a while to find the sd card slot\n2. The night vision is ok but lower than my expectations\n3. It has some sort of lag when you move it too fast\n\nOverall, I think that the price is totally worth the product. The video quality is great. The night vision needs to improve a bit but I’m still fine with it."},{"reviewerName":"Kyra G. Hicks","rating":"5.0 out of 5 stars","reviewTitle":"Security Camera Works Great","reviewDate":"June 10, 2019","reviewText":"This is a great security camera. It was easy to install, I did it manually instead of using the QR code. We placed the camera at the corner of the room and its view covers the whole room. It also supports motion detection that triggers the video recording. The picture is very clear and the sound is also clear. It is very convenient to install, whether it is to look at the children, pets, or to monitor the home, it works great. Overall I’m very satisfied with the product and the price. It’s a good purchase and works perfectly. I'm super happy with this security camera and will be ordering more."},{"reviewerName":"yijun li","rating":"5.0 out of 5 stars","reviewTitle":"Clear, intelligent Security Camera.","reviewDate":"June 21, 2019","reviewText":"The Security Camera is small and small, it doesn't take up space, it can be placed on a table and can be hung on the wall. The Security Camera's camera can be adjusted up, down, left and right to find what you want to see. It has night vision and clear images at night. The camera is very sensitive, and it will send the message to the phone owner when the image suddenly changes. It is also very simple to install, follow the instructions, download the application, and then scan the camera. You can also watch it remotely and talk to each other."},{"reviewerName":"mom","rating":"5.0 out of 5 stars","reviewTitle":"Easy to set up","reviewDate":"July 5, 2019","reviewText":"Let me first say I am not a techie person. I like simple and was worried I would have trouble setting this up. I was pleasantly surprised not only with the set up but the ease of using the features. The night vision was pretty good and the motion detection worked well. I was impressed with the picture quality and the sound for such a little camera and using it on my phone. This will give me peace of mind when away. I am considering adding another one for the upstairs. An inexpensive way to secure your home."},{"reviewerName":"M. Moffitt","rating":"5.0 out of 5 stars","reviewTitle":"Great, inexpensive camera.","reviewDate":"July 29, 2019","reviewText":"I wanted to try this for a while before I left a review on it. I have to say I was quite pleasantly surprised by the ease of use and quality of the picture. I feel like this has a better quality than most surveillance images they flash on the news from the big box stores! If you are looking for easy plug and play with a great quality, this is the camera for you. I will say the app takes a little getting used to, but it's not too bad and it's easy to use once you get used to it."},{"reviewerName":"Rachel Newbury","rating":"5.0 out of 5 stars","reviewTitle":"Alice","reviewDate":"August 2, 2019","reviewText":"This camera is so neat! I named her Alice because when I hear her talk, she reminds me of a lady named Alice. I downloaded the PixPlus app on my phone and it is super easy to use. Just follow instructions. My husband also has the app on his phone and logs in with my info. Alice sees great at night and the quality the camera gives you is excellent! Now I have a camera to spy in my kids!"},{"reviewerName":"Lily","rating":"5.0 out of 5 stars","reviewTitle":"Very recommended","reviewDate":"September 17, 2019","reviewText":"Open the package and see the product, I like it very much. Follow the instructions in the instructions and install it very quickly. The picture quality is very clear, and it is great to monitor the situation when you go out. If you have children at home, old people, pets are recommended to buy."},{"reviewerName":"ANM","rating":"5.0 out of 5 stars","reviewTitle":"Easy camera to set-up","reviewDate":"June 18, 2019","reviewText":"We bought this to take a trip so we could watch our kids while they nap. Was a great solution and easy to set up with the app and wifi. Super light and decent quality. I really like that the camera isn't fix and I can pan it with the app and the responsiveness is great."},{"reviewerName":"chen lin","rating":"5.0 out of 5 stars","reviewTitle":"👍","reviewDate":"November 1, 2019","reviewText":"I really like this. Small and cute. The video is clear and perfect. Can be suitable for home essential products. It is safe to have this wireless network connection. No matter where you go, you are relieved."},{"reviewerName":"Pandora","rating":"5.0 out of 5 stars","reviewTitle":"Super cool security camera!","reviewDate":"June 6, 2019","reviewText":"This camera was very easy to set up. The app makes it very simple to use while you are away. It has great picture and sound quality and it’s pretty cool that I can actually speak through the camera as well. Great price for how technical this camera is."},{"reviewerName":"Moamen Abdelbaky","rating":"5.0 out of 5 stars","reviewTitle":"Built in siren alarm","reviewDate":"October 28, 2019","reviewText":"Excellent app with an actual motion alarm that will go off from the camera to help deter unwanted people . Hofully will never have that happen but it's nice to have. Placed it outside under my covered patio."},{"reviewerName":"mtc","rating":"5.0 out of 5 stars","reviewTitle":"No complains!","reviewDate":"August 28, 2019","reviewText":"I installed this in about 15 minutes which on average it is not that long. I have tried it now a couple nights and so far I am satisfied with it. Great motion detection and photo and video quality. Night vision is also great."},{"reviewerName":"Jess","rating":"5.0 out of 5 stars","reviewTitle":"I love this camera! It rotates 360° and you can talk to the person in the room through your phone","reviewDate":"October 16, 2019","reviewText":"I really love this camera! It took me about 10 minutes to set it up and I am very pleased! It even has a microphone that you can talk to the person in the room from your cell phone! I’m going to purchase two more"},{"reviewerName":"Kelli S","rating":"5.0 out of 5 stars","reviewTitle":"Great birthday gift","reviewDate":"June 9, 2019","reviewText":"Great camera! My son likes to have a camera on his dog all the time while he is at work. He likes to be able to have the ability to talk to him. So this was the perfect birthday gift for him. He loves it!"},{"reviewerName":"Ralu","rating":"5.0 out of 5 stars","reviewTitle":"See what is happening in you home","reviewDate":"October 18, 2019","reviewText":"The price and quality of this camera is amazing. Work perfect and is easy to use and easy yo connect it. I recommend this camera to all my friend to see they kids or just security for you home"},{"reviewerName":"Malinda Wilson","rating":"5.0 out of 5 stars","reviewTitle":"Great camera","reviewDate":"June 24, 2019","reviewText":"Great product! Easy to install/set up. Love being able to see things while I’m away."},{"reviewerName":"Monty","rating":"5.0 out of 5 stars","reviewTitle":"Overall a nice WiFi camera","reviewDate":"July 13, 2019","reviewText":"Overall a nice camera at this price. Easy to setup with given manual. Picture quality is nice. Motion sensor and night vision is fine too. Helpful to keep an eye via phone"},{"reviewerName":"W","rating":"5.0 out of 5 stars","reviewTitle":"excellent","reviewDate":"July 12, 2019","reviewText":"not difficult to set up, works fantastic ! happy with what I got for the price so far, needs a mini sd card to record"},{"reviewerName":"Hannah Ray","rating":"5.0 out of 5 stars","reviewTitle":"Perfect for my needs","reviewDate":"July 28, 2019","reviewText":"I love this for checking in on my dog during the day, and for security! A little tricky to connect, but not bad! Super happy with this purchase"},{"reviewerName":"CautionJKU","rating":"5.0 out of 5 stars","reviewTitle":"Great camera with cloud access","reviewDate":"November 1, 2019","reviewText":"Great camera that was easy to setup and gain access to. Wish it used the same “HeimLife Life” app as the outdoor camera from HeimVision, but work perfect and includes 3 day cloud backup."},{"reviewerName":"Becky T","rating":"5.0 out of 5 stars","reviewTitle":"I love it","reviewDate":"August 8, 2019","reviewText":"I love it I use it to see my dogs when I’m not home. The picture quality lags a little and internet disconnects randomly."},{"reviewerName":"Rosa F.","rating":"1.0 out of 5 stars","reviewTitle":"Does not support 5G","reviewDate":"November 14, 2019","reviewText":"I have an iPhone, When I am doing the setup is that I learn that it does not support 5G. After I bought it, I can not use it. 😡"},{"reviewerName":"sarah","rating":"5.0 out of 5 stars","reviewTitle":"Good price. Great picture quality and easy to use.","reviewDate":"November 13, 2019","reviewText":"I did a lot if reviews before purchasing a camera and this one came out top fir the money. I’ve had no security issues and the camera is easy to install and work via the app. Motion detection is good, but a little sensitive at times. The two way communication works so well I can activate Alexa via the app with my voice. Unfortunately my first camera died after 7 months, but I immediately bought the same one as a replacement. Purchase the extra cover just in case it stops working."}],"qAndA":[{"question":"Will this record to SD card without internet? I want to set it up in the basement garage of a condo.","answer":"No"},{"question":"Can this camera record motion detection through a window? I want to use for surveillance of the exterior of our home.","answer":"I’m sure it can, the motion sensor on it works real well."},{"question":"how does the cloud storage work is it free forever?","answer":"You can storage recordings in the cloud storage free of charge for the first month. After a month, you can not continue to use this feature until you pay it."},{"question":"Can audio be turned off?","answer":"Check setting"},{"question":"Most Aleksa devices make a boop noise when activated, alerting others in the room that they have been \"dropped in\" on. Does this camera do that?","answer":"Not that I know."},{"question":"How much is the cloud service per month?","answer":"Ranges from 7.99. Depends on the plan you choose."},{"question":"How do I connect this to my echo show 5?","answer":"The echo has “skills” (kind of like apps on a smart phone). Download the skill mentioned in the camera’s set up manual and set up through the cameras app."},{"question":"How is SD card installed?","answer":"Unplug the camera, turn the camera lens up (you will find the card slot there), and insert the card to the card slot."},{"question":"iF I bought 4 cameras, would I be able to see all for on the app at the same time?","answer":"Yes but not a live feed. When you open the app it will update to that very second on all 4 but in order to watch the live feed you have to select which camera and then that camera feed blows up and takes over your screen. I hope this helps answer your question!"},{"question":"the video on my phone is upside down, how do you correct that ?","answer":"Go to setting, turn off the rollover 180"},{"question":"i use a 202 i another house i have. it uses the YCC365 plus app. can i use this app with the 205?","answer":"No, there are different two apps of 202 and 205. The camera work with particular app."},{"question":"Can I install four cameras on my home and see all from the same app and account?","answer":"Yea, you can add multiple same camera and see them from same app and account."},{"question":"Can you review recordings that are on the SD card via the App?","answer":"Yes."},{"question":"Does this work with google home?","answer":"No, it works with Alexa. You can view your live video with a simple voice control."},{"question":"How many cameras are include in one subscription?","answer":"I only have the one for now."},{"question":"Does it work with google hub home?","answer":"Don't think so"},{"question":"Can more than one camera be connected?","answer":"Yes, the app supports many cameras connected."},{"question":"Do you have to save the videos on cloud or memory card? Or can you just watch it live","answer":"You can just watch it live if you wanted to."},{"question":"Can i see the video feed on my echo spot?","answer":"Yes, you can."},{"question":"Can you view the camera on 2 different phones?","answer":"Yes you can set up up to 6 different people I believe on the one camera. I would recommend getting a memory card for the camera before buying it as it does not come with one."},{"question":"I have already purchased this. Will be for watching my paralyzed and blind brother in nursing home. Can this be stolen but recorded by sd card?","answer":"You can actual talk to your brother thru this device so worth it"},{"question":"What's the difference between the 205 & 203 models?","answer":"The 205 works with Alexa while the 203 does not.\n205 could not connect by LAN cable and 203 can connect by LAN cable."},{"question":"Can you activate the microphone feature for 2-way communication via Alexa?","answer":"Yes."},{"question":"Does this work with heimvision hm241?","answer":"Don't know can't get it to work,☹️"},{"question":"i currently use a 205 and want to add another 205, can this be done using same app?","answer":"Yes you can link multiple devices within the app"},{"question":"What is the name of the Alexa skill?","answer":"Yes, you can. The software that you use with the device has a guide on how to set it up, but I haven’t used it."},{"question":"Can I view this camera live from my desktop computer?","answer":"I only have the app on my phone. You can have both live and saved video on that."},{"question":"im going outta the state would this camera work good viewing states away?","answer":"When you say state meaning out of state or out of the country? Regardless, I haven’t tried yet but I would think yes it would work because you are using an app to view it. It would just be the time zone of where the camera will be not your current location when you go out of state/country."},{"question":"I have this camera where do you put the MicroSD card?","answer":"Hi, there is a SD card slot at the neck of this camera."},{"question":"Can I control 8 cameras from my phone, if half of them are in two different locations?","answer":"I don't know since I only have one. But I don't know why not. Do you mean all the locations are at your home? I would think not if they were in different homes since they work with your WiFi connection. The location within the home or within the reach of the WiFi signal would be what is important. The app on the phone… see more"},{"question":"how is the camera powered?","answer":"The camera plugs comes with a wall plug"},{"question":"Do you need to pay any monthly service to use this?","answer":"You don’t need to pay monthly serve to use this camera. Only cloud storage serve need to pay for use (but is free for first 30 days)."},{"question":"Will this work with my kindle alexa","answer":"Yes , it will work with kindle alexa."},{"question":"I read somethin on the reviews with a 4 star,that it only works with a 2.4gig internet .. mayb a dumb question but if mines better, shd work rit?","answer":"If you have a dual band wifi, make sure 2.4gig is separate from 5gig. It supports 2.4gig only."},{"question":"Can this be set up and used without a cord?","answer":"It doesn’t have a battery so you will need to plug it in to a power source. I suppose you cold plug it into a portable power source."},{"question":"Can i use my personal home cloud with this camera or is cloud set limited to only one cloud service?","answer":"Cloud storage does not support other private cloud serve, it’s limited to only one cloud service provider."},{"question":"I absolutely cannot get this to connect to my wifi. I tried multiple resets of my router, changed settings, everything. And yes it was the 2.4 not 5g.","answer":"Mine works right away with my Wifi. You just have to scan the barcode when it tells you to. Just follow the manual included in the box. They are pretty user friendly."},{"question":"Does this have to be plugged in to work?","answer":"Yes, it needs to be plugged in to work. It's needs to be powered."},{"question":"Se puede usar en el exterior?","answer":"No lo creo. Es una cámara para interior"},{"question":"Does the app works with AppStore apple?","answer":"Yes it does."},{"question":"Can this be used for outdoor surveillance?","answer":"Definitely not recommended at all for outdoor use."},{"question":"How many cameras can be supported with the app?","answer":"Much as you can, but you need to buy cloud storage for each camera. Cost $60.00 per year per camera"},{"question":"Is the echo spot required to use this product? Can i just buy this product on its own and view it on my computer/phone","answer":"You will have to buy a monthly subscription and only can view on your phone not your computer"},{"question":"what is the size?","answer":"About the size of a regular coffee cup"},{"question":"how many hours of recording on the 128GB card?","answer":"Usually, it can be recording for a long time. It's about 12 days of recording on HD display, or about 50 days on the SD display."},{"question":"How many devices can I add to an account? and how many people can log in at the same time in one account?","answer":"Several. I have 2 but there is room for more."},{"question":"i have 5 cameras all have sd card installed why does the camera not record to sd cards why is the sd cards not detected, i feel like its misleading?","answer":"u must format cards before use."},{"question":"do you have to connect to Alexa? Or can you just use with Smart phone","answer":"Hi, you can connect to Alexa or just use with phone. You can view and control the camera on your phone app."},{"question":"What is its power source?","answer":"This needs to be plugged in at all times to an outlet"},{"question":"Can this be used outside?","answer":"Have not tried, but I would say probably not"},{"question":"Multiple people connect to the WiFi ?","answer":"You only need the wifi to connect after it stays connected on its own."},{"question":"Can more one person use the app?","answer":"Yes."},{"question":"I followed the introduction and tried many time, but I can not connect the camera. How can I do now?","answer":"Make sure that the device has returned to the factory settings before adding the device: press the reset key until you send a voice prompt.\nThen, there is four-step voice prompt appears in the normal addition process:\n(1) \"Please configure camera by scanning code or AP hotspot\" , if not , plz check that the power s… see more"},{"question":"Can I view the live feed on my laptop?","answer":"I believe so... my husband does all the technical stuff in house... but i do believe it will work on any device you set it up too."},{"question":"Does anyone know how to disable the video going idle after 5 minutes? regarding the hm205. it's used as a baby monitor and can't stop.","answer":"While if you want to get the real time view all the time, please contact the heimvision tech support for help with RTSP method. Just exit the App if you don't want to view the real time video. If you want to stop the camera recording, go to setting--device off, it will stop recording."},{"question":"What voltage range can the power supply use? Only 120?","answer":"It runs off of a transformer. So you can plug it into 120v with that, or I suppose you could plug it into a portable power supply."},{"question":"Will it work with mipc app?","answer":"Hi, it only work with PIXPLUS APP."},{"question":"Does it alert multiple devices","answer":"Yes"},{"question":"Can I view live feed from work?","answer":"Yes, you can."},{"question":"How do i delete from the chip? it is full and i do t need the footage. also if there is something i want to save how do i save what i want. thanks","answer":"You can format the SD card through the app"},{"question":"Is there an app for iMAC desktop?","answer":"No sure."},{"question":"So when it detect motion it moves by itself? Is their and option to play music or sound through it?","answer":"It doesn’t track the movement, but the recordings are coded for the times when movement happens. We can speak through it and hear what is going on, but in my opinion, the speaker would have too much distortion to try and play music through it."},{"question":"We lost the screws and plate to mount this. Are they available for purchase?","answer":"Similar ones can be bought on Amazon, but not exactly the same."},{"question":"Can I connect with my laptop? The images show a picture of a laptop next to the phone...","answer":"Yes you can"},{"question":"How do I charge it ? Does it comes with a battery?","answer":"You don't charge it. It needs to be plugged in to work."},{"question":"Can I save the video on my desktop instead of the cloud?","answer":"Hi, you can download it from cloud and save to your desktop. Or save it to desktop from your SD card."},{"question":"How does private share works, what does it do","answer":"By setting share in the main interface of APP, you will share video and account with your whoever you want. The new version of APP supports sharing account permission settings. You need to check the relevant features when sharing."},{"question":"Does it have an ethernet connection?","answer":"It just has the power connection spot"},{"question":"Does it run on 220v?","answer":"No absolutely not"},{"question":"Buffers every 2 seconds on Alexa Show. Good wifi connection, is there something to help?","answer":"Wait till midnight. For some reason it plays flawlessly during those hours."},{"question":"What is the monthly regular charge (dollor amount fee) of cloud recording after the first free month?","answer":"It varies if you do monthly or annually. I don't subscribed. I just pick the free /3 days and deletes a file and it just keeps capturing."},{"question":"Can you use camera with alexa if you not paying for a cloud account? Closeli app used for Alexa wont let you log in without payed cloud account.","answer":"You can use the camera with Alexa without paying for cloud account."},{"question":"Can I use it out usa","answer":"yes"},{"question":"Anyone know the aperture of the HM205? (If you don't know, no need to respond; someone who does know will respond.)","answer":"While I do not know the f-number, it's a small enough aperture (large enough f-number) so that everything within 30-40 feet is in clear focus. It's likely that the range is much longer than that — 30-40' is about what ours covers."},{"question":"I purchased this camera in august 2019. why wont it connect anymore!?!??? i’ve tried everything!!!","answer":"Well, I have to ask...sorry...but have you unplugged it, waited a couple of minutes, and then plugged it in again? That is always the first step. Have you changed your wifi password? Have you made sure the cat didn't chew on the cord? Or that darn dog? Have you changed the name of your wifi? I guess you have checked t… see more"},{"question":"Can you enable the motion alarm to make an alarm noise from the camera when motion detection is active?","answer":"Yes, you can. You can make a alarm from camera by switching on the ALARM TONE button on setting."},{"question":"Does anyone know how to get the audio to work? I can hear in the room, but when I push the button to talk it does not work. Any suggestions?","answer":"Hi, you need to hold the button down when you are talking."},{"question":"Is this battery powered? I cant find that info.","answer":"No, you must connect to a electrical outlet.\n👍🏼, so are great and the image are really good.\nI love mine 5⭐"},{"question":"can you mount this camera?","answer":"Yes you can. It includes 2 mounting screws, 2 mollies, mounting bracket and mounting screw."},{"question":"How long is the power cable?","answer":"The usb cable is roughly 6 feet."},{"question":"I cannot get this to connect no matter what I try any suggestions?","answer":"Make sure the camera is very near your phone and have a good wifi. The camera lens reads the aztec on your phone. Sometimes it may keep saying not connected on your phone but the camera will say its successfully connected and it is. I had a difficult time initially but found out that once you reset make sure phone and … see more"},{"question":"Can i connect to a wifi without a password? like a wifi you need to login on the website?","answer":"Not sure what you mean. If you have wifi and not using a password, you are asking for trouble. But if you are trying to connect your camera without a password being entered, it cannot do it."},{"question":"in nursing home to keep electronics and this camera from being stolen should I get another camera to watch if this camera is stolen?","answer":"This camera is amazing it will notify you when someone gets in the zone you can actual talk to them so yes I highly recommend this"},{"question":"will it work with my cell provider if I don't have wi-fi away from home ?","answer":"Yes"},{"question":"Se puede usar en el exterior?","answer":"Nope. It is not waterproof. But I have mine on the window sill at the front door. No one has even noticed it yet, and it pans out the window and then cruises back into the kitchen. It catches everyone who comes into the house or up on the porch. Would that work for you?"},{"question":"Does this work with echo dot 3rd generation?","answer":"It will work with echo dot 3rd generation after you buy a one-year cloud service."},{"question":"Does it works with alexa echo show 5?","answer":"Yes, it does."},{"question":"For some reason, as soon as the cloud recording expiration notice happened, it will not record to the sd card any longer. why?","answer":"Because you have to renew your cloud recording system"},{"question":"Can a second camera be added?","answer":"Yes, it can. Just do the same setup as you did before and you're good to go."},{"question":"Has anyone had success setting this up with an Arris router/modem combination? I’ve tried everything multiple times and it will not connect.","answer":"If it's through spectrum you may need a new router, go to the store they should give you an updated one for free."},{"question":"where can I buy extra wall mounting packages? I need more than one which came with the camera?","answer":"You can buy wall mounting package on Amazon, but maybe it's not the same as packages of our camera."},{"question":"Is a 32gb SD is sufficient or 64gb would be better?","answer":"You don't actually need any memory card, if you elect to use the cloud storage option.\nIf you do use a card the size depends on how much you plan to store. Obviously a 64 Gb. card would store twice the video of a 32."},{"question":"Do you have to have Alexa to use this camera?","answer":"No"},{"question":"How many frames per second?","answer":"Hi, at most 15fps."},{"question":"What is the monthly regular charge (dollor amount fee) of cloud recording after the first free month?","answer":"The monthly fee is $7.99-$9.99 per month."},{"question":"The app pixplus not work..... I have iPhone . Any other app","answer":"Was it working before? If it were, the update caused you to not have access. To gain access, you must clear the system cache and data in your installed apps. That'll fix the problem."},{"question":"How much is the cloud storage per month?","answer":"6.99 per month"},{"question":"Do you have to pay for the subscription service?","answer":"Eventually yes. They provide a free 3 day cloud service for a month. You can also use a SD card"},{"question":"Can this be used outside?","answer":"Just indoor"},{"question":"Can i connect to a wifi which does not has password? like a wifi you need to login on the website?","answer":"You would not want to do that. Very dangerous and you are asking to be hacked."},{"question":"Does this camera have sound notification alerts, I.e. to notify me if dog is barking?","answer":"Only notifications are for the motion detection. It has two-way sound so you can hear everything from where the camera is when you have the app open but doesn't do notifications due to sounds, only motion"},{"question":"What color can i but it in?","answer":"Mine is white - I don’t remember there being another option when I bought mine"},{"question":"Can you pull up the video on your tv through the fire cube?","answer":"I have not done so yet."},{"question":"how many hours of recording on the 128GB card?","answer":"It will be about 300 hours of HD recording and even more if you do SD recording."},{"question":"I cannot get this camera to hook up to my Alexa show, it just keeps telling me camera not supported. What did I do wrong?","answer":"Mine does same thing. Closeli app not supported by alexia"},{"question":"Does this have human detection and motion tracking?","answer":"Yes, it has motion detection and it works well."},{"question":"What can you do to make these work if you only have 5g?","answer":"It only supports 2.4GHz."},{"question":"How do you share with family?","answer":"At the thumbnail of the camera in the main interface, tap \"share\" icon to share your camera with your family. If you want to share account with your family, you should register at App."},{"question":"About how far is the reception on this? And will it positively work with Alexa show, I know several say they do but they dont.....","answer":"It depends on the internet signal. It works with Alexa show."},{"question":"Do I have to pay anything to view and use this camera from my phone with just the as card?","answer":"No, you don't have to pay to view and use the camera. If you don't need the video recording, you can use it for monitoring without microSD card or cloud storage. And if you want to record something, you can insert a microSD card or pay the cloud storage (free for the first 30 days). It's up to you. Note: unplug the cam… see more"},{"question":"Does the camera works whit wifi","answer":"Yes, it does. First, connect the mobile to your Wi-Fi, then log in app. Next, tap in the upper right corner, select the Intelligent camera and Device adding by scanning the code. Then, tap Connect to the Network, select the Wi-Fi your mobile is connected and enter the correct password. Camera is connected."},{"question":"Can other people view your camera feed? How secure is it against hackers and deviants?","answer":"not sure, but nothing yet"}]}