{"title":"All-new Echo (3rd Gen) - Smart speaker with Alexa - Twilight Blue","manufacturer":"Amazon","currentPrice":"$99.99","rating":"4.6 out of 5 stars","totalRatings":"279 ratings","features":["Meet Echo - Echo (3rd Gen) has new premium speakers powered by Dolby to play 360° audio with crisp vocals and dynamic bass response.","Enjoy premium sound - Personalize your listening experience by adjusting the equalizer settings. Pair with a second Echo (3rd Gen) or Echo Plus (2nd Gen) for stereo sound and add more base with an Echo Sub.","Voice control your music - Ask Alexa for a song, artist, or genre from Amazon Music, Apple Music, Spotify, Pandora, SiriusXM, and more. With multi-room music, play music on compatible Echo devices in different rooms.","Voice control your smart home - Turn on lights, adjust thermostats, lock doors, and more with compatible connected devices.","Keep your family in sync - Use your Alexa devices like an intercom and talk to any room in the house with Drop In and Announcements.","Alexa has skills - With tens of thousands of skills and counting, Alexa is always getting smarter and adding new skills like tracking fitness, playing games, and more.","Designed to protect your privacy - Built with multiple layers of privacy controls, including a microphone off button that electronically disconnects the mics."],"reviewsAspects":["sound quality","echo plus","new echo","much better","twilight blue","echo dot","apple music","blue color","great sound","better sound","even though","blown away","echo gen","highly recommend","easy to set","living room","connected to your wifi","smart devices","alexa app","listen to music"],"productInformation":[],"productDescription":[],"reviews":[{"reviewerName":"Honest Reviewer","rating":"5.0 out of 5 stars","reviewTitle":"The Pros, Cons and Oks for the Echo 3rd Gen (HR).","reviewDate":"October 18, 2019","reviewText":"Pros:\n• This is a solid built machine. Very sturdy and no dust cracks, while retaining its simple form. One of the few times I can say you’re getting exactly what every picture on the web is showing.\n• I had the basic black design, but I do appreciate that Amazon is offering more colors rather than there basic set (even if it’s only a few generic colors).\n• The mute option is the most appreciative tool. When you activate it the classic blue glow will fall into the red, giving you the visual display that your privacy is being protected.\n• The sound performs exactly what it’s built for. I found no issue in testing in an open living room. The volume goes to great levels as once again, for a 360-degree smart speaker, Amazon reigns supreme.\n• Testing all ranges of music, I found that that bass to be rich and powerful. My colleague has the previous Echo Plus and she states that there is an improvement in the bass with this Echo. An overall rich sound when a piano came in and a warmer outcome when acoustics came into play (You’ll get the bass experience when you hit those hard beats).\n• Like any other model, the Bluetooth connectivity between a third party stereo works flawlessly. I tested this out with some Bose surround sound, and nothing but clear music. You can also pair the Echo if you have smaller / weaker speakers. Both together will pump up the experience.\n• The connectivity is so flawless that buying two of these devices (or use Echo’s previous versions, if you have one) and put them in separate locations doesn’t make this a bad idea. You’re going to get great quality in music without paying an am or a leg for it.\n• I have to appreciate Amazon for not pushing their music platform. They offer the usual Spotify (which I used) but also Apple Music, Deezer, TuneIn, even BBC sounds. You’re getting a lot more features than just a basic smart speaker.\n• Using Google Home for over a year I can say that just saying “Alexa” felt more natural than saying “Ok Google.” Not to mention having Alexa listen to me every time I said: “Alexa” (Google Home users will understand this).\n• Like before, smart applications fit like a glove in this system. I only used it for lights and the Echo was spot on. This feature is more common than ever on any smart speaker, and the Echo does what it’s supposed to do.\n• I admire the organization of the app because it’s your remote control on anything you want the Echo to do. Turn off lights, switch music, mute volume, install new features, and so forth. We all carry our phones like carrying our driver licenses when going outside. This day in age I’ll always prefer an app than a physical remote.\n• I did some Alexa calls on this and found only clear responses and answers (this will depend on your Wi-Fi).\n• I would give 70% of Alexa sounding more human.\n• Everything is in the cloud so, you don’t need to worry about manual updates. All taken care of.\n• As I mentioned before, everything else is the same in a smart speaker. Ask for the weather, traffic, upcoming appointments, and all other general questions. I didn’t test all of them because…well is the same technology as last year.\n• The biggest difference in my book is the price. Newer and cheaper.\n\nCons and Oks:\n• No Zigbee controller. This isn’t much of an issue, but if you already have a smart house layout than you’ll need to spend some extra time configuring with the Echo. The issue for this is that it puts more work on the Echo than you need. Also, there may be some smart devices that won’t work on the Echo because of this. I know last year's models had some connectivity issues with Philips Hue bulbs. Keep an eye out for which smart devices are compatible with the Echo.\n• I did notice that the app slows down when you put a lot of apps and smart applications in the Echos. I tested a lot of features out that require a decent amount of downloads, but the results did create a delay in the app. I have to assume without Zigbee’s software, if you have a lot of smart applications connected to the Echo, and with the general apps you use, there will be a delay in the long run.\n• The Echo gets loud. Loud enough that you’ll get some distortion when you’re around 95% in volume. The effect is shown when a lot of bass is begin made. Please note that 90% and up is booming your entire house.\n• Compare to Google Home, Alexa still isn’t the brightest smart speak in the family. For the basic day to day task it works fine, but those random questions that we tend to have throughout the day Alexa doesn’t deliver. Alexa will usually provide you with a quick one-sentence summary (Unlike Google, it would provide you a short paragraph.). This issue doesn’t happen all the time, but you’ll notice it when it does.\n• I’m trying to learn Spanish, so asking smile Spanish questions with Alexa is not reliable. Example I will say “Alexa, what does “Qué estás haciendo” in Spanish mean (What are you doing?)? Alexa will say “What are you happy.” I’ve been studying for 6 moths so my speech on that sentence was spot on, but Alexa. Not a reliable study buddy.\n• I had the first version of the Echo and all I can say is I miss the rotation ring. Bring it back Amazon.\n• The design is nothing new. It’s built very solid, but it’s identical to Echo Plus 2. My colleague had the Echo Plus and putting them aside there was no way you can tell the difference (a nice note if you want to steal your friends and replace it with the last version).\n• Even the sound is almost similar to the previous Echo. Both are fantastic, but almost the same.\n\nBottom Line:\n\nIt’s a great smart speaker system, but almost identical in every way as its previous model. There is nothing wrong with that because Amazon does put in a lot of features into this Echo that makes this right in the top three (Google Home, HomePods, and the Echo Family). It’s accurate, excellent sound, and lower in price than its previous model.\n\nSome concerns are the effects in the long run with those who have a decent amount of smart applications, and making sure the compatibility can be performed accurately. Also knowing the limits of what Alexa can and can’t do as the hardware is identical to its previous version. I wouldn’t be surprised if you want to just read Echo’s previous model amazon reviews. Trust me when I say that they’re almost identical in sight and performance.\n\nIn the end, the reason it doesn’t matter about the flaws is because the price is well worth what you’re getting. It’s a machine that I can see using it every day for the simplest things such as setting up an alarm to enjoying it in small parties. I will say that if you’re planning to use your surround sound stereo connected to this, then this is a must buy. You pay a heavy price for a HomePod, enjoy a generic performance for a Google Home, and are presented with an overall user-friendly experience with the Echo 3. Cheaper than its predecessor and the worth every penny.\n\nOverall: A tiny upgrade from its previous model, but still an excellent experience in sound for all.\n\nHope I was a help to you.\nLove,\nHonest Reviewer"},{"reviewerName":"C","rating":"5.0 out of 5 stars","reviewTitle":"New Echo, same speakers as Echo PLUS Gen2!","reviewDate":"October 18, 2019","reviewText":"Echo Gen 3 vs regular Echo Gen 2:\n\n-Gen 3 is slightly wider (3.9\" vs 3.4\"), and slightly lighter (27.5oz vs 29oz), but about the same height\n-Gen 3 has bigger speakers: 3.0\" neodymium woofer and 0.8\" tweeter; (Gen 2 was 2.5” woofer and 0.6” tweeter)\n-Gen 3 has an auxiliary port on the back that can serve as an output OR input. (Gen 2 was output only)\n-Gen 3 can be stereo paired with another third-gen Echo or with the Echo Plus.\n\n*NOTE: The Echo Gen 3 is identical to the 2018 Echo PLUS Gen 2, except it does not include the built-in ZigBee smart home hub or temperature sensor. It has the exact same dimensions, weight, speakers, and fabric cover as the 2018 Echo PLUS Gen 2 (with the added color option of Twilight Blue).\n\nUPGRADE OPINIONS:\n\nI can definitely tell the difference in the speakers, especially at higher volume levels. The 3rd Gen speakers produce a fuller sound, and more powerful bass. This wasn't as noticeable at lower volumes, but still an audio enthusiast would be able to tell. Don't expect to be utterly blown away though, the difference is not as great as the difference between the Echo and the Dot, for example.\n\nIf you already have an Echo Gen 2, it is probably NOT worth replacing it with the Echo Gen 3 yet. It is just a slightly better speaker and the added audio input. Also keep in mind the Echo Studio will be out soon, and that is supposed to have much better sound quality than any of these devices; so if you really care that much about better speakers you might want to wait until that comes out.\n\nTHINGS WE REGULARLY USE ECHO FOR:\n\n-Controlling thermostat, lights, fans, smart plugs, Roomba, etc.\n-Setting alarms and timers. Especially timers!\n-Asking for Weather, News or Sports updates\n-Calling friends/family\n-Playing music, sometimes in multiple rooms at once\n-Managing shopping lists\n-Asking any question that is faster to ask than type into my phone/pc\n-Playing games with paired Echo Buttons\n-Translating things from one language to another\n-Getting recipes and cooking tips\n-Listening to audiobooks\n\nECHO vs ECHO PLUS:\n\nWhat is interesting, is that I find it hard to come up with a reason to buy the Echo Plus now. The sound performance is exactly the same now with Echo and Echo Plus. With the Plus, the only thing you get for the extra $50 is a Zigbee hub and temperature sensor. It is really difficult for me to think of a reason I would ever need to use either of those things anyway. I have dozens of smart devices, and I have yet to run into a situation where I needed a Zigbee hub. My smart thermostat handles temperature, I wouldn't want to use a temp sensor in my Echo device anyway. I would much rather pay $100 for the Echo (even less if you trade in your old Echo), instead of $150 for an almost identical Plus.\n\nSUMMARY:\n\nIf you already have an Echo, it probably isn't worth it to replace it with this new version. But if you are looking to add a new Echo device to your household, and you want to play music on it, this is the one to get. It seems like a much better value than the Echo Plus currently. If you don't care about music at all, then you could save some money and get the Echo Dot instead.\n\n* (If you found this review to be informative and/or helpful, please click \"Helpful\" to let me know. Thanks! ) *"},{"reviewerName":"Sean Christopher","rating":"5.0 out of 5 stars","reviewTitle":"Bittersweet Upgrade","reviewDate":"October 21, 2019","reviewText":"I purchased my first Alexa Echo 1st Gen two years ago and I fell in love right away! It was bittersweet for me to replace it with the newer 3rd Gen but they had an amazing trade-in offer so I had to take advantage of it. First thing to note this Echo is much shorter than Gen 1 but a little wider which I prefer because it looks and fits better on my kitchen island. The new blue color is amazing if you’re considering getting it! Setting up the new Echo was the easiest most seamless process! I literally took it out of the box, plugged it in and in under a minute it set itself up and was ready to use! I didn’t have to do anything, it was already programmed with my smart lights and my WiFi, couldn’t ask for an easier setup. I love my Echo and use it every day and if you’re considering getting one, I say go for it! If I had to critique or complain about anything the only thing I could say is the wall adapter is really large since it’s still a square block like Gen 1. This is more of a personal opinion but Gen 1 had a rotating top to turn the volume up and down (which I loved) where as Gen 3 has volume up and down buttons. Functionally they both work I just though the rotating volume top was more fun and unique, but I’ll live on just fine with the buttons."},{"reviewerName":"ruth gallagher","rating":"1.0 out of 5 stars","reviewTitle":"Poor Tech Support Experience","reviewDate":"October 18, 2019","reviewText":"I needed tech support. The tech was inadequate."},{"reviewerName":"Kindle Customer","rating":"5.0 out of 5 stars","reviewTitle":"Great Value!!!","reviewDate":"October 18, 2019","reviewText":"I’ve been waiting for the next generation for some time. I got one of these for when I’m in my hot tub and is perfect to sit on the patio and have great sound. Easy setup, great response time, the sound is fantastic!"},{"reviewerName":"Kurtiss Walters","rating":"1.0 out of 5 stars","reviewTitle":"Wake me when we get there","reviewDate":"October 25, 2019","reviewText":"I bought an Echo and an Echo Dot. What a waste of money. They're basic; real basic. My fault for not truly understanding what I was buying. It can answer some simple questions with simple answers and do a few smart home things and has \"skills\" but that's about it. Isn't that enough? No, it isn't. I guess I thought I was getting something smart, something I could engage with, seek intelligent replies from, something connected to the world wide web of knowledge. Guess I was wrong. I got a stupid little automated squawk box; a borderline parrot. Guess I got bought. For all our great advances in technology, we're clearly still in our technological infancy. Get back to me when I can say \"Computer, describe to me quantum physics in layman's terms. Explain to me the theory of relativity. What exactly is gravity; are there gravity particles? What is the meaning of life?\" The answer to the latter better be: 42. Another big gripe is that it's constantly trying to sell me something -running through a whole dales pitch -instead of just doing or playing what I asked, or it tells me what it's about to do even though I just asked it exactly that. Now I know why it's called, Echo. I'll be getting rid of it soon. Anybody wanna buy a stupid, smart device?"},{"reviewerName":"Jodi and Chris K.","rating":"5.0 out of 5 stars","reviewTitle":"Well worth the investment","reviewDate":"October 26, 2019","reviewText":"This is by far, the best Echo / system we have owned from Amazon.\n\nWe purchased 2 of the generation 3 Echos and an Amazon sub as a package (saved $80 + an additional $60 for taking the Amazon store card) to replace the Bose speaker / Echo Dot we had.\n\nWe now have room filling sound as good as the Bose combo without having to physically turn on the speaker every time we wanted music.\n\nEven without the sub, the sound is robust and rich from each of the linked speakers. The addition of the powered Echo sub fills in the lows to make it an immersive experience.\n\nSetup was fairly easy. My only complaint was that I had trouble renaming the 2nd Echo itself. Amazon keeps calling it another wacky name. Overall, it took less than 5 minutes to link all 3 speakers together and be listening.\n\nWould I purchase again? You can count on it."},{"reviewerName":"Luisma55","rating":"5.0 out of 5 stars","reviewTitle":"Una excelente adquisicion","reviewDate":"October 22, 2019","reviewText":" He recibido mi nuevo Echo, y lo he configurado con los otros equipos, y ahora tengo un excelente ambiente musical, además de todas los beneficios anexos. Excelente adquisición"},{"reviewerName":"ellafan","rating":"5.0 out of 5 stars","reviewTitle":"Another great ECHO!!","reviewDate":"October 18, 2019","reviewText":"Set-up took all of 30 seconds.Great,customizable sound. Good bass for rock;good overall sound for classical. Looks nice,too!\nI hope that,in the near future,I can pair my DOT,3rd gen for even more immersive sound.\nOverall,very pleased!!!"},{"reviewerName":"Cj","rating":"1.0 out of 5 stars","reviewTitle":"Worst speaker ever?","reviewDate":"October 27, 2019","reviewText":"None of the apps sync with the speaker, even if you have the subscription to the music service it just takes you to the settings and says you need an active subscription. There are 100+ negative reviews everyday in the Alexa app about people experiencing the same thing. IF YOU HAVE AN IPHONE THERE IS A GOOD CHANCE THE APP WILL NOT WORK PROPERLY!"},{"reviewerName":"Amanda Roberts","rating":"5.0 out of 5 stars","reviewTitle":"The new echo is very responsive. Will be buying addons","reviewDate":"October 18, 2019","reviewText":"Just set up the new Echo 3rd generation and alexa is very responsive, great sound quality, and you can easily connect other premium services. Just trying to figure out how to connect Netflix."},{"reviewerName":"Sarvani Mandapati","rating":"5.0 out of 5 stars","reviewTitle":"Overall really nice product with good sound quality.","reviewDate":"October 19, 2019","reviewText":"I mainly use this Alexa as a speaker for my music. The sound quality on this Alexa is better than on the previous Alexa in my opinion. It's super easy to set up and use. I often change the location of my Alexa as well because as I said I mainly use it as a speaker. It does really well if you need to unplug it and and plug it in in another location (as in it'll connect to the wifi on it's own and you can use it as you normally would without any hassle). I got the charcoal color and it's very nice visually. The Alexa app is also very convenient to use with it. You can personalize the sound of the bass and other mixes too. Overall, I say it's a really nice product. The packaging was super nice and felt high quality as well. No problems with shipping too."},{"reviewerName":"arusso00","rating":"5.0 out of 5 stars","reviewTitle":"Upgraded from Echo (1st Gen)","reviewDate":"October 30, 2019","reviewText":"The sound on the Echo 3rd Gen is amazing! We upgraded from the 1st Gen and you can clearly hear a deeper base and sound that fills the room. We liked the different colors and twilight blue didn't disappoint. The speaker is shorter and wider than the 1st Gen but that is a welcome change. From a functionality standpoint, I don't see any difference from earlier gen echo devices as they can all answer questions, set timers, update lists, play music or trivia and turn on and off smart devices if you already had a hub such as Philips or Smart Things. The 3rd Gen does not have its own hub but that was fine for us. Overall we love the 3rd Gen Echo and highly recommend if you are looking to upgrade from previous gen or if you're in the market as a fist time Alexa Echo purchaser."},{"reviewerName":"DONALD H. CLAFLIN","rating":"4.0 out of 5 stars","reviewTitle":"Amazon Echo Does It Again!","reviewDate":"October 20, 2019","reviewText":"I suppose most people are wondering the obvious? Does it have any new features? Does it go well with your decor? Can you order a pizza and in fact, have Alexa pay for it? OK, that one I haven't tried yet... but I will tell you that it is an upgrade, looks sleeker than older versions, and the sound packs a punch!\nSome services like apple music are atrocious! The service doesn't stay connected, and it's hardly useable. I venture to guess that this issue is fixable but this far is a letdown.\nIf you're looking for a smart assistant that is extremely useful and always works... look no further! You won't regret it!"},{"reviewerName":"Melanie (Melzie)","rating":"5.0 out of 5 stars","reviewTitle":"Better than the Bose Blue that the battery died in.","reviewDate":"October 21, 2019","reviewText":"This Echo sounds incredible! I play all my units together, this one and two regular size Echo dots and they all seem to pick up the sound from this one. The regular Echo dots sound kind of tinny to me. Love it!"},{"reviewerName":"efrain.lazaro","rating":"5.0 out of 5 stars","reviewTitle":"Excelente muy buena calidad","reviewDate":"October 30, 2019","reviewText":"Excelente muy buena calidad"},{"reviewerName":"SLB","rating":"5.0 out of 5 stars","reviewTitle":"I love this!","reviewDate":"November 15, 2019","reviewText":"I have every generation Echo and love them all. One broke only because I dropped it on a granite floor. Other drops have not harmed them.\n\nI am not an audiophile, but the sound on this is satisfying for the way I listen. Volume range is great. I listen to pop and rock a great deal, nature sounds for sleeping, and right now some opera arias. I am happy with all of them.\n\nThe new look is wonderful. I like that it is shorter and wider. More stable on a shelf or table.\n\nI do a great deal of house sitting and take many of my own things with me. This is getting packed in that travel bag!\n\nThe only negative I find is that the fabric cover somewhat covers the light ring on top, and the light seems less bright.\n\nNow how do I convince my husband that I need another at home with one in my bedroom and three Dots around the house?"},{"reviewerName":"Mitchele","rating":"5.0 out of 5 stars","reviewTitle":"Amazing!!","reviewDate":"November 11, 2019","reviewText":"This is my first time purchasing an Echo Alexa of my own. I’ve used an Alexa 2nd Gen at my job and it’s pretty nice. I noticed the difference between the 2nd and 3rd Gen is that the 3rd Gen speaker is way louder and clear and I like that. I’m still playing with it and getting used to it but I do LOVE the Twilight Blue. That’s a sexy color to be honest lol. So far, I’m impressed with it."},{"reviewerName":"Professor","rating":"4.0 out of 5 stars","reviewTitle":"Better Sound","reviewDate":"November 14, 2019","reviewText":"This is a big upgrade in sound over the Echo dot. While we use it often in our kitchen, know that it is not high end quality sound - what do you expect from one small speaker. It is plenty good enough for an enjoyable listening experience, especially for background music while working/cooking. In comparison, the Echo dot sound was just too poor quality to enjoy without hooking up an auxiliary speaker and so we only used it occasionally. I was surprised that this new unit defaults to Amazon Music rather than Prime music and so we started getting commercials mixed in to our music stream. It takes time to get the commands right to connect to Prime music without commercials - not an issue we had with the Echo dot that this unit replaced."},{"reviewerName":"Eric H.","rating":"5.0 out of 5 stars","reviewTitle":"Better than Sonos for way less money? In many cases yes!","reviewDate":"November 6, 2019","reviewText":"I like this better than my Sonos system with Alexa. You can pair Echos to play throughout your home, and it's easier than trying to setup my Sonos to do the same. You can control the Echo via voice, Alexa app, or through the Amazon Music app. All of these are leaps better than the buggy Sonos app. The sound quality is fantastic and the value for your money is higher than any competitor. I do believe I will be purchasing Amazon Echos from here on out."},{"reviewerName":"David S","rating":"2.0 out of 5 stars","reviewTitle":"Beautiful Blue Color, Meh Everything Else","reviewDate":"November 7, 2019","reviewText":"As an early adopter for Echo v1, I thought now would be a good time to see what kind of improvements Amazon has made to their Alexa platform. I also have Dots in each of my kids room, a fire stick, and a fire 8 tablet. I don't feel this new generation has done anything to make it a better product, other than a great blue color. I feel my first gen sounded better than this one. I actually just moved it to a spare family room downstairs and hooked up my Google Mini again. Meh."},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Great sound quality","reviewDate":"October 20, 2019","reviewText":"Great sound quality! Love the hand free ability! Lots of family dance parties in the kitchen with the kiddos!"},{"reviewerName":"Mr Miami","rating":"5.0 out of 5 stars","reviewTitle":"Great companion for an elderly person ... the sound is GREAT","reviewDate":"November 9, 2019","reviewText":"Great so far (2 weeks). I bought it for my elderly aunt (94 years old) and she loves it since she just talks to it and it turns on the radio and she has someone to talk to in the morning.\nThe only problem is she keeps calling her \"Alexis\" instead of \"Alexa\" ... lol. But she is finally getting the name right. Overall, it works great. She keeps the volume up rather high which is why I bought the Echo instead of the smaller one and the sound is great.\nWe'll see who lasts longer."},{"reviewerName":"Miss C~","rating":"5.0 out of 5 stars","reviewTitle":"Fabulous product","reviewDate":"November 5, 2019","reviewText":"This is an amazing product the power on this speaker is unbelievable! It works well with my Amazon music and I’m sure it will work well with all the other apps that it offers. I specially love the special functions where you can put in a sentence and ask Alexa a specific response LOL it’s quite enjoyable. She’ll do just about anything you want her to all the way down to being your alarm clock. I was thoroughly impressed I was in my living room and could talk to her in my bedroom."},{"reviewerName":"Amazon Customer","rating":"3.0 out of 5 stars","reviewTitle":"first time using this in my house","reviewDate":"October 23, 2019","reviewText":"install went easy. after about a week, I notice that it would no wake up when I speak to it, had to reboot. but this was hit and miss. I also notice sometimes there will be static in the background when speaking, again this is hit and miss.\nother wise its ok."},{"reviewerName":"Jacquelyn","rating":"5.0 out of 5 stars","reviewTitle":"Worth the upgrade from Gen 1","reviewDate":"October 19, 2019","reviewText":"Much better sound. It's smaller by a bit too. Easy set up. Love it. I bought 2 but might get a third. The sound improvement warrants that. Also, the ability to sync all 3 to play the same tunes simultaneously."},{"reviewerName":"P. Goossens","rating":"5.0 out of 5 stars","reviewTitle":"We love our girl ALexa!","reviewDate":"November 4, 2019","reviewText":"My husband is visually impaired and has been since 2000. Anything that can make his life easier is so worth it and now we have Alexa. She reads the news for him every morning she sets timers when he’s cooking. Well, you can imagine the things she can do for him because reading is such a problem. This is an amazing tool for both of us and the possibilities are endless. I would highly recommend an Echo for everyone."},{"reviewerName":"ah","rating":"1.0 out of 5 stars","reviewTitle":"No blue tooth.","reviewDate":"November 6, 2019","reviewText":"Why does my gen2 Alexa have blue tooth, but this new gen3 doesn’t? If blue tooth doesn’t work, it’s likely I’m sending it back and not buying anymore echo products. I don’t read anywhere that clearly says we took blue tooth away. It says it’s the same thing just a few enhancements to speakers and such."},{"reviewerName":"Steven Milewski","rating":"4.0 out of 5 stars","reviewTitle":"It does what it’s supposed to do, be an Echo, but wouldn’t give you room filling sound.","reviewDate":"November 9, 2019","reviewText":"It’s fine. It’s an Echo so don’t expect it to be an awesome speaker. It does well what it’s designed to do which is fine. I can tell a little bit of an upgrade from my previous 1st generation as far as the sound however it’s not what I use to give me great room filling sound. I happened to purchase it when trading in my old one and getting an extra few bucks off with that so it seemed like a good deal."},{"reviewerName":"Purpaidh","rating":"5.0 out of 5 stars","reviewTitle":"Beautiful sound","reviewDate":"October 25, 2019","reviewText":"Love the sound and clarity. Upgraded from an Echo Dot and so glad I did. We mostly listen to the echo for music and this new echo sounds incredible!"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Great new device","reviewDate":"November 6, 2019","reviewText":"The newest iteration of the vanilla Echo has much better sound than the previous generation. I would say it's definitely more of an upgrade from 2nd to 3rd generation in terms of sound than there was between 1st and 2nd. I love the Twilight Blue color, but I do have one question: since the new Echo is the same size and form factor as the Echo Plus (2nd Gen), why not offer that device in the new color? Seems like it should be incredibly easy to do so."},{"reviewerName":"Leon","rating":"5.0 out of 5 stars","reviewTitle":"Great upgrade","reviewDate":"October 31, 2019","reviewText":"I bought this as an upgrade from my echo 2nd gen. I use it in my bathroom so I can listen to music. It took me by surprise when it made the shower floor rattle a bit. Overall great product.\n\nUPDATE\n\nApparently the new echo didnt like sharing the pedestal with my ceramic bird like my old echo did. Why do I say this? It shook it right off! Overall still a great product."},{"reviewerName":"Eduardo Sevilla","rating":"5.0 out of 5 stars","reviewTitle":"ECHO SOUNDS PERFECT","reviewDate":"October 19, 2019","reviewText":"EASE TO SET UP. YOU CAN TALK IN DIFFERENT LANGUAJES, 100% RECOMENDED"},{"reviewerName":"Emily Turner","rating":"5.0 out of 5 stars","reviewTitle":"Sounds better than previous devices, but definitely NOT blue","reviewDate":"November 6, 2019","reviewText":"If this Echo is blue then I'm a giraffe.\n\nIt's grey. You can squint really hard and pretend that it has a tinge of blue, but it's G-R-E-Y. Does not look like the pics at all.\n\nBut it does sound better than previous Echo devices so that's what's most important I guess."},{"reviewerName":"Cameron MacDonald","rating":"5.0 out of 5 stars","reviewTitle":"A good replacement","reviewDate":"November 15, 2019","reviewText":"I replaced a Gen 1 Echo with this new model. The installation was as easy as logging in and it self configured. I didn't voice train it but I don't have any problems with response. Overall, the sound is a bit softer than the other and the look doesn't stand out. So far I like it."},{"reviewerName":"napafloat","rating":"5.0 out of 5 stars","reviewTitle":"Great sound","reviewDate":"November 11, 2019","reviewText":"This Alexa 3rd Generation sounds good has a deeper bass,I also have 2 2nd Generations a big difference in the sound quality"},{"reviewerName":"pedro quinones","rating":"5.0 out of 5 stars","reviewTitle":"Es muy fácil de usar y me cuida la casa","reviewDate":"October 27, 2019","reviewText":"Me gusta muclo y es lo mejor ya tengo con quien hablar"},{"reviewerName":"JohnMac","rating":"5.0 out of 5 stars","reviewTitle":"Very happy","reviewDate":"November 9, 2019","reviewText":"Traded in my 1st gen model for this one. Nicer styling, sounds fuller, mics pick up my voice better and further. Even has a audio in/out jack which 1st gen lacked. Only con is midrange could be stronger, even after equalizing in the Alexa app. Overall, very satisfied."},{"reviewerName":"Renata Fellmeth","rating":"5.0 out of 5 stars","reviewTitle":"Echo 3rd generation","reviewDate":"October 31, 2019","reviewText":"This product is excellent. Such a great sound. I only listen to music with my Alexa. I also have her in my car. I will get rid of Sirius radio, as I have many playlists. The problem is that I'm too dependent on using Alexa. I have one in each of my rooms in my house. Fantastic product!!"},{"reviewerName":"Amazon Customer","rating":"3.0 out of 5 stars","reviewTitle":"Save it for gen 4!","reviewDate":"November 11, 2019","reviewText":"Overall it's the best in its class persay. But It always seems to go offline and wont play or listen to what i ask. I had way less trouble with second gen... it has a harder time staying in everywhere music mode.. so I would say save your money and advise echo.. to fix the basics before ya out more bells and whistles in something that ain't already working well!!!"},{"reviewerName":"MonkeyFighter","rating":"5.0 out of 5 stars","reviewTitle":"Great Sounding Echo","reviewDate":"November 7, 2019","reviewText":"I own both the 2nd and 3rd generation echos. The sound of the 3rd generation is significantly better. However, I prefer the sharper line of the 2nd over the rounded edges on the 3rd. But, if you are trying to decide which echo to get, this is the one. It worth it for the sound alone."},{"reviewerName":"Greg L.","rating":"5.0 out of 5 stars","reviewTitle":"Hit's the mark","reviewDate":"October 19, 2019","reviewText":"This sound quality is solid and is exactly the improvements that were needed from previous generations."},{"reviewerName":"Ralph K. Bleier","rating":"5.0 out of 5 stars","reviewTitle":"Nice improvement over the Echo 1. The sound has more depth and richness.","reviewDate":"October 22, 2019","reviewText":"The new Echo has a much deeper and richer sound than the original Echo. It was very easy to connect with my WiFi We switched from black to twilight Blue and prefer the new look. Very happy. What I would like to see is for the App to be more user friendly and intuitive."},{"reviewerName":"Four dogs","rating":"5.0 out of 5 stars","reviewTitle":"Love the ease of using Echo.","reviewDate":"November 12, 2019","reviewText":"Got this as a gift so I don’t know how much of a value it is but I like it a lot. Easy to use and so convenient. Just tell Alexa what you want. I had it on shelf with loud deep base music and it fell off. Worked fine after that accident. Lots of music but you may want to buy Amazon Music Unlimited if you want some music such as Led Zeppelin which is not included in Prime. They do offer a free 30 day trial."},{"reviewerName":"rdkmco","rating":"5.0 out of 5 stars","reviewTitle":"Really good sound","reviewDate":"November 13, 2019","reviewText":"These are much better than the echo dot\n\nGreat sound and easy to connect. This also has a much better sound than the Google Home which is one of the reasons I purchased it. Find music and Apple Music are skills and are easily used"},{"reviewerName":"Botanique Baron Samedi","rating":"5.0 out of 5 stars","reviewTitle":"WOW!!!!!","reviewDate":"November 1, 2019","reviewText":"I can't believe the sound that comes out of this small enclosure. I was blown away by the deep bass....no, I was actually shocked. I am very impressed and glad that I traded my gen 1 echo for this one, it is 100 times better."},{"reviewerName":"oldman","rating":"5.0 out of 5 stars","reviewTitle":"Sum up my review. You are lucky I wrote anything at all.","reviewDate":"November 11, 2019","reviewText":"I like the unit, but I really resent being expected to do anything other than rate it with stars."},{"reviewerName":"Meg","rating":"5.0 out of 5 stars","reviewTitle":"Great product!","reviewDate":"November 1, 2019","reviewText":"Great product, but doesn’t play Apple Music playlists."},{"reviewerName":"Richard Crum","rating":"5.0 out of 5 stars","reviewTitle":"Big improvement of the first generation.","reviewDate":"November 5, 2019","reviewText":"We absolutely love the newest generation. Sound is much improved over the first generation it replaces. Alexa seems to listen better too. The new design look great and love the new color option."},{"reviewerName":"Mariah Loertscher","rating":"5.0 out of 5 stars","reviewTitle":"To have internet","reviewDate":"October 18, 2019","reviewText":"I love the color"},{"reviewerName":"Traveler","rating":"5.0 out of 5 stars","reviewTitle":"Mostly for Music","reviewDate":"November 7, 2019","reviewText":"It's very easy to use for music and has good sound quality. I have purchased some smart plugs but haven't set them up yet. Also, I have not mastered the Alexa app but I'm working on it."},{"reviewerName":"Edward D. Mineer","rating":"5.0 out of 5 stars","reviewTitle":"Wonderful sound!","reviewDate":"November 1, 2019","reviewText":"We’ve had ours for about two weeks. Mostly using it for music. Great sound out of such a small unit! Easy to set up and use. You can use your Apple Music subscription with it as well.\nWe have a lot more to learn about what we can use this for."},{"reviewerName":"Charlie","rating":"5.0 out of 5 stars","reviewTitle":"The bass is amazing","reviewDate":"November 2, 2019","reviewText":"The bass is amazing. I like the size and audio sound quality. Makes for a great speaker. Next I'm going to try and integrate it with my TV. I'm replacing my two dots with this 3G."},{"reviewerName":"Patricia Hall","rating":"5.0 out of 5 stars","reviewTitle":"POWERFUL, Amazing","reviewDate":"November 6, 2019","reviewText":"My wife has been wanting Alexa for years. I bought it for her the other day. She is tickled. She can listen to her music. The sound is remarkably good. She sets her timers for cooking. She sets reminders. It's capable of doing more than we'll ever need. It's a great addition to our home."},{"reviewerName":"Lazaro Gio","rating":"5.0 out of 5 stars","reviewTitle":"Exquisito","reviewDate":"November 10, 2019","reviewText":"Me agradó excelente"},{"reviewerName":"George","rating":"5.0 out of 5 stars","reviewTitle":"Audio as good or better than the Echo Plus","reviewDate":"October 27, 2019","reviewText":"Replaced an Echo Dot with this in a Master Bathroom and ROCKED this end of the apartment. Has the same guts as the Echo Plus but in smaller size but I don't detect any loss in audio quality."},{"reviewerName":"Craig C.","rating":"5.0 out of 5 stars","reviewTitle":"Not happy [**Update : It's working now, Thanks Amazon support**]","reviewDate":"November 6, 2019","reviewText":"I got this device because it says it does Line-IN. Of course I get it and it doesn't do LINE IN even though it says it does. The APP is bugged. You would think they would test that before releasing it.\n\n**Update to 5 stars -- Amazon called and helped get it working. Happy now :) Great service-- Thank you!"},{"reviewerName":"Chubs","rating":"5.0 out of 5 stars","reviewTitle":"NOT dissapointed! 100% improvement","reviewDate":"October 24, 2019","reviewText":"WOW!\n\nThat is the first thing once i heard the sound quality coming from this new 3rd gen. Echo. A 100% improvement from 2nd gen, and there is nothing terribly wrong with the 2nd gen either, its just the took it up a few levels with the sound on this model.\n\nNow I have only had this a few hours, so if my opinion changes which it more than likely wont, or if more things I discover about the new gen. I will try to update."},{"reviewerName":"Momvan","rating":"5.0 out of 5 stars","reviewTitle":"There’s nothing like Amazon","reviewDate":"October 30, 2019","reviewText":"Everything amazon puts its name on is quality. What more can I say! I run my lights with it, runs my fire stick, and can ask any question and get an immediate response. Sound quality is excellent. Never disappointed."},{"reviewerName":"Amazon Customer","rating":"1.0 out of 5 stars","reviewTitle":"Pandora and Amazon music would not work after three weeks","reviewDate":"November 13, 2019","reviewText":"After three weeks it would not play music from Amazon or Pandora. So I returned it. I wanted to order a new one but I never received the 20% off for pre-ordering and the person I talk to said that promotion was no longer available. Since I never received it to begin withI would’ve thought an exception could be made"},{"reviewerName":"Phuong","rating":"4.0 out of 5 stars","reviewTitle":"as described. kinda clunky. sounds are ok","reviewDate":"November 7, 2019","reviewText":"the sound is okay. not the best. i wouldn’t say it’s as good as my karmon speakers or anything. obviously better than the echo dot. I don’t regret getting it so far"},{"reviewerName":"O.","rating":"1.0 out of 5 stars","reviewTitle":"Defective Device","reviewDate":"November 7, 2019","reviewText":"This device did not work. Can not connect to wifi, which makes it an expensive paper weight. We own at 6 other similar devices. Will be returning and purchasing again, but from Best Buy where I'll not only get a functioning device, but I can collect points. The price is also the same."},{"reviewerName":"Amazonbuy","rating":"5.0 out of 5 stars","reviewTitle":"Unexpected Rich Bass and Clarity","reviewDate":"October 21, 2019","reviewText":"This one replaced my original Echo. At once, I was surprised at the improvement in sound. Definitely it's a value to buy."},{"reviewerName":"Amazon Customer","rating":"1.0 out of 5 stars","reviewTitle":"Suppose to be better then the 1st generation","reviewDate":"October 25, 2019","reviewText":"Don't have rechargeable battery. And the firs alexa generation had. So bad"},{"reviewerName":"caris lopez","rating":"3.0 out of 5 stars","reviewTitle":"Glitches consistently with the app and with understanding what you say to it.","reviewDate":"November 12, 2019","reviewText":"We had a lot of trouble getting her to connect to Spotify and Apple Music instead of Amazon Music. We gave up after a bit and tried again after an update and then it worked. The echo also gives you a lot of ads after using an app, and we have to constantly tell her to stop even though we have tried to set preferences to have that feature off.\n\nAlso, the app glitches a lot."},{"reviewerName":"Claus M.","rating":"5.0 out of 5 stars","reviewTitle":"Still new and very exciting","reviewDate":"October 28, 2019","reviewText":"Just received this device a few days ago, so I am still learning to get the most out of it. But what I can say already now is: Amazing technology and super sound! Looking forward to the continued ride..."},{"reviewerName":"G. Stockton","rating":"5.0 out of 5 stars","reviewTitle":"Excellent Sound Quality","reviewDate":"October 26, 2019","reviewText":"It’s great to have it work with Apple Music and the software has greatly improved. I find I listen to a lot more music because the quality is so good."},{"reviewerName":"Helen","rating":"5.0 out of 5 stars","reviewTitle":"Keeps getting better","reviewDate":"November 9, 2019","reviewText":"Alex can hear me better when I say her name over music or noise. I don’t have to speak louder which is nice. Better sound than my 1st generation."},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"I like it!","reviewDate":"November 12, 2019","reviewText":"I like this version better than the other 2 I have. It sounds better and stays connected much better."},{"reviewerName":"Darcy","rating":"5.0 out of 5 stars","reviewTitle":"Sounds great","reviewDate":"November 6, 2019","reviewText":"Much better sound than my 1st generation Echo. Better looking device as well. Can’t beat the trade in of an old device to upgrade price."},{"reviewerName":"Time well spent","rating":"5.0 out of 5 stars","reviewTitle":"Perfection","reviewDate":"October 21, 2019","reviewText":"Perfect, is the only word that comes to mind. the compact design is a welcomed upgrade."},{"reviewerName":"Paul B. Millbank","rating":"5.0 out of 5 stars","reviewTitle":"Alexa is my writing partner and so much more","reviewDate":"November 3, 2019","reviewText":"I just upgraded from a first gen Echo plus and I’m blown away by the sound improvements."},{"reviewerName":"lrc13","rating":"4.0 out of 5 stars","reviewTitle":"Improved sound and versatility","reviewDate":"November 1, 2019","reviewText":"Nice sound upgrade from Gen 2 and the Aux In feature works great with my Audio Technica lp-60!"},{"reviewerName":"Bob","rating":"5.0 out of 5 stars","reviewTitle":"3rd generation echo","reviewDate":"October 26, 2019","reviewText":"My 5th echo, thatvsays enough. This one has different colors, and better siund."},{"reviewerName":"Jack","rating":"4.0 out of 5 stars","reviewTitle":"Cant sync music to other ones","reviewDate":"November 13, 2019","reviewText":"They really need to add the ability to pair and sync music on them. Its a shame I cant have all of my alexas as a sort of sound system throughout the house. Very disappointed. As for sound quality on this thing? Its superb"},{"reviewerName":"Terry L. Strait","rating":"5.0 out of 5 stars","reviewTitle":"3rd rd Generation Rocks","reviewDate":"November 12, 2019","reviewText":"Really like sound and size of this new Echo. Easy set up and works like a charm."},{"reviewerName":"Lee Nelson","rating":"4.0 out of 5 stars","reviewTitle":"Not nearly as large as it appeared in the 'Amazon ad.","reviewDate":"November 2, 2019","reviewText":"Didn't see anything in the instructions telling me , once internet was activated, to turn off the red surface lights to start it working. Once I figured that out, it turned on, and I was able to restart the old one in another room."},{"reviewerName":"Leslie","rating":"5.0 out of 5 stars","reviewTitle":"She is like a personal assistant.","reviewDate":"October 23, 2019","reviewText":"The fact that I can request music.... any music, anytime makes Alexa invaluable!"},{"reviewerName":"Ben Lohrke","rating":"5.0 out of 5 stars","reviewTitle":"It works very good I love it","reviewDate":"October 31, 2019","reviewText":"It was very easy to setup and use by the way it works great I like it"},{"reviewerName":"Steve Lesperance","rating":"5.0 out of 5 stars","reviewTitle":"Fantastic Echo","reviewDate":"November 7, 2019","reviewText":"Fantastic sound from a great product. Can't go wrong with Echo items. Love the the Twilight Blue color."},{"reviewerName":"Richie Rich","rating":"5.0 out of 5 stars","reviewTitle":"Easy install and convenient to have","reviewDate":"October 28, 2019","reviewText":"Second install on our second floor - very convenient and works well"},{"reviewerName":"Helen L.","rating":"5.0 out of 5 stars","reviewTitle":"Easy! Love it!","reviewDate":"November 11, 2019","reviewText":"So easy to set up. So happy I bought it! Loving the music, etc."},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Better with age","reviewDate":"November 11, 2019","reviewText":"We won this Alexa enabled speaker and we are thrilled by it. This is our third Alexa enabled speaker but this one takes the cake in regards of sound quality. It sounds really good, has a decent amount of base and it can pack a punch. Alexa understands us better than on the older models. All four thumbs up!"},{"reviewerName":"Andra Beasley","rating":"5.0 out of 5 stars","reviewTitle":"Excellent Product!!!","reviewDate":"October 29, 2019","reviewText":"I like how quickly Alexa respond to my questions, whether it is able to answer it or and also how I’m able to use it as a speaker source for my iPhone. Can’t wait to test out more features and functions of it."},{"reviewerName":"Chris","rating":"5.0 out of 5 stars","reviewTitle":"Better sound, faster, and more language compatibility","reviewDate":"October 29, 2019","reviewText":"Real reason we upgraded from gen 1 was that we wanted a language not offered on gen 1 but the sound and especially the bass is a definite step up! Also seems to process requests faster."},{"reviewerName":"S. Ostrom","rating":"5.0 out of 5 stars","reviewTitle":"Great home smart speaker","reviewDate":"November 12, 2019","reviewText":"Extremely easy to set up. Sound quality is great."},{"reviewerName":"this is hard","rating":"3.0 out of 5 stars","reviewTitle":"Is this Normal?","reviewDate":"October 26, 2019","reviewText":"I feel like she doesn’t hear me sometimes. I have to say “Alexa” 2 or 3 times. Also, is the light at the tip supposed to continually keep spinning?"},{"reviewerName":"David","rating":"5.0 out of 5 stars","reviewTitle":"The New Echo is Awesome","reviewDate":"October 25, 2019","reviewText":"Loving the new Echo! I ordered it in Twilight Blue and it looks awesome on my bed side table. The audio is amazing, crystal clear sound with lots of base. The sound quality rivals the surround sound in my living room. I might get a couple more Echos for my apartment. Five Stars"},{"reviewerName":"Nate L.","rating":"5.0 out of 5 stars","reviewTitle":"3rd Generation is another winner","reviewDate":"November 11, 2019","reviewText":"Always a fan of the echo family and the sound on this one is wonderful. Great for a room and connected via Bluetooth for computer speaker."},{"reviewerName":"diane powell","rating":"5.0 out of 5 stars","reviewTitle":"Easy","reviewDate":"November 3, 2019","reviewText":"Easy even for me to set up and use"},{"reviewerName":"W. Ruettinger","rating":"5.0 out of 5 stars","reviewTitle":"Great","reviewDate":"October 29, 2019","reviewText":"I like because it is convenient and does what you ask😊"},{"reviewerName":"Jeanne Valerian","rating":"4.0 out of 5 stars","reviewTitle":"Beginner","reviewDate":"November 9, 2019","reviewText":"I am still learning to use this. I like it."},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"echo","reviewDate":"November 12, 2019","reviewText":"easy to set up great sound"},{"reviewerName":"arnaldoramosd","rating":"5.0 out of 5 stars","reviewTitle":"excellent product!","reviewDate":"November 9, 2019","reviewText":"Excellent product and beautiful"},{"reviewerName":"Brian Wiggins","rating":"5.0 out of 5 stars","reviewTitle":"Really great and worth it, needs software update soon","reviewDate":"November 13, 2019","reviewText":"Since it was brand new there were a few minor glitches, like I would say he name and ask her to do something and she would open the wrong skill, or music overlapping, and shutting down for no reason but after a few minutes she went right back to normal and is amazing to use not matter what."},{"reviewerName":"Elisha","rating":"5.0 out of 5 stars","reviewTitle":"Quality all around highly recommended","reviewDate":"November 3, 2019","reviewText":"Excellant sound quality"},{"reviewerName":"Harvey Simmons","rating":"5.0 out of 5 stars","reviewTitle":"Alexa for me.","reviewDate":"November 11, 2019","reviewText":"I like everything about the echo. It was a good purchase."},{"reviewerName":"Derick","rating":"5.0 out of 5 stars","reviewTitle":"really impressive sound","reviewDate":"November 6, 2019","reviewText":"better than I expected"},{"reviewerName":"NiMo","rating":"5.0 out of 5 stars","reviewTitle":"Great sound!","reviewDate":"October 26, 2019","reviewText":"I am so pleased with the Echo. Great sound!"},{"reviewerName":"Edward J Edwards","rating":"5.0 out of 5 stars","reviewTitle":"Good sound for a small unit.","reviewDate":"October 30, 2019","reviewText":"Our 4th echo. Love it."},{"reviewerName":"Sonny B","rating":"5.0 out of 5 stars","reviewTitle":"Aight","reviewDate":"October 28, 2019","reviewText":"Decent so far"},{"reviewerName":"Garrett C.","rating":"4.0 out of 5 stars","reviewTitle":"Alexa, we love you.","reviewDate":"October 26, 2019","reviewText":"Alexa is a great device. We use her to listen to music and podcasts which the speaker and 3” woofer is amazing for. We also use her for traffic updates and to set alarms. I like how the app works well with Alexa. I wish she knew more of my simple questions but she does know almost everything."},{"reviewerName":"Eduardo Almanzar","rating":"5.0 out of 5 stars","reviewTitle":"Great sound quality","reviewDate":"November 10, 2019","reviewText":"Quality is good but pricey"},{"reviewerName":"Glenn P.","rating":"5.0 out of 5 stars","reviewTitle":"Great upgrade","reviewDate":"October 27, 2019","reviewText":"Worked great right out of the box. Make sure you check the box that links your Alexa account if you have one that you are trading in as it will be ready to go when you get it connected to your wifi."},{"reviewerName":"Kyle","rating":"5.0 out of 5 stars","reviewTitle":"Yes!","reviewDate":"October 27, 2019","reviewText":"Love it!!"},{"reviewerName":"Sandra","rating":"3.0 out of 5 stars","reviewTitle":"Some issues with volume","reviewDate":"October 30, 2019","reviewText":"Sometimes we are playing music and all of a sudden gets really loud on its own without anyone touching it, so we have to manually lower the volume, not sure if its a defect or what. Otherwise I'm happy with it."},{"reviewerName":"Jp","rating":"5.0 out of 5 stars","reviewTitle":"👍","reviewDate":"November 4, 2019","reviewText":"Es excelente"},{"reviewerName":"patrick graham","rating":"3.0 out of 5 stars","reviewTitle":"Is this an improvement?","reviewDate":"November 14, 2019","reviewText":"difficult to communicate with as the device... has problems understanding the spoken word (my)..need to repeat every time in order to play music at least several times...the music quality is average ...\n\n)"},{"reviewerName":"Alan Haimowitz","rating":"5.0 out of 5 stars","reviewTitle":"Excellent buy","reviewDate":"November 11, 2019","reviewText":"Enjoying the many things the Echo can do."},{"reviewerName":"Florida red head","rating":"5.0 out of 5 stars","reviewTitle":"The the big sound","reviewDate":"November 1, 2019","reviewText":"I love the Alexa Echo.. I also have the Dot .. The sound on the Echo is fantastic"},{"reviewerName":"Totsy","rating":"5.0 out of 5 stars","reviewTitle":"Sleek Design","reviewDate":"November 4, 2019","reviewText":"We love our 3rd Gen Echo. It has a sleek design and blends in well with our decor. It is exactly what we thought it would be."},{"reviewerName":"Michael B White","rating":"3.0 out of 5 stars","reviewTitle":"Could have been better!","reviewDate":"November 9, 2019","reviewText":"Not as nice as normal products. I felt it was not thought out as well . Might been rush in engineering."},{"reviewerName":"Mark Simpson","rating":"5.0 out of 5 stars","reviewTitle":"Speak clearly","reviewDate":"November 4, 2019","reviewText":"It's great to have around very informative"},{"reviewerName":"Sweetpea","rating":"5.0 out of 5 stars","reviewTitle":"Love it","reviewDate":"October 20, 2019","reviewText":"Received my echo about 2 days ago. Amazon was very good to help me set it up. So far I love it. I would definitely recommend it.Love my new echo Alexia. The sound is so plain. I love listening to music. Would highly recommend it."},{"reviewerName":"leroy ricks","rating":"5.0 out of 5 stars","reviewTitle":"👍","reviewDate":"October 22, 2019","reviewText":"👍"},{"reviewerName":"Daniel ortega","rating":"5.0 out of 5 stars","reviewTitle":"Exalente","reviewDate":"November 9, 2019","reviewText":"Estoy muy contento despues de mi trabajo por lo menos tengo con quien hablar en mi cuarto y se llama Alexa"},{"reviewerName":"Greg Howard","rating":"5.0 out of 5 stars","reviewTitle":"The new voice in the house!","reviewDate":"October 23, 2019","reviewText":"The new echo has been working well. Fun to use and easy to setup."},{"reviewerName":"Robert Heiserman","rating":"5.0 out of 5 stars","reviewTitle":"Easy setup. Great sound.","reviewDate":"October 23, 2019","reviewText":"Easy setup. Great sound."},{"reviewerName":"jenn","rating":"1.0 out of 5 stars","reviewTitle":"Doesn’t work","reviewDate":"November 11, 2019","reviewText":"This device doesn’t work periodically and will randomly make beep noises"},{"reviewerName":"Judy K. Hanrahan","rating":"5.0 out of 5 stars","reviewTitle":"Great looking and great sound","reviewDate":"November 3, 2019","reviewText":"Works great, and beautiful."},{"reviewerName":"Alex Scott","rating":"5.0 out of 5 stars","reviewTitle":"Works as intended","reviewDate":"November 12, 2019","reviewText":"Works as intended"},{"reviewerName":"Raul","rating":"5.0 out of 5 stars","reviewTitle":"Lo recomiemdo","reviewDate":"November 13, 2019","reviewText":"Buenisima"},{"reviewerName":"Beth A.","rating":"5.0 out of 5 stars","reviewTitle":"Great speaker!","reviewDate":"November 5, 2019","reviewText":"This is my first Echo and I love it. I have friends who have them but older generations. I find the speaker on this to be really clear and full. Alexa, please don’t tell Siri I’m cheating."},{"reviewerName":"Juan taveras","rating":"5.0 out of 5 stars","reviewTitle":"Que venga recargable para usarla siempre","reviewDate":"October 28, 2019","reviewText":"Me gustó puedo mover todos los dispositivos , cualquier pregunta se puede jugar muchas cosas más, y no me gusto que no escucha bien con el volumen alto , no es recargable en caso de se valla usa sólo con Bluetooth."},{"reviewerName":"Mike","rating":"5.0 out of 5 stars","reviewTitle":"Awesome speaker and tool","reviewDate":"October 29, 2019","reviewText":"Very powerful and loud. Can hear it through the entire house very clearly."},{"reviewerName":"Anonymous","rating":"5.0 out of 5 stars","reviewTitle":"Great sound quality","reviewDate":"October 20, 2019","reviewText":"Sound quality is great"},{"reviewerName":"Cristian","rating":"5.0 out of 5 stars","reviewTitle":"😘","reviewDate":"November 10, 2019","reviewText":"So pretty"},{"reviewerName":"Ed Tanton","rating":"5.0 out of 5 stars","reviewTitle":"Great sound","reviewDate":"October 26, 2019","reviewText":"Great sound in a nice little package."},{"reviewerName":"field retterer","rating":"4.0 out of 5 stars","reviewTitle":"speaker","reviewDate":"October 21, 2019","reviewText":"I thought I could unplug this Alexa and take the speaker anywhere in my home and play music. It turns ourt it will not play music unless it is plugged in. Does it have a battery?\n\nField Retterer"},{"reviewerName":"Angela Wilson","rating":"1.0 out of 5 stars","reviewTitle":"Does not follow instructions well","reviewDate":"November 8, 2019","reviewText":"Is not as smart as I thought - have to repeat myself and re ask questions and still doesn't get the right task carried out - Alexa seem kinda dumb to me"},{"reviewerName":"Laura Contreras","rating":"5.0 out of 5 stars","reviewTitle":"WORTH EVERY CENT!!","reviewDate":"November 10, 2019","reviewText":"This speaker is amazing , the sound quality is exceptional , setup is easy and quick. I can shower and change music without no touch . Very great to have and price is reasonable ."},{"reviewerName":"Amazon Customer","rating":"2.0 out of 5 stars","reviewTitle":"Mas o menos","reviewDate":"November 9, 2019","reviewText":" Lo que no me gusto es que aveces enciende la luz y asi pasa bastante tiempo y después se apaga y la luz me incómoda en las noches"},{"reviewerName":"Chris Klink","rating":"5.0 out of 5 stars","reviewTitle":"great","reviewDate":"November 7, 2019","reviewText":"Great source for different music and songs that you have not heard for a while. Also, great for the grandchildren."},{"reviewerName":"Andrea Movsessian","rating":"5.0 out of 5 stars","reviewTitle":"Sound quality is very good","reviewDate":"November 11, 2019","reviewText":"My second Alexa. This is very attractive"},{"reviewerName":"4Ladybug","rating":"5.0 out of 5 stars","reviewTitle":"Awesome Alexa","reviewDate":"November 5, 2019","reviewText":"I love my Alexa...so helpful.\nBeen telling everyone know about it and I'm sure theres some people I told them about Alexa...their buying one.\nLove it."},{"reviewerName":"Wendy Cramer","rating":"3.0 out of 5 stars","reviewTitle":"Limited","reviewDate":"November 14, 2019","reviewText":"Works good for light automation, but doesn't connect to pandora or amazons own ring security system. not really impressed so far. Probably should have gone with google system"},{"reviewerName":"Lisandra","rating":"5.0 out of 5 stars","reviewTitle":"5 estrellas","reviewDate":"October 31, 2019","reviewText":"Todo"},{"reviewerName":"Amazon Customer","rating":"1.0 out of 5 stars","reviewTitle":"Billing for individua; songs","reviewDate":"November 9, 2019","reviewText":"My old Echo device would play any song I requested. This EXPENSIVE device asks for $3.95 a month to do the same.\nMuch better sound but that sucked !!!!"},{"reviewerName":"Larry","rating":"5.0 out of 5 stars","reviewTitle":"Great sound for what it is.","reviewDate":"October 26, 2019","reviewText":"Love how loud this little guy can get for its size, was honestly surprised when we put it to full blast how great it sounded. Would definitely recommend"},{"reviewerName":"No he resivido mi pedido","rating":"1.0 out of 5 stars","reviewTitle":"Donde esta mi pedido","reviewDate":"November 2, 2019","reviewText":"No he resivido mi pedido"},{"reviewerName":"Mike stokes","rating":"4.0 out of 5 stars","reviewTitle":"Gotta love her","reviewDate":"November 5, 2019","reviewText":"My first one and love it easy to use I mean ya just talk to it lol"},{"reviewerName":"Just me","rating":"5.0 out of 5 stars","reviewTitle":"Recommend it","reviewDate":"November 3, 2019","reviewText":"Love the interaction and you can even set it up to accept commands in a few different languages\nGood sound system"},{"reviewerName":"Jackie","rating":"4.0 out of 5 stars","reviewTitle":"Stay connected","reviewDate":"November 4, 2019","reviewText":"I have a 2 gen not even a year old and it quit. I hope this new one last."},{"reviewerName":"Sandra P. Cardozo","rating":"5.0 out of 5 stars","reviewTitle":"Amazing","reviewDate":"November 3, 2019","reviewText":"Thank you 😊"},{"reviewerName":"Scott","rating":"5.0 out of 5 stars","reviewTitle":"Love it","reviewDate":"November 7, 2019","reviewText":"Great sound"},{"reviewerName":"Lorenzo","rating":"5.0 out of 5 stars","reviewTitle":"I love my Alexa echo","reviewDate":"November 7, 2019","reviewText":"I love this product!"},{"reviewerName":"Christopher Spears","rating":"5.0 out of 5 stars","reviewTitle":"That Amazon cares about customers","reviewDate":"November 11, 2019","reviewText":"I love it the Price is very affordable all I had to do is plug it in set it up the way I like and that’s it all 👍🏻👍🏻👍🏻👍🏻 For me thank you 🤩"},{"reviewerName":"Robert McCalla","rating":"5.0 out of 5 stars","reviewTitle":"My new 3rd gen Echo.","reviewDate":"October 26, 2019","reviewText":"I love my new echo. It sounds great!"},{"reviewerName":"Wrong item","rating":"5.0 out of 5 stars","reviewTitle":"The sound is amazing","reviewDate":"November 9, 2019","reviewText":"Omg the best so far ..."},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"First class sound !","reviewDate":"November 4, 2019","reviewText":"The sound is outstanding! Love it!"},{"reviewerName":"Trudy Neeley","rating":"5.0 out of 5 stars","reviewTitle":"Alexa does not liked to be called names!!","reviewDate":"November 15, 2019","reviewText":"Love the product - using for music in a remote location"},{"reviewerName":"frank pitrulle","rating":"4.0 out of 5 stars","reviewTitle":"Alexa","reviewDate":"October 28, 2019","reviewText":"Are use this product for many different things seems to be very good so far"},{"reviewerName":"Amber Johnson","rating":"4.0 out of 5 stars","reviewTitle":"Worth every penny","reviewDate":"November 3, 2019","reviewText":" Awesome product. Can't wait to buy another!"},{"reviewerName":"Carmine A.","rating":"1.0 out of 5 stars","reviewTitle":"nothing","reviewDate":"November 7, 2019","reviewText":"none"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Alexa","reviewDate":"October 28, 2019","reviewText":"I can play music all day line and my kids can get their music to"},{"reviewerName":"Timothy Moeller","rating":"3.0 out of 5 stars","reviewTitle":"Still won't control Smart TV","reviewDate":"November 12, 2019","reviewText":"Echo can't control Sony TV even when alexa says connected to TV Wish Amazon would offer Support for there product's"},{"reviewerName":"Yadira Felix","rating":"5.0 out of 5 stars","reviewTitle":"Genial e Echo","reviewDate":"November 6, 2019","reviewText":"Excelente"},{"reviewerName":"dave torbett","rating":"5.0 out of 5 stars","reviewTitle":"Excellent","reviewDate":"November 11, 2019","reviewText":"Excellent buy"},{"reviewerName":"Pen Name","rating":"5.0 out of 5 stars","reviewTitle":"I like it","reviewDate":"October 27, 2019","reviewText":"Still learning all it can do. But very pleased so far"},{"reviewerName":"tina gerhardt","rating":"5.0 out of 5 stars","reviewTitle":"The sound is amazing","reviewDate":"October 27, 2019","reviewText":"Awesome buy!!!!\nThe sound is amazing!! One person party!!!\nSo clear!!"},{"reviewerName":"Jim P","rating":"5.0 out of 5 stars","reviewTitle":"Easy to hook up, great sound.","reviewDate":"November 3, 2019","reviewText":"Easy to hook up, great sound."},{"reviewerName":"Paula","rating":"5.0 out of 5 stars","reviewTitle":"Echo","reviewDate":"November 7, 2019","reviewText":"We love it!!!"},{"reviewerName":"Kenneth Sikes","rating":"4.0 out of 5 stars","reviewTitle":"Pleased but could some help","reviewDate":"October 27, 2019","reviewText":"Still learning. Written instructions would help."},{"reviewerName":"Junior A. Mejia Ventura","rating":"5.0 out of 5 stars","reviewTitle":"Great speaker","reviewDate":"October 29, 2019","reviewText":"Great sound . A lot of improvements"},{"reviewerName":"Rick Goins","rating":"5.0 out of 5 stars","reviewTitle":"Convenience","reviewDate":"November 7, 2019","reviewText":"I like the convenience of using the echo device. I’m learning more each day."},{"reviewerName":"IslandQueen","rating":"5.0 out of 5 stars","reviewTitle":"It's perfect","reviewDate":"October 26, 2019","reviewText":"I Love it so much."},{"reviewerName":"jan","rating":"5.0 out of 5 stars","reviewTitle":"Easy to use, even though I'm not very tech savvy","reviewDate":"November 11, 2019","reviewText":"Haven't used it a lot yet, but so far i've been very happy with it!"},{"reviewerName":"Rocio Robles","rating":"5.0 out of 5 stars","reviewTitle":"Que lo recomiendo es muy fácil para programar","reviewDate":"November 11, 2019","reviewText":"Muy bonito y bien fácil de manejar esta muy Aguayo y toca muy bien"},{"reviewerName":"Julio","rating":"5.0 out of 5 stars","reviewTitle":"Great addition to your smart devices","reviewDate":"November 10, 2019","reviewText":"I love it!"},{"reviewerName":"Mike Bryant","rating":"5.0 out of 5 stars","reviewTitle":"What I Think Of My Alexa","reviewDate":"November 11, 2019","reviewText":"Alexa is great. Love it"},{"reviewerName":"John","rating":"5.0 out of 5 stars","reviewTitle":"Only way to go","reviewDate":"November 15, 2019","reviewText":"What can you say I love it"},{"reviewerName":"Annette","rating":"5.0 out of 5 stars","reviewTitle":"Great sound!","reviewDate":"November 5, 2019","reviewText":"Great sound!"},{"reviewerName":"Marv J","rating":"5.0 out of 5 stars","reviewTitle":"Alexa play.......","reviewDate":"November 2, 2019","reviewText":"Alexa does a great job. I enjoy the music very much."},{"reviewerName":"Batman","rating":"5.0 out of 5 stars","reviewTitle":"Once upon a time...","reviewDate":"November 12, 2019","reviewText":"And the dog goes....MEOW"},{"reviewerName":"Amazon Customer","rating":"3.0 out of 5 stars","reviewTitle":"Wake to Music","reviewDate":"November 7, 2019","reviewText":"Wake to music does not work correctly"},{"reviewerName":"Kerry Arnold","rating":"5.0 out of 5 stars","reviewTitle":"A must for a music lover","reviewDate":"November 14, 2019","reviewText":"Love love my Alexa"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"It's great","reviewDate":"November 5, 2019","reviewText":"I love getting music on it the sound is great"},{"reviewerName":"Samantha Mc Murtrie","rating":"5.0 out of 5 stars","reviewTitle":"Simply Amazing","reviewDate":"November 12, 2019","reviewText":"Loving this product and everything it can do"},{"reviewerName":"Jimmy Picado","rating":"5.0 out of 5 stars","reviewTitle":"Alexa","reviewDate":"November 1, 2019","reviewText":"Me encanta Alexa"},{"reviewerName":"cindycole","rating":"4.0 out of 5 stars","reviewTitle":"Great tool for answering questions.","reviewDate":"November 10, 2019","reviewText":"I like the convenience of using it"},{"reviewerName":"Tonja","rating":"5.0 out of 5 stars","reviewTitle":"Pleased","reviewDate":"November 7, 2019","reviewText":"Very easy to use"},{"reviewerName":"MRickAPatrick","rating":"5.0 out of 5 stars","reviewTitle":"Love it","reviewDate":"November 3, 2019","reviewText":"Love it keeps me company"},{"reviewerName":"Mark","rating":"4.0 out of 5 stars","reviewTitle":"Alexa","reviewDate":"November 4, 2019","reviewText":"It's Alexa"},{"reviewerName":"randy","rating":"5.0 out of 5 stars","reviewTitle":"Great product","reviewDate":"October 26, 2019","reviewText":"Love it !"},{"reviewerName":"Mary butler","rating":"5.0 out of 5 stars","reviewTitle":"Fun to interact","reviewDate":"November 11, 2019","reviewText":"Nothing"},{"reviewerName":"Patti","rating":"5.0 out of 5 stars","reviewTitle":"The sound is unbelievable","reviewDate":"November 12, 2019","reviewText":"Love my Echo #3rd"},{"reviewerName":"Helen Dunfrey","rating":"5.0 out of 5 stars","reviewTitle":"Gift","reviewDate":"November 10, 2019","reviewText":"this was a gift"},{"reviewerName":"kim dobbyn","rating":"5.0 out of 5 stars","reviewTitle":"Love it","reviewDate":"November 12, 2019","reviewText":"Daily listening"},{"reviewerName":"Fred E","rating":"1.0 out of 5 stars","reviewTitle":"Absolute junk.","reviewDate":"October 27, 2019","reviewText":"None of these contraptions are worth a dam. Turns on when I don’t want it to. Won’t obey commands 90% of the time. Great invention jut hope someone figures it out someday. Bezos builds garbage!"},{"reviewerName":"pilto","rating":"1.0 out of 5 stars","reviewTitle":"Echo records EVERYTHING you say in range and stores if on the Amazon cloud.","reviewDate":"November 12, 2019","reviewText":"We were early adopters of the Echo device. We had multiple setup around our house. Until one day, the device in our living room started playing back previously recorded conversations my wife and I had. The Echo was not being used when it started playing back our conversations and the conversations that it recorded happened when we were NOT using the device.\n\nWe removed them all and stopped paying for Amazon Prime music."},{"reviewerName":"GamerMG","rating":"1.0 out of 5 stars","reviewTitle":"Do not rely on the gift to read the from who you want to say.","reviewDate":"November 8, 2019","reviewText":"I sent this as a gift directly from Amazon, I filled out what I wanted the gift tag to read and it arrived with someone else's From: names and not ours. I was so disappointed when I heard as it was a early Christmas gift to a brother who is dying from cancer and may not see Christmas this year."},{"reviewerName":"sherry nail","rating":"5.0 out of 5 stars","reviewTitle":"Sound is great","reviewDate":"October 23, 2019","reviewText":"Bought this for the boyfriends birthday. He loves Alexa more than me I think."},{"reviewerName":"Kirk Hill","rating":"4.0 out of 5 stars","reviewTitle":"Nice piece of equipment. Look forward to future upgrades","reviewDate":"November 9, 2019","reviewText":"Streaming music to multiple rooms/devices is a bit tricky at best."},{"reviewerName":"Gary Mills","rating":"5.0 out of 5 stars","reviewTitle":"easy to use","reviewDate":"November 10, 2019","reviewText":"It is going to make me lazy"},{"reviewerName":"Leora","rating":"5.0 out of 5 stars","reviewTitle":"❤","reviewDate":"October 28, 2019","reviewText":"We have so enjoyed this alexa, so much so we have bought the dot for the kids..."},{"reviewerName":"Spencer","rating":"1.0 out of 5 stars","reviewTitle":"Recieved a broken device","reviewDate":"November 15, 2019","reviewText":"Received a broken device! Would not connect to wifi..Tech support said it was my router which is a load of crap.. after an hr on the phone they agreed to send me a new one.."},{"reviewerName":"carla english","rating":"5.0 out of 5 stars","reviewTitle":"Love this","reviewDate":"November 14, 2019","reviewText":"This one is much better sound quality than the dot ..I highly recommend"}]}