{"title":"All-new Sonos Move - Battery-powered smart speaker for outdoor and indoor listening, Wi-Fi and Bluetooth with Alexa built-in - Black","manufacturer":"Sonos","currentPrice":"$399.00","rating":"4.5 out of 5 stars","totalRatings":"76 ratings","features":["All-new Sonos Move : Get brilliant sound anywhere with the all-new Sonos Move, the durable, battery-powered smart speaker for outdoor and indoor listening.","Easy to use, WiFi and Bluetooth : Setup takes minutes, and control is simple with the Sonos app, AirPlay 2, and your voice. Stream via Bluetooth when WiFi isn't available","Voice control: Amazon Alexa is built right in so on WiFi you can play music, check news, set alarms, get your questions answered, and more, completely hands free","Brilliant sound anywhere: Experience surprisingly deep bass, a wide soundscape, and automatic Trueplay tuning that perfectly balances the sound for where you are and what you're listening to","Battery that lasts: Enjoy up to 10 hours of continuous play time and deep, powerful sound. Easily recharge Move on the included base, or a compatible USB-C charger","Weather resistant: With an IP56 rating, Move stands up to humidity, rain, snow, dust, salt spray, UV rays, and extreme heat and cold","Ultra-durable: Don't worry about accidental drops or bumps. Move's components are protected by a hardwearing, shock-resistant case"],"reviewsAspects":["sound quality","battery life","portable speaker","charging base","around the house","alexa or google","great sound","highly recommend","carry around","build quality","addition to the sonos lineup","easy to set","living room","works great","works well","use it as a bluetooth","bluetooth or wifi","backyard","listening to music","wifi range"],"productInformation":[{"Product Dimensions":"5 x 6.3 x 9.4 inches"},{"Item Weight":"6.61 pounds"},{"Shipping Weight":"9.4 pounds (View shipping rates and policies)"},{"Manufacturer":"Sonos"},{"ASIN":"B07W95RBZM"},{"Item model number":" MOVE1US1BLK"},{"Batteries":"1 Lithium ion batteries required."},{"Customer Reviews":"4.5 out of 5 stars\n    76 ratings\n4.5 out of 5 stars"},{"Best Sellers Rank":"#467 in Electronics (See Top 100 in Electronics)\n#1 in Wireless Multiroom Digital Music Systems\n"},{"Date first listed on Amazon":"September 9, 2019"}],"productDescription":["How long does the battery last?","Move’s battery will last for up to 10 hours of uninterrupted playback. Pausing, volume level, Bluetooth, heat exposure, and other factors will cause battery life to fluctuate.","How do I use Bluetooth?","Set up Move on your WiFi network then press the Bluetooth/WiFi mode button on the back of the speaker to switch to Bluetooth mode. LED on top of the speaker will illuminate blue. To pair, select Move from the list of available devices on your phone.","How does Auto Trueplay work?","Move's microphones detect what you're playing and measure the frequency response from your surroundings. The speaker then adjusts its EQ for perfectly balanced sound. Auto Trueplay is triggered whenever Move is placed in a new location.","Can I stereo pair Move?","Yes. You can pair two Moves on WiFi for stereo sound.","Can I turn the microphones off?","Yes. Simply touch the microphone icon and the light will turn off indicating that the microphones are inactive. The light is hardwired so you know that the microphones are only active when it is illuminated."],"reviews":[{"reviewerName":"Carlson B.","rating":"5.0 out of 5 stars","reviewTitle":"The best SONOS speaker ever!","reviewDate":"September 26, 2019","reviewText":"I have to admit that I am a longtime fan of SONOS, although I do think that I have dealt my share of constructive criticism over the years. When it comes to the SONOS MOVE, I think they have made a home run!\n\nHere is what I like:\n\n1. It sounds amazing! Here's why - The bass is significant, even outside, without ever getting distorted. It plays really loud if you want, but also sounds well balanced at low sound levels. They did something amazing with the high-frequency and mid-range where is sounds uniform across the entire side and forward projection of the speaker, not just in the \"sweet spot\" in front like other speakers. It is beautifully detailed and realistic sounding.\n2. It looks great. Here's why - It has the same great looks as I have come to expect from SONOS, but there is something about the material choices on this product that make it even better. It fits right in with my other SONOS speakers, while not taking up any more space than say a SONOS ONE.\n3. Automatic Trueplay - it automatically adjusts its sound depending on where you place the speaker, making sure that it always sound its best. I imagine this was pretty had to do, but it works really well. I put MOVE in some pretty challenging places inside and outside, and within 20 or 30 seconds or so it just fixes itself and sounds great again!\n4. The WiFi range - I took MOVE outside and began to walk all around the outside my house and into the yard pretty far away and it never lost connection. SONOS did something special here with the WiFi to make it super robust.\n5. Bluetooth - even if you go some place without WiFi, you can still connect with Bluetooth. I like having that feature so that I don't have to worry if there is WiFi or not wherever I might travel.\n6. It feels solid - It has a great solid and balanced feeling to it. There is an integrated handle in the back that is just part of the design. I've set it down on sand and grass and it just feels stable and balanced.\n7. Stereo pair - I only have one, and with it I can fill my whole yard with incredible sound, but I like knowing that if I ever got another one, I could set them up as a stereo pair and have myself a real outdoor concert!\n8. It's weather proof - you could get caught in the rain, or it could get dirty and you can just rinse it off with a hose. I plan to take good care of MOVE, but its nice to know that it has this level of protection from the elements.\n9. It has voice control - just like the SONOS ONE, it has a microphones that allow you to use Alexa and Google voice assistants. That comes in handy, especially when you are outside grilling.\n10. Charging base - it comes with a nice charging base, instead of it being sold as an accessory like other brands do.\n\nWhat I don't like:\n\n1. Travel bag - it comes with a nice looking bag, but I question how long it will last and how much protection it will really give. I'm sure SONOS will offer a travel bag accessory at some point, but for $400, it seems like they could have included a nylon padded bag with handle and pouch for accessories.\n2. USB-C charger - it is great that it comes with a nice charging base, but if they made the charger a detachable USB-C charger, then you could more easily take it with you when you travel. I'm sure SONOS will probably sell a USB-C charger accessory at some point, but again, for $400, I think this could have been included.\n\nOverall, this is one fantastic product. I would say that this is easily the best SONOS product they have ever made. I just love having a\" truly wireless\" wireless speaker!"},{"reviewerName":"Z. Neff","rating":"5.0 out of 5 stars","reviewTitle":"Outstanding outdoor speaker and indoor Play 3 replacement","reviewDate":"September 26, 2019","reviewText":"Finally, at long last.....we finally have an outdoor, portable, Bluetooth/wifi Sonos speaker offering. I have Sonos products all over my house, so I will admit I already like their products and I am very familiar with them. This speaker fits perfectly into their lineup for people who want to be able to bring Sonos away from home wifi zones. I'll make this review short and sweet. This speaker is not small....it's probably about twice the volume of a Play One. It's also not light, but it comes with a very well-designed handle. The way I think of this speaker is a new and improved Play 3 that happens to be mobile and battery operated. It has a front-facing driver that sounds very nice and is plenty loud for my taste. It can be paired to another Move speaker if you have a large deck and you don't want to hardwire a stereo setup.\n\nWhat I do with mine is the perfect application, in my opinion. I leave the handy and well-executed charging station where I would have placed a Play 3 in my house. It will operate exactly the same as your other Sonos speaker. When I'm going to use it outside, I simply pick it up and take it with me. The internal wifi extenders means I never have to use Bluetooth when I'm anywhere near my house. I use this on my deck. If I forget to bring it in at night, it will have no issues with a rain storm, a drop into the pool, or a water gun blast.\n\nPros:\n- Solid speaker loudness and tone. It's not as good as a Play 5, but as good or slightly better than the Play One.\n- Very well built.\n- Charging station is nicely done and can remain in a convenient location.\n- Can be charged with any USB-C plug as well.\n- 10 hour battery life at 50% volume.\n\nCons:\n- Price. This is not an inexpensive speaker.\n- Size and weight. I don't take this to the beach with me. It's a little too big for that and I wouldn't want to risk something of this value at the beach.\n- It's new, so there are not any aftermarket wall or deck mounts being made yet. I am waiting for a wall-mount for my deck where I can just set it down out of the way."},{"reviewerName":"Lars Swanson","rating":"5.0 out of 5 stars","reviewTitle":"Finally! Sonos delivers a wireless speaker!! Best of all It checks all the boxes.","reviewDate":"September 27, 2019","reviewText":"Portable (Check), pairable (check), weather resistant (check), Trueplay (check), voice control (check), bluetooth (check), Sonos sound and of course WiFi capability, (Check and Mate). This really is an amazing speaker. If you own a Sonos system it's a great adjunct. I now have 19 Zones with my new \"Move\" speakers including three Zones in my yard. The \"Move\" is the speaker I've been hoping that Sonos would make. Every situation is different but I'd highly recommend getting a pair of them. Everything sounds better in stereo. Enjoy and thanks Sonos for making life just a little bit better."},{"reviewerName":"D. Gregorio","rating":"5.0 out of 5 stars","reviewTitle":"High-quality, somewhat portable sound","reviewDate":"September 30, 2019","reviewText":"My old bluetooth speaker blew out, so I decided to upgrade to the Sonos Move. Obviously, it’s pricey. But with that price comes a sound quality I didn’t expect from a portable speaker. Audio is rich and clear. Bass is deep enough, but noticeable better in smaller quarters.\n\nThe build quality is what you’d expect for the price. The charging ring-type stand is a nice touch. And speaking of touch, the touch controls on the top of the unit are responsive with a light tap.\n\nWhen it comes to portability, it fell like carrying a gallon of water around. Carry this around in a backpack and be ready to sweat. It does come with a soft felt fabric bag which is only good for keeping dust and debris off the unit. If you plan on taking it places, get a case.\n\nThe Sonos Move is a solid buy if you want to splurge."},{"reviewerName":"Craig","rating":"5.0 out of 5 stars","reviewTitle":"Much needed addition to the SONOS lineup","reviewDate":"October 1, 2019","reviewText":"I’m a veteran SONOS owner and user, with multiple Play3, CONNECT Amps and now MOVE. The MOVE adds much needed weatherproof portability to the SONOS lineup while retaining the impressive audio quality that SONOS is known for. This speaker sounds as good or better than most Bluetooth portables, while enabling WiFi connectivity to SONOS when in range. It’s a bit large and heavy for a portable, but makes up for it in durability and function. Very easy to move and keep charged. I bought one immediately, because I enjoy having music nearby when I perform outdoor tasks and love the streaming options available through SONOS – so washing the car, working on the tractor, or reading outside on the deck all became more enjoyable. It works just like any other SONOS component and is easy to set up once you have the App and music services enabled. I also appreciate that SONOS has diligently worked to improve performance, streaming quality and connectivity over time – much more reliable now than it was several years ago and adding components today is almost seamless. If you already have SONOS this is a terrific addition, if not it will be a great first SONOS component. It’s not cheap, it would be a great value at $250 but at $399 it’s definitely an investment."},{"reviewerName":"Enelcee","rating":"5.0 out of 5 stars","reviewTitle":"Awesome Speaker!!","reviewDate":"October 21, 2019","reviewText":"I have only had this speaker for several days now, but have been so impressed with it I couldn't wait to write a review. The first night I had it, I took it to a bar where we were sitting outside, this thing sounded so good it was attracting positive attention from every one within earshot. I only use it as a Bluetooth speaker, so I cannot attest to it's Wi-Fi, or AI assistant capabilities. It will not work right out of the box and must be set-up through the Sonos app which is not a big deal and the app works very well. Someone wrote in another review that you can adjust the bass and treble through the app, but I did not see it and I looked everywhere. That being said, the speaker sounded perfectly balanced without making any adjustments! Bluetooth connectivity works great and my iPod synced with it immediately. It comes with a bag that looks great and should do just fine to provide some protection against scratches. The build quality is great, this thing is built like a tank! The charging base works every time, even if the speaker is not perfectly placed. I cannot say enough about how good this speaker sounds!! If there was anything that I could say about it that I don't like, it would be all the funny noises it makes when you touch any of the buttons. I really don't need to hear sounds confirming that I am adjusting the volume up or down."},{"reviewerName":"Ryan S","rating":"5.0 out of 5 stars","reviewTitle":"Mobile sound to die for","reviewDate":"October 2, 2019","reviewText":"First off, I've only had the speaker for 24 hours, so my experience is limited. I'm currently on vacation with family at a house in Maine and ordered this to have some tunes. I've had several family members already ask about it and shown interest. The sound is fantastic, and battery life seems amazing. My only complaint would be cost, but you get what you pay for!"},{"reviewerName":"Robert A DiPenice","rating":"5.0 out of 5 stars","reviewTitle":"Genius Speaker","reviewDate":"September 30, 2019","reviewText":"Great sounding speaker, that can play indoors connecting to your existing Sonos system... you have the option of taking it outdoors as well... it connects via Bluetooth or WiFi... very durable, water resistant... it also works with Alexa or Google assistance. There are Smart Speakers, this is a Genius Speaker... it does it all... and it does it all, Very Well."},{"reviewerName":"NB","rating":"5.0 out of 5 stars","reviewTitle":"Great to take on trips!","reviewDate":"November 1, 2019","reviewText":"I've always said to myself that I'd buy a portable Sonos, especially one that can go outdoors, once they make one. So I followed thru on that promise to myself, and to be honest, it's pretty great. When not using it as a portable bluetooth player on trips, it sits on our Sonos network in our house which is great since I can take the music with us if we are entertaining outside.\n\nOverall, it's expensive. Probably not worth it if you're never going to take it outside of your house. But for roadtrips it's been a great portable speaker to have in hotels and houses.\n\nAlso it's pretty hefty, and probably 50% larger than a Sonos:One (or whatever they're called now)"},{"reviewerName":"robert a cistrelli","rating":"1.0 out of 5 stars","reviewTitle":"A product at this price point should have top-notch support. Did not receive that from Sonos.","reviewDate":"October 22, 2019","reviewText":"Just sent it back. I have 12 Sonos products at two different residence working fine. With Alexa. This product took two days on the phone with Amazon Alexa service, and Sonos service, to try to get it to communicate with Alexa. In this process, lost connection to my other Sonos speakers in the group. Was finally able to get connection with the help of Alexa support. Sonos support was completely useless. Very surprised at a high-end product with this type of support. Turned out to be a Sonos problem and I was able to get my speakers back. Thanks to Alexa. Support."},{"reviewerName":"Jim J.","rating":"4.0 out of 5 stars","reviewTitle":"Great Sound in a Portable Speaker","reviewDate":"October 27, 2019","reviewText":"Have an entire house of Sonos speakers and this one hits a sweet spot. No more do I need to schlep a Play 1 outside or wherever. Sound quality is unbelievable just like all Sonos speakers. I think the sound is a little bigger than the Play 1. I also purchased a Bose Portable Home speaker and this blows it away. The Sonos Move also comes with the charging cradle included and its extra with Bose. I haven’t tried Bluetooth mode as I am always typically connected to WiFi. The only negative I can say is the cradle and power cable are connected and the plug is fairly large. It wouldn’t fit through a grommet on a desk."},{"reviewerName":"Scott M","rating":"1.0 out of 5 stars","reviewTitle":"BAD","reviewDate":"The manufacturer commented on the review below","reviewText":"Awful addition to the sonos lineup. I have many sonos speakers and this one either doesn't connect or struggles to connect. SAVE YOUR MONEY!"},{"reviewerName":"WIlliam L.","rating":"5.0 out of 5 stars","reviewTitle":"Great Sonos Sound!","reviewDate":"September 26, 2019","reviewText":"Works great, sounds great! BIG as hell!"},{"reviewerName":"Kenneth R Sue","rating":"2.0 out of 5 stars","reviewTitle":"Great sound but.....","reviewDate":"The manufacturer commented on the review below","reviewText":"We purchased this on Oct 2 and it was shipped to us pretty fast. But there were a lot of issues pairing the Sonos Move to any Bluetooth items we had at home. We could pair it initially, but everytime we tuned the Sonos back on, it would take a long time before the Sonos Move would recognize the existing Bluetooth connection. Also, the battery did not keep the charge. We charged it up to 100% 3 times and each time the power drained even though we didn't use it. At first I thought it was because we kept it on but I tested it yesterday confirmed it. We charged it to100% yesterday and took it off the charger. I checked on the APP on my phone and it was 100% charged. THen this morning when we turned it on, it was at 20%. Not happy so we are returning this."},{"reviewerName":"Gabriel","rating":"5.0 out of 5 stars","reviewTitle":"Awesome new little outdoor friend","reviewDate":"September 26, 2019","reviewText":"Awesome sound and auto tune works actually great"},{"reviewerName":"Mr. GA 88","rating":"5.0 out of 5 stars","reviewTitle":"Expensive but worth the Money especially if used outside only","reviewDate":"October 23, 2019","reviewText":"The only think I didn’t like is they don’t have any stands for these speakers yet. Great for my outside patio music sounds like a concert. Very expensive but worth the money"},{"reviewerName":"Ben West","rating":"5.0 out of 5 stars","reviewTitle":"The perfect home portable speaker","reviewDate":"October 18, 2019","reviewText":"I don’t do many reviews for products, but I could not help on this one. I have been a Sonos fan for several years. I have always been impressed by their sound quality, Innovacion, and ease-of-use. But this speaker is the most impressive thing they have produced yet. They absolutely nailed the concept of a home speaker that is also sometimes portable. Mine lives in my bedroom, which has a door out to my patio. When I want to listen to some music outside. It’s as easy as picking it up and walking out the door. No new connection, no loss in service, no reboot. Sound quality is what you would expect from Sonos, and the speaker seems really durable. All in all, I can’t find a single fault with it. Bravo."},{"reviewerName":"Jon Moter","rating":"5.0 out of 5 stars","reviewTitle":"Fantastic sound and really flexible in its use","reviewDate":"October 27, 2019","reviewText":"The sound is great. I'm really impressed that an easily portable speaker can generate the volume and quality of the sound it pumps out.\n\nI love being able to bring it out to the garage if I'm going to do some work, or take it out to the back yard deck to hang out with friends. I could easily see bringing these to a picnic or for a car-camping trip.\n\nI was originally a little concerned that $400 was a little pricey for a single portable speaker. But now I realize that I can buy fewer speakers for my home, and just move this around to whenever I want to listen to music.\n\nIn fact, I'm going to order a second one right now."},{"reviewerName":"RobG","rating":"5.0 out of 5 stars","reviewTitle":"Awesome speaker!!","reviewDate":"November 13, 2019","reviewText":"I'm very impressed with this speaker. Blends in perfect with my existing Sonos, or moves around with me. The WiFi range is impressive... Much better than my phone's!\nIf I have one issue, it's that the Sonos has a WiFi connection, but my phone is out of range and switches to mobile network. And when not on WiFi, I can't manage my sonos through the app to skip is change songs. Again , more of a phone issue (samsumg s8+) than Sonos.... Impressed with the range!"},{"reviewerName":"Phil Williams","rating":"5.0 out of 5 stars","reviewTitle":"The Sonos you know and love, but now on the go.","reviewDate":"November 1, 2019","reviewText":"The Sonos you know and love, but now on the go. Or, works just great as an addition to your current Sonos set up when you are at home. Sounds great. It's larger than you think. Comes with a nice cloth sack to put it in when you are transporting it."},{"reviewerName":"Lisa","rating":"5.0 out of 5 stars","reviewTitle":"Love it!","reviewDate":"October 20, 2019","reviewText":"I am never buying a Bose Product again. Sonos does it again it’s official the speaker rocks battery life sound quality Excellent!"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Worth the wait - portability without compromise","reviewDate":"October 19, 2019","reviewText":"The Sonos speaker I always wanted; great sound for the price, excellent battery life and portable enough to carry around the house inside and out."},{"reviewerName":"Griffin Cogorno","rating":"5.0 out of 5 stars","reviewTitle":"Great Somution without wiring the backyard.","reviewDate":"October 9, 2019","reviewText":"This Move is a beast. Great function grab and go. Easy set up and easily able to use alexa and pbone to control.\n\nThe sound is pretty amazing. It is loud enough for a backyard setup."},{"reviewerName":"toothpick","rating":"5.0 out of 5 stars","reviewTitle":"Excellent sound and bass","reviewDate":"October 29, 2019","reviewText":"Like all Sonos products, this one is fantastic. We have used it both insideon wifi and outside on bluetooth. Sound quality and batter life are great. Very happy with this speaker"},{"reviewerName":"Curtis","rating":"5.0 out of 5 stars","reviewTitle":"Couldn’t be easier","reviewDate":"November 1, 2019","reviewText":"It’s exactly what I expected and sounds great"},{"reviewerName":"DOCKNOF","rating":"5.0 out of 5 stars","reviewTitle":"IT’S AMAZING","reviewDate":"September 28, 2019","reviewText":"It’s AMAZING!!!"},{"reviewerName":"Kamuela","rating":"5.0 out of 5 stars","reviewTitle":"Great sound with an excellent app!","reviewDate":"October 16, 2019","reviewText":"So far so good with this little powerhouse!\nWelcome home, Alexa..."},{"reviewerName":"luis hurtado","rating":"5.0 out of 5 stars","reviewTitle":"Excelente producto","reviewDate":"October 20, 2019","reviewText":"Es un súper producto, da gusto tenerlo"},{"reviewerName":"Robert Robertson","rating":"5.0 out of 5 stars","reviewTitle":"Move on up","reviewDate":"November 12, 2019","reviewText":"Love this wireless speaker. It is robust and easy to use."},{"reviewerName":"James Vance","rating":"5.0 out of 5 stars","reviewTitle":"Awsome","reviewDate":"October 23, 2019","reviewText":"It's worth every penny. I love mine."},{"reviewerName":"Mirian","rating":"5.0 out of 5 stars","reviewTitle":"An excellent product to own!","reviewDate":"October 28, 2019","reviewText":"I have the play bar/ sub , play3 , and play 1’s but the Sonos move is the best of them all!\nThe Bluetooth sounds exactly same as using home WiFi."},{"reviewerName":"Abel","rating":"5.0 out of 5 stars","reviewTitle":"Loud","reviewDate":"November 5, 2019","reviewText":"Great speaker"},{"reviewerName":"Chikinbutt","rating":"4.0 out of 5 stars","reviewTitle":"Decent Sound - Quite Heavy - Ridiculous Charging Block","reviewDate":"The manufacturer commented on the review below","reviewText":"Picked this up as a pre-order direct from Sonos and received it this past saturday, even though Fed Ex wasn't supposed to deliver until the Monday launch date. First impressions were good: Typical Sonos build quality, although a bit heavy for being a portable speaker. Was easily added to my other Sonos speakers via the app and withing 5 minutes I was listening to music.\n\nSound quality is on par with the Sonos One - with a bit of a wider soundstage (which surprised be given the single driver) and a bit of a better bass response. Bluetooth sounded a bit more muted than Wifi or Apple Play. The fact this speaker is Apple Play ready is the reason it didn't get 3 stars. Comparing this to the JBL Boom Box, which may be unfair give the size of the boom box (although the weights are comparable) the boom box comes out on top for bass response and volume.\nMy biggest issue is the ridiculous size of the AC adapter for the charging base. Not only is it enormous, but it lacks the ability to disconnect from the bass to fit through a grommet on a counter or desk to plug into a hidden outlet. So now the move sits on my desk with the ugly ass cord plugged in, in plain sight. Why Sonos couldn't simply make the cord detachable is beyond me.\nAlso, keep in mind that this is not a light speaker. It weighs in at a whopping 6.75 pounds! Fine to move around the house, but I don't see myself taking this on trips to listen in the hotel room......"},{"reviewerName":"Rich Diver","rating":"5.0 out of 5 stars","reviewTitle":"Great Sound that moves around!","reviewDate":"October 30, 2019","reviewText":"It's an awesome Speaker!!!!"},{"reviewerName":"Jeff Roybal","rating":"5.0 out of 5 stars","reviewTitle":"Speaker slaps","reviewDate":"October 5, 2019","reviewText":"This speaker slaps."},{"reviewerName":"S. Spediacci","rating":"5.0 out of 5 stars","reviewTitle":"One Speaker For All You Need","reviewDate":"October 24, 2019","reviewText":"I honestly didn't know portable speakers could pack such a punch. I'm a very recent convert to the Sonos world and I have been impressed at every step. I was absolutely ecstatic when I heard they launched a portable speaker that works well in the home and outdoors. I was also skeptical.\n\nAt the time I was debating a couple of things:\n\nFirst, I wanted a speaker for when I go car camping. There's a lot of options out there and it was a bit overwhelming since they all seemed to have mediocre sound quality.\n\nSecond, I wanted a speaker for when I cook in the kitchen, hang out in the bedroom, or in the backyard.\n\nDo I buy a singular speaker for all of this? Will it sound decent? Do I buy another Sonos speaker for the house and plan to unplug and plug it in and an outdoor speaker for camping?\n\nThen the Sonos Move came along and did it all and more. I’m absolutely amazed. I keep it in the bedroom, take it to the kitchen when I cook, take it to the backyard when I want, and even took it down to the beach in a small backpack with my pup. I even took it with me this past weekend to a wedding I was in and used it in the hotel room to play music for the groomsman while we were getting ready.\n\nOn top of all that flexibility - it sounds absolutely amazing. Absolutely no compromises here. The bass is punchy and clean and the mids/highs are crisp and audible. I’m not an audiophile, but I listen to a lot of music and refuse to listen to music on crappy speakers. It simply ruins the fun of music for me.\n\nYes, I paid a pretty penny for it, but I truly found my perfect speaker. I have no regrets and know I’m going to own this speaker for years to come. Especially since the battery is replaceable. I honestly believe that I saved money in the long term because I bought one speaker that does the job of several.\n\nI can’t recommend it enough."},{"reviewerName":"Rich","rating":"5.0 out of 5 stars","reviewTitle":"Battery life ok, great rich sound, beautiful Alexa/Google integration!","reviewDate":"October 11, 2019","reviewText":"I can only read those of four because of the portability and battery life. However, there are some adjustments to be made to get the best sound out of this.\n\nThis isn’t exactly a critical review but this is something that a lot. This isn’t exactly a critical review but this is something that a lot of users should know about owning one of these. It works great with other Sonos. It works great if you have another HomePod and just were thinking about getting one but you wanted something portable.\n\nNow the fun part -\n\nA few tips for a walkthrough around the Sonos app:\n\nThere is an EQ in the settings app. It’s under settings, system, Move, EQ.\n\nIf you don’t have it near a wall or corner - disable Trueplay. The low ends come into play and sound really great set on a table to resonate into.\n\nSet the bass from 3-6 in the EQ depending on your tastes. Treble 1-2.\n\nOne last thing - This thing truly shines in a corner or even on the floor by a wall. I know this sounds crazy, but the acoustics on a floor, or in a corner next to the wall sound really boomy and the low ends sound dramatic! I initially was ready to take my Move back until you mentioned you didn’t see an EQ on the app.\n\nLet me know what you think, very curious to hear your thoughts!"},{"reviewerName":"Happy Mom","rating":"5.0 out of 5 stars","reviewTitle":"I am a fan!","reviewDate":"September 28, 2019","reviewText":"This is exactly what was missing from my Sonos system. I own a lot of Sonos speakers and I really miss not having a portable one that is connected to all my others. I can take this to the back deck, or let the kids use it in the play room, or out with us to the hot tub.\nWhile I think buying it as a stand alone portable speaker isn’t probably where it is going to shine - having a portable speaker as part of your Sonos system though? Pure gold. I pre-ordered this the second I found out about it and haven’t been disappointed! I leave it docked and treat it like a stationary speaker, and then I have the ability to take it where ever within WiFi. Or use it as a Bluetooth speaker (which is super simple to switch between WiFi and Bluetooth). I am very pleased! And the sound is great of course.\n\nThe speaker is fairly large - twice the size as a Sonos One I would say. And it is decently heavy. So not something you would just readily cart around with you wherever you go. But the built in handle is easy to use and conveniently located."},{"reviewerName":"Simon Guo","rating":"5.0 out of 5 stars","reviewTitle":"Works Great with Amazon Music Ultra HD","reviewDate":"September 24, 2019","reviewText":"Very enjoyable music quality when play with the Ultra HD music."},{"reviewerName":"Mark","rating":"4.0 out of 5 stars","reviewTitle":"High quality sound as part of Sonos network or standalone","reviewDate":"October 9, 2019","reviewText":"At initial setup, the Sonos Move is just like any other Sonos speaker that you add to your WiFi network using the Sonos app. Only at that point, do you get the new option to switch the Move to being a standalone Bluetooth speaker. A bit disappointing is the fact you have to press a physical button on the back of the speaker to toggle between WiFi and Bluetooth; one would hope the app could do that as well. Moving the compact 6.5lb Move is easy with a grooved handle at the top. The Move does not have AC and so it must be charged on a regular basis but advertised to last 10 hours. The sound quality (Bluetooth or WiFi) seems as good as the other Sonos speakers. Overall, well recommended but it would nice if there was an integrated Bluetooth/WiFi option to allow group connectivity with the other Sonos speakers when using a Bluetooth connection."},{"reviewerName":"Paul Stuart","rating":"4.0 out of 5 stars","reviewTitle":"Incredible sound, excellent Alexa integration...but BIG. Charging cord needs some work.","reviewDate":"October 25, 2019","reviewText":"Having never owned a Sonos before, I was keen to compare it with my other higher end speaker, a Libratone Zipp Mini. The latter is adorable, has great surround sound, and holds a charge pretty well.\n\nThe Sonos Move blows the Zipp Mini away in every way, shape and form...except being heavy.\n\nTo begin, sound is absolutely incredible. Earth shattering bass, powerful and robust tones, and it fills like a room like no ones business. I can't tell whether the smart volume/ambiance adjustments are to thank, but this speaker is a beast! Moreover - and unlike the Zipp Mini - the Move looks and feels highest end. Turning on/off the mic, volume adjustments, etc.; everything operates perfectly.\n\nSpeaking of the mic (pun intended, I suppose), wow is it sensitive and accurate! Amazing voice recognition with Amazon Alexa, so much better than the Echo devices scattered around my house. I had an initial glitch with SiriusXM functionality, but that was fixed after I re/installed the Sirius and Alexa skills/links in their respective apps.\n\nAlso, and contrary to every other speaker I've owned, the Move maintains seamless bluetooth and Airplay connectivity. These issues drives me batty with the Zipp Mini, with it regularly dropping and/or getting mixed signal quality when streaming from my phone.\n\nIf there's a criticism to be made, the Move is probably misnamed. It's both BIG and HEAVY. Which is the price one pays for being durable and waterproof. This is not a speaker you'd throw into a bag to carry around, rather one best suited for outdoor seating areas, putting in/out of a car for trips.\n\nRelated, the charging base is great, cable not so much. If you're trying to hide the cable, good luck. The giant charge brick can't be separated from the cord at all, which means eyesore any way you look at it. It also eliminates some of the value of having a charging base as there limited places you can place it due to plug restrictions.\n\nFinally, the Sonos app/speaker integration is amazing. By far, the best of it its kind. It knows how/when to turn the speaker on/off to maximize functionality.\n\nAll in all, this is an amazing piece of technology. If you're looking for a gift for someone who has everything...and/or have a yard/pool area needing some sound...this is a wonderful purchase. Hopefully Sonos will offer an alternate plug in the near future."},{"reviewerName":"Glenn M. Vile","rating":"5.0 out of 5 stars","reviewTitle":"Excellent addition to a Sonos system or first Sonos unit.","reviewDate":"October 5, 2019","reviewText":"I have been collecting Sonos devices for the last 6 years. I now have a device or multiple devices in every room (yes, each bathroom too). I previously ran wires to outdoor speakers which I connected to a Connect Amp and it worked well, but the fixed speakers were hard to get the volume right. Now I can augment my outdoor experience by taking these outside and combining to my existing speakers. The Move is built like a tank and I am certain it will last a long time. If you already invested in Sonos, it is a no-brainer. If you want to start collecting, this is a great place to start because you can literally move it around your house with you.\n\nIt is a little heavy, and will not be my go to travel speaker, I use a Beoplay P6 for that, but this speaker will be the one I take fishing, sit by a campfire, or enjoy grilling in my yard. I bought my second one 6 days after the first one arrived so I could make stereo pairs."},{"reviewerName":"Geo","rating":"2.0 out of 5 stars","reviewTitle":"I RETURNED MINE!","reviewDate":"October 13, 2019","reviewText":"I bought this overpriced speaker at Best Buy, and it is FLAWED! First off, if you listen at a decent volume, you are NOT going to get anywhere close to 10 hours of play. On the occasion that I managed to play the Sonos Move on a full battery, I only got about 4 to 5 hours. My friend's Libratone Zipp 2 was getting anywhere between 8 to 10! Noticed how I said \"on the occasion\"? Well, my Move kept powering on by itself. This happened while the speaker was both on and off of the charging base which is very inconvenient as it drains power when it's on, even if the speaker isn't playing music. I constantly had to go to the back of the unit to power it off. So, this means if I was driving to the beach, I would have to keep it next to me to turn it off in an effort to save battery life. I reset the Move a few times and this did not help. Maybe my unit was defective, but that's not all. Honestly, the sound wasn't that great. In my opinion, sound was very bassy, and not in a good way. It was very muddy, and hid little clarity. I enjoyed my friend's Libratone speaker more, actually. I appreciated it's sound better and really liked the \"360 sound\" that it puts out. Needless to say, I've returned this piece of junk and I'm getting the Zipp 2."},{"reviewerName":"NaughtiLiterati","rating":"5.0 out of 5 stars","reviewTitle":"This thang KNOCK!!!!!!!","reviewDate":"October 13, 2019","reviewText":"I have a few other Bluetooth speakers and this Sonos Move is the smallest but somehow it is almost the LOUDEST and the sound is soooo rich, deep and warm and ugh, SEDUCTIVE, that anything you play on it will sound like it is being performed right in front of you or like you are wrapped in a magical cloak whose fibers vibrate with music once you put it on. Yes, it is that serious. Because it is actually called MOVE, we wanted to test it in and out of the house and these nice days led to some awesome afternoon grilling sessions where we enjoyed every track we played from jazz to deep house. We haven't tested it in rain but there will be plenty of that this week. Setting this up is a cinch and Alexa works flawlessly. For this price point, you are going to be truly blown away by the quality and the sound so keep that volume respectable!"},{"reviewerName":"D. Seymour","rating":"5.0 out of 5 stars","reviewTitle":"I was blown away","reviewDate":"October 16, 2019","reviewText":"Very easy to set up. Everything was straight forward and I was up and listening in 5 minutes. In my room, it sounded great, so I decide to take it on tour. Took it out to the back yard and was very impressed. I could hear it everywhere on my property and didn't even turn it to 10. I took it to work with me because there were many different areas to test it in. In a large, open area with a lower ceiling, it filled the space with music. Next, I went to the warehouse and, again, music filled the room with no distortion in sound. The hardest place I took it to was the data center where the noise level is very high. This was the only place it struggled, but music could still be heard over the noise. This speaker, beyond a doubt, is the best portable speaker I've heard. I highly recommend this speaker."},{"reviewerName":"DJ","rating":"4.0 out of 5 stars","reviewTitle":"Versatile Hefty Speaker Which Does it All -- At a Price.","reviewDate":"November 1, 2019","reviewText":"Excellent build and sound quality in a hefty speaker. The price, while seemingly high, is almost reasonable considering the large number of features, build quality, very good sound, and the fact it integrates seamlessly into the Sonos product universe. I'm getting a weather resistant speaker, WiFi connectivity via the Sonos app or Apple Airplay 2, universal bluetooth connectivity, TruePlay auto equalization, and Amazon Echo in one untethered transportable speaker. It's quite an achievement. If you already own Sonos products this fits in well. We used it to play Halloween music outdoors at 50% volume for five hours with plenty of charge remaining. We used it on bluetooth with an iPad Pro which was about 30 feet from the Move. I expect battery time will be around 9-10 hours at 50% volume.\n\nThis is Sonos’s first battery powered speaker. It packs almost all Sonos capabilities along with Bluetooth and Amazon Alexa or Google Assistant. I'm using it with Alexa. It responds like my Echo speakers but its wake word can’t be changed and it can’t make or receive cellphone calls. Even at loud volumes I can use Alexa voice features without yelling. It has very sensitive mics. It weighs 6 lbs and is 10 inches tall...hefty but with a good built-in carry handle. The Move cannot be used as part of a Sonos Surround system. It won't connect as rear speakers like Sonos Ones.\n\nIt's transportable but not portable enough to throw into a backpack or an aircraft carry-on without eating up your weight allowance. Moving it inside/outside the house and transporting to parties, family or friends is easy. The charging ring base works great and doesn't require fiddling to get the speaker properly seated to charge. The charging ring, A/C adapter, and USB-C cable are one unit and can't be disconnected from one another. This limits placement and transport options. Sonos should make the charging ring, cable, and A/C adapter separate. Especially since the Move can charge directly via its USB-C port.\n\nWe also have the new Bose Portable Speaker which shares Amazon Echo and bluetooth features with the Move. The Bose is smaller and more portable for travel. We purchased a small hard case for travel so it will go with us on trips. The Move will stay home and go to friends houses or outside. The Move sounds better mainly because it's larger and it plays louder while keeping a balanced sound. The Bose sounds good but not as good. The Move's battery is user replaceable. The Bose battery is not. Bose defers when questioned if it will offer future battery replacement service. Bose charges $29.00 for a charging ring which Sonos includes. This brings the price of the Bose within $20 of the Move. I'd choose the Move over the Bose unless portability was my main buying criteria. Additionally, the Sonos App is far ahead of the Bose app in flexibility and streaming service availability.\n\nIf you're invested in the Sonos eco system and need a transportable battery powered speaker I highly recommend the Move. If not, your buying decision is tougher. Do you sacrifice some sound quality for portability and go with Bose or another brand? Depends on your needs. Either speaker gets you the latest technology, good sound quality, with many desirable features especially if you're looking at Amazon Echo or Google Assistant integration."},{"reviewerName":"Moisio","rating":"4.0 out of 5 stars","reviewTitle":"Nice addition to the Sonos lineup...Truly portable around the house","reviewDate":"October 28, 2019","reviewText":"This is our third Sonos speaker and is a marked step up from our previous two. The portability feature really is great. We don't have outdoor speakers and it was always a pain to unplug one of our others and fiddle with the outlet outside. So this one is now parked in our family room and comes outside onto the deck when needed.\n\nJust to clarify the portability a bit...there's a deep pocket in the back of the speaker which makes it easy to grab with one hand. The unit sits on this unassuming plastic ring that charges it and it comes off and sets back down without any issues; there's no click or button...you just put it there and pick it up. If you press the microphone button during the transition, it will automatically adjust sound to the new surroundings. That's a cool feature, I guess, but I don't particularly notice it.\n\nLook, I'm into the whole Sonos set up, but a lot of it has to do with the software. This review is mainly about the hardware. And Sonos is not selling speakers that rise to the quality demanded by true audiophiles. But they're still really good speakers for listening to music around the house. And this one fits into that mold; the sound doesn't degrade at higher volumes and the bass is capable. To my ears, it's not significantly different from the Bose speakers you used to drop iPods into. If anything, I'd say this one sounds better than they did. And I mean that as a compliment.\n\nThe speaker set up was relatively painless. It integrated with the other two without any issue. It seems like this model is designed to be a central unit...we went with the system prompts and the others ended up being satellites. That's fine for us because the other two are smaller, but I don't know how it would integrate with a more fleshed out system.\n\nI haven't used the Alexa function, so can't comment on how that bit behaves."},{"reviewerName":"TWL50","rating":"4.0 out of 5 stars","reviewTitle":"All around portable speaker","reviewDate":"October 31, 2019","reviewText":"This is my first Sonos speaker, and it's pretty good. The first thing I do with a speaker is put it through its paces with a number of different music tracks. This sounds good, not great. The bass is lacking compared to a similarly prices Bose, and it is underwhelming when put up against the sound from an Apple soundpod.\n\nThe design is attractive, and it can fit into any room with ease. There are touch controls on top which I keep hitting when I pick it up to move it. When it's plugged into its base, I can leave the speaker on all the time and I can play music on the device without having to switch bluetooth devices on my phone. The downside to this is if it's not plugged in, the speaker is always listening for you, and the battery can deplete in a week or so.\n\nThis is a heavy speaker but some of that bulk is made up by a beefy speaker that can last roughly 8 to 10 hours depending on how loud you're playing it.\n\nYou have to install software on your phone to use the speaker. It would be nice if you could use this like a regular speaker and connect via bluetooth only, but I wasn't able to figure out if this was even an option. Once you install the software the speaker is registered to you so if you want to pass on ownership at some point, you will be forced to do that in the software. I find this odd.\n\nOverall this is a good sounding portable speaker, however, I don't think I would get another Sonos product because of their weird phone software dependency."},{"reviewerName":"Shelley","rating":"5.0 out of 5 stars","reviewTitle":"Sounds fantastic, but bigger than I expected it to be.","reviewDate":"November 11, 2019","reviewText":"This speaker is fantastic. I have been very impressed with the audio quality and the feature set. This is my first time using a Sonos branded speaker and the Sonos app, and I am thoroughly impressed. The ability to connect this speaker to WiFi and use it with my favorite streaming apps is awesome. Using the speaker this way technically means it doesn't have to be connected to my phone and can run music even if I am not home and someone else wants to use it-you just tell the speaker what to play from my library and it plays.\n\nThat being said, I do wish it was easier to just pair the speaker using bluetooth and play music from my phone. It seems to require the Sonos app the setup the device before you are able to do this, so there is a fair amount of setup needed before you can use the speaker. I could be wrong here, but I couldn't figure out how just use bluetooth straight out of the box without setting the device and app up first.\n\nThe audio is clear and crisp, with plenty of bass, mids, and highs. The audio fills my office or living room with sound to spare, and gets much louder than my now outdated Bose Soundlink.\n\nOverall, I am extremely happy with this speaker. It is large, so not really something that I will toss in a backpack and take with me, but it is portable enough that I can take it into the backyard if the occasion calls for it. Battery life has been excellent so far as well.\n\nHighly recommended!"},{"reviewerName":"BM","rating":"5.0 out of 5 stars","reviewTitle":"Phenominal Sound Quality","reviewDate":"October 23, 2019","reviewText":"If I could give this speaker 10 stars, I would. The sound is incredible whether indoors or out. The speaker is pretty easy to set up after you download the Sonos App. The app then guides you through the set up. You can play pretty much all of your different music service subscriptions thru Sonos, but I only plan to use this as a bluetooth speaker for Spotify. I could allow Sonos to have control over my Spotify account and music by entering all my information, which would allow me to use the speaker microphone to tell it what to play, as you do with Alexa, but I chose not to, and instead just play my Spotify as I normally do through my iphone. The Sonos Move sits in a small round base charger and once charged, you just lift it out and move it to wherever you want to. It weighs about as much as a half gallon carton of milk. It has the capability to adapt itself to it's new surroundings using the True sound feature and walking around with your iphone and allowing the speaker to tune itself for the best sound. I did it in my garage, back yard, and living room and it worked nicely. I get the same great sound in all 3 areas. You can also use this with other Sonos speakers and a few other brands. The best thing about the Sonos Move is the sound. It has a deep rich sound that allows me to pick out every single instrument being played. The best portable speaker I have ever seen."},{"reviewerName":"jesus pujol","rating":"4.0 out of 5 stars","reviewTitle":"Worth it if you have other Sonos speakers","reviewDate":"September 27, 2019","reviewText":"I’ll keep it short and sweet. Plays much like a Play 1 just a bit louder with better bass response. If I didn’t already own 7 other Sonos speakers, I would’ve gone with something else. On another side note, I also own a UE Boom 2 and this blows it away. I guess you can compare the Move to the JBL Extreme 2."},{"reviewerName":"Rebecca J. Vincent","rating":"5.0 out of 5 stars","reviewTitle":"The sound will blow you away!!!","reviewDate":"October 30, 2019","reviewText":"WHOOO - the sound in this is incredible! INCREDIBLE!!!!!! As good as Boise in our opinion. Reading up on the speaker, we see how they connect to one another & now, we're looking into getting more to replace all the speakers in our home.\nCON - this system is a little big - so make sure you have the space.\nCON - we had some issues with getting it connected to our wi-fi. It took some contacting the support team via Twitter (which they answered back pretty quickly) & my husband fiddling around with it & he finally got it connected - dont ask us how - we just did....\nBut even with the 2 CONS - the sound trumps it all! I'll move pictures for the big unit & it was worth all the hassle getting it hooked up. The sound is awesome.\nAlso love that you can have Alexa or Google assistant on it. We have an Alexa that we use a lot so we didnt want 2 Alexa's right next to each other so we made this one Google...\nCant say enough good about this."},{"reviewerName":"Sean Logue","rating":"5.0 out of 5 stars","reviewTitle":"Heavy, but awesome","reviewDate":"October 26, 2019","reviewText":"The sound quality is typical Sonos. Flat, and unenhanced, with a smooth roll-off at the lower frequencies. If you've heard the Sonos One and enjoy it, you will like this as well. It is very similar but can play louder, which is a big advantage outside.\n\nThe integrated handle in the back works well, but the weight is toward the front so it tips at a big angle when picked up. That, along with its hefty weight, makes it something you won't want to carry around for long distances. It isn't so bad that you won't use it outdoors, but you won't be taking this on your next hiking trip.\n\nThe integration with the Sonos ecosystem is well thought out. It works just like any other Sonos product but can be switched to Bluetooth when carried out of wifi range. This allows it to be used as any other Bluetooth speaker when disconnected from the network.\n\nOverall, a pricey but great outdoor speaker."},{"reviewerName":"MsFancyPantz","rating":"5.0 out of 5 stars","reviewTitle":"Now I get the hype!","reviewDate":"October 28, 2019","reviewText":"This is my first Sonos and WOW, now I get what all the hype is about! It has bluetooth and Wifi? Is portable? Super long battery life? Sound is amazing? W00T!!!\n\nI really love this thing. I have it in my kitchen set up to pick up either the TV in the living room so I can still hear the news or whatever, then can switch to music on my phone, or take into the bedroom to watch TV in there, which is SUPER awesome because we have a soundbar next to the TV (reasons, doesn't matter, but we can't move it closer to us) and we have to have the sound up loud to hear it well, which has woken the kids in the next room previous. With this, we just put this next to the bed and hear perfect sound with the TV.\n\nMy husband is a self proclaimed audiophile and happens to be a computer engineer that is hard to impress with technology and even he loves it."},{"reviewerName":"Saulblao","rating":"4.0 out of 5 stars","reviewTitle":"Good but not perfect","reviewDate":"September 25, 2019","reviewText":"Very good product. Originally use bose mini speaker and really like this one. Also has some mysterious durability and water resistant specs which would be nice. Price is a little high which is true with all\nSonos. It’s large but easy to carry. Will use it for patio and concert/tailgating."},{"reviewerName":"Robert Kall","rating":"5.0 out of 5 stars","reviewTitle":"Wow. Addicting sound","reviewDate":"October 16, 2019","reviewText":"Wow. This has addicting sound. The set-up was really smooth and no hassle seamless, from putting it together out of the box to downloading the app and linking it to my wifi system. It doesn't get any easier. And for this 68 year old, that's very nice.\n\nThen, there's the sound. This is going to change my daily life practices. OR should I say the sound is so good it could be life changing. The reason I say that is the sound is so, so good that it is delicious to my ears. Why put on the TV when you can have beautiful music playing that sounds incredible. The bass and the full range are a joy.\nThe only liability I found was not the fault of Sonos. The Alexa app would not allow me to change the \"wake\" word."},{"reviewerName":"JARELLANO","rating":"4.0 out of 5 stars","reviewTitle":"Excellent Sound Quality!","reviewDate":"November 3, 2019","reviewText":"Sorry, this video is unsupported on this browser.\n This is my first SONOS product but will be the first of many to come. This is an amazing speaker.\nOnly one thing I do not like (that is why I only removed 1 star) and other than that is perfect:\nIs very heavy: 6.728 lbs (3.052 kgs) so is portable but not too much\nWhat I like:\nExcellent sound quality.\nBattery life is great: I have been using this speaker for up to 7 hours at work running on battery.\nThe Bluetooth range is well in the 10 meters and WiFi range depends on your WiFi router/switch but is good for me.\nThis is waterproof speaker so you can use nearby the pool without worrying about damaging your speaker."},{"reviewerName":"sfdk","rating":"5.0 out of 5 stars","reviewTitle":"Heavy for a portable speaker, but amazing sound quality","reviewDate":"November 1, 2019","reviewText":"This is the heaviest portable speaker I've ever had, but other than that GREAT product. Easy to setup, compatible with Alexa and most importantly, amazing sound quality."},{"reviewerName":"Haley Aura","rating":"5.0 out of 5 stars","reviewTitle":"Must buy for your Sonos collection","reviewDate":"October 22, 2019","reviewText":"This thing SLAPS. I was shocked how good the music sounded when I turned it up full volume. The price for this being Sonos is honestly a steal with it being wireless too. Must buy speaker even if you have a whole system set up. We use Sonos at our lake house and it’s sooo nice to be able to just carry this down right to the water without worrying about losing WiFi."},{"reviewerName":"Joseph A Dandona Jr","rating":"5.0 out of 5 stars","reviewTitle":"Great sound and kind of portable.","reviewDate":"October 20, 2019","reviewText":"I own several products in the Sonos ecosystem and this is a good fit with my system. I will be mostly using this outside but I love the ability to move it anywhere in the house. The sound is really good for a portable speaker but not fantastic. I've tried it in several locations and it's auto True-play features works well. It really shines outside in all locations that I've tried. Not sure I would consider this portable if I had to carry it several miles? Love it so far and will update review with battery life information."},{"reviewerName":"Bookwormmom","rating":"5.0 out of 5 stars","reviewTitle":"Rich and Quality Portable Speaker","reviewDate":"October 26, 2019","reviewText":"Sorry, this video is unsupported on this browser.\n This new Sonos speaker puts the older versions to shame. The sound quality is so rich and can carry quite far with how loud it gets. The battery life is awesome and it can easily be picked up and carried to wherever you want it. Definitely a fantastic speaker!!"},{"reviewerName":"Happy Chappy","rating":"5.0 out of 5 stars","reviewTitle":"Excellent sound quality!","reviewDate":"October 30, 2019","reviewText":"Love the deep, rich sound the Sonos Move speaker produces! I'm really quite impressed with the ease of setting up this speaker and connecting it to WiFi. The App is user friendly as well. The speaker is quite large and heavy. It self charges on its base. Great product!"},{"reviewerName":"Bookenator","rating":"5.0 out of 5 stars","reviewTitle":"Holy moly!","reviewDate":"October 18, 2019","reviewText":"Really great sound. It was a little hassle to set up, but once I got my phone to find it and pair with it all was good. Download the Sonos software and follow the instructions, make sure it's charged all the way. The sound is amazing. Now I want another one."},{"reviewerName":"Miguel Vazquez","rating":"3.0 out of 5 stars","reviewTitle":"Dissapointing. Save your money.","reviewDate":"September 25, 2019","reviewText":"For $399 portable speakers sound quality is really BAD, specially in the BASS area which is specially dissapointing. Save money and go with the JBL Extreme, better portable speaker in every aspect with GREAT bass and better portability."},{"reviewerName":"Kristina Meighan","rating":"5.0 out of 5 stars","reviewTitle":"A Great Outdoor Speaker","reviewDate":"October 1, 2019","reviewText":"Just purchased this speaker. Took it to the beach. What a great sound!!!! It survived the salt spray, some sand and some light rain. And they weren’t exaggerating when they said 10 hour battery life before recharging. I have the Sonos One and the Play 3. This is the best of the bunch."},{"reviewerName":"M. T.Pope","rating":"5.0 out of 5 stars","reviewTitle":"Amazing sound","reviewDate":"November 4, 2019","reviewText":"This speaker is great. The sound is clear and loud. It doesn't take up a lot of space and easy to charge. I would recommend the is product to others."},{"reviewerName":"Steven J. Hamel","rating":"5.0 out of 5 stars","reviewTitle":"Typical sonos","reviewDate":"October 8, 2019","reviewText":"Another amazing sonos product now for the outdoors. Really solidly built speaker and incredible sound as expected from sonos. I used to be a Bose only guy but not anymore!"},{"reviewerName":"Michael","rating":"5.0 out of 5 stars","reviewTitle":"I love this speaker!","reviewDate":"November 13, 2019","reviewText":"Sonos absolutely hit it out of the ballpark with the new Sonos Move! The sound is absolutely amazing, but the Sonos App is the secret sauce that really takes this portable speaker to the next level. It easily integrates with Amazon Alexa, Amazon Prime Music, SiriusXM, and more. The Sonos App integrates so well with Amazon Prime and SiriusXM that your favorite playlists and stations appear within the Sonos App, negating the need to use the dedicated Amazon and SiriusXM apps. Absolutely seamless. They really did a great job with the App.\n\nThe Sonos is so much more than just a great sounding speaker, it’s worth every penny for the quality and utility."}]}