{"title":"mockins Extra Large Air Fryer 5.8 Qt with Advanced LCD Touch Screen, 7 Built-In Presets and Rapid Air Circulation Technology and Includes Free Air Fryer Cookbook | Must Have Kitchen Gadgets","manufacturer":"Mockins","currentPrice":null,"rating":"4.4 out of 5 stars","totalRatings":"150 ratings","features":["\n         Make sure this fits\n                by entering your model number.\n        \n","🍳 Throw away that deep fryer for a mockins high quality Air Fryer . The Air Circulation technology allows your food to be cooked without sacrificing the flavor of your fried food and without those extra calories and fat from oil.","🍳 The rapid air circulation technology will ensure your food is cooked crispy and evenly . It will create nice healthy snack for adults and healthy snacks your kids will enjoy too! You can fry , bake , roast, grill or cook almost everything from streak to pizza, french fries to chicken breasts and so much more!","🍳 The mockins Air Cooker has a LED Touch Screen Display with 7 built-in smart cooking presets and a 60 minute kitchen timer. The sleek design makes this a great addition to your kitchen appliances and great to keep on your kitchen counter .","🍳 Cooking and cleaning just got a whole lot easier. The Air Fryer includes and easy to wash , dishwasher safe removable drawer with a safety latch and non stick food basket . We included a FREE Recipe Book to get you started with cooking your delicious healthy meals. This is a great gift for an aspiring chef , Christmas gift , gifts for men , gifts for women , Mother's Day gift or even just a gift for yourself to enjoy!","✅ ✅ CUSTOMER SATISFACTION GUARANTEED: We are so sure you will be obsessed with the mockins Air Fryer we offer a LIFETIME WARRANTY , hassle-free REPLACEMENT or MONEY BACK GUARANTEE. So invite your friends and family for a healthy dinner made with the mockins Air Fryer . If you have any questions or concerns feel free to give us a call and we are happy to assist."],"reviewsAspects":["air fryer","easy to clean","easy to use","french fries","stopped working","pork chops","love this air","highly recommend","chicken wings","super easy","pleased with my purchase","fried chicken","send it back","far happy","chicken breasts","cooks fast","great customer service","use and clean","great way","fryer is awesome"],"productInformation":[{"Package Dimensions":"16 x 15.5 x 15.5 inches"},{"Item Weight":"17.05 pounds"},{"Shipping Weight":"17.05 pounds (View shipping rates and policies)"},{"ASIN":"B07GSHW951"},{"Item model number":"MHAIRFRYLG94"},{"Customer Reviews":"4.4 out of 5 stars\n    150 ratings\n4.4 out of 5 stars"},{"Best Sellers Rank":"#28,590 in Kitchen & Dining (See Top 100 in Kitchen & Dining)\n#84 in Air Fryers\n"},{"Date first listed on Amazon":"October 10, 2018"}],"productDescription":["Do you love the taste of fried food? Are you looking for a healthier alternative to fried food that still gives it that great taste?","Get the best of both worlds with the Mockins Extra Large Family 5.5L Air Fryer and stay healthy while still enjoying great food!","\n","\n","\n","Prepare a diverse range of delicious dishes with little to no oil!","Foods that were once high calorie and deemed unhealthy can now be eaten guilt-free.","Rapid Air Circulation Technology cooks food by circulating hot air in all directions, ensuring fast and even cooking.","Includes a removable pan with a cool-to-touch hand-grip.","The detachable basket makes moving the food from the air fryer to your plate quick and easy.","Free added recipe book with step-by-step instructions to make delicious and fun dishes the whole family will love."],"reviews":[{"reviewerName":"tempgal","rating":"5.0 out of 5 stars","reviewTitle":"I think I'm in love (with this Mockins Air Fryer)","reviewDate":"December 5, 2018","reviewText":"I pondered the purchase of an air fryer for months and wrestled with conflicting thoughts as to how large a cooking basket was adequate, and whether or not the device was worth the cost. I saw the Mockins on Amazon, was satisfied with the reviews and the price, and decided to go for it. The basket in this one is HUGE -- about 9 inches across and about 5 inches deep. Might not be big enough for a Thanksgiving turkey, but it will hold a LOT of food. Thankfully, the exterior doesn't seem any larger than other air fryers with a basket only a quarter the size of this one. The unit is nearly silent while operating and cleans beautifully. So far, I've only needed to wipe it out with a sponge. My first effort was very healthy chicken fillets (with just seasoning, no oil and no breading). Every morsel was enthusiastically eaten. The second effort was brats. Instead of my usual parboiling then grilling brats, I only air broiled them. They came out juicy and delicious. Next is going to be either shrimp or catfish and I can't wait to try out a few other foods that I've been avoiding because they needed to be breaded or fried. This is an excellent gift -- either for your own household or that of someone you love. Just do it."},{"reviewerName":"Amazon Customer","rating":"4.0 out of 5 stars","reviewTitle":"Review","reviewDate":"October 28, 2018","reviewText":"I just purchased this product. I had a smaller air fryer that worked great so i think just getting used to this one is all i need to do. I used it twice and my food came out good. I think it worked better the second time. I made organic chicken wings. The tempature was 360 first for 15 minutes then i turned them for another 12 minutes. They turned out golden and crisp on the outside and tender on the inside."},{"reviewerName":"Mrs. B","rating":"5.0 out of 5 stars","reviewTitle":"Love this thing!!!!!","reviewDate":"November 27, 2018","reviewText":"Great product! All you need is a little spray oil and you're good to go. Crispy? Yessssssssssss. Trial and error I burnt the potato cakes. Too much time and high heat. Next batch was mmm mmm good! Did I mention that it cooks fast too? If you're looking for a product that is inexpensive, has great quality, light weight, fast cooking time, and easy to clean, THIS IS IT!!!"},{"reviewerName":"Amber Honey","rating":"5.0 out of 5 stars","reviewTitle":"Great product and Great customer service!","reviewDate":"November 26, 2018","reviewText":"I broke the drawer part of my unit when I accidentally clicked the button which then caused me to break the clips that held the drawer in. I called Mockins and they sent me out a new drawer free of charge. Great customer service and great product!"},{"reviewerName":"Kevin","rating":"5.0 out of 5 stars","reviewTitle":"Great Wings","reviewDate":"September 22, 2018","reviewText":"I'm so tickled... It's worth buying just for the great chicken wings. They got perfect. And a cinch to clean."},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"great product; easy to use; and easy to clean","reviewDate":"October 16, 2018","reviewText":"what I like most about this air fryer is the simplicity of use. The touch pad and preset buttons make using this product easy and simple. I have used it with several dishes and find the French fries to be the best. I would recommend this product for anyone wanting a simple to use appliance and healthy food. clean up is a breeze and easy."},{"reviewerName":"Jerome G Spearman Sr","rating":"5.0 out of 5 stars","reviewTitle":"This machine is the answer to my prayers....help me to lower my High cholesterol.","reviewDate":"October 5, 2018","reviewText":"I love it is user friendly, easy to clean. It cooked my fish to perfection,just enough crunch on top,and no oily taste."},{"reviewerName":"tamme","rating":"5.0 out of 5 stars","reviewTitle":"Birthday Gift for my Mom","reviewDate":"October 12, 2018","reviewText":"I am so pleased with this air fryer. I spent several weeks researching many different types of air fryer's. I am so impressed with the construction of this product. We've made Egg Rolls and Sweet Potato Fries so far. Customer service and the warranty is also a very important selling point for me. Very pleased with my purchase!!"},{"reviewerName":"sheree","rating":"5.0 out of 5 stars","reviewTitle":"great air fryer!","reviewDate":"November 19, 2018","reviewText":"I was hesitant in purchasing an air fryer online, but this air fryer is great! 5.5 liters is the perfect size for cooking a family meal!"},{"reviewerName":"Raftice","rating":"5.0 out of 5 stars","reviewTitle":"Good fryer. Excellent quality and features","reviewDate":"October 22, 2019","reviewText":"We are pleased with the air fryer. It has a good sized capacity and cooks well. It does a great job on chicken and fish and works especially well for asparagus. We did note an odor when using the fryer for the first few times but it has since dissipated. A note concerning all air fryers. While it does work well, I find that many things that I cook in the air fryer could be just as easily, and often more easily, be cooked on a baking sheet in the oven. In my opinion, they are sort of a fad that will likely die out. Having said that, if you want to get one, this one has been a good one so far. We are happy with the quality and the features. there is a plastic cover over the basket release that prevents you from accidentally releasing the basket and having the basket and fryer bottom separate and spill hot food or the hot basket. I notices that some reviewers noted this was a problem on other fryers. I cannot recall if anyone noted having a problem with this one. I will say that if you have that problem with this one, you are probably mentally defective as the cover makes it nearly impossible to accidentally release the basket. We use the parchment inserts when cooking and this preserves the Teflon coating of the basket and cooker. I highly recommend that you buy these inserts. They make cleaning a breeze. I think it is also a good idea to buy an accessories kit to go with the fryer. People who report having problems with this are obviously not using these recommended inserts or are using harsh abrasive items to clean the fryer. Please note when purchasing an air fryer that there is a learning curve concerning how to cook foods perfectly in it. It takes some time to get to know how it works and cooks and one should not expect perfection immediately."},{"reviewerName":"James E. Egolf","rating":"1.0 out of 5 stars","reviewTitle":"Display dies quickly","reviewDate":"March 6, 2019","reviewText":"After ordering this fryer the LED's in the display began to die after three months. While one going bad is not that big a deal, three is with the possibility of not being able to tell temperature or time. Find a better machine than this and skip this one."},{"reviewerName":"Joseph P Kania","rating":"1.0 out of 5 stars","reviewTitle":"Defective Product; Will Be Replacing With a Different Brand","reviewDate":"April 19, 2019","reviewText":"I was excited to receive this air fryer. Unfortunately, the price for its size and excellent reviews proved too good to be true. The air fryer is defective and unusable: The drawer does not fit correctly in the machine, so the fryer gets no electrical power unless I push down on and hold the drawer handle. If I let go, the power shuts off. Thus, I wasn't even able to try the fryer. I contacted Amazon and its customer service walked me through a number of troubleshooting steps before acknowledging that the product was simply defective. A frustrating, dinner-less night, and now I have to box it up and send it back. Amazon's customer service was excellent, but I will be using my refund on a different brand instead of risking the same thing happening again."},{"reviewerName":"c wyman","rating":"5.0 out of 5 stars","reviewTitle":"Honored the warranty as stated on the Amazon site.","reviewDate":"March 15, 2019","reviewText":"The inter basket lock/unlock button malfunctioned making it possible for the inner basket to come out when shaken. Called Mockins and explained the problem. Within two weeks I had a new air fryer. Excellent customer service and a excellent product. I would buy it again. For sure its a five star product and a five star company."},{"reviewerName":"Sherry","rating":"5.0 out of 5 stars","reviewTitle":"This Mockins Air Fryer is awesome!","reviewDate":"December 3, 2018","reviewText":"This product is awesome. I have had it unpacked for only 3 days and have made a whole chicken and blackened pork chops. Both were super delicious. I will use it often. I just cleaned out a cupboard shelf so it will be front and center for easy retrieval. I can’t wait to make more awesome things. It is easy to use, easy to clean. And if the enclosed cookbook doesn’t cover what you need, there are many recipes on the internet."},{"reviewerName":"A222222²1mazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Super easy","reviewDate":"October 17, 2018","reviewText":"Absolutely love how easy it is to make meals that even the kids love... also super easy to clean."},{"reviewerName":"jhenry","rating":"4.0 out of 5 stars","reviewTitle":"great customer service but the product stopped working after two times of using","reviewDate":"August 31, 2019","reviewText":"I recieved my air fryer in just a few days. I used it twice and was in love with this fryer. It was really easy to use and the food turned out great. The third and fourth time i tried to use, I started to have issues. The temp wouldn't let me set for more than 200 ( I reset several times). I decided to cook what was planned at 200 and double the time and then it started to trip my breaker. The next day I called Mockens and they were quick and awesome with my frustraion. They belieaved that the fryer must not be compatable with my outlet. I belieave it was a fluke and my fryer was defective (since it stopped going pass 200). They said they never ran into this issue and didn't want to send me another one since it was tripping my breaker. They refunded me my money quickly and didn't make me send it back. I'm ordering another brand and wattage to see if I have better luck. Even tho I had isuues in my experence with this certain fryer I was very pleased with the company and customer service."},{"reviewerName":"TerriA","rating":"1.0 out of 5 stars","reviewTitle":"Read reviews before purchasibg","reviewDate":"January 30, 2019","reviewText":"We purchased this in Oct and delivered Nov 1st and have used it about 7 times. Went to use it tonight and it went crazy and now no longer works.\nWhat a waste of money. Buyer Beware!!"},{"reviewerName":"Allie Pacino","rating":"5.0 out of 5 stars","reviewTitle":"Watch it, because it cooks food FAST!","reviewDate":"September 18, 2019","reviewText":"Love my Mockins air-fryer. I think the picture doesn’t do any justice to the size because this thing is huge and I probably could’ve gotten a smaller version but I have more room for more food so I’m not complaining. It cooks everything is record fast time and always has a crispy crunch that’s unmatched. Before I would always reheat things like fried chicken or catfish in the oven and the texture would remain the same as if it came out of the fridge (slightly soft), but now I get a better crunch than when I originally brought them home. Just amazing. Only thing I would say to watch out for are the preset times, because (especially when reheating) most items don’t need the full amount of time to get hot and crispy. One of the first times I used it, I left catfish nuggets in for the preset time for fish and those things were hard as a rock!"},{"reviewerName":"Glenn Allen","rating":"5.0 out of 5 stars","reviewTitle":"So Far, So Good","reviewDate":"October 2, 2018","reviewText":"Used one time so far, frying chicken thighs with good results. Disappointed about the delivery time (almost two weeks)and the limited number of recipes. Nothing on fried chicken??"},{"reviewerName":"Oghos nosa","rating":"1.0 out of 5 stars","reviewTitle":"Died after first week of use","reviewDate":"April 28, 2019","reviewText":"I was extremely excited to use this product. It worked flawlessly for 1 week, was easy to use and clean. After first week, it started making a weird noise and draws so much power it caused the circuit breaker to \"break\". I was worried about it causing a fire so I stopped using the product. What a shame!"},{"reviewerName":"Marcus_H","rating":"5.0 out of 5 stars","reviewTitle":"Hassle Free Cooking","reviewDate":"December 24, 2018","reviewText":"Love this air fryer. We've cooked wings, fries , bacon, chicken breasts and sausage with it so far. The buttons are a little loud but you really won't spend much time pressing them (need to figure if the volume can be turned down). Don't want to get popped by grease? Get you an air fryer and sit on the couch while it fries to perfection. Definitely glad we bought this item."},{"reviewerName":"Shuh-Marraka","rating":"5.0 out of 5 stars","reviewTitle":"Best investment yet!","reviewDate":"March 14, 2019","reviewText":"This air fryer is one of the most amazing things ever !! You can literally cook anything in it. It thoroughly cooks pork chops in about 15 minutes. For me, I like to line my basket up with foil for easy cleaning but to each it’s own.\n\n**When using air fryer to cook meat, make sure you’re using marinade, water or some type of liquid so your meat won’t dry out. It cooks so fast so your meat can easily dry out."},{"reviewerName":"always honest","rating":"5.0 out of 5 stars","reviewTitle":"Nice unit","reviewDate":"January 21, 2019","reviewText":"I really like this oven but have a problem with the 3 tiny black caps that keep falling off the basket. These caps prevent the nuts on the outside of the basket from scratching the pan. I have already lost one cap down the sink drain. Other than that I makes great wings & baked potatoes."},{"reviewerName":"Frederick Reed","rating":"5.0 out of 5 stars","reviewTitle":"Product is great. Highly recommended","reviewDate":"July 7, 2019","reviewText":"Product works as advertised. Customer support is superior. Basket was defective and I called they sent me a new basket ASAP at no charge. I highly recommend to everyone to buy this product."},{"reviewerName":"Amazon Customer","rating":"4.0 out of 5 stars","reviewTitle":"Either way...","reviewDate":"July 28, 2019","reviewText":"I feel as a beginner with using an airfryer. It doesn't offer any beginner tips and how to get it crispy. My first thing I made was sweet potato fries and they came out horrible. I later discover your not really eliminated oil. You still need it with the airfryer. Not a lot (couple of tablespoons) but none the lesa still needed it. If I known this I would have never purchased one. However, after a few you tube videos. I learn some tricks. I personally don't think it cooks faster."},{"reviewerName":"Rosemarie Cappolina","rating":"5.0 out of 5 stars","reviewTitle":"Very healthy. No greasy frying.","reviewDate":"October 1, 2018","reviewText":"Love my air fryer. So easy and everything comes out so crispy"},{"reviewerName":"AngelR.S.M.","rating":"5.0 out of 5 stars","reviewTitle":"Amazing.","reviewDate":"September 26, 2018","reviewText":"No complaints. Great product. Recommend to everyone."},{"reviewerName":"ImmaB-Anonymous","rating":"5.0 out of 5 stars","reviewTitle":"Pretty Awesome","reviewDate":"April 21, 2019","reviewText":"Started off small with French Fries and did not use one drop of oil. Very tasty and the fryer will be getting a lot of use. Arrived on time and I was shocked by the size I thought it would have been smaller. Really glad I purchased this Air Fryer."},{"reviewerName":"potatochip","rating":"5.0 out of 5 stars","reviewTitle":"Excellent Product","reviewDate":"April 9, 2019","reviewText":"This is a very convenient cooking tool which makes delicious food by not drying out the meat. We made fries as well and they tasted like restaurant grade fries. Definitely would recommend purchasing and told my co-worker who ended up buying one as well."},{"reviewerName":"cim","rating":"5.0 out of 5 stars","reviewTitle":"I like it","reviewDate":"November 12, 2018","reviewText":"This gets very hot ! I had to get used to settings for different foods. But once i did i used it more and more. My hisband uses it now too. Cleaning it is easy too,"},{"reviewerName":"Ratings Guru","rating":"5.0 out of 5 stars","reviewTitle":"Efficient","reviewDate":"December 30, 2018","reviewText":"We cooked some chicken and it was the best tasting, crispy chicken we have had in years. If other meals are as delicious and easy to fix in the future, I am only sorry we didn't purchase this years ago. A fine product."},{"reviewerName":"Audrey Berger","rating":"5.0 out of 5 stars","reviewTitle":"The machine really does brown. I’m hooked. The size is great for s family of four","reviewDate":"October 9, 2018","reviewText":"I used the air fryer to make city chicken. It came nice and brown and juicy."},{"reviewerName":"Brian cotten","rating":"5.0 out of 5 stars","reviewTitle":"We love it!","reviewDate":"October 8, 2018","reviewText":"Great machine! We have cooked numerous things in this machine and it has cooked to perfection."},{"reviewerName":"Daniel Perry","rating":"3.0 out of 5 stars","reviewTitle":"Good but, two months and non stick coating is coming off of basket.","reviewDate":"July 7, 2019","reviewText":"UPDATE: Contacted Mockins directly and they sent a brand new basket, no questions.\n\nEverything you expect to get out of an air fryer. Only had it for two months and the non stick coating is already coming off!"},{"reviewerName":"Hayley Pomerantz","rating":"1.0 out of 5 stars","reviewTitle":"Coating is peeling","reviewDate":"February 4, 2019","reviewText":"Whole basket and tray , coating is peeling"},{"reviewerName":"J. Davis","rating":"5.0 out of 5 stars","reviewTitle":"Love it!","reviewDate":"July 8, 2019","reviewText":"For one person cooking for just themselves this is a great product. Love to cook chicken from raw or rewarm crusty chicken that has gotten soggy. The rewarmed chickens crust is nice and crispy."},{"reviewerName":"Stephon","rating":"5.0 out of 5 stars","reviewTitle":"Heaven Sent!","reviewDate":"May 29, 2019","reviewText":"I am in ABSOLUTE love with this product. Since purchase, I have not used any other method to fry my food. My partner and I find ourselves looking for new things to cook in the air fryer weekly. None of the food ever feels greasy and we are able to have our favorite fried foods without the use of cooking oil. Clean up is also very easy. I recommend this product to anyone trying to live a healthier lifestyle."},{"reviewerName":"hooch","rating":"5.0 out of 5 stars","reviewTitle":"Put something like trivets under it cracked our corian","reviewDate":"April 11, 2019","reviewText":"It’s a lot bigger than expected so storage is tricky! But I love it!! So easy to clean. Time cooking about the same but so much healthier 😍"},{"reviewerName":"Bonnie Bigham","rating":"4.0 out of 5 stars","reviewTitle":"mockins air fryer","reviewDate":"November 3, 2018","reviewText":"Just got my fryer. I was amazed how it worked. I'm exploring different foods."},{"reviewerName":"mary l.","rating":"5.0 out of 5 stars","reviewTitle":"Product","reviewDate":"November 22, 2018","reviewText":"It is a great buy and I would buy it again as a gift and you can not get a better price"},{"reviewerName":"Rita L. Lopez","rating":"5.0 out of 5 stars","reviewTitle":"Makes good food but disappointed in quality.","reviewDate":"August 2, 2019","reviewText":"I really love how the food tastes! On the down side the non stick coating is peeling off and only had it a few months also the little rubber covers on inner basket keep coming off. I will say I contacted them and were very accommodating. They send me a new inner basket but could not send me the outer basket so they refunded me the full amount I paid."},{"reviewerName":"luis suarez","rating":"1.0 out of 5 stars","reviewTitle":"Mala calidad","reviewDate":"July 1, 2019","reviewText":"Se oxida, y pierde la pintura al poco tiempo de uso."},{"reviewerName":"stewart huffmaster","rating":"1.0 out of 5 stars","reviewTitle":"Not a good product. Not durable.","reviewDate":"May 14, 2019","reviewText":"The Teflon Coating on the internal basket does not stick. The rubber legs on the bottom of the basket are not securely attached. The unit smells of an electrical short after only 5 uses. The unit no longer heats after 5 uses. Can not be easily repaired."},{"reviewerName":"anonymous19912018","rating":"1.0 out of 5 stars","reviewTitle":"Getting smoke from the top","reviewDate":"June 9, 2019","reviewText":"Had this item for about a month. used it first time after 5 days after getting it. just some light marinated chicken according to the instructions. all my smoke alarms go off. the next day same thing happens. had return label printed. This item is going back today. very disappointed."},{"reviewerName":"jackie ducker","rating":"5.0 out of 5 stars","reviewTitle":"BUY THIS RIGHT NOW","reviewDate":"November 2, 2018","reviewText":"Most amazing invention!!!! Totally a must have!!!"},{"reviewerName":"Patrick Scott","rating":"1.0 out of 5 stars","reviewTitle":"Died after 3 uses.","reviewDate":"March 25, 2019","reviewText":"Received this on March 13...cooked 3 meals (which were delicious) but each time it blew a circuit breaker...on the fourth try tonight it had no power."},{"reviewerName":"renee","rating":"5.0 out of 5 stars","reviewTitle":"Fantastic purchase","reviewDate":"March 23, 2019","reviewText":"Got this today and couldn't wait to try it out. Cleaned it with soap and water and popped in some frozen chimichangas that I've had hanging around. 20 minutes at 380 and everyone was raving at how much they liked them. So far so good. Will update if it changes."},{"reviewerName":"Joseph Krueger","rating":"5.0 out of 5 stars","reviewTitle":"Great Air Fryer","reviewDate":"November 2, 2018","reviewText":"Great product. Very please with this purchase"},{"reviewerName":"Wayne","rating":"5.0 out of 5 stars","reviewTitle":"GREAT Product","reviewDate":"October 6, 2019","reviewText":"I was very skeptical at first - but this air fryer is awesome. Many online cook books available have helped show other dishes available through this. Each time it tastes as good, or better, than my old deep fryer - I'm sold."},{"reviewerName":"Eileen","rating":"3.0 out of 5 stars","reviewTitle":"The drawer/basket handle is not properly functioning.","reviewDate":"November 4, 2019","reviewText":"The drawer with the handle did not open and close easily. I sent it back before I used. It.\nIt is bulky."},{"reviewerName":"jim","rating":"5.0 out of 5 stars","reviewTitle":"You can cook anything you want in it","reviewDate":"August 24, 2019","reviewText":"This machine is awesome, its like you are deep frying food, it comes out just as crispy without the grease"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Great way to reduce calories.","reviewDate":"August 1, 2019","reviewText":"Getting used to no oil fried flavor of fried foods is the biggest challenge. Trial and error soon teaches you how long to set the temperature and timer. Doesn’t save a lot of time but reduces calories."},{"reviewerName":"Lisette","rating":"5.0 out of 5 stars","reviewTitle":"Is the perfect item for your kitchen","reviewDate":"March 21, 2019","reviewText":"It is so easy to use I could make so much stuff in it without making a mess in the kitchen"},{"reviewerName":"Priscilla Elkins","rating":"5.0 out of 5 stars","reviewTitle":"GREAT VALUE!","reviewDate":"February 6, 2019","reviewText":"I received this for Christmas it was just what I wanted. I loved the home made french fries! We also cooked chicken thighs and my husband loved them. So much more healthy for you. Easy to clean"},{"reviewerName":"BEVERLY DELLINGER","rating":"2.0 out of 5 stars","reviewTitle":"Only had 1 month","reviewDate":"August 28, 2019","reviewText":"Had this air fryer for just over a month and we loved it. Worked great now all of a sudden it stopped working. It was cooking then it stopped and won’t come back on, NOTHING!! And of course it doesn’t right when the window closes to return it. Can’t get any help with it."},{"reviewerName":"Cookie Kim","rating":"5.0 out of 5 stars","reviewTitle":"Works great and easy to use/clean!! Great buy!!","reviewDate":"September 3, 2019","reviewText":"Top of the Line product. Huge space for cooking multiple pieces of food/large quantities. Super easy cook mode options!! I love this product!!"},{"reviewerName":"cfs dd?xzfzxgfcbbjjbjodc","rating":"5.0 out of 5 stars","reviewTitle":"Excellent","reviewDate":"August 23, 2019","reviewText":"Greatttttttt love this no fat and makes veggies crisp"},{"reviewerName":"S Kim","rating":"5.0 out of 5 stars","reviewTitle":"A great air fryer","reviewDate":"March 27, 2019","reviewText":"Works well, and is very quiet. I'm very happy with the purchase."},{"reviewerName":"alejandro31us1","rating":"5.0 out of 5 stars","reviewTitle":"Great taste.","reviewDate":"April 15, 2019","reviewText":"Food taste is excellent and works just as described, great option. I also love their cuatomer support that tryes to solve all issues and are willing to help"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Item was received very quick. Easy to use!!!","reviewDate":"August 26, 2019","reviewText":"I really like the size of the Air Fryer, it was an upgrade from my 3.5 qt fryer. Able to cook more."},{"reviewerName":"Donnie","rating":"5.0 out of 5 stars","reviewTitle":"Price is right","reviewDate":"December 19, 2018","reviewText":"Like used product for cooking."},{"reviewerName":"Iloan4u","rating":"5.0 out of 5 stars","reviewTitle":"THIS THING IS AWESOME!","reviewDate":"January 24, 2019","reviewText":"Excellent value for the price - The was the biggest air fryer that I could find, and it works like a champ. I had never used one of these before, but they were a nice addition to the kitchen - GREAT FIND!"},{"reviewerName":"bcb","rating":"5.0 out of 5 stars","reviewTitle":"large enough to meet my needs","reviewDate":"March 21, 2019","reviewText":"I love my new air fryer. This one does very well and was not expensive. I wanted one to cook vegetables which this one does. Besides the veges, I can't wait to cook a whole chicken which I can with this 5.5 liter fryer"},{"reviewerName":"Kita Sha’Nae","rating":"5.0 out of 5 stars","reviewTitle":"FAST DELIVERY","reviewDate":"March 29, 2019","reviewText":"LOVE MY AIR FRYER. IT DESERVES THE 5 STARS ITS BEEN GETTING. CANT WAIT TO BUY THESE FOR FAMILY GIFTS SOON."},{"reviewerName":"artsycatlady","rating":"5.0 out of 5 stars","reviewTitle":"Good air fryer for the price!","reviewDate":"May 11, 2019","reviewText":"Happy with this air fryer. Basket large enough to hold a lot of food. Still trying to learn timing and temperature but have had lots of good results."},{"reviewerName":"Cindi","rating":"5.0 out of 5 stars","reviewTitle":"Love it","reviewDate":"February 16, 2019","reviewText":"Perfect size for cooking for a family. Cleans up easily if you clean it regularly. I use it several times a week. Makes the BEST reheated pizza."},{"reviewerName":"MOONWILLOWSINDIE","rating":"5.0 out of 5 stars","reviewTitle":"Wonderful time saver","reviewDate":"May 14, 2019","reviewText":"Fast, makes crispy wings and fish"},{"reviewerName":"Ed Rockefel","rating":"5.0 out of 5 stars","reviewTitle":"5 Stars","reviewDate":"October 19, 2019","reviewText":"Excelente producto."},{"reviewerName":"Judy Orrell","rating":"5.0 out of 5 stars","reviewTitle":"Ease of Use","reviewDate":"April 29, 2019","reviewText":"This air fryer is great. I've only had it for a week but have used it everyday. Food comes out better than expected. It is flavorful and looks great. Haven't used my oven in a week."},{"reviewerName":"Shawn","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars!!","reviewDate":"October 7, 2018","reviewText":"Amazing product. First time user. So excited about all the great food I can make in this Airfryer."},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Great product","reviewDate":"June 26, 2019","reviewText":"Used it once so far without any problems. Works so well that it actually has my wife cooking again lol"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Safe for kids, specially the ones that do not like to cook lol","reviewDate":"January 3, 2019","reviewText":"You may cook in less time also you do not have to stay in the kitchen"},{"reviewerName":"Gienny","rating":"5.0 out of 5 stars","reviewTitle":"Espectacular","reviewDate":"July 16, 2019","reviewText":"Espectacular, me resolví la vida con la freidora, pero a los 2 meses se volvió loca y se recalentó y no prendió más."},{"reviewerName":"garesaw","rating":"3.0 out of 5 stars","reviewTitle":"Not the greatest","reviewDate":"October 1, 2019","reviewText":"Coating wears off easy"},{"reviewerName":"Karen M. Zenner","rating":"5.0 out of 5 stars","reviewTitle":"Great way to cut the grease and still enjoy your favorites!","reviewDate":"August 27, 2019","reviewText":"Fantastic product! Received it as a gift,... recommended it to a friend that now loves hers too,... but also sent one as a gift! I am a fan!"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"5 stars","reviewDate":"March 13, 2019","reviewText":"Amazing product! Works great!"},{"reviewerName":"Phyllis Riveira","rating":"5.0 out of 5 stars","reviewTitle":"Good product.","reviewDate":"July 6, 2019","reviewText":"I been using it for fry chicken, fish and egg roll. It's so easy to use and take couple minutes to clean. I am glad that I purchased this product. Thank you."},{"reviewerName":"Donna Mabry","rating":"5.0 out of 5 stars","reviewTitle":"Love it","reviewDate":"September 14, 2019","reviewText":"Great quality"},{"reviewerName":"Gary M Stevens","rating":"5.0 out of 5 stars","reviewTitle":"Best thing ever","reviewDate":"June 23, 2019","reviewText":"Bought this for daughters birthday She loves it said probably never use here stove again. Makes everything fast and easy I my self like making onion rings and a fries."},{"reviewerName":"Rhonda B.","rating":"5.0 out of 5 stars","reviewTitle":"Very pleased with my purchase!","reviewDate":"March 26, 2019","reviewText":"So far I have used it to cook chicken breasts & steak & they have both come out very good! It is very easy to clean.\nI have yet to use the pre set menu but this far, I'm happy with my purchase! Good value for the price!"},{"reviewerName":"Maria S.","rating":"5.0 out of 5 stars","reviewTitle":"Honest","reviewDate":"November 23, 2018","reviewText":"I'm very happy with it."},{"reviewerName":"Louis Saulsberry. Jr","rating":"5.0 out of 5 stars","reviewTitle":"It’s easy to work with and great and easy to use. Thank you","reviewDate":"November 14, 2018","reviewText":"Like this order it’s just what we wanted"},{"reviewerName":"patti","rating":"5.0 out of 5 stars","reviewTitle":"It works as claimed","reviewDate":"December 15, 2018","reviewText":"So far I haven't found anything to dislike. We haven't used it a great deal but what we have made as turned out very good.\nOverall I give this a excellent five star rating."},{"reviewerName":"judy tureson","rating":"5.0 out of 5 stars","reviewTitle":"Great for easy dinner plans","reviewDate":"August 28, 2019","reviewText":"Works great and good for a large family"},{"reviewerName":"RENIER E. PENICHE","rating":"5.0 out of 5 stars","reviewTitle":"Great pic","reviewDate":"May 26, 2019","reviewText":"Excellent product"},{"reviewerName":"steve","rating":"5.0 out of 5 stars","reviewTitle":"LOVE IT","reviewDate":"August 22, 2019","reviewText":"I love using it. It's so simple and very easy clean up."},{"reviewerName":"Nancy Shively","rating":"5.0 out of 5 stars","reviewTitle":"Food is delicious","reviewDate":"October 17, 2018","reviewText":"Like the small amount of oil you have to use....awesome!"},{"reviewerName":"tommy","rating":"5.0 out of 5 stars","reviewTitle":"Great taste","reviewDate":"July 20, 2019","reviewText":"Great product love it"},{"reviewerName":"J. Terry","rating":"4.0 out of 5 stars","reviewTitle":"Good","reviewDate":"November 8, 2019","reviewText":"Love this Air Fryer, only thing I do not like is after several washes of the basket the \"nonstick coating\" gets peeled off ."},{"reviewerName":"Deacon333","rating":"5.0 out of 5 stars","reviewTitle":"Easy to use!","reviewDate":"October 29, 2018","reviewText":"Ease of use!!"},{"reviewerName":"elliott schulman","rating":"5.0 out of 5 stars","reviewTitle":"great air fryer","reviewDate":"September 12, 2019","reviewText":"Hi, This air fryer has a larger capacity. Cook foster them my 2 old ones. The safety handle is designed great. It cleans great thanks elliott"},{"reviewerName":"Joshua Coyle","rating":"1.0 out of 5 stars","reviewTitle":"Not the best!","reviewDate":"October 30, 2019","reviewText":"This smokes a lot, takes longer to cook than my previous one. This lets out all the smell of the food."},{"reviewerName":"Larry D. Johnson","rating":"5.0 out of 5 stars","reviewTitle":"Easy to use and clean, good value","reviewDate":"December 22, 2018","reviewText":"Have used apx 2 months and seems to work great for many items. Only issue is round feet continuously come off bottom of inside basket."},{"reviewerName":"Stephanie Coon","rating":"5.0 out of 5 stars","reviewTitle":"Great appliance!","reviewDate":"August 1, 2019","reviewText":"I love this air fryer. I have cooked all variety of things in it and everything has turned out delicious. Cooks fast."},{"reviewerName":"Alexis","rating":"5.0 out of 5 stars","reviewTitle":"Rapido y sin esuciar tanto un éxito.","reviewDate":"May 23, 2019","reviewText":"Facil y sencillo de usar envio seguro."},{"reviewerName":"nakia barnes","rating":"5.0 out of 5 stars","reviewTitle":"Awesome product","reviewDate":"March 22, 2019","reviewText":"Omg I am so in love with this, I've been making so many things with it. I made chicken the first day and it was delish"},{"reviewerName":"Amazon Customer","rating":"1.0 out of 5 stars","reviewTitle":"Stopped working in 4 months","reviewDate":"September 17, 2019","reviewText":"My air fryer just stopped working one day. There was no indication of it stopping or anything now it just does not cut on."},{"reviewerName":"LINDA HOPKINS","rating":"3.0 out of 5 stars","reviewTitle":"Be mindful","reviewDate":"July 23, 2019","reviewText":"The paint on the basket comes off during the cooking process. I just hope and pray it doesn't cause health problems"},{"reviewerName":"imalookin2","rating":"5.0 out of 5 stars","reviewTitle":"Mockins Professional Superb","reviewDate":"March 24, 2019","reviewText":"Nothing bad about this airfryer. Made very well and QUIET"},{"reviewerName":"Stephen C Gabbert","rating":"5.0 out of 5 stars","reviewTitle":"Great","reviewDate":"July 12, 2019","reviewText":"Very happy with product and customer service is excellent"},{"reviewerName":"Melissa Kight","rating":"5.0 out of 5 stars","reviewTitle":"Healthy fried food!!","reviewDate":"August 13, 2019","reviewText":"Best thing I've purchased in a while."},{"reviewerName":"joseph cannon","rating":"5.0 out of 5 stars","reviewTitle":"Great machine","reviewDate":"April 4, 2019","reviewText":"Works great crispy fish sticks! Yum"},{"reviewerName":"Customer","rating":"5.0 out of 5 stars","reviewTitle":"Thumbs up","reviewDate":"June 12, 2019","reviewText":"Very good product. Have had it for some time now. Works perfectly"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Great product","reviewDate":"August 22, 2019","reviewText":"Great product! It’s going to live in my kitchen counter for quite some time"},{"reviewerName":"harli allen","rating":"5.0 out of 5 stars","reviewTitle":"Great quality","reviewDate":"December 12, 2018","reviewText":"Love love love"},{"reviewerName":"Jesús Soto","rating":"5.0 out of 5 stars","reviewTitle":"Great product","reviewDate":"December 25, 2018","reviewText":"It’s a must have kitchen supply. Food is done quickly and excellent for a average size famaly."},{"reviewerName":"Kindle Customer","rating":"5.0 out of 5 stars","reviewTitle":"The first few times you use it you get a new smell. That goes away.","reviewDate":"April 11, 2019","reviewText":"I love the size! It's easy to clean. I love doing new recipes."},{"reviewerName":"Joy Giannoulis","rating":"5.0 out of 5 stars","reviewTitle":"Super large. So quiet!","reviewDate":"March 14, 2019","reviewText":"So far I love it. It is even bigger than I thought it would be."},{"reviewerName":"Velisha Thomas","rating":"5.0 out of 5 stars","reviewTitle":"I love my purchase","reviewDate":"March 29, 2019","reviewText":"I love my air fryer. The wings were absolutely amazing.....❤️"},{"reviewerName":"R. CAVER","rating":"4.0 out of 5 stars","reviewTitle":"Perfect","reviewDate":"May 20, 2019","reviewText":"Excellent, my wife uses it daily."},{"reviewerName":"Michelle Vanderpool","rating":"5.0 out of 5 stars","reviewTitle":"Easy to use","reviewDate":"June 19, 2019","reviewText":"Love this👍"},{"reviewerName":"Rose M","rating":"5.0 out of 5 stars","reviewTitle":"Love it","reviewDate":"August 21, 2019","reviewText":"I can't say enough good things about this air fryer."},{"reviewerName":"dixierose190","rating":"5.0 out of 5 stars","reviewTitle":"Great Value","reviewDate":"January 16, 2019","reviewText":"Quick and easy to use with great, healthy results!"},{"reviewerName":"Edwin Alvarado","rating":"5.0 out of 5 stars","reviewTitle":"Very nice!","reviewDate":"April 11, 2019","reviewText":"Awesome Product! Great value for the money!"},{"reviewerName":"Bella","rating":"5.0 out of 5 stars","reviewTitle":"Produduct stisfaction","reviewDate":"November 7, 2018","reviewText":"Very satisfied with the product"},{"reviewerName":"Ann","rating":"5.0 out of 5 stars","reviewTitle":"Love it!","reviewDate":"September 1, 2019","reviewText":"Excellent product"},{"reviewerName":"FH","rating":"5.0 out of 5 stars","reviewTitle":"Works great","reviewDate":"March 18, 2019","reviewText":"No complaints"},{"reviewerName":"Rickey K.","rating":"5.0 out of 5 stars","reviewTitle":"Rickey","reviewDate":"March 28, 2019","reviewText":"Very easy to use"},{"reviewerName":"Tanja","rating":"5.0 out of 5 stars","reviewTitle":"Great air fryer","reviewDate":"November 8, 2018","reviewText":"I didn't know,that the air fryer was so big . but l love it now I,can air fryer my vegan food . since I'm trying to eat healthier ."},{"reviewerName":"Nancy","rating":"1.0 out of 5 stars","reviewTitle":"Do not buy","reviewDate":"October 1, 2019","reviewText":"It broke after a month"},{"reviewerName":"Scott P.","rating":"5.0 out of 5 stars","reviewTitle":"Fried food with no quilt!","reviewDate":"December 29, 2018","reviewText":"Great product! My daughter is very happy that she got it! She is looking forward to eating healthy!"},{"reviewerName":"James","rating":"5.0 out of 5 stars","reviewTitle":"Excellent","reviewDate":"January 8, 2019","reviewText":"I am extremely satisfied with the air fryer i received as a christmas gift. The chicken wings that I cooked came out golden brown and flavorful. The cleanup was a breeze."},{"reviewerName":"Paula M. Yost","rating":"5.0 out of 5 stars","reviewTitle":"GREAT QUALITY & GREAT PRICE!!","reviewDate":"September 30, 2018","reviewText":"This is a well made air fryer. This LARGE air fryer was much lower priced than others that were the same size. I am extremely pleased with my purchase. It was packaged well. It is easy to use & clean. I made fried chicken & homemade fries in it. It's makes frying food simple."},{"reviewerName":"Mister Bear","rating":"5.0 out of 5 stars","reviewTitle":"Excellent Value!!","reviewDate":"November 3, 2018","reviewText":"I love the Mockins Professional Super Extra Large 5.8QT Air Fryer!!! The first time I used it is with frozen chicken wings!! Wow what a difference in taste and very moist on the inside. Unlike deep oil fryers or your usual skillet oil fryer, with the Mockins Air Fryer you don't get that oily residue in fried chicken. It's not greasy!! Yes much better for being healthy here.\nI have yet to try some of their recipes in the booklet provided. I highly recommend this great machine."},{"reviewerName":"K. Romer","rating":"4.0 out of 5 stars","reviewTitle":"Great Machine at a Budget Price","reviewDate":"May 29, 2019","reviewText":"So far I have been very happy with this air fryer. It does a great job and quickly. I did give it 4 stars due to the fact that the non-stick coating started coming off pretty quickly. Personally that doesn't bother me too much, as I usually coat my food with oil or butter before air frying. I am also careful to not just hold the handle when I am shaking up the food, but support the basket with a heat protected hand, so as not to put too much strain on the basket handle connection. I do give 5 stars to the customer service, as they rapidly responded to an issue I had. When I received the item, the flip cover over the release button was broken (probably happened in shipping). Amazon wanted me to ship the entire fyer back and they would send me a new complete unit. I didn't want to go through all this hassle for such a small piece that was not mandatory for use of the item. I contacted the manufacturer and they sent me a replacement PDQ at no charge.\nI have been using this regularly to make crispy, delicious meals. Tonight I'm making tuna melts using this item and won't be heating up my entire kitchen here in Texas."},{"reviewerName":"Stephen O Hopkins","rating":"2.0 out of 5 stars","reviewTitle":"Fragile item & Mockins doesn't answer phone and no voicemail","reviewDate":"June 18, 2019","reviewText":"Less than a week and the small plastic clip that covers the handle release button has already broken. Fryer should have came with a bag of replacement clips because they will not hold up. They did send a small bag (qty 2) of replacement rubber covers for bolt heads that support the bottom of the basket. I guess they knew they would fall off half the time you washed it. It does make good chicken though. Still trying to figure out veggies, been burning most but I need to learn to cook them. Haven't had much luck figuring veggies in an air fryer out. Info is sparse.\nEvery time I see the broken and now set aside handle clip It will rub me the wrong way. Might send it back.\nMockins messaged me and offered to send me a replacement clip and gave me a Boston MA phone number claim my replacement. Was working odd hours and called a week or 2 later. Got a message the wireless customer was unavailable. No voicemail option was given."},{"reviewerName":"EzgiC","rating":"5.0 out of 5 stars","reviewTitle":"5 stars for everything","reviewDate":"December 9, 2018","reviewText":"I have seen a different version of air fryer at my friend’s house. Because I couldn’t find the size I wanted, I purchased mockins. I LOVED everything about it. The way it works, easy to clean, the way it looks... my favorite tool in the kitchen right now."},{"reviewerName":"AngelN","rating":"5.0 out of 5 stars","reviewTitle":"Great air fryer!","reviewDate":"September 23, 2019","reviewText":"This is an awesome air fryer. Just make sure to take off the rubber pieces covering the bolts in the basket. The rubber pieces come off super easy when cleaning and I have lost one due to forgetting to take them off while washing.\nOther than that, the air fryer does what you want. I have cooked whole chickens, chicken tenders, chicken breasts, pork chops, lots of frozen items, anything that can be baked can be air fried and tastes just as good, if not better.\nThis air fryer does stop at 400 degrees, but most do this. The size of the basket allows for whole chickens (6lbs is what I used) plus lots of other items. Make sure to preheat, which only takes a couple minutes. So if I'm cooking something for 8 mins, I set timer for 10 to preheat. You do have to shake the basket or turn things like any fryer."},{"reviewerName":"Michael White","rating":"5.0 out of 5 stars","reviewTitle":"Loving our first air fryer!","reviewDate":"June 19, 2019","reviewText":"Never owned an air fryer before. Wanted to check it out with a decent sized one and did some research. Found the Mockins air fryer and I'm very happy I did.\n\nFor a decent price, we've been able to air fry entire chickens, baked potatoes, french fries, etc. It's a GREAT way of \"baking\" things during the summer also so we don't have the extra heat from the oven. We've has this for a while now, and it's still working perfectly. I can recommend this air fryer as your entry into the world of air frying easily."},{"reviewerName":"Bayou Boy","rating":"5.0 out of 5 stars","reviewTitle":"It's a new twist.","reviewDate":"July 1, 2019","reviewText":"I use to work in the school cafeteria. It reminds me of those ovens. Well that's actually what it's an imitation of. But it's cool. Cooks great. Don't haft to add alot of seasoning to what your cooking. A 7 year old could use this thing. Kinda bulky so make space. Not crazy about the door bc I always seem to drop the bottom. That's on me though. But for Me it's not the wheel. Love it. But I still do alot if traditional cooking."},{"reviewerName":"Leah Duvall","rating":"1.0 out of 5 stars","reviewTitle":"Great customer service","reviewDate":"October 17, 2019","reviewText":"Unfortunately I may have gotten a bad unit. Mines would fill the whole house up with smoke when I used it. With both greasy and non greasy foods. I called amazons customer service and they conference called mockins and immediately I was issued a refund without having to return the unit. Both customer service teams were excellent. Sorry it didn’t work out. I liked the unit."},{"reviewerName":"John Wolcott","rating":"5.0 out of 5 stars","reviewTitle":"Five Stars","reviewDate":"October 24, 2018","reviewText":"Great hot air fryer. Comes to temp quickly and works well for even cooking."},{"reviewerName":"james mccollom","rating":"5.0 out of 5 stars","reviewTitle":"Fast cooking","reviewDate":"November 6, 2018","reviewText":"Great product fast and larger than most on the market with an excellent price . Good for football watching."},{"reviewerName":"pel4042","rating":"5.0 out of 5 stars","reviewTitle":"Great air fryer","reviewDate":"April 27, 2019","reviewText":"I like that it has a lot of presets that will set the time and temperature for chops, shrimp,chicken , frenck fries , and more. It also has a defrost setting which comes in handy if you forget to take something out for dinner."},{"reviewerName":"Duke","rating":"5.0 out of 5 stars","reviewTitle":"Everything I thought it would be in more!","reviewDate":"November 6, 2019","reviewText":"It is everything I thought it would be and more. Very easy to use and clean. I would do business with Mockins again"},{"reviewerName":"Joyce Stutzman","rating":"5.0 out of 5 stars","reviewTitle":"Great product","reviewDate":"January 7, 2019","reviewText":"Given as a gift, the recipient loves it!! They visited us at Christmas and gave them a personal tutorial on use."},{"reviewerName":"Elena","rating":"5.0 out of 5 stars","reviewTitle":"In love","reviewDate":"October 11, 2019","reviewText":"This is one of my favorite products ever. I barely have to cook."},{"reviewerName":"Jopol","rating":"5.0 out of 5 stars","reviewTitle":"A real must have in the kitchen","reviewDate":"August 22, 2019","reviewText":"I used Mockins Air fryer as soon as it was delivered . I prepared my marinated wings this morning and air fried and was very good , crispy skin evenly moist cooked wings. Super like this fryer!"},{"reviewerName":"Sergio Mata Quinones","rating":"5.0 out of 5 stars","reviewTitle":"Fat free and fast food","reviewDate":"May 8, 2019","reviewText":"Healthy fast food. I order this air fryer based on the big size and price. Today I cook some French fries and chicken nuggets. The cook book have some recipes. I try someone and the flavor are marvellous. The best of that is a fat/oil free cooking. I never back to a conventional fryer again."},{"reviewerName":"Victoria","rating":"5.0 out of 5 stars","reviewTitle":"Love this Air Fryer!","reviewDate":"August 11, 2019","reviewText":"Love this! Works great and is quiet. Very easy to use!"},{"reviewerName":"MopBITW","rating":"5.0 out of 5 stars","reviewTitle":"Good Product","reviewDate":"May 11, 2019","reviewText":"This is easy to use and easy to clean, good size"},{"reviewerName":"Kelly A. Brown","rating":"5.0 out of 5 stars","reviewTitle":"Nifty","reviewDate":"April 11, 2019","reviewText":"Great device. Well made and easy to clean. Zero issues so far."},{"reviewerName":"Jim","rating":"5.0 out of 5 stars","reviewTitle":"Great value","reviewDate":"April 17, 2019","reviewText":"1st time used tried hamburger and fries. Excellent results. Next fish and we be using forever. No open pan, no fishy smoke. Easy cleanup. The taste was great."},{"reviewerName":"richard roy","rating":"5.0 out of 5 stars","reviewTitle":"Healty eating.","reviewDate":"December 8, 2018","reviewText":"Works well."},{"reviewerName":"Debbie Haggard","rating":"5.0 out of 5 stars","reviewTitle":"Nothing I can think of","reviewDate":"July 20, 2019","reviewText":"Different meals, snacks & it turned out great, & it’s quick & easy & most of all it’s a healthier way to eat"},{"reviewerName":"kimberly whiteside","rating":"5.0 out of 5 stars","reviewTitle":"Cooks well just they way I like it....","reviewDate":"October 29, 2019","reviewText":"Cooks food fast easy and perfect"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Air Fryer easy to use","reviewDate":"April 8, 2019","reviewText":"Very easy to use. The kids can use this safely and without getting burned. A healthier way to fry foods and much more tastier than microwaving."},{"reviewerName":"Mark B.","rating":"5.0 out of 5 stars","reviewTitle":"Got a good one here!","reviewDate":"June 17, 2019","reviewText":"Works great easy to use!"},{"reviewerName":"Mike Perez","rating":"5.0 out of 5 stars","reviewTitle":"Great Product","reviewDate":"November 27, 2018","reviewText":"Very well manufactured and works much better than I expected."},{"reviewerName":"mtjj24","rating":"5.0 out of 5 stars","reviewTitle":"Great addition to kitchen appliances","reviewDate":"January 23, 2019","reviewText":"Fries are excellent. Still learning how to use but very convenient."}],"qAndA":[{"question":"Is it a fryer or a steamer?","answer":"None of the reviews listed for this Mockins air fryer are about it. They are all reviews for a steamer pot set. Amazon screwed this one up royally."},{"question":"Does he inner basket completey come out to clean?","answer":"The basket is removable. Cleaning is very easy. Also, the surface is non stick so that helps. I find putting a single layer of aluminum foil under the removable basket helps keep the cooking chamber cleanup easy peasy."},{"question":"what is the basket made of?","answer":"Not sure, like a non stick pan"},{"question":"When you push power and put it on the temperature you want does it preheat? For example I put it up to 400 and it’s saying 15 minutes?","answer":"No preheating. Set the temp, set the timer and go!"},{"question":"I keep getting an E1 on the display for my first use. What do I need to do?","answer":"I never bought this product! Amazon is having a bit of a problem I think! I received an email of products I may be interested based on my viewing...and they were nothing I would ever buy!!! I guess I need to contact customer service."},{"question":"Is there a roast setting?","answer":"Not that I can find but lowering the cooking temperature works great. I use 330 degrees for 30 minutes and then flip chicken for another 20 minutes at 330 degrees. Comes out great!"},{"question":"So lets say u frying chicken or fish would u add flour to the chicken? Just wonder if it turn out the same as if u use oil.","answer":"We’ve done both. With a milk and flour dip we lowered the temperature a little and a little longer fry time."},{"question":"I keep getting an E1 on the display for my first use. What do I need to do?","answer":"Read your instructions"},{"question":"Does anyone know where i can purchase a mockins recipe book?","answer":"A small book is included but recipe books are available from many vendors . The fryer is adjustable in temperature and time"},{"question":"Puedo comprarla y enviarla a Brasil","answer":"Thank you for reaching out to us.\nWe have had customer outside of the US buy this Air fryer via Amazon.\nBut you would have to further inquire about shipping this via Amazon."},{"question":"How big of a turkey will this large fryer manage?","answer":"I don't think a small turkey will fit, but I am not sure."},{"question":"What is the wattage ?","answer":"Not sure but works very good. Bought three extended warranty"},{"question":"Does anyone know what the wattage on the mockins 5.8 fryer is? i have searched anyplace i can think of! no watts shown!","answer":"It is 1700w."},{"question":"Does it have a drip tray?","answer":"Yes. You may have to order some extra racks and smaller pans"},{"question":"The non stick coating is peeling. Do they sell replacement or what anyone have this happen?","answer":"I have not had this problem"},{"question":"Will I have to register for the lifetime warranty ?","answer":"Yes Mockins has a lifetime warranty policy.\nJust email us at support@mockins.com with your Amazon order ID number and we will enter your purchase into our system."},{"question":"Is this good for a family of 2 or would a smaller one be sufficient?","answer":"Perfect size for 2"},{"question":"lost a rubber foot from basket, where can I get a replacement ?","answer":"I would get in touch with the seller or company ."},{"question":"Cuantos W 1400, 1500, 1600,,cuantos??","answer":"1700 W"},{"question":"My users manual was destroyed. Is there an online version?","answer":"Yes, please reach out to us at support@mockins.com so we can email you a user manual."},{"question":"Does it work on 220 Vac? Or 120","answer":"It works on 120 volt"},{"question":"The unit has a funny smell and some of the food is starting to taste like the funny smell should I be concerned?","answer":"Almost all air fryers get that smell. I believe its the rubber boots on the nuts at the bottom of the basket. I took mine off and the smell is gone. Of course it took the teflon off of the bottom below the basket but just in that one spot under each nut and hasnt effected cleaning at all. Mine kept falling off anyways."},{"question":"What is the wattage ?","answer":"1700 watts"},{"question":"Mockins manufactured in which country pl","answer":"This is manufactured in China."},{"question":"What is going on around here? and, did i just enter the twilight zone? Will this fry my wantons, or steam them? Do i even like Chinese food?","answer":"It is not a steamer"},{"question":"Can you bake with this air fryer?","answer":"Haven't tried that yet but there is a preset mode for baking on it."},{"question":"I keep getting an E1 on the display for my first use. What do I need to do?","answer":"Never happened to me. Call manufacturer"},{"question":"Where are the reviews?","answer":"They existed when I bought it"},{"question":"can this dehydrate fruit","answer":"Wish I knew, the company sent me a water filter instead of the air fryer. Had to buy elsewhere."},{"question":"Is this listing for an air fryer? The reviews seem to be for steamer baskets so I am confused.","answer":"No it is an air fryer ."},{"question":"Is this NSF certified?","answer":"Nope and it’s not a good product.\nI’m very unhappy with it."},{"question":"Is the true weight of the the air fryer 17 lbs ?","answer":"Questionable accuracy on a bathroom scale at 13-1/2 lbs"},{"question":"Do the preset buttons protrude at all?","answer":"No . It is a touch screen display ."},{"question":"How many watts is this particular fryer?","answer":"1700 watt"},{"question":"Can you cook a turkey in it?","answer":"I'm sorry the cooking area is way too small for a turkey"},{"question":"All the reviews here are for the steam pot or cook set, there are none for the the air fryer. Have you received any reviews on this air fryer?","answer":"I love it! Cooks very fast!"},{"question":"can yo make tortilla chips fom corn tortillas?","answer":"You can make tortilla chips from tortillas. Just spray the tortillas with an oil spray. Add salt"},{"question":"Can you cook Battered food?","answer":"Just did."},{"question":"Does your unit's touch pad \"leak\" noise? I'm hearing a pretty loud and annoying high frequency noise whenever the device is powered and it's loud.....","answer":"Not at all"},{"question":"Where is made of","answer":"Our Air Fryers are manufactured in China."},{"question":"How many watts max. is this fryer?","answer":"Sorry didn’t buy that one canceled order it wasn’t coming in on time , ordered a tidylife and love it don’t no the watts but cooked fish chicken steak fries"},{"question":"will this cook 3-4 chicken breasts at the same time? and do you need to flip them midway the cooking cycle? thx","answer":"Returned this item....it was more involved than advertized"},{"question":"Have any air Fryer accessory can match this product?","answer":"?"},{"question":"Can you cook a whole chicken with it?","answer":"I've never purchased this fryer."}]}