{"title":"Innsky 6.3 Qt Air Fryer( 32 Main Recipes &Grilling Rack Included), 1700W Electric Hot Air Fryers XL Oven Oilless Cooker, LED Digital Touchscreen, Auto Shut Off, 7 Cooking Presets, Preheat & Nonstick Basket 2 Years Warranty","manufacturer":"Innsky","currentPrice":null,"rating":"4.5 out of 5 stars","totalRatings":"251 ratings","features":["\n         Make sure this fits\n                by entering your model number.\n        \n","【Innsky 6.3QT XL Air fryer】Works by rapidly circulating hot air instead of oil, 85% less calories than regular deep fryers, cooks food that crispy outside and tender, moist inside. Innsky Air Fryer is good for air frying, roasting, reheating and dehydrating .Automatic shut off function prevents overcooking. Save your time and energy.","【LED Digital Touch Screen, 7 Presets】Built in digital one-touch screen menu featuring 7 presets, You can fry, bake and grill all your favorite foods such as Fries, Chips, Pork, Chicken, Steak, Shrimp, Cake, Fish, and Pizza. Improved Quality materials , no plastic smell, which is healthier and reliable.","【Dish Washer Safe & Easy to Clean】Detachable nonstick coated basket are dishwasher safe, easy to clean, you just need to clean the basket and the pan by putting it into the dish washer, release your hands and save your time.","【Free Recipe book and Grilling Rack included】Enjoy your favorite fried foods with our recipes,you can try different for your family everyday, and we also send a useful gift to you——Grilling Racks, it has 4 x skewers included, increase your grilling capacity.","【2 Years Warranty+ 90 Days Money-back】 Innsky Brand is commited to 100% customer satisfication, 90-day no reason money-back, 2 year warranty and lifetime support."],"reviewsAspects":["easy to use","easy to clean","chicken wings","french fries","big enough","highly recommend","recipe book","super easy","every day","whole chicken","large capacity","plastic smell","sweet potato","frying pan","fried foods","absolutely love","use and clean","food comes","temperature and time","without oil"],"productInformation":[{"Product Dimensions":"15.3 x 12.8 x 14.1 inches"},{"Item Weight":"11.35 pounds"},{"Shipping Weight":"13.85 pounds (View shipping rates and policies)"},{"Manufacturer":"Innsky"},{"ASIN":"B07NW9YW5Y"},{"Item model number":"55PA1US"},{"Customer Reviews":"4.5 out of 5 stars\n    251 ratings\n4.5 out of 5 stars"},{"Best Sellers Rank":"#9,134 in Kitchen & Dining (See Top 100 in Kitchen & Dining)\n#35 in Air Fryers\n"},{"Date first listed on Amazon":"February 28, 2019"}],"productDescription":["This has been the year of innovative cooking! We are all so busy and always looking for new ideas to make healthier meals for our families. In addition, we have less and less time, so we need to work smarter, not harder. With an air fryer, you can have your fried chicken and not feel guilty. This is a very cool appliance that you will want to try out.","1 x 1700W Air Fryer","1 x Recipe Book","1 x Grilling Rack","1 x User Manual","1 x Quality Card","\n","\n","\n","\t\t\t\t\t\n\t55SA1US\t55PA1US\t55PA2US\t10PA1US\tAir fryer accesories\nCapacity\t5.8QT (For 5-8 People)\t6.3QT (For 5-8 People)\t5.8QT (For 5-8 People)\t10.6QT (For 8-10 People)\t5.3QT-5.8QT-6.3QT\nControl Method\tTouch Screen\tTouch Screen\tTouch Screen\tTouch Screen\t\nAuto Off\tyes\tyes\tyes\tyes\t\nMaterials\t304 Stainless Steel/nonstick coating\tnonstick coating\tnonstick coating\tnonstick coating\tStainless Steel/nonstick coating\nGift\trecipe book\trecipe book/ grilling rack\trecipe book\trecipe book\t"],"reviews":[{"reviewerName":"IvanW","rating":"5.0 out of 5 stars","reviewTitle":"Nice Air Fryer and Easy to Use!","reviewDate":"March 24, 2019","reviewText":"Got this for my wife as heard from a friend of us that how good Air Fryer is to use on cooking with less or no oil need to add. As our kids love to eat deep fried foods so I guess having an Air Fryer might help my wife especially for cutting less on using oil to cook. So we just got it few days ago and this is our first Air Fryer so we just try something basic. We have tried to use it in the morning for cooking some bacon which we did not use any oil at all; set it to 350F and cook for 13 minutes then we got some crispy bacon for the kids. For dinner we have some chicken legs which we simply added a little bit of seasoning and a bit of corn oil then set the Air Fryer to preset of cooking chicken leg and then 20 minutes later we have some very good chicken legs. The chicken skins were very crispy but inside the meat were very tender. So far I am giving it a 5 stars and will try to use this to cook some other dishes later on since it comes with a cook book so we can try more."},{"reviewerName":"Jesse H","rating":"5.0 out of 5 stars","reviewTitle":"This air fryer is awesome!","reviewDate":"April 4, 2019","reviewText":"This air fryer is awesome! Really easy to use and easy to clean. I don't like cooking meat indoors because of the smoke and grease that gets everywhere. This air fryer does not smoke and grease does not escape. This night I received my air fryer, I made the most amazing Pork chops and popcorn chicken that were so tender and moist inside, My husband and I both love so much. It's delicious and important things is Indoor air is clean !!!\nEverything I have made so far has come out very well cooked and delicious. It's also very fast. I have no complaints so far and I'm very glad I got this air fryer."},{"reviewerName":"Vincent deng","rating":"5.0 out of 5 stars","reviewTitle":"great and easily clean","reviewDate":"April 9, 2019","reviewText":"I have never tried an air fryer before this one, but was amazed with the product so far. first off, set up took only a few minutes to get going and i was off and cooking. the air fryer comes with a book with several recipes and i found even more online(including youtude videos). i tried making steak the first time,and it came out great. nice,medium rate steaks in 12 minutes without setting off my fire alarm(as usually happens from all the smoke) and it tasted great. clean up was nice and quick as the fryer basket easily detaches with a single button press from the main pan.Summary, happily recommend this to my friends and looking forward to trying out new recipes!"},{"reviewerName":"Honesty is best adversary","rating":"4.0 out of 5 stars","reviewTitle":"Excellent Investment!!!!!!","reviewDate":"April 1, 2019","reviewText":"With exceptional new technologies, jets of hot air bursts inside the hot air fryer and cooks the food.\nMany people are still unaware of this wonder air fryer, which actually has helped countless people eat healthy and tasty food every day. Air fryer, the healthy frying option, cooks food in hot air rather than oil, so that food tastes just as good but has way less calories and cholesterol than deep fried food.For my family, I pruchased one.\nIt is a fascinating procedure, and it results in food fried in little or no oil whatsoever. That makes this product perfect for the times when one needs to reduce the calorie count of a particular dish while not compromising on the taste of it.\nApart from cooking in virtually no oil, another very big benefit of using this hot air fryer, the healthy frying option, is the reduced usage of fuel.\nMy airfryers consume a low amount of electric while cooking, and it has precise instructions.When it comes to electricity, even the usage of that is significantly lower than cooking in oil.\nAnd it is definitely easy to clean up. They can be cleaned with minimum effort, and storing them is no major hardship. There are control display screen which can adjust both the time as well as the temperature. So, if you want to cook something for 5 minutes at 200 degree centigrade, then these screen can be used to adjust the same.\nWith the airfryer, grilling, frying and baking becomes very easy, and new experiments about recipes can be made. Its design has been made that prevents sudden shock or power-related issues. Also, this opens up my world of possibilities who love to drink and eat. There is a nonstick pan inside the fryer which can be washed pretty easily and the rest of the fryer is dishwasher safe most of the times. And it is also disallows the concept of adding oil which has been the reason why many people can follow the recipes so easily, and accurately, which would be also very heart-friendly and cholesterol conscious.\nThis way, I can “deep fry” food everyday and eat it without feeling guilty about eating too many calories, or eat the same oil in which many batches of fries have been fried. The oil is harmful, as after frying for 10 hours or so carcinogenic properties develop in cooking oil left heating over high heat. In an Airfryer, no oil is necessary, and I can use a few drops of oil on the food they want to fry, and put it in. Within a scheduled time, the food is cooked to one’s perfection and the taste is the same as fried.\nSo, Innsky airfryer is definitely a very useful gadget. On one hand, it helps cook food without oil. On the other hand it is dishwasher-safe and consumes less fuel than other brands. That makes this product a very beneficial one for those who are worried about their bodies and would want to take care of himself/herself."},{"reviewerName":"Patty Martinez","rating":"5.0 out of 5 stars","reviewTitle":"Best kitchen appliance","reviewDate":"April 7, 2019","reviewText":"So glad that I decided to get this air fryer! This air fryer comes handy when preparing for dinner, not only the side is big enough but it's also so easy to clean after using it. In the package also comes a recipe book which contains various types of food. It is the best purchase!"},{"reviewerName":"TERESE","rating":"5.0 out of 5 stars","reviewTitle":"The best gadget in the kitchen","reviewDate":"April 6, 2019","reviewText":"Awesome cooking gear with large capacity, easy to use with preset and digital button , I cooked lamb lion chop withe steak preset, so I got prefect dish for my dinner. I like it make healthier cooking, it come out a lot of oil compare the traditional oven.\n\nI am lazy, I don't like wash dishes, this gear it's so easy to clearn, i just washed it with lukwarm water and wipe it dry, yahoooo, it's clearn.\n\nThe price value is good too with great quality, I would recommend it, every household should have one."},{"reviewerName":"THS","rating":"1.0 out of 5 stars","reviewTitle":"Simply fantastic! EDIT: only 3 uses and plastic tab broke off","reviewDate":"April 9, 2019","reviewText":"EDIT: I just finished using this for the 3rd time and the plastic tab for the bottom basket came off. This is the tab that slides into sensor to turn on unit when inserting the basket. The machine will not run without this little tab! I have been extra gentle when sliding basket in and out of unit too. this must have already had a crack or was weak....I have requested return and replacement. Will bump the stars back up when it is all resolved.\n\nThis thing is HUGE! I tested it out today and it cooked a thick piece of Mahi Mahi PERFECT in around 10 minutes! This is even better than my old AF which recently bit the dust. I am looking forward to using this machine!"},{"reviewerName":"JJ","rating":"5.0 out of 5 stars","reviewTitle":"Amazing Air Fryer","reviewDate":"April 3, 2019","reviewText":"My kids always like to eat fried foods so I decided to use this air fryer to make chicken wings and fries. I was surprised with the result. I didn’t use any oils and the food is still crispy. It’s a healthy way to cook food. This air fryer is easy to clean and use. It’s big enough to cook food for the family. Highly recommended."},{"reviewerName":"Angel","rating":"5.0 out of 5 stars","reviewTitle":"Good size!","reviewDate":"April 4, 2019","reviewText":"This is my second one air fryer. I bought that was size 6.3qt. My first one was smaller than this. I like air fryer because that make my cooking time shorter and easy to prepare healthy food to my family. That only use less oil to make yummy food. I am full time working mommy and they help me save lots time on cooking. The reason I bought one larger size air fryer because I could put whole chicken in the pot. It is amazing product to share with you."},{"reviewerName":"Amazon Customer","rating":"1.0 out of 5 stars","reviewTitle":"Tab for basket keeps breaking","reviewDate":"March 28, 2019","reviewText":"had to get a replacement and it still broke. The tab for the basket doesn't seem to last long."},{"reviewerName":"jin","rating":"5.0 out of 5 stars","reviewTitle":"Must try will not regret!!!!","reviewDate":"June 14, 2019","reviewText":"This is my first time trying out the air fryer, I was shock and amaze how easy and simple this cookware, and of course the food taste not as good as the really deep fried, but it is close enough. It come with a recipient book tech you how to cook and the time. So it come in very handy. The capacity is very large I can cook for 4-6serving in there very easy. The quality of the product is great. It is very simple to setup and use. Even my 10yrs old child can make a fresh french fried now. It is safe and simple."},{"reviewerName":"Marzieh Tousi","rating":"5.0 out of 5 stars","reviewTitle":"Practical","reviewDate":"April 2, 2019","reviewText":"I really like how big this air fryer is and the fact that it has a default temperature and cooking time for food; although you might end up adjusting them a bit. I made chicken thighs in this air fryer last night (see the pictures) and they came out really crispy and delicious! It was the first time I was using an air fryer and based on what I saw in the internet, I didn't wanna put too many pieces in the basket, but now I know that I could've put more pieces. So I made 2 batches and the last picture shows how dirty the basket got at the end! So little mess and so easy to clean. It took about 40 minutes for 2 batches; I think it would've taken maybe half an hr had I put all of them in at once. Anyways, I'm happy with this air fryer and I recommend it :)"},{"reviewerName":"Winky","rating":"5.0 out of 5 stars","reviewTitle":"My crabs come out great :) !","reviewDate":"May 31, 2019","reviewText":" Just use this to cook some blue crabs . They came out great and taste yummy ! Love this air fryer , it’s ideally works like small oven ! But it’s much easier to clean it . And for most of the meat and seafood products I don’t put any oil on them , when I cook them with air fryer. Which means it’s healthier. This air fryer has touch screen controls and quite easy to operate. Also the 6.3Qt space is big enough daily use ! No complaints so far :) !"},{"reviewerName":"Jakie","rating":"5.0 out of 5 stars","reviewTitle":"Recommended","reviewDate":"April 20, 2019","reviewText":"A friend recommended me to try an air fryer since it’s really easy to use and much more convenient. I figured I would trust them and now I think that an air fryer is an essential kitchen appliance. Sure microwaves do their jobs pretty well but more often than not it’s not the same reheating French fries or wings since they won’t be crispy anymore. The air fryer solves all of that. It uses no oil so that’s already a healthy bonus and it’s really versatile in uses. You can basically use it as a second oven since it will cook foods and add that crispness to foods without using the unhealthy addition of oil. You can cook foods like fries, wings, and even steak in this and it’s pretty good. You don’t have to risk burning the house down next time you cook too!"},{"reviewerName":"Sushila","rating":"5.0 out of 5 stars","reviewTitle":"I highly highly recommend this product.","reviewDate":"July 5, 2019","reviewText":"This is super beneficial. I don’t know where to start. It makes you food as tasty as deep frying but you don’t have to compromise on test. It’s been more than a month now i am using this and i am loving it. Now, i make almost everything that’s possible in this air-fryer. You can make any types of meat or vegetables. Also, you can make cheese toast or garlic toast or just toast any kind of bread. It is super easy to clean and easy to use."},{"reviewerName":"JR","rating":"5.0 out of 5 stars","reviewTitle":"Great air fryer","reviewDate":"April 20, 2019","reviewText":"This air fryer is a lot bigger and holds a lot more food than my other one. So family use is great. The unit is pretty quiet, and makes a lots less heat into the kitchen than with a conventional oven. This air fryer is super easy to use and comes with a recipe book. Even though I didn’t follow many recipes, but it has cooking guidelines on what temperature and how long to cook things. It doesn’t take very long to preheat and you can pause to shake things around in the middle of cooking without losing heat. This air fryer can fit 4 chicken breasts at a time, I haven’t tried to cook a whole chicken yet, but I think it would definitely fit in it. The fryer does a pretty good job air frying frozen foods like french fries, chicken nuggets, fish sticks, even hamburgers with little to no oil added. This air fryer may be great with frozen foods however I'm still trying to get more fresh food recipes to work better. Next, I will try baking a sweet dessert or cake. Anyway, I think this will come in very handy in the summertime in our hot climate as things cook quickly and not a lot of outside heat is generated."},{"reviewerName":"Erica Golden","rating":"5.0 out of 5 stars","reviewTitle":"TAKE MY MONEY!","reviewDate":"August 5, 2019","reviewText":"I love this air fryer. I use it everyday. It's easy to clean. I WAS hesitant to purchase it when I read someone's review saying not to purchase it if I ever wanted to clean it. I'm assuming they did not figure out how to take the frying basket out to clean the oil catching pan. So I'll inform you now if you pull the main compartment out and slide the clear tab forward there's a release button there. Push the button and the basket will release. The air fryer is still working like a champ. I looooooooove it."},{"reviewerName":"weisi dai","rating":"5.0 out of 5 stars","reviewTitle":"Good air fryer for any food!!! Good NO. 1 choice!!!!","reviewDate":"April 3, 2019","reviewText":"I got this air fryer for myself. Before I got one for my grandma in last Christmas. This time when I received it, I brought some ribs and tried this air fryer. I just want to say this. It is really really perfect! Usually we use BBQ or oven make the ribs. This time we use air fryer. It turned very good. Crispy, tasty, less oil, faster cook, easily clean!!!!!! My family fall in love with this cook. Only if you try it, you will know how much you will love this cook!!!! Also the price is reasonable too."},{"reviewerName":"LShoda","rating":"5.0 out of 5 stars","reviewTitle":"Fantastic Air Fryer and Exceptional Customer Service","reviewDate":"July 24, 2019","reviewText":"I spent a LOT of time researching Air Fryers before deciding on this one. And I'm glad I did! I have loved this Air Fryer from the first day I used it. The tray capacity is big enough for my family. It cooks quickly (without heating up the kitchen) and is simple to use and clean. I air fry all kinds of proteins (chicken breasts, pork loins and chops, steaks, you name it.) And my family likes air-fried frozen French fries even better than deep fried. Win!\n\nBut the most impressive part for me was the Customer Service. After I used the AF a couple of times I noticed the tray was difficult to slide into the machine -- it would stick on one side and take multiple tries to get it lined up correctly. It still worked perfectly, but was frustrating to use. I contacted customer service and they replaced the entire machine within days!!! I highly recommend this product, both for the function and the service."},{"reviewerName":"XL","rating":"5.0 out of 5 stars","reviewTitle":"Worth every penny.","reviewDate":"April 24, 2019","reviewText":"Tried an air fryer for the first time. Looks like a pod from an alien spaceship but it worked pretty well. 😊👌That being said, there are no other negatives. It's so easy to use, cleans super easy, and food comes out sooo good. So far I've made country potatoes and chicken cordon bleu, and my husband raved about how good they were, despite being way lower in fat than how I've previously made these dishes. I can't wait to make wings this weekend!"},{"reviewerName":"Golden zhang","rating":"5.0 out of 5 stars","reviewTitle":"It needs no oil yet food looks and tastes like it was fried.","reviewDate":"April 26, 2019","reviewText":"I LOVE this air fryer! It needs no oil yet food looks and tastes like it was fried. I made chicken strips and fries only useing a quick spray of coconut oil and they looked and tasted great!\nI usually cook these in the oven for 25-30 minutes and they only took about 13 minutes in the air fryer so its also faster.\nI like this fryer so much better than my oil fryer because not only did the food taste better it wasn't greasy yet it was crispy and tasted great. The other huge benefit is cleanup was a breeze. No oil to deal with and the removable basket is easy to wash. The black and gold color of the unit makes it look great sitting on the counter. it comes with a cook book，I can't wait to try many more things in this air fryer and think it will become one of my best used kitchen items!"},{"reviewerName":"Feng","rating":"5.0 out of 5 stars","reviewTitle":"A must-be in kitchen","reviewDate":"April 17, 2019","reviewText":"It has some smell when I use it in the first three times, but no problem afterwards. It’s easy to use with many different choices of cooking. The air fry of food are delicious while maintain the cleanliness of kitchen. I tried dumplings, chicken wings and French fries, and they came out great. The big capacity meets the needs of our big family and convenient to prepare meals. Look forward to exploring more food in future."},{"reviewerName":"Dana D.","rating":"5.0 out of 5 stars","reviewTitle":"Happy in the kitchen","reviewDate":"June 11, 2019","reviewText":"I did two weeks research of reviews on various air fryers prior to purchasing the Innsky. My first venture was a Cornish Game hen. Total success. It’s a big beast and delivers on all fronts. In particular the cleaning up is a breeze. So much easier than cleaning a whole oven. The kitchen stayed cool. It’s hot outside but not in my kitchen. I have a whole list of recipes to try in the coming weeks. There are plenty of sites on FB with happy users of fryers that will supply you with how to be successful with your AF. At this time I have no negatives to report on the Innsky."},{"reviewerName":"Amazon Customer","rating":"1.0 out of 5 stars","reviewTitle":"Cheaply Made","reviewDate":"The manufacturer commented on the review below","reviewText":"We received our air fryer, it would not even turn on. Made the exchange. Was making chicken pulled the holder out, the sensor is right under where u pull it in and out and the plastic piece broke right off as we're cooking dinner. We've had it less than a month. Seems very cheaply made."},{"reviewerName":"Christi","rating":"5.0 out of 5 stars","reviewTitle":"Love it!","reviewDate":"July 2, 2019","reviewText":"Had a hard time getting the tray out of the machine during unpackaging. I had to shake it a bit to get whatever piece had lodged it close to come loose. Maybe place the small metal accessories in a different area so they dont move around during shipping. Once I got it open it worked great. We have made several things in it and love how crispy things turn out. Was a great price as well considering the size."},{"reviewerName":"L. Beyerle","rating":"4.0 out of 5 stars","reviewTitle":"Easy to clean","reviewDate":"July 2, 2019","reviewText":"I have used this a couple of times for chicken and fresh sweet potato fries. The chicken was good but the fries weren’t as crispy as the should of been but that might of been user error. Still experimenting. This unit doesn’t really give you a lot of instructions on how to use it for different meats, just sitting for your basic meats. So it’s kinda trial and error.\nIt is super easy to clean and cooks frozen burgers quick and good!"},{"reviewerName":"Jason Feng","rating":"5.0 out of 5 stars","reviewTitle":"Modern looking, large family size.","reviewDate":"April 10, 2019","reviewText":"This is the third air fryer that I brought. First one super small Bella, got it from black Friday. Second one I brought Philip. It last for a year. Well I decide not to waste money for another Philip. So I got this Innsky. I just like Philip have modern looking and touch control. And the large size it's good for all family, I never need to cook second time. Plus the dish washer able to make very clean. Don't know how long the non-stick pan will last. But for right now it works great."},{"reviewerName":"wing","rating":"5.0 out of 5 stars","reviewTitle":"Nice kitchen helper","reviewDate":"April 14, 2019","reviewText":"I have got this fryer for like almost 2 weeks. After using it for several times. I find out this is very good for a working mother like me who has to both work and taking care of kids. This fryer saves me a lot of time, no oil need at all, I just put in clean food, set up the time and wait for the food to be reday. It’s very easy to clean up. Save me a lot of time, especially for someone who‘s not good in cooking like me. Nice appliance, and highly recommended."},{"reviewerName":"Stephanie","rating":"5.0 out of 5 stars","reviewTitle":"Big capacity air fryer for family of 8","reviewDate":"March 28, 2019","reviewText":"I ordered this big capacity air fryer to replace my old one which is only 3.7 qt and too small to make foods do my entire families. It’s very easy to use and makes delicious food. It also comes with a cook book so that I can try to make new air fryer delicious food. It’s also a good price for an XL air fryer, recommended."},{"reviewerName":"JessicaM","rating":"5.0 out of 5 stars","reviewTitle":"Do not ever set it on a stove. The bucket has to be lined up properly to insert the bucket back in.","reviewDate":"July 18, 2019","reviewText":"We love this air fryer. Its easy to use and cooks fast great quality food without all the grease. We threw out our deep fryer because this works so much better and faster"},{"reviewerName":"kettle","rating":"5.0 out of 5 stars","reviewTitle":"Nice air fryer, I like it.","reviewDate":"April 11, 2019","reviewText":"This is my first air fryer and I love it. I have succeeded in cooking chicken wings, lamb and sweet potato. The cooking time with an air fryer is much less than an oven, 15 mins at most compared with an hour at least for an oven. You don't need extra oil to cook. It does not cause any cooking fumes so no pollution to the air. The cooking pan is non-stick so it's very easy to clean. I wish I had purchased it earlier."},{"reviewerName":"Christina J Lopez","rating":"5.0 out of 5 stars","reviewTitle":"How did I cook without this?","reviewDate":"May 2, 2019","reviewText":"Now that we have this air fryer all our meats are cooked in this. . Meal cook time has cut down to 20 minutes tops. My husband even cooks in this now. I can't believe we ever cooked in a skillet before this came along. We are truely in love with it since the kids are out of the house and its just us, we cook our whole meals in here if we want and in 20 minutes we have a great dinner and no fuss, easy to clean"},{"reviewerName":"Garrett To","rating":"5.0 out of 5 stars","reviewTitle":"Very large compared to my old air fryer.","reviewDate":"April 19, 2019","reviewText":"Been using air fryers since they've become more mainstream and landing in everyones kitchen. It's very easy to use and doesn't require much clean up or attention. It's great to prepare meals in larger portions without the need to watch it over the stove. Making roasted potatos is very easy and doesn't require any oil. It frys it evenly without the need to shake the tray. Fryer heats up to 400 degrees and has a built in timer to follow cooking times. Overall, it doesn't get messy and cleaning the tray is very easy."},{"reviewerName":"McLovin","rating":"5.0 out of 5 stars","reviewTitle":"Best air fryer ever!!","reviewDate":"July 27, 2019","reviewText":"I absolutely love the air fryer. It's bigger than most i looked at and cooks faster than general recipes call for. I love making salmon, French fries, waffle fries. Corn on the cob (amazing), chicken thighs and breasts, hash browns, pork chops. This thing is real deal. Very easy to clean and operate, I talked about it so much my in-laws bought the same model!!"},{"reviewerName":"EMTDFJ","rating":"5.0 out of 5 stars","reviewTitle":"Great price versatile uses","reviewDate":"June 29, 2019","reviewText":"Was so skeptical about this thing but is the bestv5hung ever. Chicken legs come out with crispy skin and delicious. You can reheat leftover pizza and it seems like fresh. Large size and so easy to clean. Well worth the money."},{"reviewerName":"Darlene","rating":"1.0 out of 5 stars","reviewTitle":"Smelled like burnt plastic","reviewDate":"The manufacturer commented on the review below","reviewText":"I returned mine. It smelled like burnt plastic and the food (frozen french fries) had a off taste to them and smelled bad.\nI used it 2 times and both times had the same result."},{"reviewerName":"Diana D.","rating":"5.0 out of 5 stars","reviewTitle":"Great air fryer","reviewDate":"August 21, 2019","reviewText":"I bought this one to replace a smaller air fryer. I put aluminum foil on the bottom tray so that it's easy to clean and also from experience- the foil prevents future pealing on the tray. I like having a rack for extra food, however it's a bit smaller than i had image. But it is an overall good air fryer for the price."},{"reviewerName":"Rachel","rating":"5.0 out of 5 stars","reviewTitle":"Easy, fast dinner time","reviewDate":"June 13, 2019","reviewText":"I have loved this air fryer since the first day I used it. It has make my dinner time so fast and easy. A great looking air dryer with touchscreen. The tray is so easy to clean. Finally there is more pre heat and hard cleaning for the oven. Our family are eating more healthy than ever, less eating out, saving up for our next vacation:)"},{"reviewerName":"Chris Habeck","rating":"5.0 out of 5 stars","reviewTitle":"Great Air Fryer","reviewDate":"July 21, 2019","reviewText":"This is the second air fryer i have owned. The first one was much smaller, a different brand, but the controls were very similar to this one. My daughter used our old one multiple times a day and it always worked well the only problem was it's capacity was to small to cook for everyone at once. Since I purchased and received this new air fryer I have only used it once so far but the capacity is amazing! The controls are also very user friendly and it actually works better than the old one so no complaints here, thank you."},{"reviewerName":"A_prophet","rating":"5.0 out of 5 stars","reviewTitle":"100% Would buy again","reviewDate":"July 13, 2019","reviewText":"Works like a dream. I thought there would be some loss in texture or maybe even flavor since there’s no oil involved but i couldnt be any more wrong. It looks virtually identical to oil fried foods but the food feels much lighter and overall is a joy to eat."},{"reviewerName":"Billy","rating":"5.0 out of 5 stars","reviewTitle":"Amazing Air Fryer!","reviewDate":"April 6, 2019","reviewText":"I have always wanted an air fryer and when I finally pulled the trigger on this one. It's so simple to use and easy to help with a healthier lifestyle. Please follow the instructions. Set less time than you expected or you can just pull out the frying pan and check. It comes with a recipe book too. The most important thing is it is healthier. No oil or less oil in our food, you will have a healthy body and your family members too."},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"More Easily to Use Than I Thought","reviewDate":"April 19, 2019","reviewText":"It is bigger than I thought which means I can have more french fires each time, lol. Already used twice, the fryer is fantastic!! It is easy to use and easy to clean. There is a cookbook inside and I tried to make steak as the instruction. It is so easy to have a wonderful dinner. Can't wait to try every dish on the recipe book!"},{"reviewerName":"Hayley H","rating":"5.0 out of 5 stars","reviewTitle":"Love it","reviewDate":"May 12, 2019","reviewText":"Heard a lot about the air flyer recently. I finally got one from amazon. Compared to cooking top. It just so easy. I only need to shake the food holder once for the French fried or flip once for the wings. This air flyer dies all the rest. Compared to regular baker. This air fried just save plenty time. I love this air fryer"},{"reviewerName":"Lisa Thompson","rating":"5.0 out of 5 stars","reviewTitle":"Love the airfryer!","reviewDate":"April 4, 2019","reviewText":"I upgraded and got this one due to it being an XL version. It is super nice! I have made so many different types of foods in it and my 9 and 13 year old have been using it on their own as well. It is so much less dangerous than using oil and so much easier to clean. It is al digital which makes it really easy to set."},{"reviewerName":"Grace","rating":"5.0 out of 5 stars","reviewTitle":"Like it!","reviewDate":"April 25, 2019","reviewText":"This 6.3 qt air fryer is big enough for my whole family to use. It is easy to clean. And it is very easy to operate. I save a lot of time and oil now. I pretty much use it everyday. I use it a lot. I use it to cook french fries, fish, shrimp,steak. The flavor is ok for me. There is no too much smoke anymore. It is really functional. I like it."},{"reviewerName":"Wen Q.","rating":"5.0 out of 5 stars","reviewTitle":"Quite the surprise....","reviewDate":"May 8, 2019","reviewText":"I wanted to start out on a cheaper, larger air fryer to see if it was something I would use frequently. I chose this model air fryer because the capacity seemed adequate and the price was right. I was pleasantly surprised that this machine exceeded my expectations tremendously! I use it several times a week for meals or snacks. The results are always crispy and tasty! There is a learning curve as with any new appliance but once you figure it out, you won't be disappointed in this fryer ."},{"reviewerName":"jason","rating":"5.0 out of 5 stars","reviewTitle":"Love this air fryer","reviewDate":"April 25, 2019","reviewText":"this Air fryer is amazing! has is 6.3 Qt very big.the black color looks really nicely designed and easy to use .air fryer with 8 cook presets.Fried food using this air fryer came out crispy and delicious.I also put foil at the bottom for easier cleanup。is recommended to apply some oil to the food before use to enhance the taste."},{"reviewerName":"Albert Hu","rating":"5.0 out of 5 stars","reviewTitle":"Good Product and Easy to Use","reviewDate":"October 16, 2019","reviewText":"It is my first Air Fryer. I am happy so far. It is easy and fast cooking. After received Air Fryer, I tried many things from roots types of Vegetables, Chicken Wings and Drumsticks, Shimpes, Potatoes, Sweet Potatoes, Pork Ribes, etc. Vegetables are great. Chichen Wings and Drumsticks are easy cooking and excellent. Potatoes and Sweet Potatoes are east cooking. Port Ribes is the only one that less satisfies because it was too dry. Maybe I need to figure out how to cook it. In general, this Air Fryer is a good helper and worth to buy. I do recommend it."},{"reviewerName":"James","rating":"5.0 out of 5 stars","reviewTitle":"For healthy living","reviewDate":"April 11, 2019","reviewText":"I made some chicken nuggets and fries the first day I received my air fryer. Taste the same but the good thing was it's more healthier than frying it, no oil and greased on it. I'm really in loved with my air fryer, been wanting it for a while. My family really love fries so it's so useful. I highly recommend this product."},{"reviewerName":"Jamie M.","rating":"5.0 out of 5 stars","reviewTitle":"nice purchase for big family!","reviewDate":"April 2, 2019","reviewText":"The air flye come on time no issue with the shipping or so. It's so easy to use come with an instruction. Very simple instructions for cooking the food. It's not too big and it doesn't take up much room. I love to cooking with, the food turn out amazing and it keep my kitchen so clean. Before I have to use a lot of oil and it so oily every where, now not any more. It also come with a cook book, I use it to cook, amazing product. I would recommend to everyone."},{"reviewerName":"Nick-Z","rating":"5.0 out of 5 stars","reviewTitle":"Great Air Fryer","reviewDate":"April 6, 2019","reviewText":"benn looking for the air fryer for years since we want to avoid oil cooking. this air fryer helps us a lot. It's has a big size to contain a whole turkey. cook really fast and the food comes out very good and crispy as we expect. come with recipes book that gives us more choice of eating healthy"},{"reviewerName":"Olive","rating":"5.0 out of 5 stars","reviewTitle":"Easy to use","reviewDate":"April 10, 2019","reviewText":"This is the first air fryer I bought. I heard from friends that it can make fried food without oil! I like to eat fried food myself! Learn YouTube videos, fried chicken wings, fried cowboy bones. Good results! I like it very much and the air fryer has a lot of space, so I can do a lot of things at once!"},{"reviewerName":"Ethan1688","rating":"5.0 out of 5 stars","reviewTitle":"Like it","reviewDate":"April 30, 2019","reviewText":"This is a versatile air fryer. It can not only be fried but also roast and steam. Whether it is chicken, duck or pig, it can make delicious food and make cake. The most important thing is that it is fried. No oil, no air pollution, healthier eating, it’s a must-have artifact in the kitchen."},{"reviewerName":"Emily W.","rating":"5.0 out of 5 stars","reviewTitle":"great product","reviewDate":"April 1, 2019","reviewText":"The air fryer is awesome. I use it everyday and love it. It’s fast efficient and allows me to cook in the healthiest way. It’s very easy to use, you can fry with little or no oil to cook wonderfully. The air fryer’s capacity is big enough for my large family. We use it for all kinds of things. Super easy to clean. Definitely a must have for all home kitchens. Overall I am completely satisfied."},{"reviewerName":"Kindle Customer","rating":"5.0 out of 5 stars","reviewTitle":"Enjoying!!!","reviewDate":"June 27, 2019","reviewText":"Really like the size as we normally feed 5 …. have not tried everything but, so far we are very happy with results of what we have tried. Great when you have young people that want fries and chicken strips a lot. Although, other foods have turned out great!"},{"reviewerName":"Sufang jiang","rating":"5.0 out of 5 stars","reviewTitle":"Recommendable","reviewDate":"April 19, 2019","reviewText":"Fried food can be fried without oil. For people who like fried food, the appearance of air frying pan is perfect. The overall design of this air frying pan is very convenient to use, detachable blue frying pan, easy to clean, temperature and time can be set at will and has a digital display screen. It is super practical and worth having."},{"reviewerName":"Desert Girl","rating":"5.0 out of 5 stars","reviewTitle":"Awesome!","reviewDate":"June 3, 2019","reviewText":"Excellent appliance! Works exactly as expected and super easy to clean. Food cooks quickly, thoroughly, and just right. Doesn’t dry out food. I’m really happy with this purchase. Only thing to keep in mind is that it’s huge, so make sure you have space..."},{"reviewerName":"baoyue","rating":"5.0 out of 5 stars","reviewTitle":"Amazing","reviewDate":"March 31, 2019","reviewText":"I’m obsessed for this air fryer.I can cook my son crispy chicken wings and French fries or roast potatoes for my husband . The timer helps me cook everything easily with out it cooking to long like a real fryer or oven . I don’t need to worry about getting rid of hot oil no more . Very satisfied and can’t wait to try more recipes ."},{"reviewerName":"Terra","rating":"5.0 out of 5 stars","reviewTitle":"Happy with my purchase","reviewDate":"June 18, 2019","reviewText":"I have used this many times and love it. It is easy to use and easy to clean. It leaves food nice and crispy without using oil. I will really enjoy using it this summer instead of my oven and not heating up my house. I am glad that I spend more and got the larger size, we have a big family and need it. We haven’t had any problems with the product and I would recommend it to anyone."},{"reviewerName":"Lori A.","rating":"5.0 out of 5 stars","reviewTitle":"Cooks fast!","reviewDate":"March 26, 2019","reviewText":"I absolutely LOVE this air fryer! Easy clean up, and cooks the food perfect!!! Highly recommend!"},{"reviewerName":"Tik yu","rating":"5.0 out of 5 stars","reviewTitle":"The size of this air fryer is perfect!","reviewDate":"April 29, 2019","reviewText":"The size of this air fryer is perfect. Not too big it can't be stored under the counter and big enough to cook whatever you are wanting to cook. It would fit a chicken in there. Easy to use and clean.My husband and I are extremely happy with our air fryer! We have made wings ，two different types of French fries, potatoe skins, and the kids chicken tenders and fish sticks . It’s made the food so crispy !The size perfect for family 6 people.We’re love this air fryer so much and made my kids so happy ! It’s nice air fryer!"},{"reviewerName":"wei li","rating":"5.0 out of 5 stars","reviewTitle":"i need it","reviewDate":"April 13, 2019","reviewText":"I had a cholecystectomy 10 days ago. I can't eat greasy food in the future. I bought this air fryer to eat some healthy food."},{"reviewerName":"Irwin Dustin","rating":"1.0 out of 5 stars","reviewTitle":"No power response","reviewDate":"The manufacturer commented on the review below","reviewText":"Received Item.\nDefect and non-functional. Never powers up. Returned.\n\nAlso not recommended for people looking for easy cleaning.\nIf you want something simpler make sure to get a smaller air fryer with simpler tray."},{"reviewerName":"Sienna","rating":"5.0 out of 5 stars","reviewTitle":"Really easy to use!","reviewDate":"August 30, 2019","reviewText":"My friend told me all about the air fryer, I decided to buy one and try it out. It is the large size, good for a bigger family. It’s like smart fryer, I put chicken and frys in there, it can tell what is in the basket and cook right away. I didn’t have to setup Anything. It so easy to use. Only a few minutes the food was done and cooked perfectly. The taste was\nVery good. It is really good for people don’t have a lot of time to cook. Thank you, I will recommend to everyone."},{"reviewerName":"Kevin","rating":"5.0 out of 5 stars","reviewTitle":"Good air fryer.","reviewDate":"March 31, 2019","reviewText":"Got my air fryer there bigger than I thought, a bigger is always better for a big family like me, and now it's getting easier and easier to cook every day, i cook steak and fish at home all the times I even bake a pizza too we all loves it. A convenient and healthy cooking methods."},{"reviewerName":"Crystal h","rating":"5.0 out of 5 stars","reviewTitle":"Amazing! Great kitchen gadget","reviewDate":"March 30, 2019","reviewText":"This is by far my favorite kitchen gadget. I was hesitant to buy this because of it's price but, it's well worth it. It's very easy to clean and always helps you to eat a little healthier than constantly using oil."},{"reviewerName":"julia","rating":"5.0 out of 5 stars","reviewTitle":"Easy to use ,great cook than me","reviewDate":"May 5, 2019","reviewText":"It is a great buy for my family. I am not a good cook and lazy most of time. This great artifact can do everything you can imagine accept soup. I can make soup by the way,LOL. Roasted potato, meat ,vegetable, the only thing I need to do is just add some flavor.\nReally love it and very easy to handle!"},{"reviewerName":"Kara bell","rating":"5.0 out of 5 stars","reviewTitle":"Big air fryer","reviewDate":"March 31, 2019","reviewText":"Good air fryer..it's huge...came on time and nicely packed...the options to.use are very easy and it's easy to clean it also ...so far it's running excellent with no problem at all...cooked fries and it came out crispy and nicely evenly cooked."},{"reviewerName":"lxd0402","rating":"5.0 out of 5 stars","reviewTitle":"health food maker","reviewDate":"May 1, 2019","reviewText":"I love this airfryer. I have done chicken wings and came out perfect. Easy to use, easy to clean and also you dont need oil. I will be using it a lot. its a health food maker.you can eat health food every day rigth now."},{"reviewerName":"Rubin","rating":"5.0 out of 5 stars","reviewTitle":"The product worth the price","reviewDate":"April 20, 2019","reviewText":"It is very hard to choose a good one among the tens of search results from Amazon. I make it !!!\nFirst of all, the delivery is very fast. Although I choose the no-rush, I still receive it in 2 days.\nThe reason I want to buy is I'm planning to remodel the kitchen and don't want to easy everything outside. It gives me a easy way to cook. Very good quality, easy to use, easy to clean and of course the yummy food it produces."},{"reviewerName":"Coolvibes","rating":"5.0 out of 5 stars","reviewTitle":"It’s the bomb","reviewDate":"August 4, 2019","reviewText":"I’m in love! You can pretend to be a top chef with this bad boy lol It’s effortless to make a perfect steak, crispy fries, and anything else under the sun! I’ve really missed out by not buying one sooner."},{"reviewerName":"Philthesky","rating":"5.0 out of 5 stars","reviewTitle":"My first air fryer!","reviewDate":"April 5, 2019","reviewText":"I just got this air fryer last week and have made French fries using the program menu. The fries turn out great and not greasy at all. I love how it’s super easy to use and clean. My 3 year old loves fries. Now I can make healthy fries for her whenever! Next I will try to make chicken wings, super excited!"},{"reviewerName":"Nannan L","rating":"5.0 out of 5 stars","reviewTitle":"This is amazing!!!","reviewDate":"May 14, 2019","reviewText":"I already brought this air fryer for a month. I almost use this product every day, because it is easy to use and cleanup. It is amazing. When I fry chicken and steaks without added oil. I am on diet, it helps me to eat healthy and lose weight. My kitchen always looks clean and not oily. I highly recommend this product."},{"reviewerName":"Irene","rating":"5.0 out of 5 stars","reviewTitle":"Big size is good","reviewDate":"April 3, 2019","reviewText":"Like the big size which makes cooking bigger meats much easier! The cleaning is easy. I like the menu button which preset the time and temperature for different meat. It so easy to use. Really like it!"},{"reviewerName":"Randall Harris","rating":"5.0 out of 5 stars","reviewTitle":"Larger basket improves cooking results","reviewDate":"June 18, 2019","reviewText":"Item was recommended for french fries, chicken wings, and ribs. Recommendation was well founded. Haven't had for long but tried fresh hamburger patties tonight and was delighted with results. The size of the basket makes cooking everything easy and avoids the \"congestion\" and under cooking of food from using a smaller air fryer. This is the best investment I have made in a good while."},{"reviewerName":"Modern Cinderella","rating":"5.0 out of 5 stars","reviewTitle":"Easy to use and Reasonable Price","reviewDate":"May 11, 2019","reviewText":"I love air fryer. My old one is 4.8 QT and it’s not big enough for frying chicken drumsticks. My kids favorite food. The main reason I got this one because it’s 6.3 QT. After couple times of using it, I really like it. No oil needed and cooked fast. Drumsticks or chicken wings were crispy and delicious. My kids said it’s better the KFC. LoL"},{"reviewerName":"lam","rating":"5.0 out of 5 stars","reviewTitle":"my kids love them","reviewDate":"April 9, 2019","reviewText":"The air fryer as same as the picture ，the workmanship is exquisite, the texture is excellent, the shape is beautiful, fried potato chips are crispy and fishesfried with cornstarch are great. my kids love them ！"},{"reviewerName":"Justme","rating":"4.0 out of 5 stars","reviewTitle":"Must have in the kitchen","reviewDate":"September 3, 2019","reviewText":"works great, and is the perfect size! The product is easy to use, cleans up nicely, and is worth every penny! We made wings and they were the best we’ve had in awhile!"},{"reviewerName":"boom boom","rating":"5.0 out of 5 stars","reviewTitle":"Healthy alternative to fried foods AWESOME","reviewDate":"April 11, 2019","reviewText":"Love it very easy to use and clean. I left it soaking in the sink there was no rust.I have not used cooking oil since buying product. I am very happy with this purchase"},{"reviewerName":"Chris G. Hutchings","rating":"5.0 out of 5 stars","reviewTitle":"Easy cleanup and fast cooking","reviewDate":"October 21, 2019","reviewText":"I LOVE my Air Fryer!! It really is easy to clean up. I am getting used to adjusting the temperature and time so I dont overcook chicken. Hamburgers turned out very juicy. I am learning to use tin foil with chicken to keep it more moist and halfway through open up and flip chicken to get it crispy on the outside!"},{"reviewerName":"lexinyi","rating":"5.0 out of 5 stars","reviewTitle":"5 start","reviewDate":"April 29, 2019","reviewText":"Really fried food without a drop of oil, a little sound, the process is very fast! Chicken wings are made for the first time, and 12 minutes for the next time."},{"reviewerName":"Currita","rating":"5.0 out of 5 stars","reviewTitle":"Great air fryer","reviewDate":"September 6, 2019","reviewText":"I just love the fact that is very easy to clean. Easy directions to follow and so far everything I made has been wonderful. I look for recipes in You-tube."},{"reviewerName":"Bryant","rating":"5.0 out of 5 stars","reviewTitle":"I love it!","reviewDate":"June 10, 2019","reviewText":"I love this product. I have tried several recipes & they all came out great with a few little common sense tweeks here & their. I was a little leary about having to cook in batches but it cooks so fast that it is an non issue."},{"reviewerName":"summer","rating":"5.0 out of 5 stars","reviewTitle":"Easy to use and clean","reviewDate":"April 17, 2019","reviewText":"This is the first time to try the air fryer. It does help me a lot and save my time to make some food that have to be deep fried. It’s easy to use and easy to clean. So convenient ！This size is a little too big but it doesn’t matter ， I love it ！"},{"reviewerName":"Larry E. Tisdale","rating":"5.0 out of 5 stars","reviewTitle":"Trial and error cooking","reviewDate":"June 27, 2019","reviewText":"It works great. I've lowered the recommended times on most settings and use Canola oil spray to get things crisp"},{"reviewerName":"Maops","rating":"5.0 out of 5 stars","reviewTitle":"Excellent","reviewDate":"July 7, 2019","reviewText":"My wife love it"},{"reviewerName":"Amazon Customer","rating":"1.0 out of 5 stars","reviewTitle":"Broke the first and only time I used it!","reviewDate":"The manufacturer commented on the review below","reviewText":"Broke the first time I used it. Read all the one star reviews. That same little piece that broke off all the others also broke off of mine. I had to return it!"},{"reviewerName":"JO","rating":"5.0 out of 5 stars","reviewTitle":"Capacity and Quality","reviewDate":"April 1, 2019","reviewText":"The capacity is big enough for the whole chicken. It has a lot of functions. This is my first Air Fryer and was pretty skeptical about the color and texture of the outcome. So far, I am really satisfied with the outcome of the food. Clean up is easy. Will definitely recommend this Air Fryer to family and friends."},{"reviewerName":"Kenneth Messner","rating":"4.0 out of 5 stars","reviewTitle":"This is as advertised","reviewDate":"July 18, 2019","reviewText":"It has a large basket to cook 6 full wings or 12 to 14 wings cut in sections. I lo e this fryer. 20 to 22 minutes and a batch of wings are done."},{"reviewerName":"carol A. Bebko","rating":"5.0 out of 5 stars","reviewTitle":"Large enough for a family","reviewDate":"July 7, 2019","reviewText":"Very easy to clean"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"My new favorite appliance","reviewDate":"July 26, 2019","reviewText":"Absolutely love this product! It is very easy to use and the food cooks fast. Meats are cooked to order and turn out very juicy. The size is perfect for our family of 3 and have left overs for the next day. Would recommend this air fryer to everyone!"},{"reviewerName":"Patricia R. Rogers","rating":"5.0 out of 5 stars","reviewTitle":"This is a HIT!!!!","reviewDate":"July 5, 2019","reviewText":"Air fryers must be big enough to feed several people......and I can cook a whole chicken in this one!! I bought one for me, one for my neighbor and now one for my sister! Don't use my oven anymore!! Love it."},{"reviewerName":"Jennifer Dixon","rating":"5.0 out of 5 stars","reviewTitle":"Great product","reviewDate":"September 16, 2019","reviewText":"Purchased after my deep fryer broke. I was sceptical on air fryers, but I'm really liking it. Makes great fries along with other frozen foods I've tried. Cleans up in a snap, burnt on cheese whips right out. Basket is big enough for everything I've tried so far too. Would recommend it."},{"reviewerName":"Ashley","rating":"5.0 out of 5 stars","reviewTitle":"An amazing product!","reviewDate":"May 5, 2019","reviewText":"I highly Recommend this Cooking Apliance! I've been using this air fryer for a month. I lost five pounds! I'm really happy because the air-fryer only applies a little oil when you make food with it. And it's easy to use. The food is delicious. It's a must for slimmers!"},{"reviewerName":"Crystal","rating":"5.0 out of 5 stars","reviewTitle":"My love","reviewDate":"November 8, 2019","reviewText":"I cook in this more than my stove! I love how everything comes out tasting amazing"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Homemade Faster Food","reviewDate":"September 13, 2019","reviewText":"This is how you get the man in your life to cook! Play with temperature and time a bit to get the perfect crunch and it's wonderful!👍"},{"reviewerName":"Lawrence V.","rating":"4.0 out of 5 stars","reviewTitle":"smoke !!!","reviewDate":"July 10, 2019","reviewText":"Did a whole chicken,the smoke came out after about 10 min..Bad enough to set off smoke detectors in two rooms.I tried the 2tbl spoons of water thing,but did 't help much.Had to open windows and turn on a fan to get rid of the smoke.Any ideas?"},{"reviewerName":"Jenny C.","rating":"5.0 out of 5 stars","reviewTitle":"An excellent kitchen helper for a busy mom","reviewDate":"April 4, 2019","reviewText":"I am totally amazed with this air fryer. The first dish I made was fish sticks. They came out crispy but not burnt. Tasted so yummy.\n\nEasy clean up. The basket cooled down so quickly after done cooking. I wished it in a little hot soapy water with no effort. It’s totally worth it for the size of this machine. I can now host more play dates for daughter. I strongly recommend this product."},{"reviewerName":"Ann Swisher","rating":"5.0 out of 5 stars","reviewTitle":"On the first use, you may smell \"plastic\" but that will subside the more you use it.","reviewDate":"July 16, 2019","reviewText":"Only had it for 2 days. Made spaghetti squash, homemade sweet potato 🍠 fries, and salmon.\nThey were all delicious."},{"reviewerName":"JAIN - USA","rating":"5.0 out of 5 stars","reviewTitle":"Best health fryer","reviewDate":"April 13, 2019","reviewText":"The cooking process is so easy. The cooking book helps a lot in cooking process. The shape and size is great. Can fit a big piece of chunk. Love it."},{"reviewerName":"Tze","rating":"5.0 out of 5 stars","reviewTitle":"Great product!!","reviewDate":"April 1, 2019","reviewText":"Have few recipes and tried it with this fryer, comes out really great! It is delicious just taste just like the food comes out from a deep fryer but this time is air fryer. Love it and recommended!"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Worth to have one at home!","reviewDate":"April 4, 2019","reviewText":"Love this air fryer. After debating on should I have a air fryer since I have double oven at home. I decided to buy one in hopes of being able to fry fries with less oil! It's incredible yum! The first food I cooked in it was chicken wings, 370F 10mins, done! They are sooooo delicious! Recommend to the people who love fried or bake food and also want to eat healthier."},{"reviewerName":"angela gertschitz","rating":"1.0 out of 5 stars","reviewTitle":"broke after 3 uses","reviewDate":"September 21, 2019","reviewText":"Broke after 3 uses, just started turning on and off. Then stopped turning on."},{"reviewerName":"Yihua Dong","rating":"5.0 out of 5 stars","reviewTitle":"Useful air fryer that frys without oil","reviewDate":"April 18, 2019","reviewText":"I like this air fryer a lot. It is very useful. It let children make healthy food since it is not using oil. It is very easy to use."},{"reviewerName":"BattleScarred","rating":"5.0 out of 5 stars","reviewTitle":"Air frying is health WSU to enjoy fried foods!","reviewDate":"June 25, 2019","reviewText":"I own 2 they work awesome and easy to use. Easy to clean and food comes out crispy."},{"reviewerName":"Elaine Sun","rating":"5.0 out of 5 stars","reviewTitle":"easy to use","reviewDate":"May 1, 2019","reviewText":"Air fryer is an amazing invention。my family love the food with the air fryer's cooks。 especially the chicken wings ， it super juicy ， very very delicious！"},{"reviewerName":"Eric C.","rating":"5.0 out of 5 stars","reviewTitle":"Wife loves it","reviewDate":"August 26, 2019","reviewText":"The wife loves it. So I love it. She makes great food in it."},{"reviewerName":"yong","rating":"5.0 out of 5 stars","reviewTitle":"work good!","reviewDate":"June 27, 2019","reviewText":"i bought this fryer for my kids,they like fried food very much.i have been use it couple week,so far already make feench frieds,chicken wings,chicken legs,and fish,all comes cripsy,also make bbq spare ribs,diferent food you can control tempreture and time,easy to use and clean."},{"reviewerName":"Rose J.","rating":"5.0 out of 5 stars","reviewTitle":"Easy to use","reviewDate":"April 23, 2019","reviewText":"This is awesome item. It makes easy to cook, and easy to clean! Strongly recommend it!"},{"reviewerName":"Harold Dancy","rating":"4.0 out of 5 stars","reviewTitle":"Good taste","reviewDate":"July 3, 2019","reviewText":"Easy to use"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Love this air fryer","reviewDate":"July 18, 2019","reviewText":"It's easy to use and everything I've made in it is crispy and done in the middle. The only thing that wasn't good is the perch I tried to fry in it. I probably did something wrong but it's a great fryer and so easy to clean."},{"reviewerName":"TLP","rating":"5.0 out of 5 stars","reviewTitle":"Great Air Fryer","reviewDate":"July 15, 2019","reviewText":"I was skeptical, but this product delivers on what it is made to do."},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"What a great buy?","reviewDate":"April 9, 2019","reviewText":"Well I am glad I purchased this Air Fryer its large enough to hold ten chicken drumsticks or two bags of buffalo wings."},{"reviewerName":"JE","rating":"4.0 out of 5 stars","reviewTitle":"Missing item directions !!!!","reviewDate":"August 16, 2019","reviewText":"This did not come w a Manuel n I am just guessing on what features n settings do. Need this for different users ..."},{"reviewerName":"cynthia","rating":"1.0 out of 5 stars","reviewTitle":"Didn't work.","reviewDate":"July 23, 2019","reviewText":"Did not work. Emailed company & got no reply."},{"reviewerName":"CG Ferregur","rating":"5.0 out of 5 stars","reviewTitle":"Best Air Fryer for the Price!","reviewDate":"April 22, 2019","reviewText":"For the price hands down best value. Huge air fryer and simple to operate. Heats up quickly and cooks very evenly. Also comes with an additional grilling rack and a set of small stainless skewers."},{"reviewerName":"joly","rating":"5.0 out of 5 stars","reviewTitle":"Crispy and never burnt","reviewDate":"July 18, 2019","reviewText":"Was very skeptical but extremely impressed. Kids love the fries made in it and it's perfect for chicken wings."},{"reviewerName":"Arnaldo Gabriel","rating":"1.0 out of 5 stars","reviewTitle":"No recomendable","reviewDate":"July 7, 2019","reviewText":"El artículo llegó defectuoso, ni lo recomiendo."},{"reviewerName":"Nicky","rating":"5.0 out of 5 stars","reviewTitle":"I liked!","reviewDate":"April 16, 2019","reviewText":"This fryer is amazing. It’s big enough for my family. Its easy to use and clean. It’s much healthier to eat without oil. It could keep my kitchen clean."},{"reviewerName":"Sandy","rating":"5.0 out of 5 stars","reviewTitle":"air fryer","reviewDate":"November 6, 2019","reviewText":"great product"},{"reviewerName":"Sandy Chang","rating":"5.0 out of 5 stars","reviewTitle":"Worth the money!","reviewDate":"April 8, 2019","reviewText":"Amazingggg!!! We were skeptical to make this purchase, I could get a turbo oven for less to do the same thing, or so we thought. This fryer cooked some yummy chicken wings in 20 minutes! Juicy on the inside and crispy on the outside! Cant wait to try more recipes this fryer!"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Big fryer","reviewDate":"April 27, 2019","reviewText":"I love this air fryer it’s big just what I wanted, I used mostly every day ❤️"},{"reviewerName":"Netojoy","rating":"5.0 out of 5 stars","reviewTitle":"One Word = Wonderful","reviewDate":"June 8, 2019","reviewText":"So glad I have it. Saves time and money"},{"reviewerName":"Zhen","rating":"5.0 out of 5 stars","reviewTitle":"convenience","reviewDate":"May 5, 2019","reviewText":"I love this air fryer, I never Fried chicken wings and fries at home before I bought it, and I don't waste oil,"},{"reviewerName":"JodiAnn","rating":"5.0 out of 5 stars","reviewTitle":"Love this product!","reviewDate":"July 8, 2019","reviewText":"I was pleasantly surprised with this product. The only complaint I have is the latch is very flimsy, so I have to be mindful of that. Other than that it’s an amazing product. Everything I have cooked turns out perfectly and cleaning this is simple as can be."},{"reviewerName":"theresa zielinski","rating":"5.0 out of 5 stars","reviewTitle":"Easy to use","reviewDate":"July 7, 2019","reviewText":"So many ideas for what to make next and this air fryer is big enough to hold anything and it cooks everything so well!"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Love my air fryer.","reviewDate":"August 2, 2019","reviewText":"Large capacity! can make enough for everyone in one shot/ Nothing beats chicken wings in my air fryer. Can't beat it. Highly recommend."},{"reviewerName":"Robert Hao","rating":"5.0 out of 5 stars","reviewTitle":"Easy to Use and lot of options!","reviewDate":"April 17, 2019","reviewText":"Bought this Air Fryer thanks to my friend's recommendation. I have checked other reviews before I made this purchase. My wife wanted to give it a try and we enjoyed using it so much! It is easy to use and clean, especially to me as a lazy person! Thanks for creating such a good Air Fryer."},{"reviewerName":"sam","rating":"1.0 out of 5 stars","reviewTitle":"Dangerous to Children","reviewDate":"The manufacturer commented on the review below","reviewText":"I give it a zero for poor design\nThe fry basket does not lock into fryer and will come out by pulling the Handle.\nThis is extremely dangerous to children who might pull out fry basket and sustain serious injury."},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Fun to cook with","reviewDate":"July 27, 2019","reviewText":"Air fryer works great and is fun to try new recipes in"},{"reviewerName":"KI","rating":"4.0 out of 5 stars","reviewTitle":"worth money","reviewDate":"July 9, 2019","reviewText":"big and nice but slot not smooth...\nmaybe its because too big..."},{"reviewerName":"Jessica","rating":"5.0 out of 5 stars","reviewTitle":"Very good","reviewDate":"April 9, 2019","reviewText":"This is a great air fryer！6.3 qt is large enough to cook most anything, and easy to operate and does a fantastic job. Cooks in half the time of an oven. I highly recommend it!"},{"reviewerName":"Qisheng yang","rating":"5.0 out of 5 stars","reviewTitle":"Easy to use","reviewDate":"April 23, 2019","reviewText":"I researched for several day and decided on this air fryer.Received a few days before ，The controls are so easy to use。 Very simple to set up temperature and time. Will Recommend friends to buy！"},{"reviewerName":"Adrea Sharp","rating":"5.0 out of 5 stars","reviewTitle":"Love the size and ease of use.","reviewDate":"May 19, 2019","reviewText":"So glad I bought this. It's big and cooks up food to a crisp but yet food remains juicy."},{"reviewerName":"Michael Rasley","rating":"5.0 out of 5 stars","reviewTitle":"Go big or go home.! Buy one smaller and you'll end up with two. You've been warned.","reviewDate":"July 16, 2019","reviewText":"Love this thing! Favorite kitchen utensil!"},{"reviewerName":"Nancita","rating":"5.0 out of 5 stars","reviewTitle":"I’m very happy with this air fryer!!!","reviewDate":"June 21, 2019","reviewText":"I love it! I cook my food in half the time that it takes on the stove or oven. I wish I had bought this sooner! It’s easy to clean and it has a sensor when something is burning."},{"reviewerName":"anozira","rating":"4.0 out of 5 stars","reviewTitle":"working great","reviewDate":"September 10, 2019","reviewText":"cons-0 pros- easy to clean, easy to use and the food comes out tasty. I've had it now for over a month and it's still working great. I use it at least 3 to 4 times a week. As of right now I would recommend this air cooker."},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Way to simple living","reviewDate":"April 16, 2019","reviewText":"In the beginning i was skeptical to get the air fryer , but now I am very please for it , I didn’t add any oil for all the items I cook in it , a better way to healthy eating for me and my family ;). Also love it very Easy to clean."},{"reviewerName":"Cecilia Chan","rating":"5.0 out of 5 stars","reviewTitle":"Great Product!","reviewDate":"April 5, 2019","reviewText":"Love everything about this air fryer. It is easy to use and easy to clean. Food comes out crispy and tasty. I use it every day since I purchased it. Would highly recommend this product to anyone who wants to save time on cooking. Amazing product!"},{"reviewerName":"Cecelia Moyer","rating":"5.0 out of 5 stars","reviewTitle":"I love my Air Fryer!","reviewDate":"October 8, 2019","reviewText":"The Air fryer works great! And the chicken wings I cooked were to die for! It's a must-have!!!"},{"reviewerName":"Derrick Thomas","rating":"5.0 out of 5 stars","reviewTitle":"All Air fryers not good at Fry's but this one is great","reviewDate":"July 5, 2019","reviewText":"I love how easy it is to clean after you used it also so the basket is so big"},{"reviewerName":"Diane","rating":"5.0 out of 5 stars","reviewTitle":"Easy to clean and lots of room","reviewDate":"May 21, 2019","reviewText":"Very easy to clean and pretty easy to use. Made a whole chicken and there was plenty of room. Homemade french fries turn out great! So far we love it!!"},{"reviewerName":"Patrick O'Connell","rating":"5.0 out of 5 stars","reviewTitle":"Love this cooker!","reviewDate":"September 25, 2019","reviewText":"I love this thing. It's about as easy to use and clean as you can imagine. Best chicken wings I've ever made."},{"reviewerName":"matt perez","rating":"5.0 out of 5 stars","reviewTitle":"Thumbs up","reviewDate":"July 10, 2019","reviewText":"Good items I would recommend"},{"reviewerName":"melicky","rating":"4.0 out of 5 stars","reviewTitle":"Love this product!!","reviewDate":"October 18, 2019","reviewText":"I've been waiting forever to finally make this purchase and I am so glad I picked this product! It's PERFECT for our big family!"},{"reviewerName":"blue","rating":"1.0 out of 5 stars","reviewTitle":"Great Product","reviewDate":"September 12, 2019","reviewText":"Very pleased and still learning all I can do with it!"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Amazing Product","reviewDate":"July 12, 2019","reviewText":"great product, my husband loves it!"},{"reviewerName":"Amazon Customer","rating":"1.0 out of 5 stars","reviewTitle":"Absoultley no paper work in box, No manual & no receipe book","reviewDate":"September 9, 2019","reviewText":"can't rate in because I no nothing about how it works"},{"reviewerName":"Debbie Henderson","rating":"4.0 out of 5 stars","reviewTitle":"I love the side and how you can cook alot at one time evenly.","reviewDate":"October 23, 2019","reviewText":"Loved it, just love how it worked. Fried foods and others come out delicious, but at first hard to start it off, but it worked out good."},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"My favorite kitchen gadget","reviewDate":"September 29, 2019","reviewText":"My favorite kitchen item. Can cook a 6 lb whole chicken in this fryer and it only takes an hour! Doesn't heat up our Florida home."},{"reviewerName":"Andrea E. Adams","rating":"3.0 out of 5 stars","reviewTitle":"AIRFRYER","reviewDate":"September 19, 2019","reviewText":"It's great when it works, but sometimes it just shuts off and will not turn back on!"},{"reviewerName":"Nair de Lima","rating":"5.0 out of 5 stars","reviewTitle":"Easy to use","reviewDate":"August 7, 2019","reviewText":"I love this product! It so easy to use, it cooks food so fast, and the food has a real, delicious taste. I really, really recommend this. I love it!!"},{"reviewerName":"JEANNA MOISEYEV","rating":"2.0 out of 5 stars","reviewTitle":"Air fryer compartment","reviewDate":"The manufacturer commented on the review below","reviewText":"The air fryer compartment on this air fryer is very difficult to get it shut. Feels like it is cheap in the manufacturing area. Wouldn’t by again."},{"reviewerName":"Danielle Greenwald","rating":"5.0 out of 5 stars","reviewTitle":"I like it a lot","reviewDate":"September 27, 2019","reviewText":"I love it and it cooks great"},{"reviewerName":"guangtoo","rating":"5.0 out of 5 stars","reviewTitle":"Great capacity, I like it very much.","reviewDate":"March 31, 2019","reviewText":"I really like this air fryer, the capacity is big enough, the appearance is simple, the operation is very convenient, I can often do some food for my children to eat."},{"reviewerName":"Sharon Beard","rating":"1.0 out of 5 stars","reviewTitle":"Dissatisfied","reviewDate":"The manufacturer commented on the review below","reviewText":"This product did not have any details included in how to work the product or a receipt book, like stated. Plus the feature button does not come on like it should."},{"reviewerName":"Selina","rating":"5.0 out of 5 stars","reviewTitle":"Good work","reviewDate":"April 3, 2019","reviewText":"Very practical machine, use when the sound is small, and the space is large. The first use is roast chicken legs, crisp skin taste, fleshy also a lot of juice, a good machine."},{"reviewerName":"Jon","rating":"5.0 out of 5 stars","reviewTitle":"As advertised","reviewDate":"September 10, 2019","reviewText":"Works great"},{"reviewerName":"Yaxijani Hernandez","rating":"5.0 out of 5 stars","reviewTitle":"Great!!!","reviewDate":"October 29, 2019","reviewText":"Great!!"},{"reviewerName":"Amazon Customer","rating":"2.0 out of 5 stars","reviewTitle":"After 7 months it doesn’t works","reviewDate":"June 13, 2019","reviewText":"Lov it. No more oven. No more mess at the kitchen. The problem is that after 7 months the fan that moves the heat doesn’t turn on, so I can’t use it anymore."},{"reviewerName":"Jwal610","rating":"5.0 out of 5 stars","reviewTitle":"Perfect for a family of two.","reviewDate":"July 26, 2019","reviewText":"It grills like a charm."},{"reviewerName":"Mr L","rating":"5.0 out of 5 stars","reviewTitle":"Amazing","reviewDate":"June 12, 2019","reviewText":"Really works well"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Best Air Fryer Ever","reviewDate":"June 23, 2019","reviewText":"I absolutely LOVE this air fryer! I cook everything in it!!!!!"},{"reviewerName":"Ricardo Diaz","rating":"4.0 out of 5 stars","reviewTitle":"Nice","reviewDate":"July 19, 2019","reviewText":"You can cook everything"},{"reviewerName":"Emily","rating":"5.0 out of 5 stars","reviewTitle":"Great","reviewDate":"September 8, 2019","reviewText":"Love my air fryer. We use it multiple times a week. Great size for a family of 6"},{"reviewerName":"brandi","rating":"5.0 out of 5 stars","reviewTitle":"Amazing","reviewDate":"August 3, 2019","reviewText":"Excellent fryer."},{"reviewerName":"Angela McMillan","rating":"5.0 out of 5 stars","reviewTitle":"Love this so much use it every night","reviewDate":"August 7, 2019","reviewText":"By far my fav amazon purchase"},{"reviewerName":"Earl from Springville, NY","rating":"5.0 out of 5 stars","reviewTitle":"Great air fryer for price","reviewDate":"September 2, 2019","reviewText":"Works great. Chicken wings are fantastic"},{"reviewerName":"Amazon Customer","rating":"1.0 out of 5 stars","reviewTitle":"Waste of money!","reviewDate":"September 23, 2019","reviewText":"Stopped working a month after I bought it. Don't buy!"},{"reviewerName":"Boymom","rating":"5.0 out of 5 stars","reviewTitle":"Fantastic and super easy to use and clean!","reviewDate":"September 15, 2019","reviewText":"Love the quality, size and speed of this air fryer!"},{"reviewerName":"Grace Meldon","rating":"5.0 out of 5 stars","reviewTitle":"easy to use","reviewDate":"October 31, 2019","reviewText":"frying without oil"},{"reviewerName":"Amazon Customer","rating":"4.0 out of 5 stars","reviewTitle":"New toy","reviewDate":"September 27, 2019","reviewText":"Love it so far!"},{"reviewerName":"eliza","rating":"5.0 out of 5 stars","reviewTitle":"Love it","reviewDate":"August 22, 2019","reviewText":"Great investment!"},{"reviewerName":"kim D.","rating":"5.0 out of 5 stars","reviewTitle":"It’s so easy to use and healthier","reviewDate":"September 6, 2019","reviewText":"I love mine 😍"},{"reviewerName":"Yuliana H.","rating":"5.0 out of 5 stars","reviewTitle":"Las comidas son muy sanas","reviewDate":"July 29, 2019","reviewText":"Lo mejor"},{"reviewerName":"kddo1","rating":"5.0 out of 5 stars","reviewTitle":"Large and easy to use","reviewDate":"October 16, 2019","reviewText":"Bought it for my granddaughter and she is very enthusiastic about it."},{"reviewerName":"Yaritza Ortiz","rating":"5.0 out of 5 stars","reviewTitle":"best Air Fryer","reviewDate":"May 28, 2019","reviewText":"I bought this Air Fryer for my mom for Mother's Day and I have won favorite child award. She loves it!!! its super easy to clean the food comes out amazing!!! 5 Stars for this product"},{"reviewerName":"Shane","rating":"1.0 out of 5 stars","reviewTitle":"Touchscreen Malfunction","reviewDate":"July 6, 2019","reviewText":"Touchscreen did not work. Going to have to return or exchange unfortunately. I recommend going with another brand. This one also did not keep power and kept shutting off while trying to use the touch screen."},{"reviewerName":"matilde montanez","rating":"5.0 out of 5 stars","reviewTitle":"love it","reviewDate":"April 26, 2019","reviewText":"they have these same air fryer in walmart for 50$ , they work amazing"},{"reviewerName":"Jay","rating":"5.0 out of 5 stars","reviewTitle":"super easy to use!","reviewDate":"May 28, 2019","reviewText":" found this air fryer that is large enough to host a party! it arrives really fast and it is actually bigger than what i expect. before i use it first i use hot water with soup to waste off the chemical that is in the basket to remove the weird stainless steel from the taste, it is so easy to cook food with this, all i did was just throw in the food in the freezer and it only took 20 min to cook, the beep sound might be a bit loud but not really bothering, the food came out great! smells good and krispy outside. Never used an air fryer before but this is super easy for someone who doesn't cook like me. great value!"},{"reviewerName":"michael","rating":"1.0 out of 5 stars","reviewTitle":"Bad plastic smell when being used","reviewDate":"April 17, 2019","reviewText":"I know that with anything heat related you run the risk of the burning plastic smell when using it. With that in mind I took the trays out and washed them hoping it would help. Plug it into the kitchen and run it and BAM! my kitchen smells like a plastic factory. I figure ok let me run this thing a couple times for twenty mins each time full blast 400f. So I put it in my garage and run it I did this for 3 days probably 4x a day and still nothing! I had to actually leave my garage door open for half the afternoon to try and get the smell out. WTF! what causes this smell? I know a google search gives some \"answers\" but it seems that more and more products are smelling like this and it can't be good for whatever your going to be eating. I know the smell might eventually go away but is that a good thing or a bad thing? just because you can't smell it doesn't mean its not being cooked into your food."},{"reviewerName":"Deluco","rating":"5.0 out of 5 stars","reviewTitle":"Large Air Fryer","reviewDate":"March 24, 2019","reviewText":"First I want to say, when I first open the box, I was very impressed with how nice this air fryer looks. It's a very nice size. The cooking basket is large, and it looks like it will hold a large amount of food. The air fryer came with a instruction manual in a very nice recipe book. Today I decided to start small and I made the grilled cheese which is in the recipe book. Well, it was the best grilled cheese I ever ate. I love my new air fryer."},{"reviewerName":"Bryan B","rating":"5.0 out of 5 stars","reviewTitle":"Big Size Means More Options to Cook!","reviewDate":"April 15, 2019","reviewText":"This cooker is huge! My wife bought a different air fryer that was on sale at a local store, but I told her that we can get something bigger at Amazon for a better deal. The one she bought was small, so food choices are limited. She was really impressed after I bought this Innsky air fryer cooker. I have included a picture so you can see the difference in size. It's definitely bigger, so we can cook more food! By the way, it comes with a recipe book too if you need any ideas, as well as a rack and skewers (to cook kabobs, for example). It was very easy to use and clean up. I tried to make my own waffle fries for the kids to snack on and they turned out great! The kids loved it. I would recommend this air fryer if you are looking for something with a bigger capacity."},{"reviewerName":"Aquaria","rating":"5.0 out of 5 stars","reviewTitle":"We've been using it since the day we got it from the mailbox.","reviewDate":"November 9, 2019","reviewText":"We had a small air fryer for smaller servings of things like onion rings, sweet potato fries, salmon burgers (which we use more like salmon fritters), and steaks. That was fine when I was making my steak and onion rings lunch, but not so great for when we needed to cook for my husband, too. We needed a larger fryer to handle meals for the two of us at once. I wanted to try roasting a chicken in the air fryer, to see how that would turn out. It was the first thing we tried once we got the Innsky cleaned and set up on the counter. The chicken turned out perfect--succulent moistness, with just enough browning of the skin to make it crispy. Two big steaks? No problem! Toss your steaks into a skillet set at hellfire, flip to char the other side, put them on a grill accessory thingie that we bought separately and two minutes a side later, perfectly medium rare steaks. We reheated leftover coconut shrimp after that, and yum! Turned out perfect, no rubbery breading from a microwave, no overheating our house from turning on the conventional oven or using the stove to reheat.\n\nIf you like to cook bigger meals in your fryer, this is definitely a good option. HUGE capacity, enough to cook a whole chicken (up to around 5 pounds), pot roast, personal pizzas, the aforementioned basket of coconut shrimp (around 15?), meat loaf (I have some old mini loaf pans that are deeper than the modern stuff--perfect for the air fryer!), small casseroles, and more, then this is the air fryer for you.\n\nWe made room on our utility room shelf to store it when we weren't using it, but it's never been out of use long enough to go there. We probably use it 3 times a week, and it holds up great, cleans up easy. I handwash the basket thingies, and there is a bit of a learning curve with getting around the slots on the sides of the inner basket. Once you get the hang of it, though, it wipes down fast and dries fast, too.\n\nI recommend getting an accessory set to extend the uses you can get out of this air fryer, and open up more possibilities for what to do with it. I use a cake pan from the set I got as a small casserole pan for the husband and me. It makes the right amount for the two of us, with just enough extra for leftovers that we can both have for lunch the next day."},{"reviewerName":"Sarit","rating":"4.0 out of 5 stars","reviewTitle":"Large air fryer","reviewDate":"April 4, 2019","reviewText":"I have been wanting to purchase an air fryer for the longest time but didn’t know if the price was worth it. I wanted to use it to make my kids freshly made chicken strips, French fries, and veggies. This is a much healthier option than pan frying and I’m so happy that I took the plunge and ordered it. Much cheaper than the other ones I saw in the store. Quality is just the same as those much more expensive ones. I’m happy with my purchase and excited to make more things in it. It is larger in size, but that means you have more space to air fry food. Has a larger capacity to cook food too."},{"reviewerName":"paula","rating":"5.0 out of 5 stars","reviewTitle":"It is one of the most worthwhile things I have bought in a while.","reviewDate":"April 6, 2019","reviewText":" I finally decided to get an air fryer. This Innsky Air Fryer is large 6qt capacity and shaped like a big high tech egg. I made fries, chicken breast, fish, jumbo shrimp, beacon...The time and temperature settings on the menu are very accurate. Without adjust anything, they all came out beautiful crispy outside and fresh tender inside! It was better than anything we have made with frying pan. The clean up is extremely easy with sponge and soup.\n\nI will put more update after using for awhile if there are anything new."},{"reviewerName":"Jyenc","rating":"5.0 out of 5 stars","reviewTitle":"Pretty good kitchen gadget","reviewDate":"March 31, 2019","reviewText":"I love the concept of air fryer. Had bough one xmas that was too small for family of 4. So i got a bigger one. I usually brush with my food with some olive oil to get more frying effect. So its not oil free but at least i am not deep frying it with tons of oil.\n\nLove the removable tray for easy cleaning and serving.\nDigital panel for accurate temp. My old one is a nob i can never set exactly 350 degrees, but its only in increment of 10 degrees.\nComes with a rack and mini skewer stick perfect for smaller item.\nFits a 8” pizza no problem.\nMany preset button so its a good guide for beginner chef.\n\nSo far performs well, no complains."},{"reviewerName":"maomao","rating":"5.0 out of 5 stars","reviewTitle":"The price is a steal！","reviewDate":"April 5, 2019","reviewText":"The price is a steal. The appliance itself is beautiful. Fits perfectly on your counter top and matches any kitchen scheme. Its self explantory and easy to use! I tested almost everything within moments I got it. Fries, nuggets & raw seasoned chicken! My famous broiled chicken no longer needs to go in the oven! This quart fit all 5 pieces of chicken breast in there!! I flipped a few times for even cooking but its like a mini oven. Eating healthy is hard and this makes me so happy. I dont have to sacrifice my fav foods. A lot of chicken! Seasoned w/ pepper & cajun. No oil added or anything special."},{"reviewerName":".","rating":"5.0 out of 5 stars","reviewTitle":"Never use too much oil again!","reviewDate":"April 10, 2019","reviewText":"I decided to get this air fryer because I wanted a bigger one than the 4 qt one that I have (it has now been passed on to my daughter who fell in love with my smaller one). This new one has worked perfectly well for me and actually cooks faster than the smaller one. I like that it came with a couple of extras and a recipe book so if you are a newbie, you will have different dishes you can make in it. I use it mostly for cooking chicken and fries and when reheating fried foods in it, they come out like it they had just been fried. Great investment!!!"},{"reviewerName":"Brandi Ryman","rating":"1.0 out of 5 stars","reviewTitle":"Major malfunction","reviewDate":"August 14, 2019","reviewText":"I was super excited when I first received the air fryer. It was much bigger than my last one. I liked the set up of it. When I first started using it it cooked quickly and perfectly, except that it smelled like burnt plastic. I summed that up to it being new. The burnt plastic smell continued after numerous washes and I even checked multiple times to make sure I got all the plastic off of it when I originally opened it. The plastic smell never went away. Then after about 10 uses it started cutting off on certain settings every minute. Then the timer would not move, it would say cooking for 10 min for 8 minutes then it would move to 9 min...so on...I would have to turn it off reset it and start over. Now it gets super hot (too hot) and is obviously shorting out every 10 seconds or so. Very disappointed. I love air fryer cooking yo definitely don't reccomend this brand. Unfortunately I think I am past the return time."},{"reviewerName":"imaltai","rating":"3.0 out of 5 stars","reviewTitle":"preset is bad","reviewDate":"The manufacturer commented on the review below","reviewText":"I post a photo to let you see the actual size of this air fryer, its very easy to use for a beginner like me, and its so powerful, I set temperature too high to then burn my fries :)\n\nupdate: be careful on the preset, I then realized that the preset burned my fries actually."},{"reviewerName":"Jenny","rating":"5.0 out of 5 stars","reviewTitle":"ｉlike this so much！","reviewDate":"June 14, 2019","reviewText":"I knew for the first time that fried food can be like this. I don’t need oil, no fire. I bought this air fryer because I went to my brother’s house last month to see that he was using it. I felt very unbelievable. I saw it very heartily and directly at his house. I bought it online. It’s really convenient. I have children in my family who like fried food. So this fryer is very practical for me. With this fryer, I’m not afraid of being splashed by oil. I won’t have anything to fry at home. After the fumes, it is also very clean afterwards, it is really easy to use, if you want to buy, I suggest you buy this!"},{"reviewerName":"Olivia","rating":"5.0 out of 5 stars","reviewTitle":"Easy to use and easy to clean","reviewDate":"April 10, 2019","reviewText":"Prior to purchasing,I’ve always been worried about the products.How could I fry foods without oil? Purchasing the air fryer is probably the best decision I made recently.You can literally use it to fry anything ribs,steaks,cake,etc.If the food doesn’t have fat, spray a little oil on the food. It literally came out the same as using a real deep frying pan.And most amazingly,no grease in your kitchen.This frier was non-stick which makes the washing much easier than thoes silver aluminum pots.The only concern was you might not be able to use dishwasher.(FYI-I have not read the user manual yet.It didn’t look machine washable.) Last,My friend bought a smaller one (4L).Highly recommend this one with large capacity. You don’t want to repeat the same steps every time because you got a smaller air frier."},{"reviewerName":"Jackie Bull","rating":"5.0 out of 5 stars","reviewTitle":"Incredible customer service","reviewDate":"May 6, 2019","reviewText":"Initially had a problem with first air fryer and this company provided outstanding customer service and provided a replacement immediately! I love this air fryer. It cooks more evenly than my previous one and food comes out cooked to perfection. I love how easy it is to clean. I also love that it had an incredible 18 month warranty! Thanks again Innsky for your incredible customer service!"},{"reviewerName":"Feya","rating":"5.0 out of 5 stars","reviewTitle":"Good quality","reviewDate":"May 5, 2019","reviewText":"I have been thinking to get a air fryer for a while, and I did research on some name brands product for a while. Most of them are quite expensive (more than $200) so Until I visited my friend few weeks ago. She bought this last year and used it really often. The day I visited her family, she cooked some delicious chicken by using this air fryer- I saw she used it, And how food came out. It tasted so good and the cooking process was so easy. I immediately asked her for the link and bought this! I have used it once so far and it was easy to set up, clean!"},{"reviewerName":"Lucinda","rating":"5.0 out of 5 stars","reviewTitle":"Making yummy food easier","reviewDate":"April 12, 2019","reviewText":"First time to buy air fryer and figure it out cooking is so easy. Just power on and the displaying menu to show the items to be cooked. Easy to setup temperature and time. Safety is most important, and it makes me comfortable to cook something I was not good at it. I can make BBQ spareribs and yummy food easier. It is easy to clean also. Large capacity can provide big family yummy food. I don’t need to stand to wait for food preparation when I use this air fryer."},{"reviewerName":"L.Y.","rating":"5.0 out of 5 stars","reviewTitle":"So Health and Great","reviewDate":"June 9, 2019","reviewText":"I should bought this long time ago. Every eat to use, especially I also bought a chart which tells me the temperature and time I need for all kind of food. I personally love the sweet potato french fries. With 6.3 QT, it is big enough to feed my family. It can dish washer clean. With the LCD touch screen, make it very easy to use. Plus they offer 18 months warranty, it will never go wrong with buying this, if you need it. Highly recommended."},{"reviewerName":"Mr. Jake Soffalot ˿","rating":"5.0 out of 5 stars","reviewTitle":"Mind Blown","reviewDate":"April 1, 2019","reviewText":"I'm really amazed how this product works. I saw a gordon ramsay video of him using an air fryer to make turkey sliders. I followed his recipe to the tea. Oh boy, first off, Gordon Ramsay is the man! Second, the sliders were amazing! It has that juiciness and exploding flavor in every bite. I'd use this any day over an oven or stove-top. And with the holidays around the corner, I can't wait to use this machine an impress my guest with my cooking!"},{"reviewerName":"AngelicaMoya","rating":"1.0 out of 5 stars","reviewTitle":"It didn’t work!!!!","reviewDate":"The manufacturer commented on the review below","reviewText":" I was so excited about this product but it came in a bad shape! The case didn’t match the big part of the machine so all the vapor was going out... I decided to try it anyway since I was really looking forward for that but after 10 min my electricity went out because of this air fryer... so definitely I am not buying it again :("},{"reviewerName":"Steve heiser","rating":"5.0 out of 5 stars","reviewTitle":"Great product","reviewDate":"July 26, 2019","reviewText":"This is a great product has a large basket easy to use for air frying don't get anything smaller than a 6.3QT there is hardly any difference in price or size but the basket that you put the food in is the difference it's large say you want to cook a large chicken the 6.3 will handle this but some of the smaller fryers won't this is a great airfryer."},{"reviewerName":"qiu e zheng","rating":"5.0 out of 5 stars","reviewTitle":"Good air fryer","reviewDate":"April 11, 2019","reviewText":"This air fryer is very easy to use. I follow the instructions in the recipe book and it tastes very good. I marinated the steak and chicken before I put in the fryer and it taste delicious. Also very easy to clean."},{"reviewerName":"Kim","rating":"4.0 out of 5 stars","reviewTitle":"So far, so good.","reviewDate":"August 2, 2019","reviewText":"Very big, takes up a good chunk of counter space. Works as it should. I have only made chicken breast in it twice so far, but plan on trying other things soon."},{"reviewerName":"C.P","rating":"1.0 out of 5 stars","reviewTitle":"WARNING BEWARE, DO NOT BUY!","reviewDate":"The manufacturer commented on the review below","reviewText":"First try with the unit and our kitchen went in flames. Air Fryer started smoking and went in flames within seconds during first used.\nWe are still coping, managing and dealing with aftermath caused by the defective unit."},{"reviewerName":"Amy","rating":"5.0 out of 5 stars","reviewTitle":"Easy to use and easy to clean！","reviewDate":"April 14, 2019","reviewText":"I bought a 6.3 quart air fryer a weeks ago. It is now my new favorite toy .They cook almost everything in it. I made pork chops the first night and they turned out great. It takes a little time getting used to a different way to cook, but it's as simple as it gets. You can pull out the basket and check on your food anytime you want. I was skeptical when my friends told me I had to buy one, but the air fryer has exceeded my expectations."},{"reviewerName":"Olivia","rating":"5.0 out of 5 stars","reviewTitle":"I absolutely love it.","reviewDate":"June 19, 2019","reviewText":"This is my first air fryer. I bought this one because of size. I wanted one for trial before I committed to a bigger one. I absolutely love it. I have no issues with the handle or plastic chipping like many previous reviews stated. We use this for quick snacks and definitely wings. This is a good purchase."},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Who knew","reviewDate":"July 6, 2019","reviewText":"Who knew I would love an appliance so much! Easy to use and great size. You won’t regret"},{"reviewerName":"Alina","rating":"5.0 out of 5 stars","reviewTitle":"This air fryer has a very large capacity, enabling cooking for multiple people","reviewDate":"April 2, 2019","reviewText":"This air fryer has an excellent capacity and is useful for cooking for a lot of people. I used this once to cook up a bunch of food for a party and no one even noticed that I just heated it up in an air fryer. I also use it at home every so often in order to make French fries or to cook chicken."},{"reviewerName":"paol lin","rating":"5.0 out of 5 stars","reviewTitle":"amazon","reviewDate":"April 17, 2019","reviewText":"Buy this air fryer for the first time. I used to use oil pans. I often fry food at home. The smoke in the house is very strong. Not good for children at home. I use this air fryer these days. High security. Set the time without waiting. The taste is good. I like it very much."},{"reviewerName":"Peggy Paul","rating":"5.0 out of 5 stars","reviewTitle":"Cooking, reheating and lots more","reviewDate":"August 11, 2019","reviewText":"My first one and I really like it. Easy to use. Fits under my cabinets perfectly.\nGreat for cooking without grease. Also, nothing better for reheating pizza, fried fish and items previously done in the microwave."},{"reviewerName":"Purewealth","rating":"5.0 out of 5 stars","reviewTitle":"Made well no smell of plastic when cooking, and very quite.","reviewDate":"April 25, 2019","reviewText":"Except for receiving air fryer late in delivery. I have in the two days made pounded down chicken breast with herb and garlic bread crumbs, and sweet potatoes fries. They both turned out awesome, the size is wonderful also for two people."},{"reviewerName":"Mackenzie","rating":"5.0 out of 5 stars","reviewTitle":"Useful","reviewDate":"March 29, 2019","reviewText":"Bought this air fryer to replace my old one. My old air fryer is much smaller and can’t fit a lot of food. It’s really easy to operant and has a lot of space to put food in. It’s easy to wash and the parts and be taken apart for easy cleaning. It can also cook without oil. Highly recommend getting this."},{"reviewerName":"Lidia Suarez","rating":"5.0 out of 5 stars","reviewTitle":"Dinner made easy","reviewDate":"April 8, 2019","reviewText":"It’s an awesome air fryer. Good size for a family of 4, easy to use with all the buttons labels for a specific food. Requires little or no oil at all. So it’s not greasy if you like fried food. Dinner made easy."},{"reviewerName":"Be yourself - Just do it","rating":"5.0 out of 5 stars","reviewTitle":"Healthy air fryer.","reviewDate":"April 2, 2019","reviewText":"I ate a lot of foods that fried with oil. Im getting way too fat. Even i used Olive oil to cook but still unhealthy. So i decide to buy this air fryer. Easy to use. This air fryer may change the way that eat."},{"reviewerName":"NubianAmazon","rating":"5.0 out of 5 stars","reviewTitle":"No regret","reviewDate":"April 13, 2019","reviewText":"No regret in getting this air fryer, it’s really great. My fries, and chicken came out as crispy as they would have in a deep fryer plus it’s healthy, you use little to no oil. I’d recommend it to anyone."},{"reviewerName":"Brandon","rating":"5.0 out of 5 stars","reviewTitle":"Just Amazing!","reviewDate":"March 28, 2019","reviewText":"This air dryer is awesome. It works fast and you can literally fry anything. Makes great tasting food without the added fats from using oil. This thing is the best addition to our kitchen!!"},{"reviewerName":"Benjamin Chen","rating":"5.0 out of 5 stars","reviewTitle":"Healthy and taste good!","reviewDate":"April 17, 2019","reviewText":"This is great frying machine! I put 360 degree for 25mins and the result is awesome! It’s crispy outside and tender inside. It’s very healthy too because doesn’t use much oil."},{"reviewerName":"jingle","rating":"5.0 out of 5 stars","reviewTitle":"good basic Air Fryer","reviewDate":"April 16, 2019","reviewText":"I have got this air fryer for about two weeks. It works great so far. There is a little bit plastic smell the first few times of use. But after 5-7 usages the taste was gone."},{"reviewerName":"Megan","rating":"5.0 out of 5 stars","reviewTitle":"Deben comorarla","reviewDate":"May 5, 2019","reviewText":"Es magnífica! Se las recomiendo! Debes ir manejando el tiempo porque de puede quemar si lo pones muy alto pero esta divino. Hice pollo y papas rojas son nada de grasa"},{"reviewerName":"Gzbuzz","rating":"5.0 out of 5 stars","reviewTitle":"Awesome product","reviewDate":"April 17, 2019","reviewText":"I am enjoying quicker cooking times, less oil, the taste is better than frying. it has nice control panel,easy to operate, everything has been great!"},{"reviewerName":"Marcus","rating":"5.0 out of 5 stars","reviewTitle":"Easy to use and delicious","reviewDate":"June 14, 2019","reviewText":"Very easy to use. Food is super delicious! It’s healthier than fried food, and more tasty.\nLoving it.\nCleaning is pretty simple too."},{"reviewerName":"G. Burch","rating":"2.0 out of 5 stars","reviewTitle":"Plastic taste","reviewDate":"The manufacturer commented on the review below","reviewText":"I do not like this air fryer. I have cooked several items but everything has had a plastic taste. I washed the basket and the part that holds the basket in hot soapy water several times but it doesn't help. It is also a lot bigger than I realized. So be prepared to make extra space on your counter."},{"reviewerName":"Hannah","rating":"5.0 out of 5 stars","reviewTitle":"easy to clean","reviewDate":"April 15, 2019","reviewText":"I have used it many times. This air fryer has a large capacity. I like it very much, and it is very suitable for home use. It is not as oily as it is fried in an air fryer, it will be healthier, and the cleaning is simple and the quality is very good."},{"reviewerName":"nolan","rating":"5.0 out of 5 stars","reviewTitle":"So needed","reviewDate":"March 28, 2019","reviewText":"now making breakfast it’s so easy in the morning. I use it ever day to heat frozen foods and to fry or grill. They came out better than I expected"},{"reviewerName":"Jeanne","rating":"4.0 out of 5 stars","reviewTitle":"Instructions","reviewDate":"July 9, 2019","reviewText":"Instructions were not clear . Had to u tube to find out how to preheat and actually use it"},{"reviewerName":"OQ","rating":"5.0 out of 5 stars","reviewTitle":"love it","reviewDate":"June 26, 2019","reviewText":"the food taste so good and fresh i was so surprised and i can't believe i waited so long to get one"},{"reviewerName":"Nicky","rating":"5.0 out of 5 stars","reviewTitle":"valuable","reviewDate":"April 16, 2019","reviewText":"This is much better than what I expect. its bigger than what I thought. I see a lot of possibility for my dishes now"},{"reviewerName":"Jeanene J Mitchell","rating":"5.0 out of 5 stars","reviewTitle":"Great product","reviewDate":"August 22, 2019","reviewText":"Love the ease of air frying. Easy to use, clean and store on counter top."},{"reviewerName":"Randy G.","rating":"5.0 out of 5 stars","reviewTitle":"It’s good to have a barbecue in the yard.","reviewDate":"September 5, 2019","reviewText":"The skewer tool is especially suitable for cooking.Highest fire for 12 minutes"},{"reviewerName":"Gloria","rating":"5.0 out of 5 stars","reviewTitle":"It’s so useful","reviewDate":"April 11, 2019","reviewText":"It’s easy to use and big enough! Good helper for cooking. It makes cooking happier."},{"reviewerName":"p.haynes","rating":"4.0 out of 5 stars","reviewTitle":"It smokes. Kept setting off the fire alarm when I was cooking the chicken.","reviewDate":"July 11, 2019","reviewText":"Pot roast came out uncooked even though I followed instructions"},{"reviewerName":"Your avg person","rating":"5.0 out of 5 stars","reviewTitle":"Reliable and Easy to use","reviewDate":"April 26, 2019","reviewText":"I use this to food prep for work for the week and its been a breeze to use. Highly recommend it if you are in the market for something that is easy to clean and a no brainer to use."},{"reviewerName":"patricia arft","rating":"5.0 out of 5 stars","reviewTitle":"Love it","reviewDate":"June 19, 2019","reviewText":"Definitely cooks fast and easy to clean"},{"reviewerName":"Amazed","rating":"5.0 out of 5 stars","reviewTitle":"Great Air Fryer","reviewDate":"June 20, 2019","reviewText":"Innsky Air Fryer is awesome. You will love it."},{"reviewerName":"bevinnc","rating":"1.0 out of 5 stars","reviewTitle":"Very big.","reviewDate":"August 19, 2019","reviewText":"Way too big. Sent it back."},{"reviewerName":"Albee","rating":"5.0 out of 5 stars","reviewTitle":"value formoney","reviewDate":"April 3, 2019","reviewText":"good price..save time and easy to clean..."},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Easy to use!","reviewDate":"April 26, 2019","reviewText":"I love this air fryer and have used it about every day since I got it."},{"reviewerName":"purplestampingirl","rating":"5.0 out of 5 stars","reviewTitle":"Great size!","reviewDate":"September 25, 2019","reviewText":"Absolutely love this air fryer! I use it almost every day now."},{"reviewerName":"Shelia","rating":"5.0 out of 5 stars","reviewTitle":"Easy to use and clean","reviewDate":"April 14, 2019","reviewText":"Easy to use and clean, makes it all crispy. I love it!"},{"reviewerName":"E m","rating":"5.0 out of 5 stars","reviewTitle":"Holds a lot of food!","reviewDate":"September 4, 2019","reviewText":"Love it!"},{"reviewerName":"Rachel Higgins","rating":"5.0 out of 5 stars","reviewTitle":"Great air fryer","reviewDate":"June 13, 2019","reviewText":"This is a really great fryer"},{"reviewerName":"danny","rating":"5.0 out of 5 stars","reviewTitle":"Good bles","reviewDate":"August 27, 2019","reviewText":"Exelent."},{"reviewerName":"D. Stoddard","rating":"4.0 out of 5 stars","reviewTitle":"Not sure about Air fryer","reviewDate":"April 28, 2019","reviewText":"It works great but the unit is plastic and while I have no complaint about plastic smell, it seems light and for the money I would of thought it would have been more solid. I have tried french frys, both from frozen packaged and just taking a potato and cutting into fries and air frying. The packaged fries seem more like french fries and the cut up potato more like baked potato. It is good, I still need to find through experimentation what works good as far as foods in it. And the oil is not there, but neither is the flavor. How to get the salt to stick to the fries after cooking, just put it in the ketchup. It is easy just set and go play a computer game and come back to eat. Clean up is easy, just rinse and perhaps some soap. It is fairly quiet, and shuts off if I am busy. It is a good sized item on the counter top, so my wifes bread machine which is rarely used is going into storage. The user manual is ok, some things are left to your imagination, but not complex in understanding. I will be trying some vegetables next, like Brussels sprouts, carrots, and onion. It is more a convenience thing than a flavor enhancer, I would think. It is like cooking with a hair dryer. If my initial comments seem so so, I will update comments should I see it more clearly as I perform more experiments in using the thing.\nUpdate: cooking foods like veggies, you need to use foil to keep it from drying out. I should just follow the recipe book, but where is the fun in that?"},{"reviewerName":"MzJhaé","rating":"5.0 out of 5 stars","reviewTitle":"Should have gotten one sooner!","reviewDate":"May 19, 2019","reviewText":"I love it! Quick, Easy, Less Mess."},{"reviewerName":"Courtney Onsager","rating":"5.0 out of 5 stars","reviewTitle":"Game changer","reviewDate":"July 7, 2019","reviewText":"Use it all the time."},{"reviewerName":"Sara","rating":"5.0 out of 5 stars","reviewTitle":"Must buy!","reviewDate":"November 10, 2019","reviewText":"I use this Night for dinner I wish I had bought it sooner."}],"qAndA":[{"question":"How long does it take to cook a steak?","answer":"Preheat the Airfryer to 400°F. Pat steak dry with a paper towel. Add\nthe steak to the cooking basket and cook for 8-10 minutes for mediumrare."},{"question":"Just wondering is the inner pan easy to clean?","answer":"Yes it is easy to clean."},{"question":"So do I use it like regular oven temp and what temp and how long for chicken wings","answer":"Preheat the airfryer to 350°F.Set the timer to 10-12 minutes and roast the chicken wings until they are crispy brown."},{"question":"Can it’s work in 220V?","answer":"No, it can't it suit for 110V-120V."},{"question":"Can you just throw hot wings in there stacked up or do you need to spread them out?","answer":"It is better to spread them out so the heat will distributed evenly during cook."},{"question":"What is the basket made of?","answer":"It’s a teflon coated metal basket is my guess. Definitely Teflon..nothing stuck on ours yet."},{"question":"How many lbs of chicken wings can fit here or pieces?","answer":"I was able to fit 12 chicken wings."},{"question":"What does E1 mean?","answer":"Read the manual."},{"question":"What makes the newer model better?","answer":"sure"},{"question":"Is this air fryer quiet?","answer":"Yes it's not bad noise wise"},{"question":"Is this 3D circulation?","answer":"Do you mean 360° hot air circulation? The air fryer cooks food by 360° circulating hot air."},{"question":"Hello how well is this product working for you?","answer":"I returned the product! No instruction booklet was included with the product and I felt it was not my place as the consumer to download a booklet!"},{"question":"Why does it smell like burnt plastic?","answer":"Don't know mine doesn't. Check to see no packing material was all removed?"},{"question":"What size whole chicken can the fryer hold?","answer":"I bought this air fryer for my mom and look at the inside holder and its not that deep to fit a large whole chicken but it would fit a small one"},{"question":"Which is better and the best? corsori air fryer or insky 6.3qt xl air fryer?","answer":"we are produced in the same factory, so we think we are the better choice, lower price but the same quality"},{"question":"Is there a grill grate for this fryer?","answer":"It doesn’t come with it. There may be 1 to purchase. All that comes extra is that small little rack you see pictured."},{"question":"When I use this, the timer does not change for the first few minutes until it beeps 3 times; then the timer starts. Is it preheating itself?","answer":"yes mine is same\nI didnt put staff until the timer start"},{"question":"How it works ? I am compairing this brand with another, their 6.3qt fryer look so similar with almost same price.?","answer":"I DID NOT LIKE THE PRODUCT AT ALL AND SENT IT BACK"},{"question":"How do we pick food item on menu?","answer":"Tap menu, tap again & it will advance to next item, each tap advances to next item on menu."},{"question":"es compatible a 220v?","answer":"No, dear, it compatible with 110V-120v ."},{"question":"Are there accessories for this fryer?","answer":"Yes, it has a grilling rack included, it will increase your cook space ,"},{"question":"How many pieces of chicken will this hold?","answer":"Have cooked ten chicken tenders. Really awesome. Love this air fryer"},{"question":"Can someone give me the dimensions of the basket?","answer":"It holds 6 boneless pork chops. It’s twice the size of the smaller ones."},{"question":"Is it pfoa free?","answer":"I don't know what you mean sorry"},{"question":"does it cook on both sides ? or do i have to flip the food to allow it to cook on the opposite side.?","answer":"It does cook on both sides but I always flip the food anyway.....buying this airfryer was one of the best decisions we ever made...we use it almost daily....cleanup is a breeze"},{"question":"Where is this item made?","answer":"China"},{"question":"How many chicken legs can be cooked at one time?","answer":"it depends on the size of the chicken, you can see in the review, you can cook about seven chicken legs at one time"},{"question":"Does it come with a user manual?","answer":"Yrd"},{"question":"can you fit a med size house cat in it?","answer":"eh, I think it can, but why a cat?"},{"question":"Hello everyone, can you cook asparagus in this bad boy?","answer":"Yes!"},{"question":"How long does it take to preheat?","answer":"Please refer to the instruction manual."},{"question":"Can it bake bread?","answer":"Yes, it can, it has a receipe book included, it will teach you how to make bread."},{"question":"How do i get a replacement basket for the 6.3qt fryer that have the plastic tab that press the safety switch and allow the fryer to operate?","answer":"dear, you can contact with us, we have free basket provided, tell us your address, we can ship to you directly."},{"question":"also do I have to shave the house cat or can I cook it as is?","answer":"Cook as is"},{"question":"Can you cook johnsonville brats in this airfryer?","answer":"Yes, you can, let you eat delicious johnsonville brats with less oil."},{"question":"When does the burnt plastic smell go away? The food has a bad taste and smells like burnt plastic.","answer":"Hmmm. We did not have that issue. Maybe yours is effected?"},{"question":"What is the diameter of the led screen?","answer":"About 4inches"},{"question":"I am using this for the first time, setting it for 390 degrees for 14 minutes. It's cooking, but the timer is not counting down; is this normal?","answer":"The product pre heats and beeps when ready add food then and it will start counting down."},{"question":"Can you fry eggs and pancakes on it?","answer":"if you follow instructions,and use heat safe plates."},{"question":"What is the inner pan's dimensions? Diameter.","answer":"Hi , the diameter is 29cm and the hight is 15cm"},{"question":"is it possible to place a probe thermometer in the food while its cooking, or would that disrupt the the seal while its cooking ?","answer":"Some foods require turning and When you open it it continues the time and temp. You don’t have to reset it."},{"question":"I just got this innsky 6.2 qt. air fryer and the pan is really hard to open and close completely, I'm afraid it will break if forced. Any suggestions","answer":"The first couple of times I felt the same way but then you will realize as I did you need to use a little force to slide it in and almost tilt it up slightly as you're doing it. Once I started doing that I had no issues."},{"question":"Is this bph free?","answer":"I think so"},{"question":"tiene apagado automatico?","answer":"Super buena la recomiendo es maravilloso si se apaga sola"},{"question":"How many servings of fries can you cook at one time, realistically?","answer":"A lot fill it up and they all cook. Its like magic lol."},{"question":"Is it fda approved?","answer":"I dont understand the question. It is approved for use in the US. It has a UL approval."},{"question":"What is the voltage and how many kilowatts is it?","answer":"110-120 volt"},{"question":"What's their warranty ?","answer":"We offer 18 month warranty, and if you register on our website, you will get another 3 month warranty. and we also provide lifetime aftersale instruction,"},{"question":"Can a whole chicken be cooked?","answer":"Yes, it can,the diameter of the basket is 295mm, the hight is 15cm,it can cook a whole chicken"},{"question":"Are the trays teflon?","answer":"I love it"},{"question":"How do i unlock the basket to remove on model#55pa 1us -air fryer","answer":"Right above the handle there is a little square, (not the clear one) there is a black square, press that to release the basket."},{"question":"I used this to roast a chicken and my entire kitchen filled with smoke. Does this happen every time and with all foods.","answer":"Hi Jackie, when the food hasn't been unfrozen before putting into the air fryer, it may have water vapor that like smoke, have you unfrozen the chicken before cooking? And if so, you can contact us and send me a photo , we will help you find the reason and help you solve. our e-mail is service@innsky.co"}]}