{"title":"Caynel 12.5 Quart Digital Air Fryer with Rotisserie, Dehydrator, Convection Oven, 8 Presets to Air Fry, Roast, Dehydrate, Bake & More, Glass Viewing Window, Accessory Kit and Recipe Book Included, Large Capacity, 1700W","manufacturer":"CAYNEL","currentPrice":"$129.99","rating":"4.1 out of 5 stars","totalRatings":"44 ratings","features":["\n         Make sure this fits\n                by entering your model number.\n        \n","VERSATILITY: The Caynel Multi-Functional Air Fryer handles any cooking, baking, rotisserie, dehydrating or air frying task. It is a all-in-one Multi-Cooker that replaces a toaster and convection oven, deep fryer, rotisserie oven, dehydrator oven & microwave. You will get maximum versatility to make many of your favorite recipes— no oil, butter, or lard required.","EFFICIENCY: It features high performance Rapid Air Technology that makes food crispy and evenly cooked every time without unwanted fats and oils. 1700 watt stainless steel heating element and 360°air rotation ensures efficient heat up and uniform texture. Express Heat System cooks food up to 30% faster than an oven.","FAMILY-SIZED: With a 12.5 Qt total oven and 5 lb. max capacity allows you to make plenty of food so you can make enough food for the whole family, without having to heat up your oven! 3 rack levels allow you to prepare family-sized quantities and you can cook different foods at once like meat and vegetables.","CONVENIENT ACCESSORIES: Comes with 6 accessories: removable rack, rotisserie basket, rotisserie spit, skewer rotisserie, drip tray and retrieval tool. Everything will be perfect match to make a homemade meal with ease. Removable drip tray and dishwasher safe parts make cleaning a breeze. Your purchase includes a recipe book specifically made for the Caynel Air Fryer. Oven glove will be given as an extra bonus.","EASY-TO-USE: 8 in 1 programmed cooking settings with LED touch screen enables healthier oil-less recipes. Manual time and temperature controls of up to 60 minutes and 400°F. Interior lighting allows you to easily watch your food as it cooks. ETL approved with advanced safety technology for long lasting durability, 3-year warranty provided by Caynel, so you can purchase worry-free - we've got your back!If you need more racks, please search :B07VKYG9TW"],"reviewsAspects":["easy to clean","works great","touch screen","easy to use","air fryers","rack","food","chicken","oven","send","rotisserie","told","capacity","door","fries","juicy","market","operate","temperature","accessories"],"productInformation":[{"Package Dimensions":"19.4 x 16.3 x 15.8 inches"},{"Item Weight":"20.2 pounds"},{"Shipping Weight":"20.2 pounds (View shipping rates and policies)"},{"Manufacturer":"Caynel"},{"ASIN":"B07PRZSRBB"},{"Customer Reviews":"4.1 out of 5 stars\n    44 ratings\n4.1 out of 5 stars"},{"Best Sellers Rank":"#32,783 in Kitchen & Dining (See Top 100 in Kitchen & Dining)\n#66 in Deep Fryers\n"},{"Date first listed on Amazon":"August 18, 2018"}],"productDescription":["Over the past 10 years Caynel has enhanced people’s lives through thoughtful design and brilliant innovation, delivering kitchen products to over 30 countries around the globe. Caynel is the kitchen appliance brand that engages people with ‘food thinking’. We are focused on developing environmentally conscious appliances that are affordable for everyone, all built with the latest culinary technology. Delivering innovation and insights that empower people’s potential to do things more impressively or easily than they’d thought possible in their own kitchen.","It is a full oven multi-cooker gives you all of the crisp, juicy, delicious & healthier benefits of oil-free air frying!","The Caynel Multi-Functional Air Fryer handles any cooking, baking, rotisserie, dehydrating or air frying task. It is a all-in-one Multi-Cooker that replaces a toaster and convection oven, deep fryer, rotisserie oven, dehydrator oven & microwave. You will get maximum versatility to make many of your favorite recipes— no oil, butter, or lard required.","Makes food crispy and evenly cooked every time without unwanted fats and oils. 1700 watt stainless steel heating element and 360°air rotation ensures efficient heat up and uniform texture. Express Heat System cooks food up to 30% faster than an oven.","\n","\n","\n","With a 12.5 Qt total oven and 5 lb. max capacity allows you to make plenty of food so you can make enough food for the whole family, without having to heat up your oven!","Rapid Air Technology that makes food crispy and evenly cooked every time without unwanted fats and oils. Express Heat System cooks food up to 30% faster than an oven.","Comes with 6 accessories: removable rack, rotisserie basket, rotisserie spit, skewer rotisserie, drip tray and retrieval tool. Removable drip tray and dishwasher safe parts make cleaning a breeze."],"reviews":[{"reviewerName":"Carol","rating":"5.0 out of 5 stars","reviewTitle":"I wish I could give it more than 5 stars","reviewDate":"July 4, 2019","reviewText":"This is my new favorite appliance. I may never use my oven again. It made the juiciest, tastiest rotisserie chicken I have ever tasted. Then I used the rack for roasted zucchini and squash. They tasted as good as grilled. Next I used the basket to make fried yuca. AMAZING! Clean up was easy and I only had to touch the food for prep and serving."},{"reviewerName":"Ray Ritchie","rating":"3.0 out of 5 stars","reviewTitle":"design of shelf and wall brackets","reviewDate":"July 18, 2019","reviewText":"overall perhaps a good fryer, but it is a large fryer (12.5 Qts.) and they include only one mesh shelf. There should be two. Plus, that one shelf is about 1/8\" too small in the width so that it wobbles around. Plus the distance between the places on the wall where the shelf slides in are too big so that when the shelf slides out with the food on it, the back of the shelf can go up as the weight of the food in front gets out from the support. Then the shelf wants to slide on out and the shelf and the food fall onto the door. Not good designing."},{"reviewerName":"Holly & Neal Hurst","rating":"5.0 out of 5 stars","reviewTitle":"Happy Frying","reviewDate":"August 5, 2019","reviewText":"I purchased the Caynel 12.5 Quart Air Fryer. It took me months to research, physically look at, and commit to an air fryer. There are so many on the market today that it makes it a tough decision. This one won overall due to its size, rotating basket, 5 star reviews and the great customer service reviews on their site.\n\nI have cooked fried chicken, fried okra and cookies so far. Apparently, you need to have a cooking oil spray that is not PAM, so I purchased an olive oil mister separate from this purchase. The cookies were very done on the outside and not done on the inside. The chicken was excellent! No doubt that the rotating basket is the best quality that makes this air fryer beat the others!!! No timers or returning to shake it. Delicious, crisp fried okra. However, the downfall is the 1 rack provided. The picture shows 3 racks, but you are only provided 1. If you leave a review, the company promises to ship you a free rack. (I will edit if the promise is not honored.)\n\nThe product is easy to clean. Even easier when you wrap the drip tray in aluminum foil before cooking.\n\nPros:\n- Biggest air fryer on the market\n- Best customer service\n- Accessories and recipe book included\n- The rotating basket alone is worth the purchase\n- Reasonable price\n- Easy to operate\n\nCons:\n- Needs more racks. The picture shows 3 racks, but they only send 1.\n- Power button is difficult to press. The lack of a physical button means I have to press the power button 2-3 times to turn it on\n- Initial smell on the first use smells like burning plastic or some electrical smell, but goes away.\n- Need to purchase cooking oil spray, not PAM."},{"reviewerName":"ErnestJ","rating":"5.0 out of 5 stars","reviewTitle":"Satisfied","reviewDate":"July 23, 2019","reviewText":"So far the unit is great. No smell. Heat or noise is no problem. I have cooked a whole chicken in it. The flavor was good and the meat tender. I have also dehydrated fruit with it. My only wish was that it would have come with more racks. But having contacted customer service I'm told they are restocking their supply of racks."},{"reviewerName":"Earl Bedford","rating":"2.0 out of 5 stars","reviewTitle":"Operation is a headache","reviewDate":"August 18, 2019","reviewText":"When I first received my air fryer, it was love at first site. After a few weeks, it's hard to get the inside light to turn off and the door always seem to not shut all the way thus I have to damn near slam it to get it to operate. The touch screen will not allow me to turn on and off thus I have to play with it for several minutes to at least turn on. Once it decides to turn on, it's great. Operations is a headache. Will call the manufacturer to return or get my money back. I've had it for less than 30 days!"},{"reviewerName":"L9","rating":"4.0 out of 5 stars","reviewTitle":"Engineered and Built right.","reviewDate":"July 27, 2019","reviewText":"First thing is wrap the drip tray in Foil so clean up will be easy. Second was very disappointed that it only came with one rack. But if we give our order info to Caynel in Aug they will send you a second rack free. Fingers Crossed. Overall nicely built has good sturdy weight.\nBy that afternoon I started frying. FYI put some Extra Virgin Olive Oil in a small spray bottle. So when your frying vegetables or anything you want to have a nice crunch to spray some oil on and it’s almost exactly like you deep fried it."},{"reviewerName":"Amazon Customer","rating":"3.0 out of 5 stars","reviewTitle":"Send what you promised-that extra rack","reviewDate":"November 7, 2019","reviewText":"I bought this air fryer in August. As I am a personal chef who has clients needing less high calorie preparation, this seems a good choice. However, in being told I would receive an extra and much needed rack instead of the only ONE, this has NOT happened. Instead have been told that I have to send in an honest review. Thought I had and it has been back and forth trying to get that rack that was to have been sent out the second week of August. So, here is my honest review. It should not take the time and energy to receive what I was told would be sent in August...and the simple recipe book seems written for more of an Asian market...To have a useful one with more applicable recipes is much needed...Now, I do indeed expect to get that extra rack I have been hoping for these last 3 months. Thank you, Chef Zacki"},{"reviewerName":"Dartay","rating":"4.0 out of 5 stars","reviewTitle":"Works Great","reviewDate":"July 23, 2019","reviewText":"Great Product. Chicken strips came out fantastic. Downside is that it only comes with one mesh tray for cooking. Really need two or three to try cooking multiple things at once. The cooking icons are abit small to read but is functional. No messy cleanup as you would with a deep fryer. Food taste great, not dry but moist. Can't wait to get accessories. Good investment to change cooking style."},{"reviewerName":"Bagpipes 1","rating":"5.0 out of 5 stars","reviewTitle":"PRACTICE MAKES PERFECT","reviewDate":"August 10, 2019","reviewText":"Using the fryer is a trial and error process at first. It's all a matter of time, temperature and height adjustments. Broiling to crisp on one side only is a matter of placing item to broil on cool solid pizza style stone/dish using high rack and high temperature. Open door pause cooking feature is great. The unit looks great and being a 12.5 quart capacity, fits my kitchen nook just perfectly. Only draw backs are lack of a second rack and rack guides could be tighter so racks with pans/dishes on them don't accidentally tilt and slip out on you as you pull the rack out. Though their email, they told me that future production runs will supposedly supply two racks. Overall, it performs as advertised just fine and has my recommendation."},{"reviewerName":"Sam","rating":"5.0 out of 5 stars","reviewTitle":"Ease of use.","reviewDate":"July 21, 2019","reviewText":"So we are newbies to this air fryer thing. We chose this one due to size and needs of family. I used it a few times now and we love it so far. It reheated a calzone perfect keeping the bread soft on the inside and crispy on the outside. We made fish and fries and they are great too. We are definitely impressed and looking forward to experimenting more with this. It is also easy to clean and operate which is great for all in house."},{"reviewerName":"rrrd33","rating":"1.0 out of 5 stars","reviewTitle":"Didn't work","reviewDate":"August 21, 2019","reviewText":"Had to return - after the first time plugging it in and turning it on - it would not turn on again."},{"reviewerName":"KC in Vero Beach","rating":"5.0 out of 5 stars","reviewTitle":"Nici size - fits well on counter top","reviewDate":"September 9, 2019","reviewText":"I like using this appliance very much.\n\nThe only thing I would change is raise the drum or reduce the size of the drum so that I could cook a steak while simultaniously using the drum for other foods such as french fries."},{"reviewerName":"Ann Hawley","rating":"5.0 out of 5 stars","reviewTitle":"The must have!","reviewDate":"October 16, 2019","reviewText":"Super easy to use, clean, I couldn’t be happier! I’ve used the rotisserie, air fryer racks, dehydration function and the air fryer basket. This does it all and does it perfectly!"},{"reviewerName":"Cherry Batten","rating":"5.0 out of 5 stars","reviewTitle":"Loving it!!!","reviewDate":"August 3, 2019","reviewText":"Are air fryers showed up on Thursday and we made a rotisserie chicken that same night for dinner. It came out perfectly. We just made some french fries and they came out great! I am very very pleased with it. It only came with one rack, but when I contacted the seller they said that they would send me an additional one. They responded very promptly."},{"reviewerName":"Grover Bates","rating":"4.0 out of 5 stars","reviewTitle":"Works ok","reviewDate":"October 12, 2019","reviewText":"The fan sounds like it's hitting some thing when it first stars. But after a couple of minutes it quite's down and you can hardly hear it run. I would of given it 5 stars if not for the fan issue. So far it seems to cook quite well. Not sure if I should send it back because of the fan or wait and see if it will straighten it's self out."},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Works great.","reviewDate":"September 19, 2019","reviewText":"Rotisserie works great.Cooked chicken and kabobs and both turned out juicy and tender and tasted great. Very easy to use and easy to clean up after using."},{"reviewerName":"B &amp; B","rating":"5.0 out of 5 stars","reviewTitle":"Bomb-Diggity!","reviewDate":"October 14, 2019","reviewText":"My co-workers thought that we would really enjoy an air fryer -- so I did my research and found this Caynel fryer is just what they said -- \"We LOVE it\". We have only have a few weeks and ordered 2 racks at the same time, we have tried multiple things -- but the kabobs are the bomb-diggity -- no seasoning needed just good natural flavors!!"},{"reviewerName":"jason","rating":"5.0 out of 5 stars","reviewTitle":"Awesome!!!!!!","reviewDate":"August 24, 2019","reviewText":"So Happy, this is Amazing and it look gorgeous in my kitchen, works Great and it is very Big, cooks perfect food and its Delicious... thank you...."},{"reviewerName":"Amazon Customer","rating":"2.0 out of 5 stars","reviewTitle":"A fryer this size should have at least 2 or more trays.","reviewDate":"October 27, 2019","reviewText":"It showed more than one tray for cooking. But only came with one."},{"reviewerName":"Kindle Customer","rating":"5.0 out of 5 stars","reviewTitle":"Amazing","reviewDate":"July 20, 2019","reviewText":"This is a beautiful machine. I ABSOLUTELY love it."},{"reviewerName":"Kwesi M.","rating":"5.0 out of 5 stars","reviewTitle":"Works as described","reviewDate":"August 4, 2019","reviewText":"Pork chops, chicken, french fries"},{"reviewerName":"Richard mansfield","rating":"3.0 out of 5 stars","reviewTitle":"Bad Touch Screen","reviewDate":"September 19, 2019","reviewText":"The touch screen is awful. You have to sit there pressing it for a good 3 minutes(if you are lucky) to get it to turn on. When you get it on it works fine. It's just very frustrating sometimes."},{"reviewerName":"Peggy","rating":"5.0 out of 5 stars","reviewTitle":"Great Company multi use AF","reviewDate":"August 22, 2019","reviewText":"I received my Caynel. I'm still on the learning curve. Since it does so many other things than just an AF. I like not having to turn an oven in in the heat of Texas Summers. This is perfect for every day use."},{"reviewerName":"Amazon Customer","rating":"4.0 out of 5 stars","reviewTitle":"Fast, easy, and no greasy food","reviewDate":"August 21, 2019","reviewText":"It's fast, no grease, and I don't have to turn the oven on. I'm finding you can do just about everything including baking."},{"reviewerName":"Wendell","rating":"4.0 out of 5 stars","reviewTitle":"Prompt customer service for another rack.","reviewDate":"August 28, 2019","reviewText":"I bought the Caynel 12.5 qt air fryer a few weeks ago, and I wish I had made the purchase months earlier. I can’t imagine buying a smaller capacity product. Bigger IS better!"},{"reviewerName":"Leslie Barker","rating":"5.0 out of 5 stars","reviewTitle":"too big, directions confusing","reviewDate":"September 28, 2019","reviewText":"too big and directions are confusing"},{"reviewerName":"felton c johnson sr","rating":"5.0 out of 5 stars","reviewTitle":"You can stop using your gas oven almost for ever.","reviewDate":"October 9, 2019","reviewText":"No dislike the oven work great we love your product, we been using the oven almost everyday ."},{"reviewerName":"Charles Jetton","rating":"5.0 out of 5 stars","reviewTitle":"great","reviewDate":"September 17, 2019","reviewText":"Great machine. wife loves it wishes she had it a long time ago."},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Super Easy and Delicious Food","reviewDate":"July 31, 2019","reviewText":"Used it for the first time tonight GREAT !!!"},{"reviewerName":"George Olson","rating":"5.0 out of 5 stars","reviewTitle":"Great Product","reviewDate":"November 5, 2019","reviewText":"Made french fries....EXCELLENT"},{"reviewerName":"Cody Snyder","rating":"5.0 out of 5 stars","reviewTitle":"Easy to clean and maintain","reviewDate":"November 7, 2019","reviewText":"Works great! Was really surprised how well it worked for being a no name brand. Very easy to clean and maintain."},{"reviewerName":"Mark and Amanda","rating":"5.0 out of 5 stars","reviewTitle":"Crispy yet juicy. Love this thing!","reviewDate":"July 1, 2019","reviewText":" I love this air fryer. You can rotisserie a whole chicken! There are parts for anything you'd want to cook. It is very easy to change the default settings whether it's the temperature or the time to your specific meal. I like to make hot wings for my friends and the capacity on this thing is great. It's easy to set up and it's easy to clean Everything I cook in here is juicy on the inside and crispy on the outside."},{"reviewerName":"shirish Kumar","rating":"5.0 out of 5 stars","reviewTitle":"Good choice of air fryer for home","reviewDate":"July 11, 2019","reviewText":" My first impression with this is I really liked it when I open the box. Initially I tried with spring rolls, kept it in round basket and these are really cooked nice. Need to explore more food on this air fryer. It comes with skewers, trays, rotisserie and more. It has 8 preset options on touch based panel located at front and there are temperature & time controls. It works up to 400 degree Fahrenheit and 60 min of time period. We can easily clean removable items and these dish wash safe. It cooks very fast and juicy so every one loved the food. I'm very much satisfied with this product and I'll recommend this."},{"reviewerName":"L. Davis","rating":"1.0 out of 5 stars","reviewTitle":"Not working after one month of use. 🤦🏽‍♂️","reviewDate":"August 12, 2019","reviewText":"We like this air fryer.... it appears to have stainless steel lining on the inside which makes cleaning a breeze.\n\nThe Cons... shipped with only one wire cooking rack. Unable to find a means to purchase additional accessories.\n\n******* Update ******\nThis fryer button STOPPED working for us 3 weeks ago. Therefore it doesn’t work anymore. We called Amazon for support but this product was out of Amazon Support Window..... They said they would send something to the manufacturer, but I am unsure what to do. Now we are stuck with a non working fryer. I guess I should have purchased what was recommended by daughter (Ninja). I guess I am cheap-O. 😂😂 I don’t recommend this product."},{"reviewerName":"Jessica","rating":"2.0 out of 5 stars","reviewTitle":"Works great but...","reviewDate":"August 28, 2019","reviewText":" I would love to give this a 5 star review but within a week of using it the light comes on and off randomly if you don't unplug it after every use. The door also seems to have to be 'lifted' when closed or the fryer won't turn on. It is a touch screen and I always have issues getting it to turn on for some reason. Other than those things it works fantastic."},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"The wife swears by it","reviewDate":"August 5, 2019","reviewText":"We are big users of Air Fryers, however their capacity is limited. The Caynel 12.6 quart is twice a large and has the ability to have several racks, which allows you to cook the entire meal, much more healthily. This is a great unit that is easy to use, operate and to clean. Works better than advertised and is very stylish on your counter. highly recommend you wont be disappointed."},{"reviewerName":"cdcdk","rating":"5.0 out of 5 stars","reviewTitle":"AMAZING!!!!","reviewDate":"August 25, 2019","reviewText":"I am in love with this!! I gave away not only my old air fryer AND toaster oven!! It toasts, cooks and browns. This morning I made scrapple AND Grands Biscuits at the same time. I do recommend buying the additional racks, it only comes with one. I HIGHLY recommend this product!"},{"reviewerName":"bob r","rating":"3.0 out of 5 stars","reviewTitle":"better air fryers for the money","reviewDate":"September 18, 2019","reviewText":"Even after the price dropped thirty dollars on their website a day or two after I bought this item There are better ones on the market. Wish I had expanded my search beyond amazon. Also needs another rack or two only comes with one."},{"reviewerName":"Kindle Customer","rating":"2.0 out of 5 stars","reviewTitle":"Does not cook enough to my liking. Wish i had paid attention and could return it.","reviewDate":"August 12, 2019","reviewText":"Basket is a pain to clean. Does not cook higher than 400 degrees. Fries do not cook in the 15 minute time. Going to have to try 20 or 30 minutes. Nothing really seems to cook well enough😒😕"},{"reviewerName":"E N.","rating":"4.0 out of 5 stars","reviewTitle":"Would recommend this appliance to family and friends","reviewDate":"October 21, 2019","reviewText":"I like the easy to use digital face and super easy cleanup. The food tastes better although I found with some vegetables it took a little longer than expected to cook and crisp up. Looking forward to using the dehydration feature soon."},{"reviewerName":"purple man","rating":"5.0 out of 5 stars","reviewTitle":"Nice","reviewDate":"September 13, 2019","reviewText":"So far we really like it."},{"reviewerName":"Shani Brown","rating":"5.0 out of 5 stars","reviewTitle":"Works well","reviewDate":"July 10, 2019","reviewText":"Arrived quickly. Does everything I was hoping for. Will recommend."},{"reviewerName":"Kim M.","rating":"5.0 out of 5 stars","reviewTitle":"Easy to use and makes the best foods","reviewDate":"July 31, 2019","reviewText":"Best air fryer! I love this machine. I am still discovering new things to cook in it. I recommend it highly"}],"qAndA":[{"question":"How many racks come with it?","answer":"Dear customer, the current product only comes with one rack. We will increase the number of rack to two in next batch. We don’t have any extra rack and if you order right now, please contact our customer service or go to www.caynel.com to contact us with your order number, we will send you a free rack once we restock t… see more"},{"question":"When will you increase number of racks? I would love to buy this product with more racks!","answer":"Just in several days."},{"question":"How long is the electrical cord? Is is detachable from the unit?","answer":"The electrical cord is 3ft and it is not detachable."},{"question":"what size chicken can be cooked on the rotisserie?","answer":"Our air fryer is the one of biggest size in the market, actually you can cook any size of chicken in this air fryer. However we recommend you choose the five to six pounds, with five pounds being best. A five-pound chicken is usually categorized as a “roaster.” These birds are usually less than 8 months old, extremely … see more"},{"question":"how high does the temp get?","answer":"The highest temperature can be reached is 400°F."},{"question":"How many “removable racks” (like in the dehydrator photo) are included? Can you purchase additional ones?","answer":"One. Probably.....with a little research and effort."},{"question":"Is the interior of this air fryer oven nonstick coating of just stainless steel or a metal without a coating on the interior walls? This is important","answer":"It is the galvanized sheet."},{"question":"What are the external dimensions of this fryer, specifically how tall is it from top to bottom?","answer":"Approximately 15 1/2 inches. It fits under my kitchen cabinets with room to spare."},{"question":"I use 110V voltage?","answer":"It's a 110V appliance."},{"question":"Is 60minutes the max time you can set this oven to cook? I mean, dehydration need more Time than that?","answer":"The max time for air fryer function is 60 minutes if you choose dehydration, the time will automatically set for 10 hours and 30 minutes."},{"question":"If I purchase this today can I get more than 1 rack?","answer":"Yes, just contact with our customer service with your order number."},{"question":"Only one rack?","answer":"Dear customer, the current product only comes with one rack. We will increase the number of rack to two in next batch. We don’t have any extra rack and if you order right now, please contact our customer service or go to www.caynel.com to contact us with your order number, we will send you a free rack once we restock t… see more"},{"question":"I use 110V voltage?","answer":"This plugs into a normal 15 amp duplex outlet found in nearly all US kitchens. it is not a 220V special plug."},{"question":"Does it only come with one rack and can you purchase extras for drying?","answer":"You can purchase extra. But they’re out of stock. So anyone that purchased this prior to August will receive an additional rack free. You just have to email them with your Purchase Order # in Aug."},{"question":"where are the reviews for the 12.5 quart air fryer?","answer":"I personally love mycaynel\n\n… see more"},{"question":"what size chicken can be cooked on the rotisserie?","answer":"Our air fryer is the one of biggest size in the market, actually you can cook any size of chicken in this air fryer. However we recommend you choose the five to six pounds, with five pounds being best. A five-pound chicken is usually categorized as a “roaster.” These birds are usually less than 8 months old, extremely … see more"},{"question":"What are the internal dimensions of the 12.5 qt unit?","answer":"I really don’t know.... I am able to prepare 6 -7 chicken wings on the one supplied cooking rack. I have not cooked whole chickens. Yet"},{"question":"Hi. Where can I buy accessories for this air fryer for baking muffins and cookies?","answer":"Right now we don't sell accessories individually."},{"question":"? Can you cook a hamburger in it","answer":"Air fryer burgers use the air fryer to cook frozen burger patties. Frozen burger patties and other frozen foods are cooked perfect using the air fryer. Typically when using an air fryer, you are using a very little to no amount of oil to cook your food. In traditional frying, a few cups of oil are needed to cook food.… see more"},{"question":"How can i order 2 more racks?","answer":"You can directly search ASIN:B07VKYG9TW on Amazon."},{"question":"What are the interior measurements of the 12.5 quart?","answer":"10 1/4 wide,9 1/2 deep ,7 5/8 height"},{"question":"how long is the warrety for ?","answer":"3-year warranty provided"},{"question":"How many “removable racks” (like in the dehydrator photo) are included? Can you purchase additional ones?","answer":"Dear customer, the current product only comes with one rack. We will increase the number of rack to two in next batch. We don’t have any extra rack and if you order right now, please contact our customer service or go to www.caynel.com to contact us with your order number, we will send you a free rack once we restock t… see more"},{"question":"what is the size/capacity of the frying basket? I'm trying to compare to a unit that is only an air fryer, Their baskets are measured in quarts.","answer":"7 1/2\" long,5 1/2\" diameter."},{"question":"does it only come with one rack and can you purchase extras or drying?","answer":"You can they are out of stock right now. But if you have purchased this item already. In August if you email Caynel and supply your Purchase Order # they will send 1 free rack."},{"question":"Does this oven have a stainless steel interior lining?","answer":"We are enjoying the Caynel Fryer... We are disappointed that it only came with one flat wire rack. I have spent to much time looking for accessories that appears to not exist."},{"question":"Only one removable rack comes with order? How do I order 1 or 2 more racks? Need more than 1 for dehydrating.","answer":"Yeah I had the same thought before I purchased this item. Luckily I found out that they are going to send out an additional rack to any order that only received one. They are restocking in Aug. So send them your Order # in Aug and you’ll get a free second rack."},{"question":"Does your oven do conventional baking, like a casserole or cookies etc?","answer":"I haven't done it yet, but I'm sure that it does. If you look online it will be able to find videos of people using this oven to do numerous tasks."},{"question":"Can this be used as a toaster?","answer":"There is a learning cure to using the fryer, but, YES TO TOASTING, however, \"broiling\" in the true sense is another question? Still haven't figured it out."},{"question":"Does this come with more than one mesh removable tray?","answer":"The product only comes with one drip tray."},{"question":"is the interior stainless steel?","answer":"It is the galvanized sheet."},{"question":"Where is it made?","answer":"Not sure, but I would imagine it is made in China; almost everything else is made there."},{"question":"Has anyone purchased or reviewed the 12.5 Quart version?","answer":"The listing has some detailed reviews recently, and you can also watch the video review made by professional reviewer."},{"question":"This looks like an awesome product. Has anyone used it as a toaster to just make toast?","answer":"Yes. It does anything a toaster can do faster and better. You choose the bake preset and set the time for 1 min and you’re good to go. Comes out fresh like just out of the bakery."},{"question":"Where can I buy extra racks","answer":"So Caynel the maker and seller of this product has said that they are currently out of racks but will have inventory by August. So if you had purchased this product you can email them with the order number and they will send you an extra rack."},{"question":"If I purchase this today, how many racks will be included?","answer":"One removable rack."},{"question":"What size pizza can be cooked in this oven?","answer":"I can not imagine anything more than a slice or a small personal size pizza. A 10 inch diameter at the most."},{"question":"Twice in the product descriptions it says this thing will replace a microwave. I use my microwave often to boil water quickly. Will this do that job?","answer":"No, it is also very dangerous to boil water in microwave."},{"question":"It only comes with 1 removable rack? How do you cook 3 racks of food at the same time?","answer":"Presently you can’t. Caynel is restocking thier rack inventory. But if you had already purchased this item you can get 1 extra free rack in Aug. just email them with your Purchase Order #"},{"question":"Description says replaces a toaster. Is there a \"toast\" function? How do you toast bread or bagels?","answer":"No toast function per say, 280 degrees, use middle rack at approximately 4 minutes from cold start works for me, but adjustments can be made to suit."},{"question":"How can I get more racks?","answer":"I wish I could help with that, but I can't. In fact, I would like to have another rack myself. So far, I have found no place to buy one. For the size and cost of the unit, it is obvious that the manufacturer is too cheap to provide more than one."},{"question":"can you grill in this air fryer?","answer":"Absolutely you can!"},{"question":"what are the interior dimensions?","answer":"Returned"}]}