{"title":"Air Fryer Electric Hot Air Fryers Oven Oilless Cooker with Nonstick Basket(Gold/black) (5.5 L)","manufacturer":"Linsion","currentPrice":"$109.99","rating":"5.0 out of 5 stars","totalRatings":"1 rating","features":["\n         Make sure this fits\n                by entering your model number.\n        \n","HEALTHIER FRYING: 88% less oil than traditional fryers, but deliver the same deliciously crunchy taste of fried food with little to no oil. Also no oil fumes in house. Let your lover eat healthier.","VERSATILE：Our 5.8QT Power Air-Fryer comes in handy in preparing amazing meals from your cookbook, and frying a variety of dishes, such as: French fries, chicken, steak, roasts, fish tacos and sticks, waffle fries, pies, pudding and donuts.","EASY TO COOK - 60 minute cooking timer with auto-shut off when your food is done. Heating & Power indicator lights. Variable temperature control 180°~400°F, giving you total control over the food you are cooking","Manual Time and Temperature programming option; 1700 Watts of Turbo-Cyclonic Power; Super Heated Air heats up to 400 degrees, cool to the touch easy grip handle.(","2-YEAR WARRANTY FOR FREE - 90-day money-back, also 2-year warranty and lifetime support from LinsionProduct. Just contact our customer service if any issues happened. 100% satisfaction guaranteed."],"reviewsAspects":[],"productInformation":[{"Package Dimensions":"17 x 14.5 x 14.2 inches"},{"Item Weight":"14.2 pounds"},{"Shipping Weight":"14.2 pounds (View shipping rates and policies)"},{"Manufacturer":"Linsion"},{"ASIN":"B07QHKXXPX"},{"Customer Reviews":"5.0 out of 5 stars\n    1 rating\n5.0 out of 5 stars"},{"Best Sellers Rank":"#257,977 in Kitchen & Dining (See Top 100 in Kitchen & Dining)\n#401 in Air Fryers\n"},{"Date first listed on Amazon":"April 4, 2019"}],"productDescription":[],"reviews":[{"reviewerName":"Vicki","rating":"5.0 out of 5 stars","reviewTitle":"Air fryer","reviewDate":"August 3, 2019","reviewText":"Worth the price. Very convenient to use and the food cooked is healthy and delicious too. Digital display screen looks so high quality. I cooked a chicken and fries by using the fryer, everyone loves it."}]}