{"title":"Innsky Air Fryer Oven, 10.6QT 1500W Electric Air Fryer with LED Digital Touchscreen 10-in-1 Countertop Oven with Dehydrator & Rotisserie, 6 Accessories & 32 Recipes & 2 Years Warranty","manufacturer":"Innsky","currentPrice":false,"rating":"4.6 out of 5 stars","totalRatings":"157 ratings","features":["\n         Make sure this fits\n                by entering your model number.\n        \n","Oil-free & Delicious - Compared with cooking in hot oil (273.9k/100g in fried chicken, 107k/100g in chips), Innsky air fryer adopts new technology of cooking food by 360°hot air circulation, which can offer you crunchy food with little or no oil, promising you healthy food as well as delicious taste.","All-in-1 Machine - Innsky IS-AF001 is not only an air fryer, but also a rotisserie, dehydrator, pizza grill and oven toaster. With wide temperature range from 180℉to 400℉, this air cooker allows you to fry, bake, grill, roast and dehydrate. 10.6QT(inner size:10.9\"L*9.06\"W*6.97\"H) extra-large capacity with 2 rack levels allows you to prepare family-sized quantities as well as saving the space","Easy-to-operate & Safety - Touch the icon instead of keeping circling to choose cooking mode, quick and easy. 10 presets allow you to air-fry extra crispy chicken wings; air-fry rotisserie for savory pork roast, mouthwatering turkey breast, or authentic kebabs without any difficult no matter how novice you are! Automatic shut off will prevent overcooking and overheating. Pass the FDA certification, a really safe countertop convection oven that you can trust.","Expanding Cooking Options - Come with 6 extra accessories: 2 mesh racks, 6 skewers, 1 rotisserie basket, 1 drip tray that catches fat and oil, 1 rotisserie shaft to jab into the chicken or roast and 1 removal tool, this air fryer can create more possibilities which means you’re able to cook more types delicious with the included recipe.","Set You Free From Chores - Cooking is fast and free from splattering oil vapor all over your kitchen countertop. Made of non-stick material, all removable parts go into the dishwasher and can be dried by hot air after cleaning, which change the tedious work just into a piece of cake."],"reviewsAspects":["easy to clean","easy to use","fryer oven","chicken wings","air fryers","french fries","highly recommend","rotisserie chicken","whole chicken","long time","super easy","came out perfectly","drip tray","roast chicken","pork chops","stainless steel","convection oven","large capacity","fried chicken","mesh basket"],"productInformation":[{"Product Dimensions":"14.2 x 11.4 x 14.3 inches"},{"Item Weight":"17.64 pounds"},{"Shipping Weight":"21.8 pounds (View shipping rates and policies)"},{"Manufacturer":"Innsky"},{"ASIN":"B07RX9JQGN"},{"Item model number":"IS-AF001"},{"Customer Reviews":"4.6 out of 5 stars\n    157 ratings\n4.6 out of 5 stars"},{"Best Sellers Rank":"#4,313 in Kitchen & Dining (See Top 100 in Kitchen & Dining)\n#18 in Air Fryers\n"},{"Date first listed on Amazon":"August 1, 2019"}],"productDescription":["\n","\n","\n","Metal interior will ensure there is no plastic odor produced when cooking. Clean up involves just a quick wipe. Set you free from clearing up the mess","The oven is beautifully designed, with a brushed stainless steel exterior. The plastic parts are PBA-free, which produce no harmful material when cooking","10.6QT extra-large capacity with 2 rack levels, it is more versatile than standard air fryer which eliminates the need for other large appliances on your counter","The transparent glass window make it easy to see the cooking progress of your food without the need to open the cooking chamber. No more worrying about overcooking","When use two racks, arrange the racks on the top and bottom thirds of the oven. Halfway through cooking, rotate the trays and swap to ensure even cooking. This move is especially useful when baking multiple batches of cookies.","The tumbling motion means that every side of the food being cooked gets hit by heat, leading to a crispier and more even final product","Allow you to make Rotisserie Chicken simply. Achieve a much tastier meal at home than available at most grocery stores","\t\t\t\t\t\n\t7-in-1 Stainless Steel Air Fryer\t7-in-1 5.8QT Air Fryer\t10-in 1 Air Fryer Oven\t6.3QT Large Air Fryer\tAir Fryer Accessories\nCapacity\t5.8 QT\t5.8 QT\t10.6QT\t6.3QT\tFit for 5.8qt/6.3 qt Air Fryer\nControl Method\tLED Touch Screen\tLED Touch Screen\tLED Touch Screen\tLED Touch Screen\tBoth for Square or Round Air Fryer\nAuto Off\t✓\t✓\t✓\t✓\t6 PCS Accessories\nPower\t1700W\t1700W\t1500W\t1700W\t\nGift\tRecipe Booklet\tRecipe Booklet\tRecipe Booklet & 6 Air Accessories\tRecipe book/ Grilling rack\t\nVoltage\tAC 120V\tAC 120V\tAC 120V\tAC 120V\t"],"reviews":[{"reviewerName":"Dave","rating":"5.0 out of 5 stars","reviewTitle":"Huge space, 2 layers, easy to clean","reviewDate":"August 5, 2019","reviewText":"This is an awesome airfryer. This has two layers so it is perfect for family gatherings. The digital touch buttons are a plus. I fried chicken wings in this airfryer and they turned out to be great!\nI bought this after my previous airfryer broke down which was much smaller and accommodated only one layer of food to cook at a time and was difficult to clean.\nThis fryer came with a rotisserie chicken fryer as well. I haven’t tried cooking rotisserie on it yet though.\nIt is super easy to clean because the 2 trays come right out and the bottom tray where all liquid gets collected also comes out easily. I am very happy with this purchase."},{"reviewerName":"A Good Samaritan","rating":"5.0 out of 5 stars","reviewTitle":"Great upgrade!","reviewDate":"August 5, 2019","reviewText":"I have been looking for a new air fryer since my last one broke. I decided to give this a try given it has much larger capacity,1500w, and more features to use. This is definitely a big upgrade from my previous air fryer. The double layer feature is great. Now I can use the upper layer to fry french fries while using the lower layer to make rotisserie chicken. It saves my family a lot of time as you can make two dishes simultaneously. Compare to the older version of air fryer where you have to clean the air fryer basket every time you use it, this one is super easy to clean. You can use cooking pan to fry your food and just clean the pan instead of the entire basket. The see-through window is also a big game changer. It allow you to monitor your food in process instead having to break the airflow in order to check the food. I am super happy with this air fryer and will definitely recommend this to anyone who wants an air fryer."},{"reviewerName":"T L","rating":"5.0 out of 5 stars","reviewTitle":"High quality large capacity air fryer","reviewDate":"August 8, 2019","reviewText":"I am super impressed with this air fryer oven. I have tried air frying the fish sticks, sweet potato fries, chicken wings and they all came out amazing. They are super crunchy without adding any additional oil. I love the glass door so I can see how well it cooks the food and flip the tray when the top tray becomes too well done. The oven is much larger than the other type of air fryer. There are also many preset settings so you just have to pick the type of food you are frying and it will set the temperature and time for you. Overall, I am very happy with this air fryer. Highly recommended."},{"reviewerName":"Dominic G.","rating":"5.0 out of 5 stars","reviewTitle":"No microwave function","reviewDate":"The manufacturer commented on the review below","reviewText":"I’ve not used it yet but I don’t see a microwave function, which it was advertised to have.\nSince my review Innsky quickly contacted me and apologized for the mistake. They were very helpful and provided me with a satisfactory outcome. As my picture shows, I have now used the fryer and was very happy with the result. Tasty, crispy wings in 18 minutes. And clean-up is so easy."},{"reviewerName":"Krishnendu Khan","rating":"5.0 out of 5 stars","reviewTitle":"Tasty fried foods with less oil","reviewDate":"August 15, 2019","reviewText":"I was contemplating to get an air fryer for long time. At last I took the leap and decided to buy one. I decided to buy a square one instead of the usual oval one because of the more space that I can get with it. This particular one is of 1500W and has more capacity than the conventional styled ones. This has two layers which you can use for different foods at the same time which is a great advantage than the older model ones. Till now I have air fried chicken and various vegetables like potatoes, mushrooms, beans, cauliflowers. This really takes very less oil compared to the conventional frying. The cleaning is also super easy as the lowest layer collects all the dripping oil which you can take out and clean easily. Although it takes a bit of standardization of the amount of frying you want to do for the first time but after that its a breeze. The best thing that I liked is that you just put you program and thats it., you don't have to wait by standing in front of it and that saves a lot of time and less tiring."},{"reviewerName":"Tanya Filipova","rating":"5.0 out of 5 stars","reviewTitle":"Huge capacity, fast and HEALTHY meals","reviewDate":"August 9, 2019","reviewText":" Amazing. Just LOVE it. Fast meals since i'm not waiting to preheat an oven. Very convenient that this air fryer oven comes with 2 cooking trays. Now can save on time either. I'm very new to air fryer cooking but i'm just in love. I cant stop and i'm looking for new things to try out. Even the capacity of the basket is huge, we are family of 4 and this product fits perfectly for us. Cant wait to try all the extra gadgets that came with the product. Recommend it highly"},{"reviewerName":"Chelsea","rating":"5.0 out of 5 stars","reviewTitle":"AMAZING!","reviewDate":"August 19, 2019","reviewText":"This is such an awesome little appliance! I am excited for all the dinners I plan to cook with it. So far it has done really well with I have made with it.\n\nI will say it is perfect if you live somewhere where it is 100+ degress in middle of August . You want a nice dinner but even thinking about turning the oven makaes you cringe. It also perfect if only need cook a small portion. It heats up pretty quickly. I love the touch screen feature and the pictures for each chicken, shrimp, etc. This machine is like a little oven the possibilities are endless. Plus it's faster, easy to clean up, and allows you to eat some foods in a healtier way.\n\nYou can cook a WHOLE CHICKEN in this! That's one thing that I wanted in a air fryer was it to be spacious too. I have a family of 3 and it works great for us."},{"reviewerName":"Douglas Lautersack","rating":"5.0 out of 5 stars","reviewTitle":"Best wings!","reviewDate":"August 11, 2019","reviewText":"I've been making wings in my oven for years. I just made the best wings I've ever made in my new air fryer! It's big but it can cook a lot at once and it does an awesome job. I've yet to try a full chicken but I can't wait. I thought the rotisserie and skewer tools are a nice touch. I have a feeling I'll be using this a lot once I experiment with it a little bit more. So far I'm very happy. The product is well made and sturdy. It just takes up a lot of counter space so be aware of the dimensions. The instructions were a little lacking but the little cookbook that comes with it was really nice. I can't wait to use it more and see what I come up with!"},{"reviewerName":"The.K.J","rating":"5.0 out of 5 stars","reviewTitle":"Perfect for kitchen","reviewDate":"August 18, 2019","reviewText":"Multifunctinal Air fryer, I have been using it to cook french fries, chicken wings, fish, all come out good. Large capacity, two layers can put about 30 wings, good enough and very fast to make a party dinner. And the oscillating function is perfect for fries, it will come out evenly color, and you don't need to do anything through out the cooking, unlike other air fryer, you will have to take out the shake them. The glass window is a plus, what you see is what you get.\nVery easy to clean, one metal plate at the button will catch all the small debris from food, and very easy to clean it. Try it if you able to put a little more money, it is much better than conventional air fryer."},{"reviewerName":"Brandon","rating":"4.0 out of 5 stars","reviewTitle":"Great customer support makes up for some cons","reviewDate":"The manufacturer commented on the review below","reviewText":"Initially, i had some problems with cleaning it because after using it to cook my Korean BBQ, i got greases all over, so after my complaints about it, their support reached out and offered me with tips and solutions on how to keep it clean and maintenance, so my problem was might be I just had too much oil/fat on those BBQ to start with. It was great that they actually followed through with me to get my issues resolved and also guaranteed that their warranty will cover any future issues with the oven.\n\nFor the oven itself, it's pretty big compare to other air fryer, however, don't expect to have a full grown chicken to fit in there, probably a smaller whole chicken (under 3.5 lbs would fit nicely, anything bigger than that might not fit). It does come with a several accessories to use, one of which is my favorite, which is the mesh basket. My wife used that for the chicken nuggets and meatball BBQ, breaded shrimps and it cooks better using that mesh basket than the tray because it helps drain out all the fats better. I also suggest to put some extra foil wrap on the side of the bottom tray to prevent greases plashing onto the oven's wall."},{"reviewerName":"Tracy","rating":"5.0 out of 5 stars","reviewTitle":"It’s multifunctional and a healthier option. Great thing to have in the kitchen.","reviewDate":"September 4, 2019","reviewText":"Sorry, this video is unsupported on this browser.\n This air fryer oven is multifunctional based off its name. It’s an air fryer and an oven combined so it’s a very helpful thing to have in my kitchen. It was easy to assemble, easy to use and easy to clean. I recently roasted chicken using it and I love that it’s able to spin the chicken a full 360. The chicken came out perfectly cooked and it tasted very tender. I also like that when I bake things, there’s 2 rack levels so it holds a good amount of food. And it also comes with a mesh basket so when I make fries, it can drip off all the oil. It’s a healthier alternative, there’s no harmful things going into the food while it’s cooking and the food comes out delicious."},{"reviewerName":"C. W","rating":"5.0 out of 5 stars","reviewTitle":"It’s Absolutely made our life happier and easier.","reviewDate":"August 23, 2019","reviewText":"Sorry, this video is unsupported on this browser.\n We had a normal small oven for three years, it is getting older, we want to buy a new one, the fryer oven always show up from the TV, we want to try something new so that we purchased this fryer oven. I myself like cooking very much, my husband likes to eat roast chicken and my son likes bread a lot, I use this fryer oven roast chicken and make bread by myself, they love it. This oven is more healthy, you can use less oil. It became the best kitchen machine. It’s Absolutely made our life happier and easier."},{"reviewerName":"rickyqqqq","rating":"5.0 out of 5 stars","reviewTitle":"Best oven !","reviewDate":"August 15, 2019","reviewText":"Sorry, this video is unsupported on this browser.\n It’s bigger and bulkier then I thought. I love it .We live in texas and it’s just too hot to turn on the regular oven to cook a healthy meal. This oven is perfect and cooks quickly and evenly. I’m so amazed at this perfect oven. ! Also this machine Good looking and food looks Great. absolutely love making roast chicken in it ."},{"reviewerName":"Matt hoang","rating":"5.0 out of 5 stars","reviewTitle":"Very nice air fryer","reviewDate":"August 15, 2019","reviewText":"This air fryer not only looks great on my countertops, but it's also very easy to clean. I can cook two different items at the same time. With alot of capacity, I can cook more food for everyone in less time. I air fried some chicken legs and it comes out perfectly cooked and crispy. The see-thru window is a plus, you can see the food while it's cooking. The presets for various types of food is very convenience. Got to love this air fryer."},{"reviewerName":"Greer","rating":"1.0 out of 5 stars","reviewTitle":"Very Disappointed!!","reviewDate":"The manufacturer commented on the review below","reviewText":"I purchased this large air fryer because I have a large family and needed maximum cooking capacity. Unfortunately having two racks for cooking isn’t as impressive as one would expect because the food on the lower rack literally takes twice as long to cook. Might as well do two batches. I will probably be returning this and purchasing a different 10 qt air fryer."},{"reviewerName":"ZJohnson","rating":"5.0 out of 5 stars","reviewTitle":"Love this oven air fryer!","reviewDate":"August 25, 2019","reviewText":"This is my first oven air fryer and it's awesome! It's bigger than my regular air fryer, it definitely takes up some counter space. You can use trays to make more meals, it's big enough to make dinner for a family of 4-6. I don't always like the textures of food after microwaved, and this oven air fryer really comes in handy. It's very easy to use. I don't need to preheat it which is one of my favorite things about air fryer, and it only takes few minutes to make nice warm crunchy/crispy meals. It takes some trial and error to figure out the best way to cook, but once you figure out the right combination of time and function everything we have made has turned out great. It's also easy to clean as long as you clean it after use, if you let the dirt/fats sit for few days it would be sticky and harder to clean up. So far so good, I highly recommend!"},{"reviewerName":"Vaiferrari 🌹","rating":"5.0 out of 5 stars","reviewTitle":"Awesome air fryer/oven !","reviewDate":"August 21, 2019","reviewText":"How, I'm impressed with this air frier/oven!\nAfter hearing so much about air fryers lately, I really wanted to see what was all the hype about it. Unsure if it was really any different than a toaster/convection oven...\nWell, I am really impressed! It is different, the food comes out crisper and cooks in a shorter amount of time. I have toasted bread for my bruschetta in less than 3 minutes! I recommend you checking your food often, at the beginning, until you have more experience, because it does cook fast and you don't want to end up with dry, overcooked food.\n\nThis air fryer is awesome, you can easily access your food thanks to the three 3 trays that come with it and you can see how it cooks through the little window.\nIt is definately bigger than expected, so if countertop space is an issue in your kitchen, I recommend checking the measurements."},{"reviewerName":"DN","rating":"4.0 out of 5 stars","reviewTitle":"Nice design but doesn't serve our purpose","reviewDate":"October 4, 2019","reviewText":"We bought this for:\n\n1. The rotating basket to make fries (with fresh potatoes), but it takes 1.5 times longer and the fries come less crispy than using the top tray. However, the top tray doesn't have a wall so fries keep falling off when we mix them. It needs a basket.\n\n2. Large capacity, but the bottom space is not of much use because air flow doesn't get to it. Rotating the trays make foods taste more like baking, not as crispy as in air frying, so we only cook in 1 tray.\n\nIt makes food crispy outside and moist inside, more moist than our old air fryer. We are thinking of getting the one- level air fryer with the basket so we could make fresh fries also. Love the design and see-through window"},{"reviewerName":"jingqun c.","rating":"5.0 out of 5 stars","reviewTitle":"Smart oven Easy to use","reviewDate":"September 3, 2019","reviewText":"My son is picky boy, he only like fried food, I was so worried about that . My friend recommended this oven to me , I bought this about month, it’s amazing, I use this oven everyday , cook food is easy for me now , I make steak. Chicken wing. Pork chops. fish. Vegetables ,is so easy. All you do is make flavor in your food, than put to oven , wait a'bout 15-20 minutes, your down your job! This oven is beautiful design , special the see though window , you can check anytime to make sure your food isn’t overcook with out open the window. The oven got stainless steel mesh basket, it allows the oil drippings to gather in the non -stick , sturdy pan is easy clean up . Love it !"},{"reviewerName":"Patricia Hall","rating":"5.0 out of 5 stars","reviewTitle":"Great, Powerful, large Air Fryer","reviewDate":"September 25, 2019","reviewText":"This Innsky Air Fryer is great. It's large. You can cook a lot of food. It's comes with 2 shelfs but can hold 3. It has the rotisserie basket plus the rotisserie for a small whole chicken and 8 skewers. I unboxed it and was surprised at the good packaging and then the sturdiness of the fryer. It not extremely heavy but sturdy. I got all the accessories out and mounted in the fryer, one at a time to check the difficulty in using them. Absolutely no difficulty, all went in with precision. Next I checked the control panel and I was ready to use. I did wash and dry the accessories before use. I tried a dry run the first time. Once you hit the power button you have about 15 seconds before it turns on. Not a problem once you are familiar with the control panel. You can choose between 150° to 400°. It default starts at 370°. It cooks really fast compared to the included guidelines. I like the internal light, you can see pretty well. This is my first air fryer so I can't compare it to others on how they work but this was easy to get used to. The food cooks evenly and thourghly. I plan on having this a long time. I'll keep you posted."},{"reviewerName":"AmazonJunkie","rating":"5.0 out of 5 stars","reviewTitle":"Awesome air fryer!","reviewDate":"August 16, 2019","reviewText":"This is SUCH a nice air fryer. The rotating wheel is perfect and it is good for fries or tots, the included trays are very nice and it has so many features and buttons. Touch sensitive is nice as well, there is a rotating button and a light button and tons of modes. It’s also SUPER quiet. Very happy with it"},{"reviewerName":"roma1","rating":"5.0 out of 5 stars","reviewTitle":"DOESN'T disappoint!!","reviewDate":"September 25, 2019","reviewText":"Originally, I had a Basket Air Fryer that I was using with limited capabilities. I also had a Toaster Oven which I was no longer using as much as I used to (but I wanted to keep it for using the oven for roasting when needed).\nI was researching, watching & reading multiple reviews and decided to go ahead and get the Innsky Air Fryer Oven...IT DOES NOT DISAPPOINT! I L-O-V-E IT!!! Innsky replaced and freed up precious counter space of 2 counter appliances, easy to use, larger capacity Air Frying oven & it's easy to clean. It's 5 star rated as the second of 10 of the best new Air Fryer's for 2019 and YES indeed it does NOT disappoint!"},{"reviewerName":"Hong","rating":"5.0 out of 5 stars","reviewTitle":"I use it to bake amazing delicious cheese cake!","reviewDate":"October 22, 2019","reviewText":"The baking oven in my house hasn’t been used for really long time, then it just stop working for good! Instead of purchasing a standard size one, I have been looking for something like this for a while. Now I am glad I find it. Cause baking oven for my family is not very necessary, unless we want some bakery. So we don’t want to spend too much on this.\nThis air fryer meets all your requirements for baking oven. I used it to bake some cakes for several times, and it worked all good all the time. There is one things I need to remind you guys, you see the size of the baking oven is smaller than standard one, so the heat is less strong then standard one. So for the recipe on YouTube, I would recommend you to do a little bit higher in temperature and longer in cooking time.\nGoogle the light cheese cake on YouTube, you will like it! That is what I made in past days. Remember to preheat the machine by just turn it on before you bake your cake! There is the cake baking function, you could choose directly, but I will lower the temperature to 290F, and make the time to 1hour. So far this air fryer works really good for me."},{"reviewerName":"Holly","rating":"5.0 out of 5 stars","reviewTitle":"LOVE this appliance!","reviewDate":"August 20, 2019","reviewText":"I have been wanting an air fryer for a while now but really needed to do my research and make sure we got the right one. I am so glad we waited! This is everything I have hoped for. We have made steak bites and chicken, fries and veggies. Everything turns out perfect with minimal work! I love that this is more like an oven rather than the basket and it can cook multiple items at once so we aren't waiting on dinner.\n\nThe only (minuscule) downfall is it is a large appliance on the counter. I think the benefits outweigh that though and I am super glad I made the purchase! Seeing it all the time makes me use it more often and who can argue with awesome food?!"},{"reviewerName":"Lou Wohlrabe","rating":"2.0 out of 5 stars","reviewTitle":"Clunky door, aquward racks, chemical smell","reviewDate":"October 30, 2019","reviewText":"I really wanted to love this product, I had put a ton of research into air fryers prior to purchasing. First I would like to say it came well packaged. I set it up and as I closed the door it was super clunky on the right hand side (like something was broken but I thought if I liked the oven I would either have my husband look at it or talk to a rep as mistakes happen). The first thing I cooked was chicken breasts, it was a bit noisy and the oven put out a funny smell (and yes I had run it prior to cooking in it per the instruction book). I also cooked toast as I had read it could be used as a oven toaster, it pretty much gave you dried out bread, not toasted. I cooked bacon in it one time and it was just OK. One problem is the racks, one is very high in the oven and one low, awkward to get to either on, secondly when you use the rack pulling out tool juices drop everywhere and makes a mess. Thirdly I had wanted a air fryer that was stainless steel on the inside and it is but there is a brown notch on the left hand side of the wall which is not make of stainless steel, the notch is used for the rotisserie function. Lastly after using it several times it still smelled and had the clunky door which I did not think would last. It was easy to clean but did not earn a place of honor on my counter."},{"reviewerName":"Pete","rating":"5.0 out of 5 stars","reviewTitle":"It's huge","reviewDate":"August 13, 2019","reviewText":"Really awesome air fryer oven. Technology is too advance !!! We choose this one mainly because it's huge size!!! You can fit an huge chicken in there with no problem. There's so much different recipes online. You won't have an headache cooking . It's easy to use, even my grandma knows how to use it. We love it..."},{"reviewerName":"pearl","rating":"5.0 out of 5 stars","reviewTitle":"Great product!","reviewDate":"August 9, 2019","reviewText":"I received my new Air Fryer, This is an awesome air fryer. My son is really Exciting ，bc I will cook cupcake for him . this oven size also really good for me , it is not too big !!! my family like this new oven ."},{"reviewerName":"Harlan","rating":"5.0 out of 5 stars","reviewTitle":"Great oven for someone to bake or roast","reviewDate":"September 15, 2019","reviewText":"Sorry, this video is unsupported on this browser.\n I bought this oven for while now so I decide to write small review base on my own experience. This oven is air dry oven run by electric it come with couple cooking tools like trays, basket, some other grill bar for you to roast chicken, ribs , fish ect. i just upload a short video grilling chicken wing it’s very easy to use it has 10 auto key to push like cooking grill chicken bake fish franch fries bake pizza shrimp even bake cake each those option already has preset time and temperature so pretty much just put your item into this oven tap the bottom and you good to go. For cleaning part you have to worry much it’s very easy to clean u can remove those used trays or other cooking tool into dish washer and done. My wife love it she like it more than the one she bough from Walmart I think it call black+decker oven"},{"reviewerName":"Mei","rating":"5.0 out of 5 stars","reviewTitle":"good","reviewDate":"August 20, 2019","reviewText":"Sorry, this video is unsupported on this browser.\n When I bought this air fryer, I saw a lot of brand air fryers. The original intention was that the air fryer could be used without oil. It was relatively healthy. Recently, I have been working out in fitness. There are also children eating chicken wings and chips at home. Unhealthy, read a lot of styles, and finally saw this powerful, can be used as an air fryer, can be used as an oven, can also be dried, bought back and tried to test the chicken wings feel good, other functions will be slowly studied in the future"},{"reviewerName":"Anet","rating":"5.0 out of 5 stars","reviewTitle":"Love this thing!","reviewDate":"August 17, 2019","reviewText":"I think I’m in love with this thing! It’s so easy to make dinner for my husband and I. Dinner is ready in 30-45 min! It has 2 racks so you can add meat on one and some veggies on the other and call it a day! I made buffalo wings on it today and they were super crispy! Not to mention a whole lot healthier than frying them!"},{"reviewerName":"Don Frye","rating":"5.0 out of 5 stars","reviewTitle":"Air fryer you can count on","reviewDate":"September 27, 2019","reviewText":"Really good size. Has drip tray and two slide out trays that can be in any of 3 height levels. Even has a rotisserie bar for chickens and a rotisserie basket. I haven’t tried these however should work well. We have done hot dogs, fried chicken strips, fish and even rib eye steak. They all came out great. In fact, the steaks were as good as using our gas grill. We also made bowls and chips out of tortillas. Put a little cooking oil on them to crisp them up. I like this oven style unit better than I think I would like pull out basket type. It has a glass window and light so you can see progress. That’s important to me because I am experimenting with how to best prepare different foods. We still use our stovetop and cookware, but this oven is a great addition to our kitchen."},{"reviewerName":"AmazonRulez","rating":"5.0 out of 5 stars","reviewTitle":"Healthier, Crispy Chicken Anyone?!","reviewDate":"August 23, 2019","reviewText":"I got this yesterday; tried it on chicken drumsticks (with five spice seasoning and garlic powder only) this morning...big hit with my family. My son was surprised to hear I cooked the chicken without oil. Highly recommend it! I just hope it lasts; made in China."},{"reviewerName":"daniela cardenas","rating":"5.0 out of 5 stars","reviewTitle":"Way faster alternative","reviewDate":"October 25, 2019","reviewText":"I am so in love with this fryer! It’s such a beautiful design which is why I was initially drawn by it, looks super modern and I thought its definitely going to match all of my stainless steel fridge and microwave. Well I wasn’t wrong, this fryer/oven is so cute but not only that; it’s extremely convenient. I’ve never owned anything like it before, very nice, I have used it to air dry my vegetables like potatoes and carrots, instead of having to put in inside the oven and wait to it to pre heat and then wait an additional 40 minutes I just put them here, touched the button that displayed dries and 15 minutes later I was serving some delicious potato wedges and carrot. Absolutely everyone that has seen it HAS to ask, where did I buy it, how much was it etc. such a great item to have, I’m excited to try it for baking. I do have to say that when I used it the first time I didn’t like the smell and weird taste it left on my chicken nuggets but that was my fault because I didn’t read the owners manual where it specifically tells you to wash the inside before first use so definitely clean and wash well before using. Overall I would highly recommend to anyone."},{"reviewerName":"Rajiv ranjit","rating":"5.0 out of 5 stars","reviewTitle":"Helpful for healthy and deliciouse food.","reviewDate":"August 19, 2019","reviewText":"The reason to but this air fryer oven is to have healthy food. Actually I have joined \"Crossfit 6 weeks Challenge\" and my trainer suggest me to have chicken breast without ani oil anf fat to loose body fat. So, I did some research and finally I bought this air fyer oven and it meet my expectation. I got one receipe book with it which is bonus for me. I have used it ever since I got this. I really like this air fryer oven....5 star out of 5 star.🙂"},{"reviewerName":"shama","rating":"5.0 out of 5 stars","reviewTitle":"Easy to cook and clean.","reviewDate":"August 17, 2019","reviewText":"Great for preparing meals and dehydrated fruits.I was pleasantly surprised by how much functions it got going. this is a great little appliance. This unit is basically a mini convection oven and it works best with proteins. I cooked chiken and salmon, they turned out nicle and the chiken tastes like BBQ! And the good poin is that it no need to oil for cooking.. you can select the presets based in your food, cooking, baking, or frying.."},{"reviewerName":"Macho Man","rating":"5.0 out of 5 stars","reviewTitle":"The Chicken Was Amazing","reviewDate":"August 20, 2019","reviewText":"I have been hearing good things about air fryers so I finally decided to get one and I was not disappointed. I’m very impressed with this fryer. It has plenty of room so you can cook two layers of food or larger items like rotisserie chicken. I cooked “Amazing Chicken” (google it for recipe). It turned out great and cooked in half the time it would have in a regular oven. It is easy to clean too with removable drip tray and racks. I highly recommend this product."},{"reviewerName":"Mr&MrsGM","rating":"5.0 out of 5 stars","reviewTitle":"Highly recommended!!","reviewDate":"October 26, 2019","reviewText":"Best purchase ever... I took some time before making a review on this product and I must say this is a must have for every kitchen worldwide.\nTrust me... We looked through every single air fryer online before choosing this and I’m happy we got this one.\nI love how the fry foods taste and the fact that it requires little to no oil is really amazing. I didn’t think the chicken would taste so good... my husband and I were blown away... we barely use the stove to cook since buying this.\nIt’s very easy to clean up and is definitely a healthier way to cook. Just buy it..."},{"reviewerName":"Ella","rating":"5.0 out of 5 stars","reviewTitle":"so so so great ！","reviewDate":"August 13, 2019","reviewText":"It is so good!this is a all in one oven !and very easy to use! It has many kinds of button for food like steak ,chicken ,french fries ,cake,fish,sausage and so on! You just need to put the food in it and select the food button! Wait few minutes!a delicious food is coming It’s oil free! It’s healthy for children! My son like the french fries very much! And the size is enough for a family with 2 kids !it’s 10.6QT !"},{"reviewerName":"Zach Williams","rating":"5.0 out of 5 stars","reviewTitle":"Effecient Advanced features Air Fryer","reviewDate":"October 28, 2019","reviewText":"My family and I are trying to eat healthier but we love crunchy foods that are usually cooked in oil. The air fryers are a great way to get that texture. This air fryer inlike others is large enough to cook a whole meal for my family. There are three trays meaning I can cook meat veggies and potatoes at the same time. There are so many functions to quickily cook something with the push of a button. This is very convient. The screen is simple to work, but also very sleek and modern. The fryer heats up very fast with quick cook times. There is also a rotisary feature which is neat. I can cook a whole chicken evenly. I use this device all the time now. There are so many different things I can do. It is very comprable to othet much more expensive air fryers"},{"reviewerName":"Robert","rating":"5.0 out of 5 stars","reviewTitle":"perfect air fryer oven","reviewDate":"August 20, 2019","reviewText":"This air fryer oven works very well. I can use it for baking also air frying. It's very easy to use and helps me make healthy and delicious foods. It's also made out of high quality material, so it's very safe and durable. It's very to clean as well."},{"reviewerName":"Slim","rating":"5.0 out of 5 stars","reviewTitle":"My first step towards a healthier eating","reviewDate":"October 5, 2019","reviewText":"After heard and tried several delicious dishes cooked by using air-oven by friends and families, we decided to invest one for ourselves. We have been using it quite a lot in the last two weeks after receiving it... and we are very pleased with the purchase. You can simply press the mode indicator to choose the type of the food you wish to cook, i.e. chicken, fish, chips or veggies...or you could set your own temperature and time, and it ready to go . One thing I think would be even more very helpful is if they could provide more cooking instructions for a wider range of receipes, however, it is not a problem, as I can find a lot of receipes online. Overall, we are pleased with the purchase, and we found it easy to clean and use, and virtually use little or no oil for very tasty foods. Thanks"},{"reviewerName":"Meri Badran","rating":"5.0 out of 5 stars","reviewTitle":"I could not do without this, my instapot, water kettle and vitamix. Thats all I need!","reviewDate":"October 1, 2019","reviewText":"Love love love! I asked some friends about their air fryers and the advise I was given was to get a larger capacity one. This one is perfect for us. Roasted veggies, eggplant vegan parm, fries, tater tots, vegan corn dogs and chikn tenders have all turned out awesome. Baked some corn muffins, toasted bread and waffles. Only think I still prefer in the deep fryer is okra. Husband and I are very pleased. Clean up is a breeze. Warm water, soapy soft sponge then ready for next use. I could not do without this, my instapot, water kettle and vitamix. Thats all I need to whip up a delicious meal!"},{"reviewerName":"Linda Davis","rating":"3.0 out of 5 stars","reviewTitle":"Would not recommend due to smell of plastic or something.","reviewDate":"The manufacturer commented on the review below","reviewText":"This machine has a smell, like plastic or something. I let it heat up, but smell did not go away. Ayway , I rotisseried a chicken which smelled wonderful while it was cooking, but when it was done, it had that plastic taste to it. I didn't like having to use the screws to keep the chicken in place either. What genius came up with that? The element at the top does get hot which makes it different from a microwave. I might be returning because taste is everything."},{"reviewerName":"Joshua","rating":"5.0 out of 5 stars","reviewTitle":"it is great too and cooks quick","reviewDate":"August 23, 2019","reviewText":"Never used an air fryer before but I’ve been reading all these articles about how healthy and quick it is so decided so give this one a try. Really uses hardly any oil and Im not a a very good cook but i can make juicy and pretty lightly fried chicken in like 25-30 min - that’s my favorite. And it’s so consistent. it is great too and cooks quick. Can do potatoes and all sorts of stuff."},{"reviewerName":"K. McCoy","rating":"5.0 out of 5 stars","reviewTitle":"Where has this air fryer been all my life??","reviewDate":"October 28, 2019","reviewText":"It is not an overstatement to say that I LOVE this air fryer. Since opening the box Friday night we have made chicken fingers, french fries, apple pie and flank steak. It's perfect for apartments where you can't have a smoking frying pan but you still love your steak juicy inside and carmelized on the outside. OMG this thing is amazing. It's fast, fits easily on the counter and is unbelievably easy to clean! I find I have to cook things longer than the directions but it's still far faster than oven or stove. Best kitchen purchase ever."},{"reviewerName":"Fay","rating":"5.0 out of 5 stars","reviewTitle":"Highly Recommended for someone who is looking for a Air Fryer","reviewDate":"October 6, 2019","reviewText":" I am a big fan of air fryer, already had one of the older models and used for more than a year. Compare to my old air fryer, this one has a larger capacity and double layer so I can cook two things at the same time. I especially liked the see-through window and the light on/off function so that I can watch the progress when cooking. The grilled salmon turned out to be juicer and tender inside than my old air fryer. It is like a desk-top oven with an air frying function. I liked it very much."},{"reviewerName":"Maggie wu","rating":"5.0 out of 5 stars","reviewTitle":"Make cooking is so easy","reviewDate":"September 21, 2019","reviewText":" I bought this as my first air fryer but I absolutely love it,I thought I would use it once in while but it is so easy to use and the recipe book is so easy to follow,so since I getting it i have used it every single day. It make ererything hot and nice and crispy. Cooking has never been something I enjoy but I know it’s important to provide healthy meals for my family. Anything that makes it easier is winner for me.it’s super easy to clean too, I don’t use the washing machines,just put some soap with sponge , light rubbing,it will become like a new one, so happy to have it"},{"reviewerName":"Maggie","rating":"5.0 out of 5 stars","reviewTitle":"Best kitchen appliance EVER!","reviewDate":"September 12, 2019","reviewText":"I am all for healthy living and cooking is my passion. Having this air fryer I have abandoned everything else in my kitchen. I make my morning eggs sunny side up, my air fried veggies for lunch and a WHOLE rotisserie chicken for family dinner. Clean up doesn't really exist since all the parts are dishwasher safe and get cleaned very easily. Such a time improvement - my whole family loves it! Since we use it daily it just stands on the kitchen counter looking pretty sharp. Thank you for a great product! So happy!"},{"reviewerName":"masiel chen","rating":"5.0 out of 5 stars","reviewTitle":"totally impressed with this product","reviewDate":"August 21, 2019","reviewText":"LOVE this item, especially the large capacity of the housing and how fast it cooks. I've had numerous brands of air fryers and so far this is the best I've ever bought .This would be perfect for people want to eat something other than microwaved mush."},{"reviewerName":"Becka11","rating":"5.0 out of 5 stars","reviewTitle":"Cooks evenly","reviewDate":"September 19, 2019","reviewText":"I've been wanting to try an air fryer for a while now and u am happy with the purchase I have made. The air fryer is large it feels sturdy and high quality. It came with to grated pans, a rotisserie basket and skewer. It also comes with a drip tray for easy clean up. The first thing we tried was tater tots that we had in the freezer and I'm impressed with the way the cooked. They were evenly cooked, nice and crisp on the outside. I loved not dealing with the oil mess when trying things"},{"reviewerName":"Loria N","rating":"5.0 out of 5 stars","reviewTitle":"Easy to use","reviewDate":"October 8, 2019","reviewText":"I bought this air fryer oven only a couple weeks ago and it has already become the most used item in my kitchen. I gave my old toast oven away and I didn’t use my Philips airfryer since I got this fryer oven. It can do so many things. I have made chicken wings, lamb legs, fish, fries and so on with this oven. The food are so delicious. My kids love all these foods. It is easy to use and clean. So far I am very happy with it. I am looking forward to cooking lots of food with it."},{"reviewerName":"Katherine Elofson","rating":"5.0 out of 5 stars","reviewTitle":"Great for leftovers","reviewDate":"August 27, 2019","reviewText":"We've been debating on getting an air fryer for quite some time. I feel that we buy new appliances and the hardly use them. However, this air fryer is great because it works phenomenally on leftovers.\n\nOnce you get to know the machine, things that are 2 days old tastes new. Great for a busy family!"},{"reviewerName":"Wendy","rating":"5.0 out of 5 stars","reviewTitle":"Quick cooking, easy cleaning and makes delicious food","reviewDate":"November 9, 2019","reviewText":" This air dryer oven is awesome! It’s easy to use and it’s quick to finish baking/cooking the food. The flavor of the food cooked in it is also good, I know that because my kids loved the chicken, I had to put in more chicken just for them. It’s also easy to clean so you won’t feel the need to use it less often because its hard to clean. Since this is easy to clean, I don’t need to worry about the cleaning much."},{"reviewerName":"kevin","rating":"5.0 out of 5 stars","reviewTitle":"pretty and easy to use","reviewDate":"August 29, 2019","reviewText":"The appearance is very good-looking oven, if you are a beauty control, please buy it directly. I tried chicken in my shop today, but I set the time too long, I thought the chicken would be tough, but it didn't, it would be perfect if the time was set to 12 minutes (the recommended time in the manual is 12 to 15 minutes, I set 15 minutes), in a word, I like it very, very much hahaha"},{"reviewerName":"Ali","rating":"5.0 out of 5 stars","reviewTitle":"Kitchen item","reviewDate":"September 4, 2019","reviewText":"Very easy to use and really practical to clean. It is a unique device for those who have time problems and those who are troublesome to cook. It is both practical, delicious and quick. There is so much apparatus in it that we have difficulty deciding which ones to use."},{"reviewerName":"Amazon Customer","rating":"3.0 out of 5 stars","reviewTitle":"limited use product disapointed","reviewDate":"October 23, 2019","reviewText":"comes with flat plates 2 they don't hold enough for a family, rotisserie made to hold chicken not a roast.\nneeds a basket for fry's. don't recommend for family, very low volume , much better units on market\n\nI'm 86 and live alone works for me as a fill in."},{"reviewerName":"Shan chen","rating":"5.0 out of 5 stars","reviewTitle":"So happy we bought this oven","reviewDate":"September 21, 2019","reviewText":" I bought this product as my first air fryer oven . This air fryer is everything it claims to be. So far we have cooked pork chops, shrimp, yellowtail neck and sea bass. We’ll do a lot of grilling in the future. All you do is make flavor in your food than put it to oven , wait about 15-20 minutes, your done your job! Everything comes out perfectly. The fryer is super easy to use and clean up. I love this oven and highly recommend it."},{"reviewerName":"desertdiamond","rating":"5.0 out of 5 stars","reviewTitle":"Awesome product!","reviewDate":"October 10, 2019","reviewText":" I have not tried all of the functions of the power air fryer yet. What I have cooked in it has come out well. It is easy to set, nice machine. It opens up a world of possibilities cooking whiteout oil. The dehydration setting is perfect for preparing sweet healthy snacks for kids. Love the convenience of not turning on the big oven. Easy to clean and large cooking capacity too."},{"reviewerName":"phydeaux86","rating":"5.0 out of 5 stars","reviewTitle":"The Rotisserie made the Best Chicken !!","reviewDate":"August 29, 2019","reviewText":"I cooked a chicken in the Air Frying using the Rotisserie, Also pizza and bacons, they came out perfectly tender and crispy. The Air Fryer also is great since it has a window I can see the food as it cooks."},{"reviewerName":"Jeffery Z","rating":"5.0 out of 5 stars","reviewTitle":"AWESOME appliance","reviewDate":"August 21, 2019","reviewText":"This air Fryer is so so AWESOME..its big enough for 8piece of large chickwing. Which my whole family. They Also come with one booklet you can follow with cooking style. For me its goog enough for to Use every single day."},{"reviewerName":"M. Shilling","rating":"1.0 out of 5 stars","reviewTitle":"Update- Now Disappointed","reviewDate":"August 28, 2019","reviewText":"Update. We’ve used this air fryer at first it worked great after a few uses it doesn’t seem to get enough heat to dry. Very disappointed; wanted to return the air fryer but the window to return this item has past."},{"reviewerName":"Big Jon","rating":"5.0 out of 5 stars","reviewTitle":"Very convenient","reviewDate":"November 3, 2019","reviewText":"This is basically a tiny convection oven. I find that I have stopped using my oven. It comes with a fry basket and a rotisserie, but the oven itself has 3 baking pans that allow baking at temperatures up to 400F. The timer prevents burning or overcooking. I can cook an entire dinner for three using nothing but this little air fryer."},{"reviewerName":"Amy C.","rating":"5.0 out of 5 stars","reviewTitle":"Wonderful product!!!","reviewDate":"November 7, 2019","reviewText":"I got this air fryer oven for my mom, she really like it. She said it is very easy to use and clean, so far she already used oven to made chicken wings, bake potatoes,grill cheese sandwich, cake, and roast chicken. She love it! And compare with other big stove oven, this fryer oven save a lot more engergy. Wonderful product!!!!! Thanks!"},{"reviewerName":"Sheryl","rating":"1.0 out of 5 stars","reviewTitle":"Didn’t cook evenly","reviewDate":"October 27, 2019","reviewText":"Everything I made frozen, burnt on the top and still frozen on the bottom. I sent it back."},{"reviewerName":"A. Neiffer","rating":"5.0 out of 5 stars","reviewTitle":"Great kitchen tool...with my homemade dribble guard","reviewDate":"November 11, 2019","reviewText":"I purchased this amazing oven because of it's footprint size and basic features. I am very pleased with the product. A dribbling tray on the first use made a mess of the oven door. I also managed to touch a knuckle to the hot door as I was removing that tray. Bread crumbs from croutons fell into the door hinge, and were not easy to brush out. So, I set about coming up with a solution. By trimming a plastic cutting mat, so part slides into the oven (above the drip tray), yet covers the entire open door, dribbles fall onto the mat, I don't accidentally touch the hot surface and a quick wipe takes care of any cooking splatter on the window. Hope this idea helps others as much as it helped me."},{"reviewerName":"Yuka","rating":"5.0 out of 5 stars","reviewTitle":"love it ！","reviewDate":"October 21, 2019","reviewText":" Love this air fryer! This is my first time using an air fryer but it was very self explanatory since the light-up buttons show pictures of what foods you’d cook. You can also just warm food up by pressing the start button. This device has made my time in the kitchen in half! I tried making mini pork ribs doused in sauce, and all I had to do was choose the temperature and time. It came out great and saucy! I can also now make my own fried items such as French fries without worrying about the oil content! I used the rotisserie container to evenly cook my fries and it came out crispy and fresh!"},{"reviewerName":"Joy of Heart","rating":"5.0 out of 5 stars","reviewTitle":"Follow the instructions!","reviewDate":"September 8, 2019","reviewText":"This small oven is like a convection oven with basket and grilling shelves. I do like it but you really need to follow instructions for best results."},{"reviewerName":"Kelly M.","rating":"5.0 out of 5 stars","reviewTitle":"Great appliance","reviewDate":"September 23, 2019","reviewText":"This was my first air fryer. It works very nicely. All the food we have warmed, toasted or cooked have been great. Temperature and timing will take a little adjusting to. We noticed a little odor the first couple of uses, but it soon went away. That was not a problem, just like most new appliances."},{"reviewerName":"Nicole L","rating":"5.0 out of 5 stars","reviewTitle":"Great product !","reviewDate":"October 14, 2019","reviewText":"I have Owned a few different air fryers in the last year and this one so far is the best! Has lots of room unlike some of them I have owned! Love all the different settings, and the double layer makes it super easy to cook multiple things at once. The best part is you don’t have to heat your whole house up to make dinner! Highly recommend !"},{"reviewerName":"Michelle Catagnus","rating":"5.0 out of 5 stars","reviewTitle":"Easy to use air fryer","reviewDate":"August 11, 2019","reviewText":"This let's you both air dry and rotisserie! Low calorie cooking made easy."},{"reviewerName":"Jenny glikin","rating":"5.0 out of 5 stars","reviewTitle":"Worth the money","reviewDate":"September 3, 2019","reviewText":"This is an attractive air fryer and it has a large capacity but does not take up too much space. It heats up quickly, I love the sturdy racks, and how easily they clean. The warranty is also better than most. I hope to have this air fryer for a very long time."},{"reviewerName":"KiKi","rating":"5.0 out of 5 stars","reviewTitle":"Really great, I like it very much.","reviewDate":"September 12, 2019","reviewText":" Nowadays, small appliances are very convenient. This rotating function of this oven is great, and it can be heated 360 degrees. The chicken wings that are made out are soft and the taste is great. The whole family said that it is delicious."},{"reviewerName":"desandmatt","rating":"5.0 out of 5 stars","reviewTitle":"Quality Product","reviewDate":"August 28, 2019","reviewText":"Very nice, well made, very convenient! I am very pleased with the air fryer!"},{"reviewerName":"Jacobo","rating":"1.0 out of 5 stars","reviewTitle":"Just Garbage/junk","reviewDate":"The manufacturer commented on the review below","reviewText":"We received this item plug it, and nothing happened. We tryied to look where is the on/off botton ( hard to find) we did and nothing. Don't waste your time with this one!!!! I am not a person who does reviews but this one deserved one. JUNK"},{"reviewerName":"Linda","rating":"5.0 out of 5 stars","reviewTitle":"Good helper for people who don’t know how to make dinner","reviewDate":"October 3, 2019","reviewText":" I bought this one for my dad for his birthday! My dad is so impressed with this new cooking help!!! He said: it’s a huge hero in his life ! Finally,He can make dinner for himself without my mom! It’s easy to use, easy to clean, and it’s way healthier than fried food in the oil !!! Highly recommended!"},{"reviewerName":"Lisa63","rating":"5.0 out of 5 stars","reviewTitle":"Look no further, this is the one!","reviewDate":"September 17, 2019","reviewText":"This is it! Finally got the one I love. This product is built well and cooks great! Even my husband likes it and can use it!"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Presets are spot on!","reviewDate":"November 7, 2019","reviewText":"Great Air fryer hands down, I waited until my Family tried all the presets to post this review. My wife amd kids love it. It seems as if your meal is light and healthier as far as fries, chicken, burgers. Might just be me. Easy clean up is a big plus also. Worth every red cent. Thank you"},{"reviewerName":"shreve","rating":"5.0 out of 5 stars","reviewTitle":"You have to own one!","reviewDate":"November 5, 2019","reviewText":"Amazing appliance! We do most of our cooking in it! Fries,bakes,broil etc,etc"},{"reviewerName":"enids!","rating":"5.0 out of 5 stars","reviewTitle":"Very large cooking area!","reviewDate":"August 27, 2019","reviewText":"Super easy to use and cleans up easily!\nI’ve cooked chicken , pizza, veggies and fries.\nFrench fries do take a long time to get crispy. I love the basket for cooking fries."},{"reviewerName":"Ronald Ahlstrom","rating":"5.0 out of 5 stars","reviewTitle":"Glad I did my research and got this air fryer","reviewDate":"October 14, 2019","reviewText":"This is our first air fryer and it was important that it worked just as well as the deep fryer for taste, convenience and time. It turns out that my family likes the air fryer much better than using oil. It gives us crispy fries, great pork chops and chicken and even reheats pizza faster and better than the oven."},{"reviewerName":"Marina","rating":"4.0 out of 5 stars","reviewTitle":"Frier not great","reviewDate":"October 14, 2019","reviewText":"I think it is decent but I do not think it fries well. I like the way it cooks very evenly. The door is flimsy. It’s not worth the money. Also the bottom tray doesn’t work well. Only the top tray cooks."},{"reviewerName":"Xu","rating":"5.0 out of 5 stars","reviewTitle":"Easy to use, nice fryer","reviewDate":"August 21, 2019","reviewText":"I love this fryer so much,the instructions are easy to read and understand.Have use it as toaster.fryer..... I had anxiety during my first cooks, It is really going to work like the day. I have zero complaints and the price is good for me."},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Must buy!","reviewDate":"August 28, 2019","reviewText":"Absolutely a great purchase!"},{"reviewerName":"Steven","rating":"5.0 out of 5 stars","reviewTitle":"Nice fryer","reviewDate":"October 16, 2019","reviewText":"This has been the best fryer I’ve ever used. It’s easy to use and cleaning isn’t complicated. There’s minimum splatter when I fry my food. I’m super satisfied with this fryer."},{"reviewerName":"Cheryl osbornn","rating":"3.0 out of 5 stars","reviewTitle":"Very disappointed","reviewDate":"The manufacturer commented on the review below","reviewText":"Cooking space is actually very small."},{"reviewerName":"karina","rating":"4.0 out of 5 stars","reviewTitle":"GREAT AIR FRYER","reviewDate":"September 20, 2019","reviewText":"I do love the way the food comes out, it is kind of pricey though but its a keeper. Food comes out perfect."},{"reviewerName":"Coolbrezze","rating":"5.0 out of 5 stars","reviewTitle":"Outstanding Product","reviewDate":"October 16, 2019","reviewText":"We Use Our Fryer Just About Everyday We Love It And Would Buy It Again"},{"reviewerName":"Ji Y","rating":"5.0 out of 5 stars","reviewTitle":"Little noisy but easy to use","reviewDate":"November 7, 2019","reviewText":"Good products"},{"reviewerName":"machi","rating":"4.0 out of 5 stars","reviewTitle":"Easy","reviewDate":"November 3, 2019","reviewText":"Great!"},{"reviewerName":"Dr.cabral","rating":"5.0 out of 5 stars","reviewTitle":"Love it","reviewDate":"October 12, 2019","reviewText":"I love it"},{"reviewerName":"ryan","rating":"5.0 out of 5 stars","reviewTitle":"Better than expected","reviewDate":"October 10, 2019","reviewText":"I love this product. The food taste great and cooks fast."},{"reviewerName":"Kevin Stotts","rating":"4.0 out of 5 stars","reviewTitle":"Easy clean up","reviewDate":"October 30, 2019","reviewText":"Easy to use."},{"reviewerName":"Loved39yrsSTLgoin","rating":"5.0 out of 5 stars","reviewTitle":"Best Air Fryer ~ Best Company Five ⭐️","reviewDate":"October 3, 2019","reviewText":"We’re excited to begin using this, BUT!!!\nHow do I reach out to the manufacturer to ask for ALL the parts? We only got the basket and two pans! No rotisserie clamps, and none of the hardware we see shown at all. No skewers nothing stainless Steele except the rotisserie rod and the basket.\n\nWhat do we do now?\n\nUpdate October 5, 2019\nI’m just getting to this update. We’re REALLY impressed with Innsky Direct!!!\nThey’ve already contacted us and are taking care of the missing parts. Unbelievable customer service. We’ve used the racks and this machine works great!\n\nAs soon as we get the parts, this is shooting straight up to five stars. Really happy so far.\n\n10-10-2019\nAll missing parts have arrived 👍\nWe LOVE this oven. Huge area inside. Beautiful crispy food. Excited to rotisserie an organic free range bird! Best service EVER , number one ☝️ so far! Highly recommend this Air Fryer and this Seller ⭐️⭐️⭐️⭐️⭐️"},{"reviewerName":"Debra De Los Santos","rating":"5.0 out of 5 stars","reviewTitle":"Great item!","reviewDate":"November 5, 2019","reviewText":"I love the air fryer oven. Unfortunately, I could not use it as I used my stove's glass top surface for the base and the oven bumped up against the stove's knobs and I burned the plastic on the bottom of the pot before I could use it. I might have left this rating on another product by mistake."},{"reviewerName":"Kenneth Hooper","rating":"5.0 out of 5 stars","reviewTitle":"It's big enough to cook a decent amount of food.","reviewDate":"October 1, 2019","reviewText":"I think it's the best air fryer on the market. It's worth the price. I can cook 10 chicken wings at one time."},{"reviewerName":"joseph","rating":"5.0 out of 5 stars","reviewTitle":"Goodbye stupid metal basket hello oven!","reviewDate":"August 8, 2019","reviewText":"First off! I HATE AIR FRYERS WITH METALS BASKETS! That’s the first part to break or rust or bend or the coating starts to peel and blah blah blah.... I’m sick of it.... I’ve went through possibly 3-4 air friers to all find out that the basket is the weak point. This has competed my life, it does everything a normal air fryer would but better. I have used it three times and it works like a charm! Came packaged great and looks luxury looking. I’m so happy to have trays no more wasting money on the parts, but I must say the chicken roasting option is interesting, haven’t tried but I want it say that’s a awesome add on. Also great quality, same as every other air fryer plastic with metal but the oven door is strong and nice!"},{"reviewerName":"A@#@*9! User","rating":"5.0 out of 5 stars","reviewTitle":"What a great machine!","reviewDate":"August 12, 2019","reviewText":"Wow. What a machine. I have been wanting an air fryer but I wanted something that could do more. This machine has so many ways to cook food! It is very user friendly. I have tried chicken and beef and potatoes in this so far. The food is cooked without oil making it healthier and it comes out perfectly crispy and delicious. I love that it comes with accessories like the skewers to make kabobs. The interior is stainless which makes it very easy to clean and the exterior is gorgeous. It looks great on my counter 24/7. The drip tray is easy to clean and reuse. I'm no professional cook but even my husband has been commenting on the delicious food that comes out of here. I have tried several gadgets more pricey than this without the results. Just give it a try!"},{"reviewerName":"FreedomWins","rating":"4.0 out of 5 stars","reviewTitle":"Seem's Okay......","reviewDate":"The manufacturer commented on the review below","reviewText":"Have you noticed all the reviews of this air fryer read like they were all written by the same individual?\n\nI actually bought and have used this item.\n\nPros:\nNice design\nEasy to use\nPlenty of accessories\n\nCons:\nEmits a strong plastic or electrical smell.\nSmell transmits to food. (currently running it on high under the range hood, to burn off the whatever).\nA quail might fit the rotisserie or perhaps a Cornish game hen.\n\nI have not used the basket yet but it looks well made and installs easily.\nI did wash out the inside and the trays before using.\nFrozen hash brown patty came out perfectly prepared this morning, aside from the chemical taste.\nWarmed over stir fry was okay if a little dried out, again chemical taste.\n\nHopefully it will lose the odor and last many years.\n\nOne odd thing... It had a sticker on the front glass that said do not remove, however, in the instruction manual it said to remove all stickers. I opted to remove it and boy was that a chore. It took a lot of elbow grease to get the sticker's adhesive off the glass."},{"reviewerName":"MacBHoward","rating":"5.0 out of 5 stars","reviewTitle":"First really great air fryer for a reasonable price","reviewDate":"August 11, 2019","reviewText":"I picked this air fryer after reading reviews and saw that the company responded to every negative review with an offer to make things right. It was a good decision. I have been using another air fryer since last October. I like to make frozen fish fillets in it, but the non-stick surface peeled off after only a few uses, and I’ve been lining it with parchment paper since. This air fryer has real non-stick surface on it’s trays. I’ve already used it to make fish, and the fillets came out perfectly. I also made fries, and the rotating basket is great. Clean up is super easy. The only suggestion I offer to the company would be to use a label on the glass that has less glue. It has to be removed before use, and it took some effort. That wasn’t enough to take away even a fraction of a star. The bottom line is that this thing looks great, cooks great, and cleans up great. Here’s the best part...you can cook enough food in it for supper! Because it has two trays, I was able to cook 4 fillets at the same time. If the fish fillets are large, I can still cook enough for two people instead of one at a time like I did with the last fryer. I should also mention ease of use. I was able to add cook time, increase and lower temperatures, and turn on an inside light to check doneness while the food cooked. I would give it more than 5 stars if I could."},{"reviewerName":"🌸Flower🌸Girl🌸","rating":"5.0 out of 5 stars","reviewTitle":"Upgraded speed saver","reviewDate":"September 1, 2019","reviewText":"I upgraded air fryers and I have to say I am super impressed with this one. I love that you can see through and check your food. I made a rotisserie chicken, that is a major bonus. The chicken came out perfectly crisp and done with great flavoring ( added seasoning) I have also cooked skirt steak and it came out perfect, very juicy no dryness. I’m impressed. I love the 2 racks. It has saved me so many night when my kids have had school the next day and we were running late. I call it speed cooker. My kids now complain when I cook on the stove top and not the air fryer. Very convenient & you can cook just about everything in this air fryer. When I am done, I wipe it out and it cleans up really nice. I will also be purchasing another one for my mother in law at Christmas time. I think it would make perfect Christmas gifts. I use this air fry more then my last as it hold so much more food then the standard ones. Now that I have this one, I don’t know how I ever lived without one."},{"reviewerName":"Claudene R.","rating":"2.0 out of 5 stars","reviewTitle":"Ok.","reviewDate":"October 24, 2019","reviewText":"The recipe book has great ideas however the device should come with a book that informs the customer on ways to cook things other than the recipes. For example a book separated by type of cooking i.e. - rotisserie, frying, how to use the dehydrator to make jerkey (all the features that this device supposedly has). The device comes with two books, recipe and maintenance manual. Also, the light died the first day. I saw it flash when I first plugged it in and once more after that and haven't seen it work since and I've had it for about a month or so now. I've pressed the light button when the device is on as directed and no luck. The icon just blinks....didnt complain because i didn't want to pack up this huge thing to return. I'll just use my kitchen light. We just guestimate what temps we think meats may cook on and the times compared to the recipe book then pray lol the food overall has come out good and pretty crispy. Wish the device were cheaper for what we got, but overall not too upset with the purchase."},{"reviewerName":"Misty T.","rating":"5.0 out of 5 stars","reviewTitle":"Money well spent!","reviewDate":"September 11, 2019","reviewText":"Wow! I've been wanting a air fryer for a long time, and finally broke down and made the purchase. Kicking myself in the butt for not ordering much sooner. This air fryer has been such big part of my life since the purchase. When running late on the go, or just simply not feeling well, I throw some chicken tenders and fries in and it's done in minutes. ( cooks much more than chicken tenders and fries, was just a example)\n\nI've also made pizza and even a rotisserie chicken in this. No grease is a huge plus. More healthy ( atleast makes me feel like I'm eating more healthy haha) and less mess. It has been very easy to use and clean. Can even put the removable parts in dishwasher :)\n\nIt comes with so much accessories,which is a huge plus as well. I don't think I could have chosen a better Air fryer. This is definitely the all in one, go to fryer. Well worth the money spent!"},{"reviewerName":"Tina H.","rating":"5.0 out of 5 stars","reviewTitle":"Healthy Multi-Functional Air Fryer","reviewDate":"August 22, 2019","reviewText":" This is not a traditional oven; it has multiple functions that help to maintain a healthy diet. I have been using this primarily to dehydrate fruits and chicken breasts for healthy snacks for the kids.\nThe fryer has an adequate capacity large enough to cook a whole chicken. It will provide enough food for a family dinner. Cooking is made so easy with the LCD manual panel. Press dehydrate for instance and then set timer and temperature. And there is the handy light to check your cooking status. There are so many accessories coming in the package that provides the oven with diverse cooking styles. You do not need to take a cooking course to make a delicious meal on your own. And most importantly, you can enjoy turkey jerky and lamb kebobs without the guilty feeling with the cholesterol."},{"reviewerName":"Nicole","rating":"5.0 out of 5 stars","reviewTitle":"Great product","reviewDate":"September 5, 2019","reviewText":"I was looking for an air frier to replace my old broken one and came across this all in one air frier oven. I have to say that I’m very impressed how easy it is to operate and clean. I have been using it four times so far. I made potato chips and chicken wings. They came out pretty good. This oven is well designed, it has big capacity even though it looks smaller than my regular countertop oven. It cooks easily for the whole family. I replaced my countertop oven and air frier with this all in one piece. I am happy with this purchase."},{"reviewerName":"N. King","rating":"5.0 out of 5 stars","reviewTitle":"Ready for holiday cooking","reviewDate":"October 26, 2019","reviewText":"The holiday season is officially upon us. I got this air fryer oven to help with my holiday cooking. I always have to do multiple batches in the oven due to lack of oven space. This air fryer oven is the perfect addition to my cooking gadget arsenal.\n\nI gave this air fryer oven a test spin and here is what I liked about it. The oven has a small footprint, it doesn't take up much counter space. Which is great beacuse I don't have a ton of space.\n\nThe oven has a digital display that is easy to read and use. There are several cooking presets. If your cooking chicken just press the chicken button. You can adjust the time and temperature with the push of a button.\n\nWhile your cooking the time that is left and temperature flashes on the display. The sides of the case does get hot but not too hot that you have to worry about getting burnt. There is a light button on the oven that you can press to see what's going on inside the oven. When you open the oven door to check on the food the timer does pause and will automatically resume once you close the oven door. When the food is done cooking there is a loud beep that can be heard from another room. Also when it's cooking there is an audible hum coming from the machine.\n\nThe oven has a large cooking capacity. I was able to cook 24 wing dings in one batch. They came out perfectly. I also made bacon and didn't have to flip it.\n\nThe oven is easy to clean. The drip tray is perfect for catching any crumbs or drippings. The trays are nonstick and easy to clean. I also noticed that the trays cool pretty fast once you remove them from the oven. The inside as well as the outside of the oven can be easily wiped clean.\n\nThis oven is a great addition to any kitchen. My holiday cooking time will be greatly cut in half."},{"reviewerName":"Mayank Kaushik","rating":"5.0 out of 5 stars","reviewTitle":"Much needed upgrade from my last air fryer!","reviewDate":"August 8, 2019","reviewText":"I recently upgraded to this electric air fryer oven from my last air fryer due to its large size as we couldn't get enough quantity of food cooked for 2-3 people at once with my last one.\n\nThis air fryer is not just larger, it came with more features, trays, accessories and has better frying ability as well."},{"reviewerName":"Lam N.","rating":"5.0 out of 5 stars","reviewTitle":"Working really great!","reviewDate":"November 11, 2019","reviewText":"I bought an air fryer before and it was expensive one as well. But it was a little bit too small and die after 6 mons. I was searching for another one but I wanted something different in design and this one hit my eyes. This one is amazing and work great more than what I expect. It is so much bigger and have more room to put more stuffs in.\nI was worry the most about cleaning it up but it was easy to clean up. You simply just need to pull the trays out to clean. I dont like my previous one cause everything was hidden. This one is a glass air fryer so I can watch the thing inside which is really cool. I tried a lot of different things like French fries, potato, chicken wings and meat; they were all good. I definitely use this one to fry the whole turkey for next Thanks Giving, I bet it will be great. It is a touch screen control and I love that feature so much. It is easy to use and looks so fancy as well. Highly recommend more than a regular and old style air fryer.\nP/S: I still recommend to have a foil to cover the tray so it will not be messy to clean up and save more time."},{"reviewerName":"Sandy Ruth","rating":"5.0 out of 5 stars","reviewTitle":"Makes cooking so much fun","reviewDate":"September 25, 2019","reviewText":"This air fryer oven is by far the best one I’ve purchased, I’ve received it more than a week now, and I can say that I would use it everyday if I can, I usually don’t like to cook at home, but with this oven, it just makes my cooking so much easier, and it’s also super easy to clean compared to the old air fryer I have, I just need to take out tray and soak them it water for a couple minutes and wash it. Also the see through glass just as awesome as it seems, I don’t have to shut the whole process of cooking down to check if the meet it’s cool through or not, I would definitely recommend this air fryer oven to those who think cooking is such a big work."},{"reviewerName":"GEORGE XU","rating":"5.0 out of 5 stars","reviewTitle":"Awesome Oven.","reviewDate":"October 17, 2019","reviewText":" First of all, I don’t like use my regular oven at all, either less family member or too much things to be taken care. This Air Fryer Oven shows right time and right size and right quality. I usually have it to bake cookie, fry half-baked pizza and grill my favorite sauced meat, etc. while oil fry some my regular delicious dish for dinner.\nThis is very powerful oven, safety and easy to clean too. The touchscreen, digital displaying and many accessories make so many type cooking easy and possible, that inspire my cooking soul a lot to keep trying all kind of cooking combination to tell which more delicious and flavor.\nThe most my like part is rotisserie basket and shaft, as I can roast my whole sweet potato. It is so sweet and delicious, I don’t have so many years. Another, 6 skewers are absolutely plus for my sauced flavor shish kebab.\nBTW, It is so easy to figure out how to use it w/o manual but one thing there is a red tab switch behind the window door that is for toggling place the rotisserie."},{"reviewerName":"CKH","rating":"5.0 out of 5 stars","reviewTitle":"Great oven and air fryer","reviewDate":"August 8, 2019","reviewText":"I hate having small appliances that only do one thing. This machine does it all - toaster, oven, convection oven and best of all, air fryer. Very easy to use. It is large enough to cook for a family verses the smaller air fryers on the market. It also cooks fast! I highly recommend it for small areas and it keeps the kitchen cool as it does not heat up the room in a manner similar to full sized oven."},{"reviewerName":"Alina","rating":"5.0 out of 5 stars","reviewTitle":"Cooked Cornish hen in this and produced amazing results","reviewDate":"September 1, 2019","reviewText":"This air fryer oven has many uses and I’ve cooked many different types of food with it. The first food I tried to cook with it was one of the best I’ve ever had before. The day that this item arrived, I had already gone and bought, as well as marinated a Cornish hen. After putting it in for about 35 minutes and letting it spin around, I got a delicious mini rotisserie chicken. I’ve also tried baked chicken thighs in here and they taste amazing. I plan on trying to cook some chashu next week using this and can’t wait for the results. This oven produces delicious food without the cooking time that an actual oven takes."},{"reviewerName":"Becky Blaylock","rating":"5.0 out of 5 stars","reviewTitle":"Healthy Cooking!","reviewDate":"October 28, 2019","reviewText":"This is an upscale air fryer oven that has more applications than a standard air fryer. It has the capability of being a dehydrator as well as the ability to cook a whole chicken using the included rotisserie skewer and forks. This unit has everything you need to make perfect meals every time you use it. Just right for me and my Husband. It comes with three racks, a grill pan, a tumble basket, and a rotisserie attachment for meats like roasts and chicken etc. under 3 pounds so they properly fit in the 10-quart unit and rotate properly. I am amazed as to the amount of time it takes to cook in this Air Fryer Oven. Much less than the conventional oven saving time and energy.\nI am delighted and amazed with this Air-Fryer and recommend it highly to those people looking for faster, healthier alternatives to conventional cooking."},{"reviewerName":"D. Roberts","rating":"5.0 out of 5 stars","reviewTitle":"Wonderful","reviewDate":"September 3, 2019","reviewText":"About a month ago I purchased the smallest air fryer I could find, the GoWise 2.75l. I enjoyed it so much that I decided to get a larger size. After reading all reviews I ordered the Innsky Air Fryer Oven. Last night I put my pizza (I make my own crust and my own toppings) in it and it cooked perfectly. Today, I got a 5 pound free range chicken and cooked it. It was fantastic and so fast, 45 minutes! The skin was crispy and the meat was very juicy and so good! A lot better than the deli chickens I normally buy."},{"reviewerName":"Olehippiegal59","rating":"5.0 out of 5 stars","reviewTitle":"It’s a great big air fryer love it!","reviewDate":"October 26, 2019","reviewText":"I was scared to get this because I was afraid I wouldn’t know or understand how to use it. And let me say they do not give you any instructions at all on cooking food. Gives you a little pamphlet for what comes with the air fryer. But not how to cook anything or how much time you can cook certain food. You are on your own with that. Thank goodness there are Facebook groups to get in and they will tell you what and how to cook in this AF. But I do love it. For rotisserie chicken less then a 4 lb bird and they are hard to find. But I did it was the first thing I cooked. It was so hard to figure out how to make the rod stay in place when it turned. I over cooked the bird completely my fault. I even cook biscuits in it. That was pretty good and no preheating. I’m still learning but I love it. Getting some accessories now . And no the AF never has smoked or burned anything. It’s great"},{"reviewerName":"jashrla","rating":"5.0 out of 5 stars","reviewTitle":"i love it so much","reviewDate":"August 12, 2019","reviewText":"what an amazing addition to my kitchen, really nice and easy to use.... it even saves me a lot of time from cooking, i can imagine how it makes my life so easy.... like i can do a lot of thing while preparing dinner for my family..... i love how easy it is to use and how convinient it is..... i love it so much i really do"},{"reviewerName":"qiu lin","rating":"5.0 out of 5 stars","reviewTitle":"No more fast food for me!!","reviewDate":"October 25, 2019","reviewText":"It hard to really find any cons about this product. This air fryer made my life so much easier. Normally I would heat up my overnight or frozen food in microwave but problems is that doesn't taste the same anymore. The air fryer allow you to cook fast and efficient, anything you put in comes out just like freshly cooked. For people like me who don't know how to cook and order fast food all the time, it's like paradise. So far I had used to cook a whole chicken, fish, steak, ribs and etc. They all comes out greate, and definitely saves me a lot of time cleaning and chores!!! Easy to use and adjustable. With this product every can cook without headache"},{"reviewerName":"Gamer","rating":"5.0 out of 5 stars","reviewTitle":"Very very pleased with this purchase!","reviewDate":"The manufacturer commented on the review below","reviewText":"I just purchased this air fryer last night. I want the first part of my review to detail why I chose this model and manufacturer. First, I am giving this 3 stars as of now until I get to try the model. I will change the rating based on usage.\n\nI chose this particular model and brand out of the plethora of options primarily because of the negative reviews. Yes, the negative reviews. There was a common theme: the manufacturer took the time to address the reviews and tried to make everything right with the customer. That in of itself impressed me incredibly and gives me the confidence to make this almost $200 purchase that if anything is awry or wrong, that the company will do it's absolute best to fix the issue(s).\n\nI've owned this product for a week now. I have cooked wings, pork chops, fish, a rotisserie chicken, and chicken nuggets for my kids. Everything has come out crispy and delicious. I started Keto and bought this to help me cook faster and in a variety of ways to help with my keto journey. There is plenty of cooking space. There are 2 racks, and as long as you remember to set a timer to flip the food (you do this in an oven also), then the food will come out crispy on all sides. The rotisserie chicken came out just as good as a store-bought one. There are a plethora of recipes online to look through. The pre-defined settings are spot on.\n\nMy only complaint with the design of this unit is the door, and hopefully, the manufacturer will revisit my review and address this. The left or right henge can come out of sync a little when opening and closing the door. If you're not careful, I can see the door breaking off with enough applied pressure. If you're cognizant of this as you're opening and closing the door, it won't be a problem.\n\nOverall, you will not be disappointed with this air fryer. I have used this almost every day since it arrived. Again, the #1 reason to make the purchase is that the manufacturer a) makes so far a quality product and b) will address any and all issues that you have through your comments and reviews here. That shows that they care about and stand by their products."},{"reviewerName":"Cindy","rating":"5.0 out of 5 stars","reviewTitle":"It’s really useful","reviewDate":"September 12, 2019","reviewText":" The air fryer that I bought was amazing. It’s a prefect size that I want it! After I bought it, my husband and I were using it to make a roasted chicken! We used the whole chicken itself to put it into the air oven! After few minutes, the chicken skin turned into brown color! We can smell the roasted chicken all over the kitchen! The fragrance of the chicken smell so good! It makes me so hungry! It takes less than thirty minutes to cook the roast chicken! Also, this air oven can use in different ways! I’m sure you won’t be disappointed after using it! Relatively, you will be fall in love with is air oven! It’s easy to use, to clean and to storage. On top of it, you can eat healthy food too! It’s a great product for all the family that who like to bake and cook!"},{"reviewerName":"Feng","rating":"5.0 out of 5 stars","reviewTitle":"makes fries Crispy","reviewDate":"August 26, 2019","reviewText":" It fits my small kitchen well. The operation is simple, temperature and time can be adjusted easily. Pretty convenient to set up.\nGreat machine that can cook food differently and in a healthy way. Safer and healthier.\nPretty useful, I love the fries it makes very Crispy and chicken wings Crispy and juice inside! very satisfied. Love this product."},{"reviewerName":"Mike & Kim","rating":"5.0 out of 5 stars","reviewTitle":"Easy to use- healthier and quicker!","reviewDate":"September 5, 2019","reviewText":"It’s a very large appliance, but I expected that having a family of 6 and needing the cooking space. It takes some time getting used to how long of a time to cook, but knowing that it takes significantly less time to cook food and that it’s healthier because I’m not frying the food is a total win! Glad that I got this air fryer!"},{"reviewerName":"MariS","rating":"5.0 out of 5 stars","reviewTitle":"I love this little oven!","reviewDate":"September 6, 2019","reviewText":"I've only had this a few days, but I love it. It is easy to clean and the food cooks perfectly. I did contact customer service about something and they were fast and very responsive. Thanks InnSky!\n\nETA: I've now been using this little oven for a couple of weeks. Perfect onion rings, salmon fillets, and a 3 lb whole chicken. Easy to clean and use. This is the best kitchen appliance purchase I have made! And customer service at Innsky is very responsive and accommodating! Thanks Innsky!!"},{"reviewerName":"Karenid","rating":"5.0 out of 5 stars","reviewTitle":"Perfect Air Fryer Oven","reviewDate":"October 1, 2019","reviewText":" I bought this as my first air fryer oven a couple weeks ago and absolutely love it. I use it almost everyday, this unit comes with useful accessories to make your cooking experience easier. Easy to use, easy to clean. I love the way it makes my rotisserie chicken I did a 5 pounds one and came out perfect. This absolutely made my cooking life easier, we also are doing the Keto diet and is perfect for us since with this airfryer you don’t need to use oil."},{"reviewerName":"Julie snyder","rating":"5.0 out of 5 stars","reviewTitle":"Great value! Grills, bakes, toasts roasts etc....","reviewDate":"August 9, 2019","reviewText":"Love this oven! Baked freshly breaded chicken tenders in 15 minutes! Great features! Cooks fresh and frozen entrees in minutes. Grills, bakes, toasts, bakes it does it all!"},{"reviewerName":"Ryan","rating":"5.0 out of 5 stars","reviewTitle":"I like fried food but can't enjoy the grease comes with it","reviewDate":"August 19, 2019","reviewText":"Air fryer is my solution for keeping having fried food while staying away from all that excess grease. We gave it couple tries and made some fried chicken and sweet potato fries. It works well. A little larger than what I expected but at the same time a little more capacity."},{"reviewerName":"Fer R.","rating":"5.0 out of 5 stars","reviewTitle":"Works great, easy to use.","reviewDate":"August 31, 2019","reviewText":"This is an awesome upgrade from my older little oven, has lots of space and it looks and works great. I've been taking a long time thinking about this purchase, since I've always used my convection oven, I am happy I finally upgraded, air fryer works way better."},{"reviewerName":"CHRIS M.","rating":"5.0 out of 5 stars","reviewTitle":"So far so good","reviewDate":"August 30, 2019","reviewText":"So far so good. We just received it yesterday, but everything seems really well built and looks great. We used it last night and it was fast and the food was perfectly cooked. Looking forward to more."},{"reviewerName":"Jessie W.","rating":"5.0 out of 5 stars","reviewTitle":"great oven love it","reviewDate":"August 31, 2019","reviewText":"The design is absolutely beautiful. It works perfect. Very good quality. Heats food evenly and quickly. Even first time oven user is able to figure it out. Easy to use and especially easy to clean."},{"reviewerName":"Cindy","rating":"5.0 out of 5 stars","reviewTitle":"Air fryer","reviewDate":"August 24, 2019","reviewText":"I love some steaks and they came out super tender. I have some steaks and they came out super tender. And the chicken wings are also very good, the cleaning is also very simple, Excited to try more, worth every penny."},{"reviewerName":"Cristy","rating":"5.0 out of 5 stars","reviewTitle":"Air Fryer awesomeness","reviewDate":"August 30, 2019","reviewText":"Omg this is an amazing air fryer. Perfect for everything I need to do and the trays to make 3 different dishes help and the screwed for cobbobs and to make rotisserie chicken is amazing"},{"reviewerName":"Ellie Johnson","rating":"5.0 out of 5 stars","reviewTitle":"Easy to use, very practical","reviewDate":"September 21, 2019","reviewText":" The first time I used this kind of air oven, afraid too advanced wouldn't use at the beginning, then use it every time I feel the air oven is very easy to use, and use diversity, French fries, barbecue, roast chicken, baked bread cake, etc., also can be used as a microwave oven, very practical, and easy to clean, I will recommend to my friends and relatives."},{"reviewerName":"Jesus","rating":"5.0 out of 5 stars","reviewTitle":"not bad","reviewDate":"September 15, 2019","reviewText":"I am satisfied with this airfryer. It makes my easy to cook fries and chicken pops for kids and it’s healthier because you don’t need that much oil. It’s not just a airfryer but an oven. Well designed, has enough space for frozen pizza. Love the two racks design and the window that you can see what you are cooking."},{"reviewerName":"JayDee","rating":"5.0 out of 5 stars","reviewTitle":"Only had it a few hours and already I love with it!","reviewDate":"August 22, 2019","reviewText":"The basket rotates. I did coconut shrimp. I put in potatoes to ‘fry’. They all turned out great. The rotisserie device is easy to take in and out."},{"reviewerName":"Tangerine","rating":"3.0 out of 5 stars","reviewTitle":"There is a learning curve!","reviewDate":"November 1, 2019","reviewText":"I have not had an easy time with this air fryer, my first one. I do think I am the problem. There is a learning curve and I am still in it. I wish it had a more extensive cookbook."},{"reviewerName":"Sophia","rating":"5.0 out of 5 stars","reviewTitle":"amazing","reviewDate":"November 3, 2019","reviewText":"I like this air fryer. You can have a whole chicken in the rotisserie! There are any parts of the things you want to cook. Changing the default settings is easy, whether it's temperature or the time of a particular meal. I like the wings that soar for my friends, and I have great ability in this matter. It's easy to set up, it's also very easy to clean the things I cook here, juicy inside, and crisp outside."},{"reviewerName":"Tina","rating":"5.0 out of 5 stars","reviewTitle":"very nice and save space","reviewDate":"September 4, 2019","reviewText":"i always want to have a oven, but i want a small one. This one really meets my need and does not need too much space. i like the design. Have not used it yet, but i think it is easy to use."},{"reviewerName":"Frank","rating":"5.0 out of 5 stars","reviewTitle":"Delicious","reviewDate":"September 23, 2019","reviewText":"Actually I used it to make pork feet and it tasted great. I have to say that this quality is very good and cook easilier than before, my husband also said that I have made progress in cooking."},{"reviewerName":"Becky Atkinson","rating":"5.0 out of 5 stars","reviewTitle":"Compact, quiet, and easy to use","reviewDate":"October 16, 2019","reviewText":"This appliance is amazing! This is perfect for 1-2 people (unless you get another pan). The fan that blows is not loud at all and the touch screen is nicely lit. Everything I have cooked in this oven has come out moist and very yummy. 10/10 would recommend!"},{"reviewerName":"Cathy Buchanan","rating":"2.0 out of 5 stars","reviewTitle":"Small opening","reviewDate":"November 5, 2019","reviewText":"Never even totally unpacked when we saw how small it is. The width is impractical for the use we had in mind when we ordered."},{"reviewerName":"Travis","rating":"5.0 out of 5 stars","reviewTitle":"Great fryer","reviewDate":"October 18, 2019","reviewText":"Works great, no issues at all."},{"reviewerName":"Ed","rating":"4.0 out of 5 stars","reviewTitle":"I'm impressed","reviewDate":"October 24, 2019","reviewText":"No problems whatsoever."}],"qAndA":[{"question":"looking for an air fryer oven that Doesn't heat up its surroundings or exhaust smoke and smells. Is this the one or should I keep looking?","answer":"You get both exhaust and aroma—not a tremendous amount butnit still occurs."},{"question":"Where is the dehydrating function? It was advertised to have this and we wanted to use it, but couldn't find it.","answer":"Thank you for this question! The ninth icon ( lemon) represents the dehydrating function. After touch the icon, you can set the time and temperature according the type of the fruits or vegetables you want to dehydrate. Here I can give you some suggestions about dehydrating Apple and Bananas:\n\nApple:  … see more"},{"question":"What is the maximum size of a pan that fits inside","answer":"Dear customer, the inner size of the air fryer oven is: 10.9in x 9.06in x 6.97in (L*W*H), and the size of the matching trays are: 10in * 9in * 0.6in. You can use it as a reference.\nHope this helps! If you have any question in the future, please feel free to contact us through Amazon Message."},{"question":"How big of a chicken will this hold ?","answer":"not certain have not had the chance to cook in it."},{"question":"What is the temperature for each preset function (fish, chicken, fries...)? Thank you","answer":"Thank you for this question!\n\nCooking Mode: … see more"},{"question":"when cooking larger quantity of wings...use trays or basket? for how long?","answer":"You use the tray it does better"},{"question":"Any type off off gassing ? plastic smell ? can't find any air fryers that don't have some kind of lasting plastic burning smell - thx","answer":"it takes awhile wash every thing over and over"},{"question":"What are the inside measurements? Please","answer":"Thank you for the question! The inner size of this air fryer oven is 25.7*23*17.7cm/10.9*9.06*6.97in (L*W*H). Hope this helps! If any further question you have, please feel free to contact us through Amazon Message."},{"question":"How quickly does the rotisserie turn? Mine doesn't seem to move. How do I check to see if its working?","answer":"Dear Customer, after you put the rotisserie basket in the air fryer oven, please toch the rotate icon (on the right of the power icon) to begin the rotate function. If it still not move, please contact us as soon as possible.\n-Message us through Amazon: https://www.amazon.com/hz/help/contact/A6SK3XGORS9D0\n-Email us a… see more"},{"question":"What is the warranty?","answer":"Thank you for this question! The warranty of Innsky product is 24 months. Hope this helps! If any further question you have, feel free to contact us through Amazon Message."},{"question":"Is it normal for the fryer to make loud sound while it on? My friend has a cuisinart fryer and it doesn’t make sound at all.","answer":"It's not quiet, but not too noisy either. I believe it's the fan moving air around. Perhaps the Cuisinart doesn't do as many things as this Innsky."},{"question":"How big is a 5qt","answer":"This unit is over 10 quarts. A friend of ours said to buy a big one as they have a smaller probably 5 quart and he said it was too small at times. Space wise the 10 quart doesn’t really have a lot bigger footprint than some of the 5 quart models. We are very happy with the larger unit."},{"question":"can you fry wet batter food?","answer":"I think by the time the batter would fry, it will have ran off the food and into the pan. To be honest, I haven't tried that."},{"question":"Help! My door won't open. I shut it and then went to go open it, but it won't open. Is there some way to open the door?","answer":"Dear customer, This may because the Pressure Difference between the inner part of the air fryer oven and the outside. Please power on the air fryer and use preheat function to heat the oven inner part first and then try to open it again. If the problem is still unsettled, please contact us through Amazon again."},{"question":"Did I miss a set of directions? I can't figure out how to attach rotisserie basket.","answer":"There is a red slider lever, can’t miss it that needs to be slid over to easily slide the basket into position. Took me awhile to figure that out too. It works like a charm once you see it."},{"question":"Can this unit be used to defrost frozen food or frozen meats?","answer":"Thank you for this question! Yes, this unit can be used to defrost frozen food and frozen meats. Hope this helps! If any further question you have, feel free to contact us through Amazon Message."},{"question":"Does the outside of fryer get hot?","answer":"Warm, not hot."},{"question":"Can you also use the air fryer as a toaster? If so what setting and how long?","answer":"Thank you for this question! This air fryer oven can make toast. Ajust temperature of the air fryer oven 350℉/400℉，and set the time about 4-6 minutes accordingly. Hope this helps! If any further question you have, feel free to contact us through Amazon Message."},{"question":"What are the actual outside dimensions? Dimensions in the photo specify 11.4x14.3x14.3 while the product detail section lists 15x15x16.9","answer":"Thank you for this question! The actual outside dimensions is 11.4x14.3x14.3in, the product detail section show the package dimensions 15x15x16.9in. Really sorry for the mistake, we will modify it right now. If any further question you have, please feel free to contact us through Amazon Message."},{"question":"why does this 10.6 qt, air fryer only have 1500 watts when your smaller ones have 1700 watts?","answer":"You would have to ask their engineers. You could also compare the specs of both side by side. For some reason others use more current than the 10.6 unit. Higher temps perhaps? Less efficient? Only the design engineers know for certain."},{"question":"Why is it not cooking evening on the top and bottom rack","answer":"Not had that problem with it"},{"question":"will it work on 220v","answer":"Hello, this air fryer oven can't work on 220V. It has American plug and can work on 120V. Hope this helps! If any further question you have, feel free to contact us through Amazon Message."},{"question":"What size precut parchment paper is recommended","answer":"Thank you for this question! The size of the mash rack is 10in * 9in * 0.6in/25.6cm * 23cm * 1.5cm, you can choose the precut parchment paper according to the size of the rack. Hope this helps! If any further question you have, feel free to contact us through Amazon Message."},{"question":"How to turn down the damn sound beeping when pressing buttons and when it shuts off?","answer":"I don't think you can but I thought you could turn off the beeping."},{"question":"Can you make beef jerky","answer":"Thank you for this question!\n\nICON: Beaf … see more"},{"question":"Confusing description-what is metal & what is non-stick? and is the non-stick duraceramic, teflon or something else?","answer":"All shelves (2 with holes, 1 solid) are non-stick."},{"question":"the description claims this has a microwave. Is that true?","answer":"Not true."},{"question":"Does this one also simply make toast or leftover pizza etc?","answer":"Makes toast, a little crispier than a toaster."},{"question":"Do both rows of food get crispy ? Does the rotisserie rotate well?","answer":"I don’t know the answer, I returned the product"},{"question":"Does this reheat refridgerated/frozen foods? Can a dinner plate be used in as can be done in a microwave? What is the voltage of the machine?","answer":"again not sure"},{"question":"Has anyone had a problem with the door? I have a air fryer as seen on tv and I have to keep a spoon rest under door to keep it closed.???","answer":"That hasn't been a problem with my Innsky Air Fryer"},{"question":"What is the best way to contact customer service? It works great, but I have 1 tray of 2 that will slip out of the second rack.","answer":"go to amazon"},{"question":"Where is the skewer rack? The instructions are not clear on how the skewers are to be mounted.","answer":"Thank you for this question! Please put the skewers on the Mesh Racks directly. Hope this helps! If any further question you have, feel free to contact us through Amazon Message."},{"question":"Anyone else noticed the strong plastic smell from the oven that seeps into the food? Does it go away after some time or is there something you can do?","answer":"I didn’t experience this."},{"question":"Many toaster ovens are not insulated. How about this one? Does this emit a lot of heat from sides, back or top?","answer":"Does not seem to emit much heat on any side."},{"question":"What is the maximum size of chicken you can cook on work rotisserie?","answer":"You could probably put a 3 to 4lb Chicken in there"},{"question":"what are the racks made of ? and is the inside stainless steal ?","answer":"Thank you for this question! The racks and the inside are made of aluminium alloy. Aluminium is an excellent conductor of heat and weighs about a third of what steel does. It is often the best option for food applications. Hope this helps! If any further question you have, please feel free to contact us through Amazo… see more"},{"question":"What is the lowest temperature you can put it on (for dehydrating purposes)?","answer":"Thank you for this question! The lowest temperature of the dehudrating function is 90℉. Hope this helps! If any further question you have, feel free to contact us through Amazon Message."},{"question":"Does it rotate kebabs or vegitables , rotisserie function for cooking them ?","answer":"Thank you for this question! This air fryer oven can rotate kebabs or vegitables. Use rotisserie function to cook them. Hope this helps! If any further question you have, feel free to contact us through Amazon Message."},{"question":"Can it bake a pie?","answer":"Thank you for this question! This air fryer oven can bake a pie:\nPre-heat the Airfryer on the highest degree while you are preparing the pie. Timeperature: 400℉; Time: 20 minutes and then check to see if the crust is cooked.\nHope this helps! If any further question you have, feel free to contact us through Amazon Message."},{"question":"Product from which country?","answer":"CHINA"},{"question":"Does the exterior remain cool while cooking? I am looking for a safe solution.","answer":"Yes it stays cool."},{"question":"What is the voltage?","answer":"Thank you for this question! The voltage of this air fryer oven is 120V. Hope this helps! If any further question you have, feel free to contact us through Amazon Message."},{"question":"Are the trays Teflon?","answer":"Not sure it is Teflon, it is non stick. I love the Air Fryer, I have had 3 Air Frers- this is by far the best."},{"question":"When i turn the airfryer off, it says \"off\" in the window, but the airfryer still runs. is the only way to make it stop to open the door?","answer":"When you turn it off the fan still runs for about 30 seconds then it will shut off."},{"question":"Anyone else have a door that’s stuck? I cooked one batch of chicken (delish) and now the door won’t open.","answer":"No problem with the door after numerous uses"},{"question":"Does this item use infrared?","answer":"Thank you for this question! This air fryer cooks food by 360°hot air circulation. It doesn't use infrared. Hope this helps! If any further question you have, feel free to contact us through Amazon Message."},{"question":"Has anyone tried cutting up potatoes for homemade fries? How did they turn out?","answer":"I haven’t yet, but plan to."},{"question":"Why do you finally give the outside dimensions but don't specify Height, Length, & Width???????","answer":"Dear customer, we are really sorry for the inconvenience. The Inner size of the air fryer oven is: 10.9in x 9.06in x 6.97in (L*W*H). Hope this helps! If any further question you have, please feel free to contact us through Amazon Message."},{"question":"I tried to use both trays and only the top cooks. The bottom does not. Do you think it is faulty. Also is the basket supposed to rotate","answer":"Thank you for this question! Different from traditional ovens transfer heat into food by Infrared radiation, Air Fryer Oven cook food by hot air which comes from the inner top fan. Preheat is important. When use two racks, arrange the racks on the top and bottom thirds of the oven. Halfway through cooking, rotate the t… see more"},{"question":"Could you bake?","answer":"You can bake most smaller items, would not hold a full casserole pan."},{"question":"Can it toast bread?","answer":"Yes. It does toast bread albeit a little crispier than a regular toaster due to the convection effect."},{"question":"Can i do a small turkey?","answer":"I don’t know of any turkey that would be that small"},{"question":"What are the baskets made of?","answer":"Some kind of metal I don’t really know what it is"},{"question":"Why is the top and bottom tray not cooking evenly","answer":"Thank you for this question! The hot air comes from the top of the air fryer oven which is different from traditional oven with a fan built into the rear of the oven. Please make sure there is not too much food on the top rack which may stop the air circulation. Hope this helps! If any further question you have, feel f… see more"},{"question":"How heavy of a bird can the rotisserie handle?","answer":"Thank you for this question! About the whole chicken rotisserie. There is no weight limit but size limit. Please make sure the chicken can be put in the oven completely. Hope this helps! If any further question you have, feel free to contact us through Amazon Message."},{"question":"Does it have an automatic shut off?","answer":"Thank you for this question! This air fryer oven do have automatic shut off function. It will shut off automatically when the time is up or when you open the front door. Hope this helps! If any further question you have, feel free to contact us through Amazon Message."},{"question":"Can it make toast?","answer":"Thank you for this question! This air fryer oven can make toast. Ajust temperature of the air fryer oven 350℉/400℉，and set the time about 4-6 minutes accordingly. Hope this helps! If any further question you have, feel free to contact us through Amazon Message."},{"question":"Are the accessories dishwasher safe?","answer":"Dear customer, the accessories are dishwasher safe. Hope this helps! If you have any question in the future, please feel free to contact us through Amazon Message."},{"question":"Hi what is the max temperature of this product?","answer":"Thank you for this question! The max temperature of this air fyer is 400℉. Hope this helps! If any further question you have, feel free to contact us through Amazon Message."},{"question":"How much clearance is required because of outer shell heat?","answer":"Great question! Please make sure the clearance is at least 4inch/10cm to make sure heat dissipation. Hope this helps! If any further question you have, feel free to contact us through Amazon Message."},{"question":"does this microwave ?","answer":"No but it does cook without having to flip food. It cooks with circulated heat."},{"question":"Will it toast bread?","answer":"Great question! This air fryer oven can toast bread. Ajust temperature of the air fryer oven 350℉/400℉，and set the time about 4-6 minutes accordingly. Hope this helps! If any further question you have, feel free to contact us through Amazon Message."},{"question":"When i turn the airfryer off, it says \"off\" in the window, but the airfryer still runs. is the only way to make it stop to open the door?","answer":"When you turn it off the fan still runs for about 30 seconds then it will shut down."},{"question":"What is the maximum amount of French fries that can be made at one time with the oscillating basket and how long does it take? Thank you.","answer":"Depends how large you cut your fries. I cut mine very thin - like McDonalds - I get a lot of fries from one large potato - the key is to spread them out so I place them on both trays - if too many sometimes the rest on the bottom pan - then too shelve cooks quicker -so I alternate the shelves about every five minutes -… see more"},{"question":"What are the dimensions of the trays and the rotating basket?","answer":"Thank you for this question!\n\ntray：10in(length) * 9in(width) * 0.6in(deep) … see more"},{"question":"is this product lined with BPA?","answer":"Great question! This air fryer oven is BPA-free and PFOA-free. Hope this helps! If any further question you have, feel free to contact us through Amazon Message."},{"question":"Where it makes?","answer":"This question makes no sense"},{"question":"Can you use multiple trays at a time?","answer":"Thank you for this question! You can use multiple trays at the same time. When use two trays, please arrange the racks on the top and bottom thirds of the oven. Halfway through cooking, rotate the trays and swap to ensure even cooking. Hope this helps! If any further question you have, feel free to contact us through A… see more"},{"question":"How many boneless chickem breast will one pan hold?","answer":"2 large or 3 small"},{"question":"What Size of chicken can you use when using Rotisserie?","answer":"Small chicken. Quail would fit. Cornish Game Hen, probably.\nRoasting chicken? No way on God's green earth!"},{"question":"Is there a broiling function? How do I brown just the top without one?","answer":"Not in a air fryer. The fan is circulating the heat in all directions. You need a toaster oven or your main oven."},{"question":"Is there a light in the oven, crisper tray & pizza rack? Evidently the interior is too small for an oblong cake pan---correct?","answer":"The oven has a bright light that comes on when the oven door is opened and remains on while the oven is in operation. It comes with a solid tray and two perforated trays which allow air circulation. I would not hesitate to use it to cook a pizza. The oven has a rotisserie feature and comes with forks for poultry, et… see more"},{"question":"Is it common to see steam coming out of the front door?","answer":"No, it only comes out the top were the vents are."},{"question":"Can anyone clarify the dimension? Previous response shows outside dimensions smaller than inside. Many thanks","answer":"The inside is smaller just like the picture shows the rest is all the machine"},{"question":"Does the basket rotate bt itself or do i have to do it by hand","answer":"Thank you for this question! This air fryer oven has a rotate function. It can rotate by itself when you choose this function. Hope this helps! If any further question you have, feel free to contact us through Amazon Message."},{"question":"Is it also a Microwave like state in the description?","answer":"Thank you for this question! This air fryer oven can't be used as a Microwave. We have corrected this mistake in the description! Really sorry for the wrong information. If any further question you have, please feel free to contact us through Amazon Message."},{"question":"Is this unit loud?","answer":"Well, it does make sound. Comparable to a microwave."},{"question":"why Is the prices go up every few days?","answer":"Basic economics - supply and demand due to interest in the product."},{"question":"material of racks: It was mentioned that racks are made of metal with non-stick coating. Is that the teflon coating, i.e., is a health risk? Thanks!","answer":"Thank you for this quesiton. The cotaing is make of teflon. But don't worry, this air fryer has gotten safety certificate, and it is PFOA-free & BPA-free. Hope this helps! If any further question you have, please feel free to contact us through Amazon Message."},{"question":"Can the rotate function be used with any setting (air fry, roast, bake)?","answer":"Thank you for this question! The rotate function can be used with any setting. Hope this helps! If any further question you have, please feel free to contact us through Amazon Message."},{"question":"Can I make a small Boboli crust Pizza in it","answer":"Thank you for this question! This air fryer oven can make a small Boboli crust Pizza. Pre-heat the Airfryer on the highest degree while you are preparing the Pizza.\nTimeperature: 360℉\nTime: 15 minutes … see more"},{"question":"Is the inside of the oven stainless steel as opposed to non-stick! Please respond, thanks.","answer":"It is non stick."},{"question":"Are the six extra accessories stainless steel or teflon toxic coated teflon?","answer":"They are SS but not the most robust things I have encountered. Sounds as if you are not a fan of Teflon, n'cest pas?"},{"question":"how can I make a pop corn in this oven?","answer":"Thank you for this question! This air fryer oven is not suggested to make pop corns. Hope this helps! If any further question you have, feel free to contact us through Amazon Message."},{"question":"does this come with information on cooking times? do the times and temps vary between roasting/ baking/ etc??","answer":"Thank you for this question! This air fryer oven comes with a 32-recipe book which give some suggestions on cooking times. The Instruction Manual also give some recommendations about cooking time and temperature. Hope this helps! If any further question you have, please feel free to contact us through Amazon Message."},{"question":"Fries cook quicker, crispier on top tray than in rotating basket, but they fall off tray when mixing. Please make a frying basket/tray?","answer":"That’s really a suggestion for the manufacturer, but we successfully got crispy fries using the rotating basket. It took a little longer than the 15 minutes automatically programmed time by at least 5 to the extra minutes. . I used the extra crispy frozen fries."},{"question":"Can you cook eggs with this fryer?","answer":"yes no problem"},{"question":"Why does the 10.6 quart innsky have less wattage (1500) than the other smaller capacity units, which appear to have 1700 watts. doesn't make sense...","answer":"I’ve been using this air fryer for a couple of months, and I know something about wattage, so I’m going to make an educated guess. The oven is made of higher quality materials, so it’s more efficient than the ones that use more watts. I’ve been thinking about going back to the reviews to give an update. If I give anoth… see more"},{"question":"air fryer toggle switch to insert rotisserie works when oven is cold but does not work when oven is hot","answer":"Dear Customer, please contact us via Amazon Message, so we can have more information to help you better."},{"question":"What is the warrenty?","answer":"Thank you for this question! Innsky Brand is committed to 90-day no reason money-back, 2 year warranty and lifetime support. Hope this helps! If any further question you have, please feel free to contact us through Amazon Message."},{"question":"When I turn the light on, it goes off by itself after a couple of minutes. Is it supposed to do this?","answer":"Yes it is"},{"question":"What is the country of origin for Innsky?","answer":"China"},{"question":"Does this item put off a lot of hot air when running?","answer":"Not really, the closer you are the warmer it is...my kitchen is approximately 121 sq fr and the over temperature did not change."},{"question":"Will a standard frozen pizza fit inside?","answer":"9 inch maximum size round pizza"},{"question":"This oven has 6 preset functions for roasting, baking and such. Which is the air frying function? Thank you","answer":"Thank you for this question! The first icon of the 10 presets has the function of air frying. Hope this helps! If any further question you have, feel free to contact us through Amazon Message."},{"question":"Parts of the both ends of the rotating basket are made of hard, black plastic. Will this be affected by the intense cooking temperature over time?","answer":"We've been using it regularly for 6 months and haven't noticed any problems with it."},{"question":"can roasts be cooked in this air fryer?","answer":"I am quite sure as it serves as an oven (temps are adjustable)"},{"question":"Does it work with 220V?","answer":"Dear customer, this air fryer can work with 120V, it can't work with 220V. Hope this helps! If any further question you have, feel free to contact us through Amazon Message."}]}