{"title":"Ninja AF161 Max XL Air Fryer, 5.5-Quart, Grey","manufacturer":"Ninja","currentPrice":"$129.99","rating":"4.6 out of 5 stars","totalRatings":"68 ratings","features":["\n         Make sure this fits\n                by entering your model number.\n        \n","Now enjoy guilt-free fried food. Air fry with up to 75% less fat than traditional frying methods (tested against hand-cut, deep-fried French fries)","Max crisp technology delivers 450 degrees of superheated air to cook foods up to 30% faster (versus Ninja AF100) for hotter, crispier results with little to no oil for guilt free fried favorites","Xl 5. 5-Qt Ceramic-Coated nonstick basket and crisper plate fit 3 lb. of French fries or Chicken wings","Broil rack: give meals or sides a crispy and bubbly finish","Functions include: max crisp, air fry, air roast, air broil, bake, reheat, dehydrate"],"reviewsAspects":["easy to clean","french fries","tater tots","convection oven","crisper plate","max crisp","chicken wings","chicken nuggets","easy to use","air fry","air fryers","air roast","highly recommend","every single","worth every","counter space","much easier","every day","evenly cooked","well it cooks"],"productInformation":[{"Product Dimensions":"14 x 11 x 14.8 inches"},{"Item Weight":"11 pounds"},{"Shipping Weight":"14.95 pounds (View shipping rates and policies)"},{"Manufacturer":"SharkNinja"},{"ASIN":"B07S6529ZZ"},{"Item model number":"AF161"},{"Customer Reviews":"4.6 out of 5 stars\n    68 ratings\n4.6 out of 5 stars"},{"Best Sellers Rank":"#1,785 in Kitchen & Dining (See Top 100 in Kitchen & Dining)\n#6 in Deep Fryers\n"},{"Date first listed on Amazon":"July 5, 2019"}],"productDescription":["\n","\n","\n","Air fry 3 lbs of French fries or chicken wings.","Crank up the temperature to 450 degrees to give your favorite fried foods a crispier finish than ever before.","Rapid fan speed and super-hot temperatures deliver faster cooking and crisping.","Up to 75% less fat than traditional frying methods.","Cleanup is easy with nonstick dishwasher-safe accessories.","Includes preset programs with optimized fan speeds for perfect results.","Brings your foods closer to the heating elements for optimal broiling.","\t\t\n\tNinja Air Fryer Max XL\tNinja Air Fryer (AF101)\nDescription\tMeet the Ninja Air Fryer Max XL, a fast and easy way to cook your favorite foods. Cook and crisp 3 lbs of French fries, using little to no oil, in a family-sized XL 5.5-qt basket.\tMeet the Ninja Air Fryer, a fast and easy way to cook your favorite foods. Cook and crisp your favorite foods, like 2 lbs. of French fries, using little to no oil in a family-sized 4-quart basket.\nMaxCrisp Technology\t✓\t\nCooking functions\t✓\t✓\nNonstick ceramic coating\t✓\t✓\nTemperature range (F)\t105F-450F\t105F-400F\nCapacity (lbs., qts.)\t3 lbs, 5.5 qts\t2 lbs, 4 qts\nWattage\t1750 watts\t1550 watts\nColor\tGrey\tBlack/grey\nNumber of manual programs\t7\t4\nProduct dimensions (in.)\t14 L x 11 W x 14.8 H\t13.6 L x 11 W x 13.3 H"],"reviews":[{"reviewerName":"Mary Batt","rating":"5.0 out of 5 stars","reviewTitle":"Ditch the veg steamer","reviewDate":"August 29, 2019","reviewText":"I air roasted cauliflower with a little oil, garlic salt and pepper. It was amazing. Made pizza rolls first being i didn't know how to use it and it would be much simpler. Pizza rolls came out nice and crunchy . I was going to get a steamer for veggies , however with this air roast setting there is no need to buy a steamer. I ordered a few air fry cookbooks to give me an idea to what are the possibilities . The cookbook that came with it is not much of one, just a few pages . Very easy to clean. The price is much better on Amazon then going direct to Ninja's site. Not a fish eater , but i think i will give it a try in this unit as well as salmon patties . Great for keto diet users . The hard part is knowing how long to cook for. I took the pizza rolls out 5 min early or they might have been over done . The machine automatically sets for 20 mins which im sure you can change the time . Just got it today so i have a learning curve to practice. Seems easy enough ."},{"reviewerName":"tn","rating":"5.0 out of 5 stars","reviewTitle":"Excellent upgrade from the 4qt Ninja Air Fryer","reviewDate":"October 18, 2019","reviewText":"We've been using the Ninja 4qt fryer for about a year now and love it. One of the things we use it for is chicken wings. These fryers cook wings to a very crispy finish, as if they were deep fried. The only complaint we have ever had was that we wished it were a bit bigger. Enter the Max XL. Same excellent results as the smaller version with more capacity. The temps in this model go 50 deg higher and this one seems more quiet than the smaller one. Very happy with both of our Ninja Air Fryers. I have attached some side by side phots for folks wondering about size differences."},{"reviewerName":"Gina","rating":"5.0 out of 5 stars","reviewTitle":"Great for solo/fam dinners and replaces other appliances","reviewDate":"September 22, 2019","reviewText":" It’s been only a week but at my WW (Weight Watchers) meeting the recommend for the low fat and oil for frying foods.\n\nFrom what I can tell this is an easy way to grill indoors with no smoke. If you are a foodie and like to dehydrate food, bake and other cools stuff def. I don’t have a grill, microwave or convection oven so this fills the void nicely. Even if you have all that it does make cooking, reheating convenient without the cleanup.\n\nDecided to get the XL because although is just me wanted to put a whole chicken in and make more than one thing at a time. Most ppl that have gotten one their only complaint is that they didn’t get a bigger one."},{"reviewerName":"Matt P.","rating":"5.0 out of 5 stars","reviewTitle":"Didn't Know Things Could Be So Easy!","reviewDate":"September 4, 2019","reviewText":"I've been reading about air fryers for about a year now, but never seriously considered one because I never thought fried food could taste as good unless it's dipped in a big old tub of hot oil, i was wrong. When I had a chance to order this Ninja Max Air Fryer I decided to go for it and give it a try. The day it arrived I went through the manual and the cookbook (one of those manuals with about 20 recipes, not an actual cookbook), and after finding some room on our countertop, decided to give it a quick try with something we had in the freezer. We were both hungry for a snack, so decided on some tater tots as the initial experiment. I read that some adjustments may have to be made on time and temp, so set it on max crisp and 10 minutes. You can slide the bucket out at any time to check on things, and it stops the clock and all until you slide it back in, where it picks up right where you left off. After several minutes and several in/outs of the bucket, they were done. I'm a pretty decent cook, and have cooked tater tots in the oven and in the fryer (hot oil), and I'll be perfectly honest, they never tasted as good as when i cooked them in this air fryer. They were spot on crunchy, and still moist potato inside. I was pretty amazed, but not sold on one trial. Next day, decided to cook some frozen fries and Tyson Southern Style battered chicken. Again, not being sure of time and temps just yet, I continually checked them until done (cooked them separately). Once again, they were just as good, if not better then when cooked in the oven or hot oil fryer. Not only were they cooked much faster than any ways I've cooked them previously, but the only mess from cooking both was just having to wipe out the bucket. No hot oil to deal with after cooling, no pots, baking pans, or utensils to have to clean, just the bucket. Now I'm starting to rethink the whole air fryer thing. We've cooked several other frozen foods in this (fried okra, different fries, onion rings, etc.) and have used the bake cycle as well for some chicken. Every single thing we cooked in it has tasted great, and saved us from the usual cleanup. There are several other settings on here as well that we have not tried yet. I'm getting around to the air roast, air broil, and dehydrate for jerky, and can't wait to see how they work, but can't review them yet. I've since checked out online other recipes for air fryers, and there is a million+ to try. Also, Ninja has a lot of recipes on their website, but the site isn't actually updated for this specific model with recipes, although the other air fryer recipes I'm sure will work. This is an amazing machine. I'm old school, and love cooking, and NEVER thought this could cook anything as well as my old tried and true methods, but I'll be the first to admit when I'm wrong. I still have a lot to learn about the many uses of this air fryer, as there seems to be so many ways to use it, and recipes to try. But, just from the times I have used it, I'm amazed at how well it cooks, and extremely pleased with how few items I have to clean up after I'm done. I'm absolutely positive this will get a lot of use in my kitchen as time goes on and I get more familiar with it. I've set my calendar for 60 days from today to update this review and how it's going two months from now. Overall, we found this to be an excellent cooking machine, very easy to clean, does have some accessories that look like they would be handy to have on hand (not included), and a great addition to our kitchen. Well worth the money."},{"reviewerName":"Newyorkeyez","rating":"5.0 out of 5 stars","reviewTitle":"YES, YES, YES!","reviewDate":"September 23, 2019","reviewText":"This is a game changer! For someone who does not like to cook, clean the pots, pans, and stove after cooking nor stand by monitoring the food while it is cooking! ME! Thin steaks are cooked to juicy perfection in 4 minutes! Easiest clean up ever. My home and or clothes never ever smell like a restaurant with this appliance. Worth every penny!"},{"reviewerName":"paulvi","rating":"5.0 out of 5 stars","reviewTitle":"wow","reviewDate":"September 2, 2019","reviewText":"what a academy award winner the same as its brother the 4 qt however more features"},{"reviewerName":"GALE TOMES","rating":"5.0 out of 5 stars","reviewTitle":"Fantastic","reviewDate":"September 30, 2019","reviewText":"I am so happy with this, it is so much nicer than the one I have and so easy to clean. I does a wonderful job on cooking, I use it as much as I can. I would highly recommend this to anyone, it has several functions and easy to operate."},{"reviewerName":"Alyssa Bessey","rating":"5.0 out of 5 stars","reviewTitle":"2nd AirFryer","reviewDate":"September 29, 2019","reviewText":"This by far is the best air fryer!! I got a different brand a 2 years ago and after 1 year it died. So I replaced it with this one. OMG....have used it twice so far and I am impressed and it has exceeded my expectations. So worth the buy!!!"},{"reviewerName":"babs","rating":"4.0 out of 5 stars","reviewTitle":"Don't hesitate!","reviewDate":"October 25, 2019","reviewText":"This was a replacement air fryer for another brand. I have had several air type fryers over many years. So far I am really liking this one. It is one piece basket that comes out of the cooking unit. This is much easier to handle and work with when cooking. It seems to have a good non stick coating so food is not sticking. If you are questioning sizes and you are cooking for more than a couple people I would recommend the 5.5 qt. It is not very loud either."},{"reviewerName":"Angela W","rating":"5.0 out of 5 stars","reviewTitle":"More family time!!","reviewDate":"October 9, 2019","reviewText":"We all have busy lives and with the Ninja I have been able to cook a quick dinners and eat in less than 30 minutes. My husband and daughter have used it everyday and it still looks brand new. Clean up is a snap."},{"reviewerName":"Keith Turner","rating":"5.0 out of 5 stars","reviewTitle":"Easy to use & good food.....","reviewDate":"October 15, 2019","reviewText":"We love our new air fryer food really tastes great and best of all no oily food.... so far everything we’ve fixed has been great......"},{"reviewerName":"GG","rating":"1.0 out of 5 stars","reviewTitle":"Toxic smell! Disappointed","reviewDate":"October 18, 2019","reviewText":"Really dissapointed! First week using this Air Fryer and it produces a horrible toxic smell everytime I cook with it. I thought the smell would go away but it hasn't. On the positove, its a good size and looks nice, but I probably won't be using it again."},{"reviewerName":"LUIS ANTONIO LA LOGGIA","rating":"5.0 out of 5 stars","reviewTitle":"Excelente","reviewDate":"September 17, 2019","reviewText":"Excelente"},{"reviewerName":"Grouchy 41","rating":"5.0 out of 5 stars","reviewTitle":"Nice time saver","reviewDate":"October 13, 2019","reviewText":"I'm trying this unit with a lot of new recipes and so far it's been great"},{"reviewerName":"Cynthia Alatrista-vasquez","rating":"5.0 out of 5 stars","reviewTitle":"Good quality!","reviewDate":"October 10, 2019","reviewText":"Great product, no smell, little mess, very easy to use, I use it as a toaster too, super fast!!"},{"reviewerName":"D Hollandsworth","rating":"5.0 out of 5 stars","reviewTitle":"Great Product!","reviewDate":"October 10, 2019","reviewText":"How did I cook without this thing?"},{"reviewerName":"lecear","rating":"5.0 out of 5 stars","reviewTitle":"Ninja Fryer","reviewDate":"November 4, 2019","reviewText":"I couldn't have made a better choice. Love my Ninja Fryer."},{"reviewerName":"Lillian Sanders","rating":"5.0 out of 5 stars","reviewTitle":"Smoky house","reviewDate":"November 7, 2019","reviewText":"I made fresh chicken wings i put oil on them they came out great !!my concern is that it smoked up my house is this\nNormal ?"},{"reviewerName":"Daddy","rating":"5.0 out of 5 stars","reviewTitle":"Awesome product","reviewDate":"October 12, 2019","reviewText":"Easy to used and clean"},{"reviewerName":"Ed","rating":"5.0 out of 5 stars","reviewTitle":"Love","reviewDate":"October 5, 2019","reviewText":"Love everything about it"},{"reviewerName":"Counselor Bill","rating":"5.0 out of 5 stars","reviewTitle":"Excellent Air Fryer!","reviewDate":"November 5, 2019","reviewText":"Love this product and use it often!"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Nice","reviewDate":"October 13, 2019","reviewText":"Nice"},{"reviewerName":"Franci Neill","rating":"5.0 out of 5 stars","reviewTitle":"Love this so much!!","reviewDate":"September 8, 2019","reviewText":"I’ve had a smaller less powerful air fryer for several months which I use on an almost daily basis and on the weekends multiple times between each day. So when I saw this one I jumped at the chance to try it out! When it arrived I was a little concerned it wouldn’t fit in the corner of my counter where the previous air fryer lived. But it fits very nicely!\n\nNow let’s talk about how well it cooks! I love all the different “air frying” options. It’s allowed me to experiment with baking and frying! And the larger capacity is awesome as it lets me make a larger quantity of food which is so helpful with my meal prepping for the week. I made multiples of my version of an Empanada and they turned out perfectly with just the right amount of crispness and browning. I’m so excited to try to do some dehydrating of some summer fruits!\n\nI’d highly recommend this air fryer! You won’t be sorry!"},{"reviewerName":"Lashello","rating":"5.0 out of 5 stars","reviewTitle":"Guilt Free Frying....","reviewDate":"September 9, 2019","reviewText":"This is my initial review for the, Ninja AF161 Max XL Air Fryer, 5.5-Quart, Grey, and I'll update it as I use it.\n\nSo right out of the box, you'll notice how easy the cooking bin slid in and out of the fryer, the ceramic coated plate the underside of the wings, with no turning even more so than the top of the wings, the slide in basket is ceramic coated also. I'm sure this will last for years; previous models were Teflon coated. The inside of this Air Fryer is ceramic coatings which looks much more substantial than previous models. The crisper plate and the basket are dish washer safe.\n\nThe control panel on this Ninja AF161 is far superior from the old previous models, same results could’ve been achieved but with much more attention and thought needed for same results. Options like max crisp, air fry, air roast, reheat, bake, air broil, dehydrate, start-stop, temp and finally time settings all makes it so easy to get the most out of this ninja fryer.\n\nThis ninja comes with very informative and well made quick and owners guide. Perhaps it’s a good idea to read both of them to get the most out of the. I have a tendency to only use limited options and not experience the full potential of any product, this fryer has almost unlimited cooking options. I have got a lot of ideas. What makes it enjoyable is prep then set it then go do other things in the kitchen, however I do keep it in sight looking at the minutes remaining so I know what else I can do before it’s finished.\n\nSo if you are brand new to air-frying, I would suggest air frying any type of chicken, like wings or flapper part but before inserting them, paper towel dry them, then dust with baking powder, both sides, then place them in the fryer on crisper plate, cook using the air fryer setting or max crisp for suggested time or just eye ball it and you'll know when it’s done then take it out and Enjoy! You can add powdered seasonings to the dusting or as a topping after cooking it’ is very easy and quick and very healthy too as far as fried chicken goes. The best guilt free fried chicken I’ve ever.\n\nThe only advice I would offer is get this model because it has a very big capacity and comes with the stainless-steel multi-layer rack, as it allows for even more options of all features.\n\nOverall, amazing fryer with tons of cooking options at an amazing price, highly recommended."},{"reviewerName":"MarathonMom","rating":"5.0 out of 5 stars","reviewTitle":"Starts in seconds, easy to clean, crispy food.","reviewDate":"September 13, 2019","reviewText":"There are a ton of reasons to love this air fryer. This is my second air fryer but the first from Ninja. This one comes with a \"Max Crisp\" setting that is simply perfect for frozen foods. I use it more often than anything else. It cooks frozen fries and chicken nuggets to a perfect crisp in about 10 minutes. It says to pre-heat it, but I honestly don't do that because I kept burning myself on the basket. It cooks faster if you pre-heat it, but not by that much. Anyway, the max crisp is set to 450 degrees and then you just adjust the time and away it goes.\n\nThe basket is covered in non-stick coating that makes it super easy to clean. My other unit is a pain to get clean from the grease that comes out of certain foods. This one practically just rinses off. The bottom grate stays in place with some rubber knobs on the sides of it. In other words, you can flip it sideways to dump out fries and it will still stay in there. It holds a surprising amount of food. I can easily fit an entire small bag of French fries in there.\n\nThere are a bunch of other features on this one. It bakes, dehydrates, broils, reheats, roasts, and of course fries. I have tried broiling, frying and reheating. I haven't had any issues with this unit at all. What I have tried have worked perfectly and easily. This machine is intuitively obvious. The screen is easy to read and clearly shows the temperature and the time. The front lights up which mode is selected. Just plug it in, put the food in, select your mode, set the time, and go. The food comes out nice and crispy and evenly cooked.\n\nI honestly wouldn't change anything about this machine. It is taller and narrower than my other one and thus takes up less space on the counter. I never use my old one any more, I turn to this one instead. I love the options and ease of cleaning. I would have happily paid full price for this and highly recommend it to any cook or parent that can be short on time. Chicken nuggets with fries for lunch now only takes 10 minutes and no oven pre-heating! Also, no kids complaining about squishy fries anymore."},{"reviewerName":"Gisell Langelier","rating":"5.0 out of 5 stars","reviewTitle":"Gorgeous and powerful machine!","reviewDate":"September 1, 2019","reviewText":"We had a Cuisinart air frier and convection oven so we compared something we cooked in that to this baby and we were blown away!\nThis cooks the food much better and faster. With the cuisinart our food was often under cooked in some parts of not fully crispy. The Ninja does 369 cooking so everything is evenly cooked and crispy. It takes less counter space, it looks gorgeous and the heat goes up which is better for us (the cuisinart expelled heat through the back and melted our blinds). Very easy to clean too!\nLove this machine!"},{"reviewerName":"J. Stroh","rating":"5.0 out of 5 stars","reviewTitle":"Wow! Very impressed with this air fryer!","reviewDate":"September 4, 2019","reviewText":"I have never owned an air fryer but some of my family members have one and they kept telling me how much they love it. I love kitchen gadgets and appliances and was I was so blown away by this unit. It cooks quick and easily and the results are amazing! So very good and healthy for you and your family. At first I tried something simple with chicken wings. They turned out great! Next I tried cheesy potatoes and they cooked perfectly and quickly. So far I have used this every day for mealtime and I can't believe how good everything comes out. The unit is very easy to clean and it is also small enough to set on your kitchen counter and does not take up very much room. I really can't say how I got along without the air fryer. I use it every single day. Absolutely love it!"},{"reviewerName":"Baazumi","rating":"5.0 out of 5 stars","reviewTitle":"Every Cook Should have One","reviewDate":"September 10, 2019","reviewText":"One of the best features about the Ninja Air Fryer is the reduction of oil used to fry foods. One of the other great features is how quickly the fryer heats up, about 3 minutes compared to how long it takes my oven to heat up, about 6 minutes. The unit is compact and doesn’t take up much room on the counter and the dials are easy to read for a change. The fryer comes with a quick start guide which makes it easy to understand how the fryer works at a glance. The first thing we tried was bacon which was crisp and delicious. The French fries surprised us as they came out crispy as well and not oily. The Ninja reheats foods just as well as cooks them. The unit is easy to clean and we look forward to cooking a lot more dishes with the Ninja. Five Stars."},{"reviewerName":"Ronald Mendoza","rating":"5.0 out of 5 stars","reviewTitle":"Larger and more effective than expected","reviewDate":"October 17, 2019","reviewText":"My wife and I have been curious about air fryers for some time, but kept reading that \"if you have a toaster/convection oven, don't bother.\"\nI'm happy to report that the Ninja Air Fryer Max XL proves that wrong, at least in our experience.\nFirst off, as the larger of Ninja's two Air Fryer models, the Max XL has a surprisingly large capacity.\nWe've used it for french fries, tater tots, chicken tenders, eggrolls, and more. Compared to using the toaster/convection oven, the food has more of an \"airy\" crispy taste. It also tends to be much quicker to use, with only a 3 minute warm up before cooking.\nThe only area of improvement would be the buttons; they are a membrane type but aren't the most responsive when trying to press quickly. However, we work around that by setting the total cook time plus warmup time, then take advantage of the fact that it pauses the timer when the basket is removed and resumes when the basket is re-inserted. (As opposed to setting the timer for warm-up, then setting it again for cooking)\nWe now use this more than our toaster/convection oven!"},{"reviewerName":"DMAdam47","rating":"5.0 out of 5 stars","reviewTitle":"Just Get It!","reviewDate":"August 30, 2019","reviewText":"I have always been a skeptic of new gadgets and Air Fryers were no exception and nothing I would have purchased. When I saw it as a Vine selection I figured I had nothing to lose. How wrong I was, this thing is great. Super fast, easy to clean and does a great job. I was wrong, I should have bought on long time ago.\n\nFirst try was simple doing just sliced potatoes, absolutely the best fried ones I have had. Nice color, crisp on the edges and cooked just right. Next forage in was chili, lime marinated Mahi Mahi and again beautiful. So many ways to use this it will fun experimenting for some time.\n\nI can't recommend this enough, don't even think about it just get it!"},{"reviewerName":"Peggy Bowes","rating":"5.0 out of 5 stars","reviewTitle":"Best kitchen appliance I've bought in decades!","reviewDate":"September 28, 2019","reviewText":"My husband makes fun of me for the large number of kitchen appliances I've collected over the years, so he rolled his eyes when this appeared on the counter. A few days later, he asked, \"How have we lived without this for so long?\" We use it almost daily and make everything from fried brussels sprouts to roasted salmon. It's so easy to use, easy to clean, doesn't heat up the kitchen and cooks almost everything a lot faster than using the oven. Baked potatoes are fluffy inside with a wonderfully crispy skin. Kale chips are uniformly crispy. Frozen fries taste so amazing we want to blow our diets and eat them every night. It does take a little bit of trial and error to find the right setting and temperature, but use the guide in the included owner's manual as a starting point. There are also thousands of air fryer recipes online you can try. Worth every penny and highly recommended!"},{"reviewerName":"JM","rating":"5.0 out of 5 stars","reviewTitle":"Our new favorite kitchen appliance","reviewDate":"September 1, 2019","reviewText":"I originally ordered this as an occasional cooking tool for the kitchen. However it has become the go to favorite in our house. Is incredibly easy to use and set up. Cleanup is even easier. The basket design usually holds enough food for a family meal, and the air fryer technology means it could be made a fraction of the cholesterol.\n\nThe package came with a few sample recipe ideas, but have found plenty more online. There’s almost nothing that cannot be cooked in this. It is satisfied the appetites of multiple growing boys and some of the pickiest eaters around. Compared to all of the other kitchen gadgets now taking up space in the closet, this one has forever and the place are the countertop is used almost every day. Affordable and simple to use"},{"reviewerName":"Bethany","rating":"5.0 out of 5 stars","reviewTitle":"Life changing!","reviewDate":"September 5, 2019","reviewText":"I can’t believe how easy this is to use! I was intimidated at first, read all the instructions and realized it was (almost) idiot proof. My food is always cooked to perfection and so so fast. For a busy mom, this is AHMAZHING! The only thing I’ll mention is the basket is not fully waterproof. I put water in it to soak and it leaked out all over my counter. So make sure to soak in the sink. But that’s more user error than anything. The crisper plate pops in the dishwasher, which is super convenient. I am so happy we got this! Comes with great recipes to try and i joined a FB air fryer group to get even more ideas. This thing is life changing."},{"reviewerName":"Jeremy Haggard","rating":"3.0 out of 5 stars","reviewTitle":"half the time it's great, the other half it burns","reviewDate":"October 28, 2019","reviewText":"I got this to try out and overall it's good but the results are hit or miss. I cooked cheese sticks in it the first time and the cheese all melted and disappeared, the second time I cooked fries and it worked great, then I cooked chicken nuggets and they burned. It does work, but the results are hit or miss it seems and I have wasted a bunch of food figuring it out."},{"reviewerName":"Bold Consumer","rating":"5.0 out of 5 stars","reviewTitle":"The healthiest 'no-oil' sliced potatoes ever!","reviewDate":"September 14, 2019","reviewText":"I use my new Ninja XL air fryer every day. It takes almost no effort. It cooks great, you have all sorts of options, and soooo easy to clean! I love it. I never want to be without it."},{"reviewerName":"GreenGreen","rating":"5.0 out of 5 stars","reviewTitle":"Quick and easy","reviewDate":"October 23, 2019","reviewText":"I had tiny cheap air fryer before Ninja. I like the way it cooked. Faster cooking than oven; easier cooking than stove. I decided to buy a bigger and better air fryer. Ninja has similar size of instant pot. with the rack, I can cook enough for 3-4ppl. So far, I’ve made several dishes which tasted better than I expected. But you might need to watch the time and temperatures. Online recipes might have different timing/temp depends on the air fryer brands."},{"reviewerName":"joshua gipson","rating":"5.0 out of 5 stars","reviewTitle":"awesome","reviewDate":"September 7, 2019","reviewText":"good quality well made performs extremly well. exactly what you would expect from Ninja"},{"reviewerName":"simone","rating":"1.0 out of 5 stars","reviewTitle":"Air Dried Food: Not Tasty and Do Not Recommend","reviewDate":"October 24, 2019","reviewText":"I got this machine because my kids love fried foods such as (homemade) chicken schnitzel and I understood this would create crispy, fried food using minimal oil. It DOES use minimal oil, but it doesn't FRY the food, it DRIES the food. My normally tasty schnitzels came out tasting like factory made food rather than homemade. The air fryer DID make the panko coating crispy, but it was NOT YUMMY. I also tried frozen french fries. They came out somewhat crispy but so dry and unappealing. I threw out the entire batch.\n\nFor the record: I followed all the instructions for how to fry, temperatures, and frying times, and frequently flipped the food or shook the basket as suggested."},{"reviewerName":"ABC MOM","rating":"5.0 out of 5 stars","reviewTitle":"Just get this already!","reviewDate":"September 4, 2019","reviewText":"This model is more powerful than the previous model, with varying fan speeds AND a dehydration feature which will come in useful for my oven roasted tomatoes that I like making for sandwiches. That was a huge plus w the Ninja models.\n\nThis newer model goes up to 450\u000b˚F vs the previous 390\u000b˚.\n\nBut the biggest reason to go with the newer model is that it automatically pauses when you pull the basket out to check on your food, or giving the basket a toss and restarts when reinserted. This is a crucial feature. that's missing from the older model!\n\nAs the only person who cleans the kitchen, being able to clean this machine by hand or by dishwasher means no more dirty toaster ovens. This perk is so under-rated!!\n\nMy very first use for this air fryer, was for roasted whole peppers. I got beautiful evenly roasted peppers in 12 minutes without baby sitting it at all. set and forget lol. I love roasted vegetables, but it's a lot of work to brown evenly, especially if you don't want to heat up a huge oven for a couple of peppers in the height of a heat wave.\n\nI'm very satisfied thus far. My husband has been cooking all sorts of things in it, steak, chicken legs, turkey wings, hash browns --they're all great. I'll update as I get around to cooking more. It's only been a couple of days :D"},{"reviewerName":"A. Yarlett","rating":"5.0 out of 5 stars","reviewTitle":"Fast cooking and crispy food","reviewDate":"August 28, 2019","reviewText":"I was interested in buying an fryer because my teenagers love fast food so why not be healthier and make it at home for cheaper. I discovered the XL was coming out so waited a few days as the smaller ninja version got rave reviews. So far I have cooked chicken wings and fries and my teens gobbled everything up so I am very happy with this machine. 20 wings and 3 pounds of fries only needed 1 tablespoon of oil and everything was crispy. Wings took 25 mins, fries took 20 (I overcooked them slightly). So far it's a winner and this is day 1."},{"reviewerName":"Karen L. Flanagan","rating":"5.0 out of 5 stars","reviewTitle":"So happy with this machine","reviewDate":"October 17, 2019","reviewText":"I received it in the mail on time, and started using it the first night, I think and am going to love it for cooking for the two of us. It will take a little practice to get the timing correct the steak was very tasty but I think I cooked it too long for the thickness of the steak as I wanted it to be rare, to medium rare. The machine cooks the food faster than my large oven, which is a plus for me. I like the ease of use, and the settings for extra crisp, air fry, roasting, baking, and dehydrating, it should accommodate all the types of things that I cook."},{"reviewerName":"D. Gabriel","rating":"5.0 out of 5 stars","reviewTitle":"Changed my life!","reviewDate":"September 27, 2019","reviewText":"This little wonder had changed my life, not only is it fun to use, but meals are ready in half the time, and I don't have to heat up my whole house using an Oven. I'm sure we're using less electricity too. I can't say enough positive things about this product, I'm just super disappointed I waited so long to jump on the air fryer craze hahaha!"},{"reviewerName":"Erin Hamby","rating":"5.0 out of 5 stars","reviewTitle":"I love this thing!","reviewDate":"September 30, 2019","reviewText":"I’m really enjoying my air fryer. I’m glad I got the big one as they don’t hold a whole lot but this is perfect for 2 people. Easy clean up. So much less fat used and it all drips down. Definitely takes up counter space but I expected that. Great purchase for us."},{"reviewerName":"G","rating":"5.0 out of 5 stars","reviewTitle":"So far we love it!","reviewDate":"September 24, 2019","reviewText":"Made wings for the first time and they came out fantastic. Made frozen egg rolls and they were excellent also. We are very happy with this appliance so far. Only had it for a few days."},{"reviewerName":"prayerTeam","rating":"5.0 out of 5 stars","reviewTitle":"Love this air fryer","reviewDate":"October 13, 2019","reviewText":"It is quick... the food tastes great... it makes this crispy when needed.... totally love it!! Food prep is so much easier."},{"reviewerName":"m","rating":"5.0 out of 5 stars","reviewTitle":"Love this!!!","reviewDate":"November 7, 2019","reviewText":"I shopped around before choosing this product. Love it!"},{"reviewerName":"Chae Polonia","rating":"5.0 out of 5 stars","reviewTitle":"Everyone needs one!","reviewDate":"October 19, 2019","reviewText":"Love it! Wish I would have found about it sooner. I cook everything from filet minion wrapped in bacon to baked potatoes and roasted vegetables."},{"reviewerName":"Craig","rating":"5.0 out of 5 stars","reviewTitle":"Don't wait just buy it!!","reviewDate":"September 26, 2019","reviewText":"Food is so good and easy to make a meal!"},{"reviewerName":"Dusty White","rating":"5.0 out of 5 stars","reviewTitle":"Holy cow! You **NEED** this thing!","reviewDate":"September 2, 2019","reviewText":"UPDATE: #1: It makes **killer chicken wings in about ten minutes***\nUPDATE: #2: It cooks even faster than the directions say (you have to keep an eye on your food)\n\nWhy did it take me this long to try an air-fryer?\n\nThis is a GENIUS product. Yeah, yeah, it is super-easy to use, and it comes with some basic recipes, and you can find recipes online, and in books. Blah blah blah. Okay, so let's get to the good stuff. FRENCH FRIES!! \"Better than McDonald's!\"\n\nBlasphemy, right? I grew up on McDonald's French fries. One of my first jobs was working at McDonald's. In fact, In fact, I have made it one of my life's purposes to recreate the magic of McDonald's French fries at home. The best results I have achieved so far are with a Presto deep fat fryer (pro-tip: ALWAYS use peanut oil, unless you have allergies). Then I found this thing . . .\n\nNO OIL at all! I don't know how this does the trick, but you use no oil at all and you end up with fries that taste *exactly* like Mc'Donald's but with something like 1/10th of the calories. This is great for anyone on a diet who has a Mickey D's craving. I uploaded the pictures in reverse order to prove my argument. The newest photos are first, and the ;last photo was my first attempt (last night). I thought I did pretty well last night, until I saw how tonight's fries came out. Infinitely better. The trick is to shake the basket every 4-5 minutes. This gives you a chance to examine the fries.\n\nI used generic \"Safeway frozen shoestring potatoes\" (store brand). I did buy the \"extra crispy\" fries (that's what it says on the bag. They may coat the potatoes with something. But these are just store-brand; nothing special at all. Here are a few more tips: The fries look \"wet\" when they are cooking. This makes them look oily, and also uncooked, even as they \"yellow up.\" Take a fry or two out the moment you even suspect they are getting ready. It is super-easy to overcook the fries. The machine says something like \"30 minutes.\" HA! More like 5-12 minutes at the most. Pre-heat for 3 minutes (just fire it up but don't load the fries for three minutes) on the \"extra crispy\" setting, and pop the fries in after three minutes. Check the fries after about 5 minutes, and every 3-4 minutes after that. You can't go wrong.\n\nYes, it makes wings, and popcorn, and all kinds of stuff. You get this an an InstaPot—and maybe a toaster oven and a microwave, and you can cook anything using almost no space at all. These four items are a must have for any dorm or RV (or even motel living). If you have more scratch and have a large kitchen, you want this nearby at all times. It won't outright replace your giant convection oven, but for everything but Thanksgiving dinner, this monster will make cooking fast and easy.\n\nCleanup is a breeze. It is all non-stick coated. What else? Not really much to say . . . this is one of the most valuable \"health conscious\" kitchen appliances ever, and it is quite roomy inside. I can't imagine anyone being disappointed, unless they wanted a giant version of one of these for Thanksgiving dinners. Anyway, I love love love mine. I know you will love yours. makes a great present too!"},{"reviewerName":"Grandmaof4","rating":"5.0 out of 5 stars","reviewTitle":"Lots of pluses for the Ninja...","reviewDate":"September 12, 2019","reviewText":"I strongly suggest that the instruction booklet be read before using the Ninja Max XL Air Fryer. I almost made a very expensive mistake. I set the air fryer up on my glass topped stove—a big no-no. I thought it would be safer to use on a surface that was not only glass but made to handle heat. But like so many things, it’s always best to do what the manufacturer suggests. So I used a glass cutting board on my counter & it was okay.\n\nI made a great batch of tater tots, better than from a restaurant & a quicker, too. I liked that I could pull the basket out easily & shake the tots around & when I popped it back in it would resume cooking at the amount of time remaining. The basket releases easily & there’s no need to reset anything.\n\nThe Ninja crisper plate is used for most things & like the basket, it’s really easy to clean. I tried another brand & was sorely disappointed because I practically had to put my foot on the thing & tug hard to open it. I didn’t feel safe at all knowing hot food could dump out on my hand as I struggled with the pan. Being able to pull the basket out easily is hugely important to me.\n\nSomething that I really like with the Ninja is the preheat time—3 minutes!! My oven takes 15 minutes & sometimes it’s just not convenient such as when I need to reheat pizza. I would heat it in the microwave & as you can guess, it was hot & edible but really soggy & greasy. The reheat function is great for pizza as well as other leftovers. The manual has Air Fry 101 to explain the different functions for the air fryer. It also recommends using silicone-tipped tongs for tossing the food during cooking & I would have liked to see those included since practically everything has to be stirred or shaken during the frying process.\n\nI like to get rid of duplicate appliances & my food dehydrator is next to go. I had no clue that this air fryer could not only dehydrate fruits & vegetables but also meat. Dehydrated meats & fish can be pasteurized, too.\n\nRegular recipes can be converted by reducing the temperature by 25 degrees & checking often. There are a handful of recipes in the guide I’d like to try as well as some tried & true favorites. It’s tempting to dig through the freezer & continue to fix taquitos, tater tots & heat leftovers but it’s about time I learn to get the full value from this air fryer. It’s been worth every cent."},{"reviewerName":"Robin","rating":"5.0 out of 5 stars","reviewTitle":"Fantastic Job Cooking A Wide Range Of Food, So Easy To Use & Fast Cleanup, Fits On Small Countertop","reviewDate":"October 15, 2019","reviewText":"The Ninja Magic Air Fryer Max XL (5.5 quart) comes with a broiling rack and a crisper plate. No manual or recipe book was in my box, but it seemed to be oversight and I easily found them on the Ninja site. This is a nice looking appliance in grey, and the manual states the interior cooking surfaces are nonstick ceramic. Ninja has become a fixture on my counter as it takes only a small space and I use it so frequently.\n\nI’ve always preferred home cooked meals but cooking can be a chore when I’m tired and I don’t enjoy cleanup, so I’ve been guilty of too much pickup and delivery. With Ninja, cooking is easy and fun, and it doesn’t take constant supervision. Most meals can be prepped quickly and once the food goes in the Ninja I can leave it alone for the most part (other than I may need to flip once or stir occasionally) and the results are perfect. Plus, there’s so little cleanup.\n\nThis Ninja has all the bells and whistles with Air Fry, Air Roast, Air Broil, Bake, Broil, Bake Max Crisp, Reheat and Dehydrate, and the controls are intuitive and easy to use. Ninja can be used to cook almost anything. I use some Ninja recipes and make up my own dishes too. I tried two new easy recipes today. One was homemade granola using the Bake setting. It’s so fresh, delicious and healthy with no additives or preservatives, and it’s crunchy and tasty on vanilla yogurt with blueberries.\n\nThe other was panko crusted pork loin chops using the Air Roast setting for 12 minutes. I only had to turn them once, and the pork was evenly cooked and crisp outside and juicy and tender inside. I’ve cooked fish or steak with vegetables and the meat looks seared and is so tender inside. I use the Air Fry setting for frozen french fries, pizza snacks, taquitos and chicken nuggets. Everything comes out better than the microwave or regular oven. I’m using the Dehydrator tonight to dehydrate apple slices while I sleep.\n\nMy favorite dish I make without a recipe is fajitas. The meat browns up so great and is so tender and juicy inside, and the vegetables look charred like they were grilled. I change it up based on what ingredients I have but basically combine sliced steak (or chicken), colored bell peppers, onion, mushrooms and tomato with 1 tsp sunflower oil, reduced sodium Montreal seasoning and crushed red pepper. I serve it on soft corn tortillas with avocado and salsa. It’s such an easy, great meal.\n\nI bought the smallest size when I bought my first air fryer as I frankly thought it would be a gimmick that I wouldn’t use often. But it’s a versatile and wonderful appliance that makes preparing meals and clean up so much easier. I’d recommend getting a larger capacity unit like this Ninja Max XL. I have a small counter but it doesn’t take any extra counter space than my small air fryer, and it’s nice to have the option of cooking larger portions for more people or leftovers. I’m super impressed with the options on the Ninja, and it cooks a variety of foods perfectly. This would be a great gift for a family member. Love it. 5 stars."},{"reviewerName":"beckileighs","rating":"5.0 out of 5 stars","reviewTitle":"Great addition to any kitchen!","reviewDate":"September 15, 2019","reviewText":"The Ninja Max XL Air Fryer is a great addition to any kitchen! So many uses for this amazing appliance! Was a bit afraid the 5.5 quart size would be too big for just my husband and I, but after using it, I'm quite pleased with the size, and it's not too big at all for just 2 people. We've made all kinds of frozen fried goodies in it, from french fries and tater tots to chicken strips and fish sticks. We've even made our own breaded fried squash and fresh fried fish, and this thing works great! It heats up quickly, you can choose your setting / temp, and adjust the timer easily. It's very simple to operate and very user friendly. The bin pulls out nicely to shake your food around during cooking so it will cook more evenly, and pops back in and starts right back up cooking them. I was really impressed that it actually gets things just as crispy as an oil fryer, but with air instead of unhealthy oil. Just amazing! It's super easy to clean up too. Wipe it out with a paper towel between washings, and the racks come out easy for washing up after use. Every kitchen could use a Ninja Air Fryer! Would also make a great wedding present or house warming gift for just about anyone!"},{"reviewerName":"SevereWX","rating":"5.0 out of 5 stars","reviewTitle":"Ninja!","reviewDate":"September 23, 2019","reviewText":"Having come from a different odd-branded air fry and going into the Ninja Max XL was like going from an economy car to a luxury model. While the old fryer worked, this new Ninja air fryer beats it out in every aspect. For the same capacity, the Ninja Max XL gives me a smaller footprint, a noticeably better build quality, more intuitive controls, and better non-stick coatings. It also is quieter while running, and doesn't emit strange odors.\n\nThe Ninja air fryer is very easy to use. The buttons are clearly marked and the manual is easy to understand. There is practically no learning-curve at all, it is that intuitive.\n\nI've use the air fryer to make homemade dressing. Fry chicken wings, french fries, fish, pork steaks, and several other things I can't think of off the top of my head. It's done well cooking anything I've tried.\n\nCleanup is easy, the surfaces wipe down and wash off cleanly. I've not a any problems with stuck on food, the non-stick coating really works well. I don't know what else to say, this air fryer has really impressed me."},{"reviewerName":"Fluff n Stuff","rating":"5.0 out of 5 stars","reviewTitle":"Everything’s Great!","reviewDate":"September 15, 2019","reviewText":"I’ve been using this thing almost every single day since I got it! I love it! How great is it to take a frozen hamburger patty from frozen to tasting like it was grilled in 6 minutes? I’ve been making stuff just for the heck of it. Air fried pickles? No problem. 2 minutes. Air fried squash? Air fried okra? Air fried frittata? The list goes on. I swear I haven’t used my stove in weeks. It’s just not near as much fun!\n\nI had another air fryer before this one but this is better quality and I like the rack that’s down in the basket as well. I also like the actual timer you can set instead of just having a dial. This one is also very nice looking and I don’t mind it being on my countertop."},{"reviewerName":"Kayla Atkins","rating":"5.0 out of 5 stars","reviewTitle":"Love this fryer","reviewDate":"October 7, 2019","reviewText":"I am recently new to air fryers. I started out with a smaller one and then this one came available and I knew that I had to try it. I love the fact that you can heat it to 450. The others that I have used will only go to 400. This basket is larger as well so I can have more in it at a time. I am a busy mom and this has been the perfect thing for me. My kids love all of the food that is bad for them like corn dogs, chicken nuggets, mini pizzas, pizza rolls etc. I need quick and easy but I hate microwave taste on some of them. this has been a saving grace. I would recommend this to anyone but especially a mother who is looking for ways to save time and effort!"},{"reviewerName":"Scott Hill","rating":"5.0 out of 5 stars","reviewTitle":"Every southern kitchen should have this!","reviewDate":"September 8, 2019","reviewText":"When I got married my wife forced me to get rid of my frier. Having that ability to make fried foods was amazing and for 10 years I haven’t had the same food experience that I enjoy out. Finally I can have it all!\n\nThis little thing is awesome and allows me to have the fried food I love without having the oil to cook with that is so unhealthy....\n\nMy wife is even now looking for excuses to cook with it :)"},{"reviewerName":"Dave Greenbaum","rating":"5.0 out of 5 stars","reviewTitle":"The Perfect Small Oven","reviewDate":"September 7, 2019","reviewText":"While I've used this as an air fryer, it's real strength is a small convection oven. Things cook evenly and quickly. I'd prefer a larger surface area, but it's great for cooking small items. Reheating slices of pizza in this thing is amazing. It goes from frozen to cooked in no time flat, without heating the house or wasting electricity."},{"reviewerName":"Belinda Rahm","rating":"5.0 out of 5 stars","reviewTitle":"Great air fryer!","reviewDate":"November 10, 2019","reviewText":"It cooks faster then it says, and so easy to clean!! Very easy to use, open it, it stops, toss or turn food, shut it and it starts again. It’s like a small counter oven, but works super fast and food comes out crispy. No more soggy leftovers!"}],"qAndA":[{"question":"Does the xl max emit a burning plastic or burning rubber smell? i have read a lot of reviews stating that the smaller version has an awful smell.","answer":"I finally used ours no smell at all"},{"question":"Please advise as to country of manufacture.","answer":"China"},{"question":"This product was released last week according to the Ninja website, why does it still say it will be released on 26th August on amazon?","answer":"Amazon has a different release date from the manufacturer. Sometimes the mfr. moves the production dates."},{"question":"what is the heating element? Halogen?","answer":"Hello rulrich,\n\nWe would like to inform you that the Ninja® AF161 Max XL Air Fryer has a calrod heating element. … see more"},{"question":"Why is the price bouncing around? I saw it at $154, put one on pre-order for $155.85 yesterday, this morning it's $151. I cancelled my order.","answer":"Sometimes pricing is based on algorithmic structures and so various discounts. If you wait until Prime Day, the discount should be even bigger. Keep in mind the economy is bouncing around a lot right now (China trade war), so several products made in Asia are seeing price fluctuations."},{"question":"What is the minimum quantity that can be cooked?","answer":"Hello,\n\nWe are happy to help you with your inquiry regarding the Ninja® AF161 Max XL Air Fryer. With this great machine, you can cook as little as you like. When cooking less food, you will need to adjust cooking times and maybe temperature. … see more"},{"question":"Is it safe to use while sitting under a cabinet? How tall is it and how many inches must I have between it and a cabinet while in use?","answer":"Hello,\n\nWe are happy to assist you with your inquiry regarding the Ninja® AF161 Max XL Air Fryer. This unit is 14.8 inches tall. The exhaust vent is located on the back side of the unit. This area will heat up during the cooking process. Be sure to keep the unit at least 5 inches away from any other surfaces. … see more"},{"question":"When cooking wings , can the broiler rack be used to cook 2 layers at a time ?","answer":"Hello,\n\nWe are happy to confirm that you can use the broiler rack in the Ninja® AF161 Max XL Air Fryer to air fry 2 layers of wings. … see more"},{"question":"I was wondering how many chicken wings you can cook with this at a time? Do the wings have to be in a flat layer, or are you able to stack them up?","answer":"Hello Helen Bernstein,\n\nWe would like to inform you that the Ninja® AF161 Max XL Air Fryer allows you ro cook up to 3 pounds of chicken wings at a time. They can be stacked up. With this being said, during the cooking process, we recommend frequently checking your food and shaking or tossing it to ensure desired resu… see more"},{"question":"Can you cook a whole chicken in this air fryer?","answer":"Yes you can. I’ve had my air fryer 2 weeks and I love it. I got the 5.5 qt and wish I had gotten the 8qt. I’ve cooked hot wings fried chicken salmon Pork loin and sweet potato fries. Clean up so easy. Love it."},{"question":"I see the basket/crisper are ptfe and pfoa free. Are all cooking compartment materials also free of these, including the drawer, etc? What about bpa?","answer":"Hello Nicole,\n\nWe would like to confirm that the Ninja® AF161 Max XL Air Fryer is BPA, PTFE, and PFOA free. … see more"},{"question":"Can you cook a whole chicken in this air fryer?","answer":"Yes"},{"question":"Is this item ptfe and ptfo free","answer":"Hello Matt,\n\nWe would like to confirm that the basket and crisper plate for the Ninja® AF161 Max XL Air Fryer are PTFE and PFOA free. … see more"},{"question":"Can this be used on 220v? Or is it only 110v?","answer":"110V only"},{"question":"Is the air fryer basket stainless steel?","answer":"The basket has a ceramic non stick coating, and is very easy to clean"},{"question":"What size accessories (such as cake barrel or pizza pan) does this take ?","answer":"Hello Amazon Customer,\n\nWe are happy to assist you with your inquiry about the Ninja® AF161 Max XL Air Fryer. The dimensions of the inner pot are approximately 8.25 inches in diameter and 6 inches deep. As long as the accessory is smaller than those dimensions, they can be used in this machine. … see more"},{"question":"What size ninja would be best of a single person?","answer":"I'm single and I use this exact air fryer on an almost daily basis. Whether I'm making a couple of servings to have leftovers or to just cook 1 thing for myself. I'm definitely not sorry I have this big of an airfryer that's for sure."},{"question":"how many pre-sets?","answer":"There are 7 settings then you set the temp and time. The settings are max crisp, air fry, air boost, air broil, bake, reheat, dehydrate. It comes with a receipt book"},{"question":"what if any is the difference in measurements in the basket of the xl vs. the regular one?","answer":"Hello Air Show Fan,\n\nWe would like to inform you that the Ninja® AF161 Max XL Air Fryer has a 5.5 quart basket. The other Ninja® Air Fryer has a 4 quart basket. With this being said, the dimensions of the basket, for the AF161, are approximately 8.5 inches in diameter and 6 inches deep. … see more"},{"question":"How is it for baking bread?","answer":"Hello,\n\nWe would like to inform you that the Ninja® AF161 Max XL Air Fryer does have a Bake function, allowing you to bake many different foods. You can use a loaf pan, as long as it easily fits in the basket. With this being said, the dimensions of the basket are approximately 8.5 inches in diameter and 6 inches dee… see more"},{"question":"Cook book in the box?","answer":"No"},{"question":"Is there smoke? Does it make the house smokey? Anyone have food burn? After using it for a while does your house smell?","answer":"No smoke"},{"question":"What is the warranty on this product? And for how long?","answer":"Hello,\n\nWe would like to inform that the Ninja® AF161 Max XL Air Fryer includes a 1 year limited warranty when purchased from an authorized retailer of SharkNinja Operating LLC. … see more"},{"question":"Is it normal for the fryer to have a plastic/chemical smell when cooking for the first few uses?","answer":"Hello,\n\nWe are very sorry to hear that your Ninja® AF161 Max XL Air Fryer has a strange smell. Prior to using the machine for the first time, we recommend that you remove and discard all packaging material, promotional labels, and tape from the unit. We recommend that you wash the ceramic-coated basket, crisper plate… see more"},{"question":"Does this air fryer use teflon?","answer":"It does have a non stick coating. Works very well and easy to clean."},{"question":"Does the xl max works with 220 volt?","answer":"Hello,\n\nWe would like to inform you that the Ninja® AF161 Max XL Air Fryer is designed to work on 120 Volts. … see more"},{"question":"Doe's it smoke? Smoke up the house?","answer":"It does specially if you air fry at a high temperature. When you open the air fryer the smoke comes out and it has set off my smoke alarm. But it still beats regular frying by a wide margin. I used a lot and would buy it again."},{"question":"Does your unit also have chemical plastic smell? The smell seems to be coming from the rubber/plastic knobs on the cripser plate.","answer":"I can’t say I noticed anything but a new smell for a time or two when I first used it."},{"question":"Will the manufacturers warranty apply if I buy it from Amazon?","answer":"Hello,\n\nWe can certainly assist you with your inquiry. The 1 year limited warranty for the Ninja® Air Fryer Max XL (AF161) does apply to the unit even if you purchase through Amazon. … see more"},{"question":"Does the coating on the cooking tray chip over time?","answer":"Not yet on my machine but I haven’t had it that long."},{"question":"I paid $119.99 yesterday for this dry fryer. Attempted to purchase another today but the price is $139.99 now. What gives?","answer":"I paid the higher price. Not sure!"},{"question":"Can I line the ceramic cooking pan with foil? I do not like my food touching any no-stick coating, due to toxicity.","answer":"Ceramic is glass. It is not Teflon or any other chemically formulated coating. Ceramic is naturally non-stick. Personally I would be more afraid of foil as aluminum is linked to Alzheimer’s disease."},{"question":"How noisy is the fryer? Ihave a small open concept house so looking for something quieter","answer":"Very quiet, gets a lil Smokey at times when greasy food"},{"question":"How do I set the clock","answer":"Hello,\n\nWe would like to inform you that the Ninja® AF161 Max XL Air Fryer doesn't have an actual clock. When you cook something, you can choose how long it cooks for by using the Time arrows. … see more"},{"question":"Is this item ptfe and pfoa free?","answer":"Hello Matthew D. Loll,\n\n… see more"},{"question":"Can a chicken of 5 lbs can be cooked in it..?","answer":"Hello Afsana Alam,\n\nWe can certainly assist you with this. You would not be able to cook a 5lb chicken in the Ninja® Air Fryer Max XL (AF161). This unit can only fit up to 3lbs. … see more"},{"question":"Does it come in any other color?","answer":"not sure."}]}