{"title":"COSORI Smart WiFi Air Fryer 5.8QT(100 Recipes), 1700-Watt Programmable Base for Air Frying, Roasting & Keep Warm 11 Cooking Preset,Preheat&Shake Remind,Digital Touchscreen,2- Year Warranty","manufacturer":"COSORI","currentPrice":"$119.99","rating":"4.7 out of 5 stars","totalRatings":"81 ratings","features":["\n         Make sure this fits\n                by entering your model number.\n        \n","The COSORI Smart WiFi has arrived on the Kitchen scene! The first air fryer that can now be controlled and monitored with your mobile devices. Special improved ergonomic angled display provide better viewing, without bending over. Slimmer footprint fit on your countertop and save your space. With the Smart WiFi COSORI is taking your meal preparation to new levels of convenience!","ALEXA and WIFI ENABLED: - The COSORI Smart WiFi air fryer provides you the ability to control your air fryer by using the Vesync APP or through voice with Alexa from anywhere. Now, you will have total air fryer control in the palm of your hands to cook, schedule, adjust and monitor the progress of your meals. Get a head start on dinner by scheduling a cook time 4 hours in advance","MORE THAN 100 RECIPES - The Vesync APP provides you with 100+ original, delicious & pre-programmed recipes to get you cooking with your mobile device. Plus, with the Vesync APP new recipes are added weekly to provide you with the dishes you crave. Find out how our numerous influencers cook their food with COSORI air fryer from our community!","SQUARE BASKET & DISHWASHER SAFE - Compared with a 4-quart round basket or even smaller one, COSORI air fryer's 5.8- Quart Square Nonstick Basket can fit a 5 lbs-6 lbs entire rotisserie chicken, while small round basket can’t. Removable nonstick coated basket are dishwasher safe, PFOA-free & BPA-free. Product Dimension: 11. 8*11. 8*12. 6 in; Basket Dimension: 9*9*3. 75 in. The XL 5. 8-Quart size serves food for 3-5 people","THE BEST HEALTH GIFT CHOICE- For all those people watching their cholesterol or blood pressure, this is a perfect healthy gift for food-loving dads, mothers, family and friends. It has 85% less fat than traditional deep frying methods, but deliver the same deliciously crunchy taste of fried food with little to no oil. Also no oil fumes in house. Let your lover eat healthier!","EASY TO COOK - Built in digital one-touch screen menu featuring 11 presets-Steak, Poultry, Seafood, Shrimp, Bacon, Frozen Foods, French fries, Vegetables, Root Vegetables, Bread, Desserts, Preheat. Quickly navigate both the intuitive LED touchscreen and VeSync APP to select presets and adjust time and temperature settings. Just open the App, and pick a recipe.","COOKING FASTER - Cooking time is faster than conventional oven, but with crispier and tastier results. ETL Listed/FDA Compliant. Automatic shut off prevent overcooking, Overheat protection. With a cool touch handle & button guard to prevent accidental detachment. COSORI original air fryer accessory set is also available for sale (search for: C158-6AC)","Up to 2 Years Warranty: 90-day money-back, comes with 1 year warranty and you can extend to 2 years warranty for free. Just contact COSORI customer service if any issues happened. 100% satisfaction guaranteed. Air fryer requires 2.4GHz frequency band to operate with App, 120V, 1700W. Please note that this voltage only applies to USA and Canada"],"reviewsAspects":["easy to clean","air fryers","fried chicken","easy to use","chicken wings","much easier","temp and time","love this air","absolutely love","wifi version","super easy","easy to operate","made chicken","easy to cook","clean made","use easy","smart air","clean and use","recipes","kitchen"],"productInformation":[{"Product Dimensions":"11.8 x 12.6 x 11.7 inches"},{"Item Weight":"15.9 pounds"},{"Shipping Weight":"15.9 pounds (View shipping rates and policies)"},{"Manufacturer":"COSORI"},{"ASIN":"B07VLKMMJ5"},{"Item model number":"CS158-AF"},{"Customer Reviews":"4.7 out of 5 stars\n    81 ratings\n4.7 out of 5 stars"},{"Best Sellers Rank":"#6,190 in Kitchen & Dining (See Top 100 in Kitchen & Dining)\n#23 in Air Fryers\n"},{"Date first listed on Amazon":"August 1, 2019"}],"productDescription":["Use your phone to operate the fryer from the other room or across the kitchen.","With the VeSync app, keep a close eye on your meal as it cooks.","Coordinate your meal by scheduling cook times up to 4 hours in advance.","Don’t know where to start? Try out our complimentary recipe book for inspiration.","A Cosori Air Fryer means so much more than fries. Serve up egg bakes, impressive sides, desserts, roasted veggies, and just about any protein,","expertly cooked.","You won’t find a preheating option in many other air fryers. Preheating visibly improves food texture and takes 2–5 minutes!","Foods are as easy to take out as they were to put in. The nonstick surface of the basket results in less residue left behind. In turn, cleanup won’t be so rough.","The fryer’s touch screen display is angled to face you, increasing visibility and ease of use."],"reviews":[{"reviewerName":"Happy Customer","rating":"5.0 out of 5 stars","reviewTitle":"Reignited the joy of Cooking!!","reviewDate":"September 13, 2019","reviewText":"Purchase this Air-Fryer. I did all the research for you. I spent 3 days researching air fryers pouring over hundreds of reviews, specs and videos.\n\nVery convenient. I purchased for my 70+ year old mother's birthday on August 27, 2019. Although mom was a great cook, she no longer enjoys the hassle of cooking now. But this Cosori air fryer has reunited her joy for cooking. She enjoys trying the many recipes included with the device as well as going on Google to find new recipes.\n\nChicken Thighs and hicken wings are big hit. I actually prefer the wings from the air fryer than any restaurant wings. Even shrimp came out great. I worried the texture of vegetables such as squash and zucchini would not do well but I was wrong. The vegetables were great as well.\n\nThe preset cooking settings make cooking super simple. The shake alarm is really helpful because it's important to turn food to prevent burning and insure even cooking.\n\nI highly recommend this new model of the Cosori air fryer. It's basket is relatively larger than others in same price range so you can cook more at same time. Also it has a smart wifi feature which allows you to control the device with your phone."},{"reviewerName":"Q.C","rating":"5.0 out of 5 stars","reviewTitle":"Best purchase on amazon this year!","reviewDate":"August 29, 2019","reviewText":"This air fryer is amazing and I bet this would be my best purchase on amazon in 2019! I've watched air fryer for a long time and hadn't decided until noticed this one. Most air fryers can only work manually to set up time and temperature, which is not suitable for me. I'm always trying to make my kitchen smarter and this wireless-connected air fryer would be the best choice for me! I can prepare meat or veggies in ahead and just put it in the air fryer. I only need to open the air fryer on my way home. Everything is super easy and the receipt book really helps to prepare.\nNotes for cleaning issues: put aluminum foil and get rid of washing it."},{"reviewerName":"valerio","rating":"5.0 out of 5 stars","reviewTitle":"Very nice, very professional company","reviewDate":"August 30, 2019","reviewText":"First of all I want to say that this is a very nice air fryer. It is well done and works great.\nI also want to make my compliments to the customer service: really top! I wrote an email this morning asking for support because I could not connect my mobile with the air-fryer and they solved in the same day.\nI take my dusty hat off!\n\nPS problem was that it is necessary to turn off mobile data before proceeding, Solved! Thanks!"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Love it","reviewDate":"August 29, 2019","reviewText":"Excellent product. I have been exploring healthy cooking now I have a toddler. This air fryer allows me to prepare delicious fried food to my family without the excessive amount of fat and calories that traditionally come with deep frying. The fryer is super easy to set up, use, and clean. Food came out so much better than expected and I definitely recommend it as a better alternative to deep fryers. I have a lot of kitchen appliances but I already see myself using this on a frequent basis."},{"reviewerName":"Kai","rating":"5.0 out of 5 stars","reviewTitle":"This size is good.","reviewDate":"August 28, 2019","reviewText":"This size is good.\nThe basket can be detachable, so it is easy to clean.\nI have made chicken thighs, sweet potato fries, and I want to try more recipes.\nI love this air fryer!"},{"reviewerName":"Brandi Holbrook","rating":"5.0 out of 5 stars","reviewTitle":"Buy this!","reviewDate":"September 3, 2019","reviewText":"Best purchase I’ve made all year! It’s quick and easy to make a meal. I made chicken wings with no breading and they came out\ncrunchy and delicious!"},{"reviewerName":"Tina","rating":"5.0 out of 5 stars","reviewTitle":"Highly recommended","reviewDate":"September 3, 2019","reviewText":"This fryer has larger basket than my old one, which can serve 4 to 5 people. I like the touch screen very much as it is very easy to clean. The basket, not to mention, is dishwasher safe, so it saves time to clean as well. For Friday movie nights, french fries are the best! The app control is still new to me. It’s good to learn something new."},{"reviewerName":"Eurus","rating":"5.0 out of 5 stars","reviewTitle":"easy to operate","reviewDate":"September 1, 2019","reviewText":"This air fryer is the best kitchen supplies I bought this year!Air fryer with WIFI is awesome!I don't have to go to kitchen to control it!This is not just fried,I can make a dessert too! I am glad they gave me the recipes book so it makes much more easy to cook.And this size is totally enough for 2-4 people.Pretty incredible!"},{"reviewerName":"Jen","rating":"5.0 out of 5 stars","reviewTitle":"Lifechanging! So easy to cook tasty and healthy meals.","reviewDate":"September 29, 2019","reviewText":"I have used this every day since getting it.\n\nThe 11 presets are convenient in automatically setting temperatures and times to cook food crisply and evenly. I have made fried chicken, fries, steak, vegetables and more in this handy machine, for all kinds of meals.\n\nThe non-stick basket is easy to clean. As all the oil and excess water drips to the bottom basket, you can cook your proteins, then sides without using multiple pans or watching over the time like you would with a stovetop. You can even defrost.\n\nI chose this model as there is an app with recipes for inspiration, and also a way to start cooking from your phone, and get notified on when to shake or flip halfway.\n\nIt also looks modern in my kitchen and makes a nice futuristic humming sound to boot."},{"reviewerName":"M. Simms","rating":"5.0 out of 5 stars","reviewTitle":"I LOVE IT!","reviewDate":"The manufacturer commented on the review below","reviewText":" I really like this air fryer. I have only had it for two weeks and have used it three times. Every time I use it excessive smoke comes out of the supposedly seals of the pull out drawer (see video) and sets off my smoke alarm (usually around 8-9 minutes). This will be my third air fryer and have never experienced this before. Also, I have reviewed all of the other reviews and did not see a pattern that this is normal. I am literally afraid to use it. If I still had the box I would return it. I am just going to throw it out. The food did come out good though and I absolutely love the smart features. I am really disappointed because I have read really good things about the COSORI and many of the youTube videos I have watched for air fryer recipes use it. Guess I just got a lemon.\n\nUPDATE: I was contacted by Cosori (they actually contacted me) and just like other reviewers, they addressed my issue and sent me a new air fryer. Great Customer Service. It is so refreshing to deal with a company who stands by their product. As I type, I am making wings for the first time in my new air fryer, and guess what, NO SMOKE. Smells amazing!"},{"reviewerName":"Chloe","rating":"5.0 out of 5 stars","reviewTitle":"Great air fryer","reviewDate":"August 28, 2019","reviewText":"It looks very fancy. Coming with user manual and recipes, very thoughtful and friendly for a beginner user. Good for 2-3 ppl. It’s my first step towards a healthier lifestyle. Remember to remove the plastic and paperboard inside before use. Can’t wait to have my first meal cooked by it."},{"reviewerName":"Judo","rating":"5.0 out of 5 stars","reviewTitle":"Become master chief with it!","reviewDate":"September 4, 2019","reviewText":"I like this product sooooooooooooo much! It's so convenient and healthy! I don't need any oil with this cooking, still taste so good！Any kind of meat and vegetables match so perfect! Also, I can make dessert or cake with this. Besides, there's no smoke and food will be done in very short time. The most valuable product for kitchen!"},{"reviewerName":"Pavel","rating":"5.0 out of 5 stars","reviewTitle":"Very easy to use, easy to clean. Tasty food in minutes.","reviewDate":"October 7, 2019","reviewText":"I didn't think I was going to be a big fan of air fryer until this product changed my opinion! I thought air fryers are just for fried chicken, but actually, this item can be used to cook all kinds of food. No matter it's steak, fish, wings, or even veggies. Just put it in and let it be - it will become ready in minutes. The cooked food tastes pretty similar to actual grilled food, but the clean up is much easier than a grill, and also air frying is much healthier than grilling. Attached photo is air fried sea bass! I use this item all the time now, recommend!"},{"reviewerName":"Amazon Customer","rating":"3.0 out of 5 stars","reviewTitle":"Good product, bad app Vesync is horrible. No notification.","reviewDate":"The manufacturer commented on the review below","reviewText":"The fryer itself is good. I hesitated to get the wifi version with all the data leaks, etc. But after using it, was glad I did EXCEPT....the app is junk....it's a generic control app. It let's you set your fryer to preheat and cook. It notifies you it's preheated sometimes. If you are actively using your phone, notifications work. God forbid you set it down and the screen goes off. No notifications. Garbage. I have resorted to setting separate alarms for preheat and cooking. So many possibilities, such poor execution."},{"reviewerName":"Xinyue Yang","rating":"5.0 out of 5 stars","reviewTitle":"Love the design","reviewDate":"August 29, 2019","reviewText":"I like the design. It looks so beautiful on my countertop. The basket is big enough for a medium size chicken so there is plenty of space. A recipe book also comes with the package which saves me lots of time. There are 5 cooking modes and a preheat setting and I can control the machine through the app, which enables me to plan for meals."},{"reviewerName":"take2heart","rating":"4.0 out of 5 stars","reviewTitle":"Cosori AirFryer 5 Stars-WiFi is almost a good idea...","reviewDate":"The manufacturer commented on the review below","reviewText":"I bought this air fryer and I do love it. The WiFi is almost a good idea. Three things that it needs-1) The APP needs tell me with a sound to shake or that it is ready. The Air Fryer itself beeps, the APP does not. It does give me a banner type notification. But if I’m busy in the other room, I still have to watch my APP for when it needs attention. 2) The SHAKE aspect is only on certain presets. I would like to be able to tell it when to have me SHAKE. 3) The history seems useless. It only has a list of days and times, no history of what settings, or recipes-so I don’t really get it! But the Cosori Airfryer is roomy, easy to clean, I use it at least once a day! Love it!"},{"reviewerName":"Carol A. Cannon","rating":"5.0 out of 5 stars","reviewTitle":"Cosori Smart Air Fryer","reviewDate":"October 12, 2019","reviewText":"Love this air fryer. Very good size for a family...5.8 qt., easy to use, easy to clean, and fries came out perfectly done. Not too big which is important in a kitchen with pressure cookers! Especially like the large square basket which holds much more than round baskets.\nPrice is very reasonable as well. Can program it with your smartphone to use in room in your house."},{"reviewerName":"El Nelsono","rating":"5.0 out of 5 stars","reviewTitle":"DO. NOT. HESITATE.","reviewDate":"October 12, 2019","reviewText":"Waited way too long to finally invest in an air fryer. Did tons of research which eventually led me to this baby. Perfecto! Reasonable footprint. Quiet. Simple to operate. Quick to clean. And mostest bestest part: the air fried foods are IN-SANE!!\nP.S. I ordered the version w the app although the assumed it was unnecessary. SO glad I did; we use the app most of the time we air fry."},{"reviewerName":"hwatkins","rating":"5.0 out of 5 stars","reviewTitle":"I love this Cosori Air Fryer!!","reviewDate":"October 15, 2019","reviewText":"I just had to write a review. I have a Nuwave AF, but didn't like it as much as my Cosori. I love the basket vs the Nuwave, so much easier to clean. The non stick coating appears to be better as well, my Nuwave started to peal just after a few uses. Over this past weekend, I used it all weekend. I made chicken drums that turned out perfect and made some honey glazed carrots from the awesome Cosori cookbook that it came with. I also, made some muffins and two Cornish hens...came out awesome as well. Last night I made pizza's ....delish! This AF is so easy, you won't be disappointed if you bought one for yourself! A very satisfied customer. I have a Cosori pressure cooker as well and love it too!"},{"reviewerName":"usha","rating":"5.0 out of 5 stars","reviewTitle":"Vivaa COSORI ♥️","reviewDate":"October 12, 2019","reviewText":"Easy to clean,use,cook everything really saves time\nAm a PhD student who loves to cook but unfortunately I don’t have enough time to practice my cooking hobby but with COSORI airfryer the recipes that used to take an hour or more in the oven just take half of the time and with yummmmmi and healthy results.I’ve attached some of my dishes that i used COSORI to prepare them also I bought the accessories of the machine gonna use the skewers to go some Kabab.Can’t wait😁\nThaaank you ♥️ for this smarty invention and cost-effective machine ."},{"reviewerName":"Shebnana","rating":"5.0 out of 5 stars","reviewTitle":"Love It!!!!!","reviewDate":"September 3, 2019","reviewText":"I wanted this for a while before I justified the purchase. I'm so happy I got it, I'm sure I will use it often."},{"reviewerName":"Elaine Godoy","rating":"5.0 out of 5 stars","reviewTitle":"Worth every penny","reviewDate":"October 5, 2019","reviewText":"After waiting and doing my research, I’m glad I decided on this fryer. The app makes cooking stupidly easy! Find a recipe and “cook this”. It notifies you when it’s preheated or when it’s time to shake the contents and when it’s done. Definitely love it"},{"reviewerName":"elijah pedone","rating":"5.0 out of 5 stars","reviewTitle":"Holds a lot of food","reviewDate":"October 20, 2019","reviewText":"This fryer is badass lol cooks great and fasts plus easy to clean. 25 chicken wings, no problem at all and cooked nearly perfect IMO and it informs me on my phone when it’s finished. We love it"},{"reviewerName":"KGreen","rating":"5.0 out of 5 stars","reviewTitle":"Loving my air fryer","reviewDate":"September 26, 2019","reviewText":"I’m now officially in love with air fryers. They cook everything perfectly and are so easy to use and clean. I’ve made quite a few recipes and am looking forward to trying many more."},{"reviewerName":"T. Davis","rating":"5.0 out of 5 stars","reviewTitle":"Still learning to use this, but it is already becoming a staple.","reviewDate":"October 18, 2019","reviewText":"This air fryer is great! I'm still in the learning phase, and have had a few misses, but I have gotten my sandwiches down perfectly. Easy to heat stuff up quickly too. Love it!"},{"reviewerName":"Sue","rating":"4.0 out of 5 stars","reviewTitle":"Tasty, easy to use, flavorful without lots of calories!","reviewDate":"The manufacturer commented on the review below","reviewText":"I bought it a month or so ago and really do like it. Still trying to perfect the cooking particularly meats. It is tasty though. Have done great fish tilapia was fresh tasting and crispy. The homemade chips were amazing-definitively slice (use mandolin is possible) easy to cook and so crispy. I would definitely recommend this product"},{"reviewerName":"Frances Wang","rating":"5.0 out of 5 stars","reviewTitle":"Great product, worth to buy","reviewDate":"October 3, 2019","reviewText":"We used to have one other brand but not working anymore. This one is easy to use, with the high tech its much easier and more convenient to control. Also this one has bigger volume. Even brand new doesn't has that smell with the other one. The menu is so useful, it shows alot of different receipts."},{"reviewerName":"Ggkn","rating":"5.0 out of 5 stars","reviewTitle":"Thank you!","reviewDate":"October 5, 2019","reviewText":"Thanks to all of you that wrote reviews! That is what convinced me that the Cosori was the AF I need. It’s terrific and no problems. Of course the first thing I tried was frozen shoe string potatoes 😂. Divine! I just tried wings for Buffalo wings....another success! Next in the menu is a boneless ribeye. Also, love the Cosori community on Facebook."},{"reviewerName":"Delvitta Saint-Pierre","rating":"5.0 out of 5 stars","reviewTitle":"Life Changing Appliance","reviewDate":"October 17, 2019","reviewText":"Great for cooking meats. Chicken is crispy and steaks are cooked perfectly. Meats are juicy, not dry. So convenient. Time saver."},{"reviewerName":"Rita Pepper","rating":"5.0 out of 5 stars","reviewTitle":"Easy cleanup and operation. Healthy way to cook.","reviewDate":"September 10, 2019","reviewText":"I love the ease of operation and so easy to clean it.\nHave made several things already and we’re excellent. Have recommended it to several friends."},{"reviewerName":"Wildlettermath","rating":"5.0 out of 5 stars","reviewTitle":"Great","reviewDate":"September 19, 2019","reviewText":"This is my first airfryer and I'm completely sold!"},{"reviewerName":"JB","rating":"1.0 out of 5 stars","reviewTitle":"Won’t make it long ... keypad issues","reviewDate":"The manufacturer commented on the review below","reviewText":"I just bought it last month .. we might use once or twice a week ... key pad it’s not easy you press and nothing happens you have to keep pressing In order to HOPEFULLY set the temp and time .. if it wasn’t for the keypad all would it be great"},{"reviewerName":"Sandra velazquez","rating":"5.0 out of 5 stars","reviewTitle":"Cooking time","reviewDate":"October 31, 2019","reviewText":"Love it, works well, very easy and the apps is awesome, food comes out delicious and well done, never worry or stay watching it cause it turns off when food is done..recommend to family and friends"},{"reviewerName":"Conedodger99","rating":"5.0 out of 5 stars","reviewTitle":"Quality product","reviewDate":"September 11, 2019","reviewText":"Really like the overall quality of this air fryer. Easy to use and well-built."},{"reviewerName":"Gretchen K Cantelmo","rating":"5.0 out of 5 stars","reviewTitle":"Wonderful","reviewDate":"November 1, 2019","reviewText":"Love that I can be in another room and am notified of when it is done!"},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Best Buy yet","reviewDate":"August 28, 2019","reviewText":"Love love this machine! Worth the money"},{"reviewerName":"Qian.Huang","rating":"5.0 out of 5 stars","reviewTitle":"A really cool kitchen supply","reviewDate":"September 7, 2019","reviewText":"This air fryer is really cool. It’s easy to operate with WIFI. And I can fried the French Fired without adding oil. It’s really convenient to cook. I like it very much."},{"reviewerName":"Kristen O.","rating":"5.0 out of 5 stars","reviewTitle":"Awesome Air Fryer!","reviewDate":"September 24, 2019","reviewText":"Absolutely love this machine! It’s super easy to learn, large enough for the family, and the WiFi feature is amazing!"},{"reviewerName":"TOMMY","rating":"5.0 out of 5 stars","reviewTitle":"sorry i waited so long to purchase it.","reviewDate":"November 9, 2019","reviewText":"great product, I regret waiting so long to purchase it."},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Great look","reviewDate":"September 9, 2019","reviewText":"Can't wait to try some new keto recipes"},{"reviewerName":"Dr. Chinchilla","rating":"5.0 out of 5 stars","reviewTitle":"Simply the best","reviewDate":"October 12, 2019","reviewText":"Buy this airfryer; you will be happy. It's has a great amount of space and can cook anything."},{"reviewerName":"Ahmed Khan","rating":"5.0 out of 5 stars","reviewTitle":"Glad my daughter is happy with this product","reviewDate":"October 22, 2019","reviewText":"This was gift for daughter and has informed me that this product very good and she well pleased"},{"reviewerName":"Amazon Customer","rating":"1.0 out of 5 stars","reviewTitle":"Steam","reviewDate":"The manufacturer commented on the review below","reviewText":" Does it looks normal?\nI’m not happy with that."},{"reviewerName":"Don A.","rating":"5.0 out of 5 stars","reviewTitle":"Easy to use,and quick","reviewDate":"September 19, 2019","reviewText":"Let be this fyer\" I cook a lot and it is my favorite go to cooker!"},{"reviewerName":"CHARLOTTE MCNEIL","rating":"5.0 out of 5 stars","reviewTitle":"Easy to use","reviewDate":"November 1, 2019","reviewText":"Love the size. How easy it is to use. Cleanup is quick and easy."},{"reviewerName":"Celeste M. Lyons","rating":"5.0 out of 5 stars","reviewTitle":"Easy to use. Easy to clean.","reviewDate":"September 20, 2019","reviewText":"Love this air fryer."},{"reviewerName":"John D Herner 1st","rating":"5.0 out of 5 stars","reviewTitle":"Love it!!!","reviewDate":"October 25, 2019","reviewText":"Love everything about this unit."},{"reviewerName":"Mandaha","rating":"5.0 out of 5 stars","reviewTitle":"Good","reviewDate":"September 11, 2019","reviewText":"Good"},{"reviewerName":"Harry Shaw Jr.","rating":"5.0 out of 5 stars","reviewTitle":"Best air fryer for the money","reviewDate":"August 24, 2019","reviewText":"This is an updated version of the original and has the added benefit of wireless connectivity. I absolutely love this air fryer and have used it for a week straight since receiving it. It's easy to use, easy to clean, and creates very tasty food. I would highly recommend choosing this air fryer over others. Unlike other air fryers, this gets to 400 degrees and also has a preheat function."},{"reviewerName":"Tom Horsman","rating":"5.0 out of 5 stars","reviewTitle":"The Air Fryer can used normally without The WiFi","reviewDate":"August 30, 2019","reviewText":" Same Cosori 5.8 Quart Air Fryer, however they’ve added WiFi Enabled Controls to it, the app was easy to download and use. Pretty cool, although it may not be for everyone."},{"reviewerName":"No Deal","rating":"5.0 out of 5 stars","reviewTitle":"Just like the regular one but smarter!","reviewDate":"September 7, 2019","reviewText":"I got this from another retailer, but I wanted to review it, the smart phone app works perfectly, no bugs or problems connecting or controlling it, it cooks great as well. Good job Cosori!"},{"reviewerName":"Fitzzz","rating":"3.0 out of 5 stars","reviewTitle":"smaller than I expected","reviewDate":"The manufacturer commented on the review below","reviewText":"I was disappointed by the size , which is 10\"x10\" x3.5\"\nthere is enough space to cook 2 chicken legs & thighs , and it takes about 25 minutes so this is not something you can plan on using for more than a meal for 2\nThe chicken I cooked turned out very well, I was surprised how good and crispy without using any oil\nI'M sure they will make a larger model soon, which I look forward to"},{"reviewerName":"banjo player","rating":"5.0 out of 5 stars","reviewTitle":"accessible for a blind cook plus support","reviewDate":"August 28, 2019","reviewText":"I just received my Cosori smart air fryer today. I am fairly new to air fryers. I had a 2 quart air fryer for a couple months and it seemed a bit small even for just my wife and I. My wife saw the Cosori air fryer and thought it looked good and was worth looking at. I saw that there was a WIFI version. This looked interesting to me because it was advertised as being available to operate by my iPhone.\n\nI am blind and usually do not find many appliances that are accessible for me to operate. With a little help to connect the air fryer to the vesync app, I was able to operate all the functions described in the product description using my iPhone.\n\nI tried a couple functions like preheat, delayed start, manual cooking, and preset for vegetables. It all worked without a flaw. Pretty incredible! I ended up cooking a couple batches of asparagus. They were just as good as if I had made them in the oven. Probably a little better. I was notified, when using the preset, to pull out the basket for a little shake. The vesync app also let me know the current temp and time remaining for cooking, with an option to pause or stop cooking.\n\nIn the app there is a section for recipes along with a history of what settings I have used for cooking with corresponding dates.\n\nAs I said I have not much experience with air fryers, so I cannot say this is better or worse than others. I can say that this is the only air fryer that I have found that is totally accessible for a person who is blind. I cannot overstate how unusual and impressive the accessible capabilities are for this air fryer.\n\nI wanted to add one more comment: When the new version of the iPhone IOS 13 came out, the vesync app did not work for using the air fryer with my iPhone and the VoiceOver screen reader. I notified vesync. They were on it. Within 2 weeks they had made the needed corrections to their app and now I am back up and running. Wow! that is customer support. I will be a life-long customer of the Cosori and vesync products. If I could give this product a 10 I'd do it. Thanks so much.\n\nbtw many times when I contact an app developer about using their app with VoiceOver, they just say too bad for you. Not with vesync."},{"reviewerName":"Faith Schneck","rating":"5.0 out of 5 stars","reviewTitle":"Incredible","reviewDate":"September 5, 2019","reviewText":"This machine is amazing. As long as the food is in a single layer, it comes out perfectly crisp every time. I've had to play with cook times and make some adjustments but the app is comes with makes it so easy. I have made asparagus, fish, boneless wings, chips, fries, and Parmesan chicken in it and each one was delicious! If you are on the fence, I'm telling you, this is a great investment."},{"reviewerName":"Mary M","rating":"5.0 out of 5 stars","reviewTitle":"This thing is awesome!","reviewDate":"October 26, 2019","reviewText":"This air fryer is a must have in the kitchen. It's fast and pretty much oil free. We've cooked so many things in this and it's very easy to clean afterwards. Even chocolate chip cookies come out in 5 minutes, no muss no fuss with heating up the oven. We have the wifi version, not sure wifi is really needed with an air fryer, but because it will only attach to the 2.5 wifi bandwidth, we can't get this to pair with it's app. It wants to attach to the 5 bandwidth. So, it's lacking there, but the convenience of having to just push a button and voila! the temp and time are programmed in, makes up for the lack of wifi. Air fryers don't have to be smart. Be sure and get the larger size, you won't regret it. Let's hope they go on sale for Black Friday, I'd like to buy another one."},{"reviewerName":"MZ DIVA","rating":"5.0 out of 5 stars","reviewTitle":"THE BEST MACHINE EVER.....","reviewDate":"September 9, 2019","reviewText":"I know I just got this Saturday but I just had to cook in it that day.. OMG my chicken was cooked all the way through on the set modes and was so tasty and crunchie. My family loved the flavor. I had not paid any attention to this brand before but it is the best. I love to hear the sizzling sounds of food actually cooking. Yeah it cost more than others but you get more than others. wifi app, delayed cooking and keep warm settings. I got my friends buying it now.\nthank you."},{"reviewerName":"Stephanie Scott","rating":"5.0 out of 5 stars","reviewTitle":"Worth every penny spent (so far)","reviewDate":"November 6, 2019","reviewText":"It took me forever to buy an air fryer. I kept talking myself out of another kitchen gadget taking up counter space and/or collecting dust. After eating some chicken wings from my neighbor, I knew I had to get one. I researched a lot of brands and settled on this one. Oh Em Gee! I've only had it for a couple of months and has used it way more than any other gadget. Pardon the poorly presented lamb chops, but I had to share (a pic :)). I've cooked wings, chicken, shrimp, lamb shops, roasted Brussels Sprouts, and much more. it cooks to perfection, has an app and recipes I use on my phone, and is very easy to clean. Great purchase!"},{"reviewerName":"mylittleflicka","rating":"5.0 out of 5 stars","reviewTitle":"Quick and Easy","reviewDate":"October 11, 2019","reviewText":"Preheat is quick. I don’t have to use my stove or oven as much, as it acts like a convection oven. I like the ability to cook, hot dogs, hamburgers, etc. without having to cook them on a skillet. They brown really nicely. I bought some accessories as well. I also like the app for my phone as I can make my own recipes for temperature and times so they are saved."},{"reviewerName":"Jaden","rating":"5.0 out of 5 stars","reviewTitle":"Amazoning","reviewDate":"September 13, 2019","reviewText":"The air fryer is very convenient to use, there are more than a dozen functions to switch, it can do many kinds of food, very delicious, and very little oil, it's very good for health. It can also be controlled via WiFi, and the kitchen work can be controlled in another room. It is very easy to clean and I will recommend it to my friends."},{"reviewerName":"Joyce M. Wesner","rating":"5.0 out of 5 stars","reviewTitle":"Must have","reviewDate":"November 2, 2019","reviewText":"How was I cooking before my air fryer?!? Seriously I use it just about every day. The one down side is that I cant run it on the same circuit with our microwave but I figured out another outlet for it. So easy to fix spaghetti squash and veggies in. Chicken wings and salmon have come out delicious. Love it!!"},{"reviewerName":"PegKi C","rating":"5.0 out of 5 stars","reviewTitle":"Great air fryer 5.8qt","reviewDate":"October 1, 2019","reviewText":"A friend recommended me to get a air fryer. After searching for awhile, I purchased this air fryer based on the good reviews. It didn't disappoint me. It's easy to use, and come along with recipes. I made fries and it was successful. Also their customer service is excellent."},{"reviewerName":"Shawn Christian","rating":"5.0 out of 5 stars","reviewTitle":"A WiFi air fryer, this is the one","reviewDate":"November 5, 2019","reviewText":"Not just an air fryer, this thing even has a WiFi app so you can start dinner when your getting ready to leave work. It’s pretty awesome."},{"reviewerName":"Mariano Bruno","rating":"5.0 out of 5 stars","reviewTitle":"Got to have it","reviewDate":"November 6, 2019","reviewText":"Best thing I ever bought."},{"reviewerName":"T. Cunningham","rating":"5.0 out of 5 stars","reviewTitle":"Crispier is always better","reviewDate":"October 29, 2019","reviewText":"Liked how it makes some foods exceptionally crispy - which everybody likes."},{"reviewerName":"Jesse","rating":"5.0 out of 5 stars","reviewTitle":"Get yours today!","reviewDate":"October 28, 2019","reviewText":"Love this air fryer!"},{"reviewerName":"Brian","rating":"5.0 out of 5 stars","reviewTitle":"Love it","reviewDate":"October 21, 2019","reviewText":"Makes the best breakfast sausage"},{"reviewerName":"Reginald A. Corrington","rating":"5.0 out of 5 stars","reviewTitle":"Great buy","reviewDate":"October 17, 2019","reviewText":"This product works amazing!!!! I have made wings & donuts so far."},{"reviewerName":"Jose sanchez","rating":"5.0 out of 5 stars","reviewTitle":"Best fryer!..","reviewDate":"September 13, 2019","reviewText":"So easy to use!.. should had buy one earlier!"},{"reviewerName":"Matthew W","rating":"4.0 out of 5 stars","reviewTitle":"Fried chicken with just a few sprays of cooking oil","reviewDate":"The manufacturer commented on the review below","reviewText":"Great little machine. Quick fried chicken with easy clean up. Quieter than my microwave."},{"reviewerName":"Krasus","rating":"5.0 out of 5 stars","reviewTitle":"The most satisfied air frier I've ever have","reviewDate":"September 7, 2019","reviewText":"When Alexa meets an air fryer, it's so convenient, you can prepare the food and set up the air fryer, then remote control it with either your cell phone or just ask Alexa to do things for you, I love technologies."},{"reviewerName":"Kd","rating":"5.0 out of 5 stars","reviewTitle":"We would buy it again.","reviewDate":"October 23, 2019","reviewText":"A quick reference sheet for most common foods would be helpful. Blue tooth connection would be better to use. Over all easy to cook, clean and use. We use it almost daily. Fries, fish sticks, chicken, roasted vegetables. A divider would be nice to slip in if cooking two different items."},{"reviewerName":"Deash","rating":"5.0 out of 5 stars","reviewTitle":"Waiting on my smar wi-fi Cosori","reviewDate":"September 8, 2019","reviewText":"This is the first time I read a review and all the reviews were good. Because of the good reviews I order the Cosori smart air fryer (9/8/19) with wi-fi. I have a Holsolm air fry which I like, it's just too small. I can wait to get my new Cosori.\nI will give my opinion once I use my Cosori"},{"reviewerName":"iris","rating":"5.0 out of 5 stars","reviewTitle":"We love air fryer","reviewDate":"October 28, 2019","reviewText":"This air fryer is very practical and easy to operate, you can do a lot of food according to the recipe it gives. I made fried chicken wings . French fries. green beans... Cleaning is also very simple. Highly recommended."}],"qAndA":[{"question":"Does it come with a remote controller?","answer":"This air fryer does not come with a remote controller. Instead, it can be conveniently controlled through the VeSync app that you can download on to your smart phone. Please let us know if you have any other questions. We are happy to help!"},{"question":"I see it states it's smaller than the original. What is the size difference? The website shows both the same size.","answer":"The size of the smart air fryer is the same as the original one. Hope this helps!"},{"question":"Does it work with alexa?","answer":"It does not have Alexa integration at this time :/ I've read that the app supports it but not on air fryers."},{"question":"I would like to check, what is the voltage for this air fryer?","answer":"110v"},{"question":"I just purchased a cs158-af, but should the drawer detach. i have burned myself once and spilled oil another. the detach button is locked/covered","answer":"The drawer should definitely not detach if the detach button is not being held down! If it's covered and not being pressed, and it's still detaching, I would contact customer service and see what they can do to help you get it replaced."},{"question":"How many wings cook at 1 time!","answer":"I've gotten up to a dozen medium sized wings on at one time"},{"question":"Can the Cosori be used as a dehydrator like the Ninga?","answer":"No, this air fryer does not have a dehydrator function. Hope this helps!"},{"question":"Hi is this exactly the same as the previous Corsori 5.8 qrt? I was looking to buy that one but it disappeared...","answer":"The links are fixed. You can find the older one now"},{"question":"Can you fry breaded fish?","answer":"You can fry anything you want"},{"question":"How many degrees does the C1700 get up to?","answer":"400 F"},{"question":"When will you make this in colors, white?","answer":"Currently, the WiFi air fryer will only be available in black. We appreciate the question! Please feel free to reach out if we can help with anything else."},{"question":"Is this model the only one that can be set up via the app?","answer":"Yes"},{"question":"How do you disable the alert to shake the food?","answer":"The shake reminder should only come on if you are using certain presets. They cannot be disabled, but you are able to manually program the air fryer to cook at the desired time and temperature (without the shake function). We hope this helps! Please let us know if you have any further questions."},{"question":"How many degrees does the C1700 get up to?","answer":"The temperature range for this CS158-AF model is 170-400 F. We hope this helps! Please reach out to us if you ever have any questions."},{"question":"can you clean this using the dish washer?","answer":"I think so. It says this product support dish washer while I hadn’t tried."},{"question":"Does the smart air fryer come in the smaller basket?","answer":"No. The inner basket is the same as the original one. The dimensions of the inner basket are about 9 x 9 x 3.75 inches. Hope this helps!"},{"question":"is there a list of Alexa commands for this somewhere, my alexa sees the air-firer via Vesync but does not respond to any of my command guesses?","answer":"Im not sure, have you looked in the owners manual?"},{"question":"Please tell where this ventilates, top or bottom? Someone's counter cracked because of bottom ventilation!","answer":"Back"},{"question":"Is the clear plastic slider on the handle durable enough to hold up? It concerns me. I just purchased this air fryer.","answer":"Yes, it will! This plastic slider is built to last and slide back and forth easily, all while protecting the basket release button. If you have any other questions, please feel free to reach out at any time."},{"question":"I bought another brand and had to return it as my food tasted like toxic plastic. Anyone experiencing plastic taste using this air fryer?","answer":"Maybe you left packing tape or foam inside. I love my Cosori, the food taste great!"},{"question":"What is the basket coated with? Teflon?","answer":"Yes, both baskets are coated in Teflon. Hope this helps! Let us know if you have any other questions."},{"question":"where can i download the app?thanks","answer":"App Store"},{"question":"Besides the wi-fi what's the diff between this one and the Corsari for 99, w/o the wi-fi?","answer":"Just the WIFI"},{"question":"What is the best setting for crispy tofu?","answer":"No idea LOL!"},{"question":"Do you have to use the app to operate or does it come with a standard plug?","answer":"You don't need the app"},{"question":"Can u place this on a granite counter?","answer":"Yes"},{"question":"Will you be offering a non-teflon ceramic coated basket in the future?","answer":"Yes"},{"question":"Is the basket dishwasher safe?","answer":"Yes"},{"question":"Does it pop corn, make popcorn?","answer":"No, the air fryer is not designed to pop popcorn. Feel free to contact us if you have any further questions."},{"question":"Can I look at recipes","answer":"Sure. You can see recipes on the 5.8 Qt Air Fryer's listing(ASIN: B07GJBBGHG). Hope this helps!"},{"question":"Me llega directamente a Colombia?","answer":"Todos los paquetes serán enviados por Amazon. Para obtener más información sobre los servicios de envío a Columbia, ¡no dude en ponerse en contacto con Amazon directamente!"},{"question":"So you are able to control this air fryer with your cell phone???","answer":"Yes! I haven’t tried it at a distant yet but I use the app all the time when I am sitting in the kitchen with the AF. So far flawless."},{"question":"I see in the desc. of this newer model it states that it has a slimmer design. Can you tell me the difference between this model and the older one?","answer":"funny you should ask this question. I ordered the older one and then the new one came out 2 weeks later so I probably returned my old one to get the new one. But there was a period where they overlapped and were in the house at the same time. I checked and there wasn't much of a difference at all that I could notice to… see more"},{"question":"I saw a few Corsori air fryers with same stats...Is this a newer model or how is this diff from the one for 105 dollars?","answer":"The difference between these two models is that one can be controlled from a smart device, while the other one is controlled manually."},{"question":"Does it support an AC 220V adapter?","answer":"No, this smart air fryer should be used with 120V only. Hope this helps!"},{"question":"I followed a muffin recipe in my Ninja air, and it came out all mushy. Is this any better? ty!","answer":"This air fryer comes with a handy cookbook with over 100 delicious recipes, including 6 for muffins! If you were to purchase this air fryer, you also get the friendly support of our wonderful customer service team. Feel free to contact us with any further questions. We are happy to help!"},{"question":"Can I toast with this?","answer":"Absolutely! There is a great grilled cheese recipe in the book that I've tested and it was delicious. I'd like to point out it's a nice side benefit but it's not something I would use primarily for toasting."},{"question":"What does the basket coated? nontoxic? pfoa free?","answer":"The baskets have a PFOA free non-stick coating. Hope this helps!"},{"question":"What comes with it?","answer":"Instruction book and a recipe book."},{"question":"Is the only difference between the wifi model and the $99.0 it’s the alexa compatibility? the price difference is $10 is that the only difference? tha","answer":"Yes"},{"question":"Will it function as a standard air fryer if i lose my wifi signal due to fault of internet server provider?","answer":"Yes, you don’t actually have to download the app if you do t want to use the remote function."},{"question":"Can it be plugged in a smart plug rated at 15 A ?","answer":"Absolutely it can! Hope this helps!"},{"question":"How loud is this cooker?","answer":"Mine is on medium side of loudness."},{"question":"so does this make crispy sweet potato chips? and is it easy to clean? Thanks!","answer":"I never try but I bet it would. It’s super easy to clean."},{"question":"What is the exact package weight and measurement? I'm calculating my shipping charge to overseas.","answer":"The shipping weight of the Air Fryer package is about 16.45 lbs, and the dimensions are 16.5 x 14.1 x 14.9 inches. Please keep in mind that this air fryer should be used with a 120V power supply. Please let us know if you have any further questions. We are happy to help!"}]}