{"title":"Air Fryer, Bagotte Programmable Hot Airfryer Oven & Oilless Cooker for Roasting, LED Digital Touchscreen, Nonstick Basket, Dishwasher Safe, Family Size","manufacturer":"Bagotte","currentPrice":"$99.94","rating":"4.9 out of 5 stars","totalRatings":"141 ratings","features":["\n         Make sure this fits\n                by entering your model number.\n        \n","【FAMILY SIZE & OILLESS COOKER】Bagotte digital air fryer cooks by circulating hot air instead of oil. Keep the food being delicious the same as deep frying, but reduce oil by 80%. Low fat and cook faster. 3.7 QT capacity meets the needs of the whole family. Perfect healthy gift for food-loving family, lovers and friends.","【ONE-TOUCH COOKING & DO MORE THAN FRY】 Select by just one touch of the screen instead of turning knobs. You can easily fry, bake, roast and grill using only one appliance. Wide temperature range: 180°F–380°F and time: 0-60 minutes based on the food. French fries, crumbed chicken tenderloins, turkey, rotisserie, all become very easy to cook!","【NONSTICK BASKET & DISHWASHER SAFE】Removable nonstick basket are Dishwasher Safe. Made from all food-grades materials, BPA-free, ETL/FDA certified, so have peace of mind while you cook. And it also have a cool touch handle, independent vents, free from smoke, you will have a good cooking experience.","【COMPACT & SAFETY PROTECTION】Smaller volume in the same capacity, saving your kitchen space. Auto shut off & Auto Memory function, when your food is done, the electric air fryer in kitchen will stop working automatically. Meanwhile make a sound to remind you.","【3 YEARS WARRABTY & RECIPE COOKBOOK】3 years Warranty! Just contact Bagotte customer service if any issues happened. And the recipe helps you prepare your favorite dishes! Choose from a variety of meals to make for breakfast, lunch, dinner, or dessert."],"reviewsAspects":["easy to use","easy to clean","french fries","chicken wings","touch screen","pork chops","recipe book","happy with this purchase","highly recommend","really like","dishwasher safe","air fryers","fried foods","eat healthy","much healthier","less oil","chicken nuggets","much better","make sure","frozen fries"],"productInformation":[{"Product Dimensions":"11.8 x 11 x 13.8 inches"},{"Item Weight":"14.15 pounds"},{"Shipping Weight":"14.15 pounds (View shipping rates and policies)"},{"Manufacturer":"Bagotte"},{"ASIN":"B07WLCP88P"},{"Batteries":"1 Lithium ion batteries required. (included)"},{"Customer Reviews":"4.9 out of 5 stars\n    141 ratings\n4.9 out of 5 stars"},{"Best Sellers Rank":"#54,606 in Kitchen & Dining (See Top 100 in Kitchen & Dining)\n#146 in Air Fryers\n"},{"Date first listed on Amazon":"August 5, 2019"}],"productDescription":[],"reviews":[{"reviewerName":"M Gerardo","rating":"5.0 out of 5 stars","reviewTitle":"Really Convinient Modern Way to Cook","reviewDate":"September 25, 2019","reviewText":" This air fryer can do everything I need it to do. It makes very crispy french fries, frozen or homemade. No need to use oil, however I have found a little bit never hurts if you're using a light oil spray. The cooking basket is non-stick. The device is easy to use and not overly complicated. Simply select a preset cooking time/temp or create your own.\n\nI have found you can set the cooking time from 1 minute all the way to 60 minutes. The temperature ranges from 180 degrees Fahrenheit to 380 degrees Fahrenheit. It will fit up to 3.7 quarts of food, but I'd recommend not overfilling it for good air circulation.\n\nI've been using the air fryer often for breaded chicken, french fries, reheating pizza, pizza rolls, and burritos. It says you can cook a steak in this, but I don't think I'd ever try that. Air fryers seem to work best with any food intended to have a crunchy or crispy outside coating."},{"reviewerName":"Sara Larkins","rating":"5.0 out of 5 stars","reviewTitle":"Gives a great texture to food and eady to clean and use.","reviewDate":"September 15, 2019","reviewText":"I am totally blown away by this air fryer!! It is totally amazing. I started the day frying my bacon in it and then reheating waffles. Im amazed at how much stuff you can cook in it. I got rid of my toaster because it replaces that completely. I cooked chicken thighs in it for lunch and they taste like fried chicken! It heats up really quickly and doesnt make your whole house hot like an oven does. It's great at heating up leftovers and gives food a nice texture . You want to make sure you use an oil sprayer to spray your food and not a nonstick cooking spray because the cooking spray will damage the nonstick lining of the airfryer. This airfryer is also really sinple to use. I suggest joining an airfryer group on facebook for tips, tricks and recipe ideas. Overall Im very pleased with this airfryer and it's a very useful appliance!"},{"reviewerName":"Robert","rating":"5.0 out of 5 stars","reviewTitle":"Now I understand all the buzz","reviewDate":"August 27, 2019","reviewText":"I decided to jump on the air fryer bandwagon and see why everyone loves air fryers. I was happy with the size of the basket to hold enough food to feed my family of 4. I started with an easy recipe of just quartered red potatoes. They cooked quickly and were crispy. My 5 year old who often complains about eating almost anything other than pasta said I should open a restaurant. I've cooked chicken and fish from frozen in the air fryer. The fryer is super easy to clean, which is important to me. I highly recommend it as long as you have the storage space for it as it is a fairly large appliance."},{"reviewerName":"retired enjoying life","rating":"5.0 out of 5 stars","reviewTitle":"Easy to use Delicious food","reviewDate":"August 31, 2019","reviewText":"Item arrived on time and in excellent condition. It works extremely well. The rectangular basket holds a surprisingly large amount of anything. It cooks things just as well as baking in the oven. The chicken wings I made last night would have taken over an hour in my oven. They were done in 20 minutes in the air fryer. Wings was so crispy and delicious. I’m going to try fried pickles next. This air fryer has six preset buttons and you can adjust the time and temp to which is really good. It has auto off, memory function, LED digital touch screen. This air fryer runs quietly. It’s easy to clean it’s dishwasher safe. The instruction is easy to understand and it comes with a little recipe book. Seems to be of great quality."},{"reviewerName":"Glen540","rating":"5.0 out of 5 stars","reviewTitle":"High quality and easy to clean!","reviewDate":"September 24, 2019","reviewText":"This is my first time using air fryer, it is hard to control the time for the first time. You can google or YouTube the receipt online, or you can read the original receipt book from the package. I would love to recommended this brand, Philip is expensive for me and i checked on YouTube before buying this brand. There have lots of videos to introduce this product and get many positive reviews. Here are the reasons why I would recommended the most!\n1. You could easily to change the time and temperature! you can stop it immediately if you want to.\n2. Easy to clean! You can just take it off the inside and wash.\n3. It have sounds but no let noisy, and the smile just like microwave, no heavy smell even you are cooking garlic or ginger. However, the air fryer doesn’t work for popcorn. Don’t treat him like a microwave!\nI think $100 is good for huge amount air fryer, and I click 10% off coupon and save the money. The shipping come in fast and no damages. I would recommended this brand of the air fryer."},{"reviewerName":"Bao H. Phan","rating":"5.0 out of 5 stars","reviewTitle":"Easy to use, sleek design","reviewDate":"September 6, 2019","reviewText":"This is a good air fryers. I bought this air fryer so that i can make French fries at home since my parent very strict on fried foods because it is oily and unhealthy. With just a little touch up of oil, a couple try to get a hang of the timer, my friend fried came out nice, creispy. My sister also love the air fryer. She uses it to cook all her favorite frozen foods and the floods came out way better than in the oven. The air fryer is quiet when heating up and during cooking. I love the printed multiple cooking presets, it is detail and easy to follow so i do not need to look at the cook book all the times."},{"reviewerName":"Alexis p","rating":"5.0 out of 5 stars","reviewTitle":"Easy to clean large air fryer","reviewDate":"October 12, 2019","reviewText":"I was looking for an air fryer for the last six months. I wanted something large, easy to use, and dishwasher safe. This one fit the bill. It is dishwasher friendly. Large enough to make batches of food. So far I have made kale chips (see pics) and sweet potato fries! I love that this came with a recipe book. Also there is a one year warranty."},{"reviewerName":"J. Zand","rating":"5.0 out of 5 stars","reviewTitle":"This cooker is whacked!","reviewDate":"November 6, 2019","reviewText":"So to give a little background, I am 60 years old, a doctor, work 2 jobs, hate cooking, can’t cook, and everyone who knows me would never eat any of my food except cereal or Tito’s with Orange Juice. Add to that I don’t like Donald Trump, doing dishes, or taking time to cook. A patient of mine mentioned that her whole family only airfrys. So I bought a machine, put in a steak, poured barbecue sauce on top, pressed the steak program, and had the best steak of my life in 8 mins. Absolutely crazy. The second steak I made a mistake, got a phone call, left it in too long, even better. I do not even want to go out to eat anymore because I can cook better."},{"reviewerName":"Casey Nicole lewis","rating":"5.0 out of 5 stars","reviewTitle":"It’s a must have! Great product!","reviewDate":"September 11, 2019","reviewText":"Awesome air fryer! So glad I purchased this. It arrived in a timely manner. It makes cooking fries and what not so much healthier because you aren't frying them in grease. I can’t wait to try more recipes in this. I love the fact that it came with a recipe book as well to give me many more ideas for trying new things in this new air less fryer. It’s very quick and very easy. Everyone needs one!"},{"reviewerName":"RumbleSis162","rating":"5.0 out of 5 stars","reviewTitle":"Nice easy way to fry without oily mess!","reviewDate":"October 18, 2019","reviewText":"Ok, I am late to the air fryer bandwagon. I did a lot of research, and read a lot of reviews. This one seemed to be the one with the best reviews and the least number of BAD reviews. I unpacked it and cooked spring rolls first. Never had them so crispy without hot oil!! Next I did chicken strips (fresh of course) and they turned out perfectly!! My grandson asked for seconds, then thirds. He NEVER asks for seconds!! No greasy mess!! I let the parts cool, washed and air dried, and it is ready to go. But it is BIG!! Now to rearrange my counter!! I will be keeping this!!"},{"reviewerName":"Leo Zheng","rating":"5.0 out of 5 stars","reviewTitle":"Fast, delicious, easy to clean, wide variety of cooking options","reviewDate":"September 25, 2019","reviewText":"This has made my life much easier! The food produced tastes much better and is much more healthier! The machine is very easy to use and it makes cooking foods a lot cleaner. It's also very easy to clean and easy to understand. There is such a wide variety for preparing dishes including heating up food, baking, frying, etc. The air fryer has your food ready within a fair amount of time, so it really helps make a quick and delicious meal, saving you a lot of time. I highly recommend it, as it has definitely helped me create dishes much faster."},{"reviewerName":"Nguyen xuan hieu","rating":"5.0 out of 5 stars","reviewTitle":"It's so convenient and healthy. Help reduce a lot of oils from regular fry","reviewDate":"September 30, 2019","reviewText":"I'm a person who's working out so hard to reduce my body fat as much as possible. However, the body fat can reduce 30% from working out and 70% from what I eat. I love fried chicken a lot, but it has too much oil to fry and it's unhealthy for me. I've been using almost a month now, I'm really satisfied with it. Moreover, it helps me to save a lot of time too, I just have to set it up at the timers for each food I fry, I don't have to sit there and wait to make sure it will be over cooked."},{"reviewerName":"wei","rating":"5.0 out of 5 stars","reviewTitle":"Make Breakfast Everyday for my children！Easy and Fast！","reviewDate":"October 16, 2019","reviewText":" As general working parents, we don't have more time to spend in preparing breakfast for our children. Now I brought a air fryer for them. Over this month every morning, I used fryer to cooking bread,corn dogs,french fries,dumplings,chicken nuggets etc. My children were so happy they can eat more kinds of breakfast, and tasted so good! And I will try more things for the add-on recipes. It just need setting temperature and minutes then press cook, it's fast and easy to use it!"},{"reviewerName":"Peter","rating":"5.0 out of 5 stars","reviewTitle":"Such a great product","reviewDate":"September 15, 2019","reviewText":"This is my first air fryer, I love it. After I bought this air fryer, I almost use it everyday. Cook fries, chicken nuggets, spring roll, shrimp. It is so easy to use, just select the number from the manual, you even don’t need to input time and temperature. Everything take around 15 minutes. When you prepare something else, it is already done for the cooking. Cleaning is also easy, I just use water to wash it. I really love this air fryer, so convenient to use. Best purchase!"},{"reviewerName":"Na'trition","rating":"5.0 out of 5 stars","reviewTitle":"I am satisfied","reviewDate":"October 16, 2019","reviewText":"After i watched a video how air fryer cook chicken wings. i like to eat fried chicken wings. so i bought this one. when it arrived , i tried to cook chicken wings with spicy sauce , Wings was so delicious: crispy and hot. I’m going to try fried potato chip with Onion, i don't need to watch and take care all the time,It has auto off, memory function, LED digital touch screen. i can do another things in same time. It’s easy to clean. great quality!"},{"reviewerName":"Peipei","rating":"5.0 out of 5 stars","reviewTitle":"Air fryer.... You will love it!","reviewDate":"September 27, 2019","reviewText":"I ordered this air fryer about three weeks ago! After seeing my friend use it, I decided to buy one for myself! It arrived pretty fast. After I received the product,I can’t wait to use it! I used the air fryer to cook salmon, chicken wings, potatoes, and chicken breast! The chicken breast tasted so much better than boiled it or pan fried it! The meat wasn’t dry at all. It has the original taste and so much healthier than the pan fry! The food tasted fabulous without putting oil on it! The product is very easy to clean! I just put some water inside the container and few drops of dish soap and let it set for few minutes. Than I washed it off! It’s fast and easy to clean and use! You won’t be regret it to buy this product. This product help me save time because I don’t have to keep eyes on it. I set the timer and the temperature than press start button, it will start to cook and I can go do my own things! I highly recommend this product! You will love it! [爱心][爱心]"},{"reviewerName":"Kevin","rating":"5.0 out of 5 stars","reviewTitle":"Easy to use and clean","reviewDate":"September 26, 2019","reviewText":"This air fryer is a game changer for me because I love fried food but the calories concerns me so air fried food is a nice middle ground for me. I’ve tried frying some spring rolls and french fries so far and they are just as crispy as the deep fried ones. The pot for the air fryer is lined with non-stick materials, which makes cleaning it easy and effortless. The LCD screen is sleek and modern-looking. Overall, I am happy with this purchase"},{"reviewerName":"Winson","rating":"5.0 out of 5 stars","reviewTitle":"I live my new air fryer","reviewDate":"October 2, 2019","reviewText":"I love this air fryer, it is so stylish and it looks nice in my kitchen!! It is very easy to clean and use, I enjoying using it cuz it shorten my cooking time and makes my food very healthy. I tried it with sweet potato fried and with little bit of oil, it turns out very good!! I also tried to chicken wing! Man! It is so crispy and amazingly good plus I did not even put oil!!! This air fryer is now my favorite appliance!!! Better than my fancy stove!!"},{"reviewerName":"L I E N","rating":"5.0 out of 5 stars","reviewTitle":"You need this wonderful airfryer","reviewDate":"August 24, 2019","reviewText":"First time using this bagotte Air Fryer and let me tell you. I'm very impressed. The fries were good and my shrimps with vegg were perfect. Crispy outside, moist inside. Would definitely use this frier more often. Take a look at the pictures I attached to this review. I also made Garlic Parmesan Chicken tenders and they are perfect. I'm happy with this purchase and definitely would recommend it to my friends."},{"reviewerName":"Aaron B","rating":"5.0 out of 5 stars","reviewTitle":"Easy clean up and gets to temp very quickly","reviewDate":"August 23, 2019","reviewText":" I’ve wanted an air fryer for years and finally got one. I really like the digital touch screen that makes it super easy to clean and very sleek looking. I baked cinnamon rolls and made some frozen potatoes in it and am very happy with the outcome. More than anything it really is a time saver. Heats up almost instantly and ready to cook. Very happy with my purchase"},{"reviewerName":"Dora li","rating":"5.0 out of 5 stars","reviewTitle":"It is very easy to use and fast","reviewDate":"September 29, 2019","reviewText":"I love how easy it is to use and the fact that I use it on a daily basis whether I'm making the kids cheese fries for a snack, potato skins, meatballs, potatoes, chicken fingers, etc! I'm still finding new things to cook. The only con is I had to reconfigure some of my own personal recipes to make sure chicken or hamburger meat doesnt get dried out. I still love it. It definitely has plenty of room for a family of 4. I made 4 good size stuffed chicken breast at one time. Buy it you wont regret it! I do a lot of grilling in the summer but I don't like cooking meat indoors because of the smoke and grease that gets everywhere. This air fryer does not smoke and grease does not escape. Everything I have made so far has come out very well cooked and delicious. It's also very fast. I have no complaints so far and I'm very glad I got this air fryer."},{"reviewerName":"duan1991","rating":"5.0 out of 5 stars","reviewTitle":"Non-oil fryer","reviewDate":"September 15, 2019","reviewText":"easy to clean and easy to use air fryer/ oven. Perfect size for family use.\nPros 1. White and stylish design.\n2.Cord can be store at the bottom.\n3. Spacious frying bucket can cook a lot of\nfood at same time.\nCons 1. Seems a little bit bigger for people who live by themselves.\nOverall, I would recommend this air fryer to my friend."},{"reviewerName":"Jacob J.","rating":"5.0 out of 5 stars","reviewTitle":"This is a must have","reviewDate":"September 18, 2019","reviewText":"Trying to be a vegetarian for a month for someone that has only eaten my entire life is super difficult. Then I found this. What doesn’t taste good fried? So far I’ve made brussle sprouts, squash, pizza rolls and potatoes in this fryer. Food comes out great with no extra calories and taste awesome! Being lazy I lined the bottom of the fryer with foil. This makes cleanup a breeze. Just take the foil out and toss it. No washing. Get an air fryer. You won’t ever regret it."},{"reviewerName":"Megan","rating":"5.0 out of 5 stars","reviewTitle":"Great buy!","reviewDate":"September 19, 2019","reviewText":"Very good looking design air fryer. Extremely easy to use . I've cooked some chicken wings and fries it was perfect, nice and crispy. I just love the face that I don't have to keep eye out for it while it's cooking, save me time to do other things. Use no oil or less .Air fry is a great way to eat healthy and still taste good. Also easy to clean up . Highly recommender this air fryer."},{"reviewerName":"jinyan","rating":"5.0 out of 5 stars","reviewTitle":"Recommend it . Very nice product","reviewDate":"September 19, 2019","reviewText":"Absolutely love it . I have been using it since the day I got it. and I love to cook and feed my family healthy food and this was just what I was looking for. I've cooked pork chops and a small beef roast, French fries, and BBQ-style pork ribs in my air fryer and everything has turned out delicious. my daughter and my husband they are really like it and I am very happy with it!"},{"reviewerName":"Jesse W.","rating":"5.0 out of 5 stars","reviewTitle":"Amazing easy way to cook","reviewDate":"October 7, 2019","reviewText":"So this thing is amazing. I’ve been air drying everything, and so far everything has ranged from good to great. Fries, wings, pork chops, fish and chips, poppers.... it’s about 2 weeks old now, and pork chops are cooking right now. I would recommend. Great for you, great for a gift. Can’t go wrong. Good food and easy to use."},{"reviewerName":"Jean Novack","rating":"5.0 out of 5 stars","reviewTitle":"This product is easy to operate","reviewDate":"September 20, 2019","reviewText":"This product is easy to operate. It’s capacity is pretty big, huge portions can be cooked.\nIt is called air fryer, but i take it more as small convection oven (oven with fans). So i can think outside box from concept of air “frying”. It gives you much better result than traditional oven because hot air blowing will make crispier."},{"reviewerName":"Dan","rating":"5.0 out of 5 stars","reviewTitle":"The air fryer is amazing.","reviewDate":"October 26, 2019","reviewText":"This Air Fryer is so nice ! The air fryer is also really easy to use. It’s also really to clean as well because the things that I cook in there doesn’t stick onto the platter. It makes it really easy to wash. I used the air fryer to cook chicken wings and potatoes. My children and my husband thinks that their really good! It’s really useful and is also really fast to cook. There are even instructions on top of the air fryer. Making it more easier, because they tell you how much time and how warm it is for each one."},{"reviewerName":"samina","rating":"5.0 out of 5 stars","reviewTitle":"Our answer to eat healthier","reviewDate":"September 15, 2019","reviewText":"We wanted to eat healthy and this air fryer is really the answer .I love the touch screen function and it looks so good on my kitchen table.\nThe fryer is for people who want to eat more healthy as it uses just a few drops of oil compared to deep frying, the food gets evenly cooked on the inside and is crispy and more delicious than oven and grill."},{"reviewerName":"Surfer16","rating":"5.0 out of 5 stars","reviewTitle":"Good product for healthy lifestyle.","reviewDate":"September 24, 2019","reviewText":"I really like quality of this product. I bought this because I want start eating less oily food. The design of this product is nice. I use this product couple of time & it’s working out good for my daily need. It’s really easy to use and clean.This Airfryer was very easy to clean and cook. It’s worth product to buy. I am happy with this product."},{"reviewerName":"Ping Ping","rating":"5.0 out of 5 stars","reviewTitle":"Fast, Easy, Awesome air fryer!","reviewDate":"September 7, 2019","reviewText":"I have had this air fryer over one week. Features that were the most important to me were the several main presets. easy to use. A great size for who family 4-5 people. Amazingly crisp and juicy everything is! fried chicken, potatoes, meatballs,etc. it is easy to clean in the dishwasher. enjoy it in my daily life."},{"reviewerName":"Satcraft Yang","rating":"5.0 out of 5 stars","reviewTitle":"Healthy Frying!!!","reviewDate":"October 6, 2019","reviewText":"It is healthy to make French fries and sweet potato strips in an air fryer. It tastes good and crispy like a fat fryer. It is very easy to use. I also like to heat up leftover pizza, chicken wings, burritos and onion rigs too.\nCleaning is so easy. Put the aluminum foil under drip pan for easy cleaning. Just let it coll down and wash the basket and the pan with soapy water. it is easy to clean when it is still warm.\nwhoever when the air fryer was first used, there is a smell of plastic burning."},{"reviewerName":"Noko","rating":"5.0 out of 5 stars","reviewTitle":"i really like this fryer!","reviewDate":"September 11, 2019","reviewText":"My child likes to eat fried food very much! I have been using this air fryer for two weeks, it is really convenient! And the chicken pieces that are fried are very good! I don't need to use oil to fry chicken and chips for the kids anymore! The food made by this air fryer is much healthier!"},{"reviewerName":"yuki","rating":"5.0 out of 5 stars","reviewTitle":"Best Air Fryer on the marker","reviewDate":"September 17, 2019","reviewText":"If you love wings and french fries like my kid , you need this air fryer, My Kids use that every day after school .\nIt is very convenient to operate. I got the food ready before I go to work and kids go home after class and put it in . feel free to let the child use independently . Definitely a must have for all home kitchens."},{"reviewerName":"kevin","rating":"5.0 out of 5 stars","reviewTitle":"Handy and quality air fryer","reviewDate":"September 30, 2019","reviewText":"It produces crisp, moist food without deep fryer or large amount of oil. It clearly the way to go if you need avoid saturated fats and heavily fried food. This air fryer is much easier to clean and maintain. the container can be washed by my hand or in a dishwasher between uses."},{"reviewerName":"Zoe","rating":"5.0 out of 5 stars","reviewTitle":"Super kitchenware","reviewDate":"September 13, 2019","reviewText":"This is the best kitchen ware I bought in 2019! It cooks so fast and healthy. French fries, spring rolls, nuggets, steak, poultry, fish, all can be done in 15 min. It is amazing. Perfect size for family of 4. Cleaning is easy too! Much better than using the big oven. Also electricity bill will be lower than before lol"},{"reviewerName":"Kimmonique Adams","rating":"5.0 out of 5 stars","reviewTitle":"You Will Fall in Love","reviewDate":"November 9, 2019","reviewText":"I love my fryer. This fryer has changed my life for the better. Food is done in less than 30 minutes. Great for a working professional with a family, and a single person. It makes cooking dinner less burdensome. I would give it ten stars if I could..."},{"reviewerName":"Ivo Stoynev","rating":"5.0 out of 5 stars","reviewTitle":"Easy to clean and use!","reviewDate":"September 25, 2019","reviewText":"The most delicious fries and wings we ever had! The kids love it and I so happy that now they will have healthy fries, the most favorite food for them. Very easy to clean and use.\nCame with receipt book, which is very nice and helpful."},{"reviewerName":"Amazon Customer","rating":"5.0 out of 5 stars","reviewTitle":"Great helper for busy mom!","reviewDate":"September 29, 2019","reviewText":"Just simply pressed the fish button on the display and my fish was done within 20 minutes. The fish came out nice and crispy. It's easy and healthy cooker. The fryer is faster than the oven and oil less. And taste is good as deep fry food."},{"reviewerName":"Charles David","rating":"5.0 out of 5 stars","reviewTitle":"Does a great job","reviewDate":"August 29, 2019","reviewText":" Such an amazing air fryer it is. I always wanted to get one and I think I got the right one. It looks good and it works great. Easy to clean. Control is really easy and it looks beautiful. Definitely recommended !"},{"reviewerName":"Andy Ni","rating":"5.0 out of 5 stars","reviewTitle":"Amazing to use and super easy","reviewDate":"September 17, 2019","reviewText":"It is absolutely amazing. It is so simple to use and comes with instructions and recipes. This makes cooking way easier and more tastier. I can do so much with my air fryer and I can eat it knowing it is healthy for my body. Love the timer feature on it and the tray pops out super easily to clean. Tons of recipe options."},{"reviewerName":"Daphne x Ouyang","rating":"5.0 out of 5 stars","reviewTitle":"Everything is great!","reviewDate":"September 11, 2019","reviewText":"I been thinking to get one since I saw my friend use the fryer to cook lots of food. I found this one and it has all good reviews.Also it is running a discount right now, so I got it and I tried it. Everything is great!"},{"reviewerName":"Lucy","rating":"5.0 out of 5 stars","reviewTitle":"Very nice!","reviewDate":"September 17, 2019","reviewText":"Best over all. Easy to perform, one button takes care everything, My lunch and dinner. no need for oil and grease.easy to clean 🧽 soap and water, just shake and drain. And this is not expensive like other similar product."},{"reviewerName":"Thi N","rating":"5.0 out of 5 stars","reviewTitle":"Easy to use","reviewDate":"September 6, 2019","reviewText":"This is a pretty nice unit for the price. It is big enough to cook a whole chicken. Easy to use with all the presetting buttons. Easy to clean, I just run it in the dishwasher. Im happy with this."},{"reviewerName":"Angel","rating":"5.0 out of 5 stars","reviewTitle":"Really loving this air-fryer!","reviewDate":"October 5, 2019","reviewText":"The large basket size makes it perfect for even cooking, I have made delicious meals and healthy snacks in this, I’ve tried fish, veggie tater tots, and chicken, crisps food perfectly."},{"reviewerName":"yong xue","rating":"5.0 out of 5 stars","reviewTitle":"Awesome air fryer","reviewDate":"September 11, 2019","reviewText":"This air fryer is very convenient. Simply operations to make healthy and delicious food! You don't have to drain the oil. This is awesome. This is absolutely worth the money."},{"reviewerName":"yuansaiqin","rating":"5.0 out of 5 stars","reviewTitle":"Very convenient warehouse for women","reviewDate":"October 3, 2019","reviewText":"This air frier was bigger than what I expected , it’s touch screen switch ,you can put whole chicken on it to bake or grill, when you frying something used less oil which is more healthier and easy to clean if you frying often you should get one"},{"reviewerName":"sdbw","rating":"5.0 out of 5 stars","reviewTitle":"Five Star air fryer!!","reviewDate":"September 23, 2019","reviewText":"One of the nicest air fryers I've ever used this is beautiful & slick Fits right in with all my new dishes my wife loves it highly recommended!!"},{"reviewerName":"V&Y","rating":"5.0 out of 5 stars","reviewTitle":"Airfryer","reviewDate":"September 18, 2019","reviewText":"Happy I bought it, the first dish I made with it is the bacon shrimp wrap on its recipe. Yummy and healthy cooking. It is easy to operate and clean too."},{"reviewerName":"Radhna2301","rating":"5.0 out of 5 stars","reviewTitle":"Healthy, golden crispy fried food with very little oil :)","reviewDate":"September 12, 2019","reviewText":"I love it!! I love that it can give me crispy fried food like fish, eggrolls and chicken nuggets with very little oil. Helps with my cholesterol.."},{"reviewerName":"CindyCeline","rating":"5.0 out of 5 stars","reviewTitle":"So simple to use","reviewDate":"September 11, 2019","reviewText":"I love This product, I have tried several recipes and they all came out great with a few little common sense tweeks here and their. I was a little leary about having to cook in batches but it cooks so fast that it is an non issue."},{"reviewerName":"Zinnia","rating":"5.0 out of 5 stars","reviewTitle":"Easy clean, easy cook","reviewDate":"September 18, 2019","reviewText":"This air fryer is so good. Easy to clean, big capacity. My kids love french fries, but I don’t want them to eat that much( too greasy). The day when I received this air fryer, I made them French fires immediately. They all love it. I also used it to make BBQ pork rid. It tasted so yummy, less time than baking them and more juicy. I strongly recommend it."},{"reviewerName":"Nanao","rating":"5.0 out of 5 stars","reviewTitle":"good product","reviewDate":"September 18, 2019","reviewText":"This air fryer is very easy to use. There is a must for children at home. The child likes French fries most, but there is no health outside, no waste, and how much to eat. It is very simple to operate, has many functions, and the main size is just right. worth buying."},{"reviewerName":"Evantang520","rating":"5.0 out of 5 stars","reviewTitle":"good","reviewDate":"September 15, 2019","reviewText":"This product is so great, it cooks my favorite foods so well, it's easy to clean and easy to use. It's a great invention!"},{"reviewerName":"Theresa","rating":"5.0 out of 5 stars","reviewTitle":"This is a good air fryer","reviewDate":"September 17, 2019","reviewText":"This product is really good it makes food fast and crispy it is very easy to clean and the flavors are outstanding"},{"reviewerName":"dcd","rating":"5.0 out of 5 stars","reviewTitle":"Very easy to use","reviewDate":"September 11, 2019","reviewText":"This air fryer is very easy to use. It cooks food quickly. I have used it to fry chick wings. The wings are crispy and tasteful."},{"reviewerName":"Bill D.","rating":"5.0 out of 5 stars","reviewTitle":"It's big","reviewDate":"November 2, 2019","reviewText":"UPDATE: Seller was excellent and promptly refunded me with Amazon gift dollars. No problem."},{"reviewerName":"Annie","rating":"5.0 out of 5 stars","reviewTitle":"Great","reviewDate":"September 19, 2019","reviewText":"It’s easy to use and efficient to use because it doesn’t require oil and it saves energy. It is very clean and I would definitely recommend it to my friends."},{"reviewerName":"HONGQIAN","rating":"5.0 out of 5 stars","reviewTitle":"Practical","reviewDate":"September 29, 2019","reviewText":"Very practical, use it to fried chicken wings, chicken legs, delicious and healthy!"},{"reviewerName":"Fengfang","rating":"5.0 out of 5 stars","reviewTitle":"Compact air fryer","reviewDate":"October 2, 2019","reviewText":"Good air fryer I bought lately. My first time to try the air fryer, it’s cleaner compared to the regular pan fryer, much less smoke and smell in the house now. Compact design, but can use in a lot food. I tried the fries, nuggets, wings etc, and it did work well, delicious."},{"reviewerName":"Hank","rating":"5.0 out of 5 stars","reviewTitle":"Awesome","reviewDate":"September 21, 2019","reviewText":"I finally get to use this airfry pot. The best thing is that I can eat fried chicken at home while no smoke is produced. And there are various kinds of food can be made from it. I will use it often from now on."},{"reviewerName":"Anna","rating":"5.0 out of 5 stars","reviewTitle":"Air fryer","reviewDate":"September 21, 2019","reviewText":"It’s super easy to cook and clean. It even comes with a ingredients book."},{"reviewerName":"Ryan","rating":"5.0 out of 5 stars","reviewTitle":"Easy to use","reviewDate":"September 25, 2019","reviewText":"This air fryer is easy to use. Help me live healthier, less oil."},{"reviewerName":"xj","rating":"5.0 out of 5 stars","reviewTitle":"Very convenient and easy to use","reviewDate":"October 9, 2019","reviewText":"This product is very easy to use. It cooks well as long as you put in the correct time. It is easy to clean. Foil wrap would do great so that it wouldn’t be too dirty. It tastes great, just make sure to put in the correct time. Overall this is the best fryer I have brought, and it is very convenient."},{"reviewerName":"Julie","rating":"5.0 out of 5 stars","reviewTitle":"Great air fryer","reviewDate":"September 27, 2019","reviewText":"this product was very easy to use. I was able to make a healthier version of my favorite fried foods. It is best for small portions and easy to clean up."},{"reviewerName":"rongjiang","rating":"5.0 out of 5 stars","reviewTitle":"WE LOVE THIS APPLIANCE!!","reviewDate":"September 8, 2019","reviewText":"Easy to use, big basket, easy to clean! Very satisfied with it. It also come with a book of recipes..had over 100 meal on it!we've used it a bunch of times already in this week.."},{"reviewerName":"Vincent","rating":"5.0 out of 5 stars","reviewTitle":"Very satisfied","reviewDate":"October 7, 2019","reviewText":"I am very happy for this purchase. It Is very good as a quality and price. Nice design and very good build. So easy to clean. It Is touch screen nice too. So what I can say, I would recommend it to everyone who want a air fryer. I am very satisfied."},{"reviewerName":"jack pan","rating":"5.0 out of 5 stars","reviewTitle":"very convenient","reviewDate":"October 6, 2019","reviewText":"The air fryer is a very convenient kitchen tool. It’s very easy to use, I can just put foods in and it will do the job. It makes good fries and grilled steak without the mess of oil splatters/burns."},{"reviewerName":"Yong Qing","rating":"5.0 out of 5 stars","reviewTitle":"Give you good surprise","reviewDate":"September 20, 2019","reviewText":"It’s very good.very useful very convenient I love it so much.so I choose it trust it"},{"reviewerName":"Yifei Jiao","rating":"5.0 out of 5 stars","reviewTitle":"Convenient and simple operation.","reviewDate":"September 21, 2019","reviewText":"It's very convenient and essay to use. Actually, i just bought this air fryer for my younger sister, and my younger sister can use it to cook well. She likes it so much."},{"reviewerName":"NY","rating":"5.0 out of 5 stars","reviewTitle":"Easy control","reviewDate":"September 14, 2019","reviewText":"This product got a bigger size than I expected, and all the functions are easy to control highly recommend"},{"reviewerName":"Yujie Yuan","rating":"5.0 out of 5 stars","reviewTitle":"Save oil","reviewDate":"September 22, 2019","reviewText":"Very save oil. Before I fry fries always use o lot of oil . But this one very save."},{"reviewerName":"Hidy","rating":"5.0 out of 5 stars","reviewTitle":"Easy use air fryer","reviewDate":"October 5, 2019","reviewText":"We have been using this to cook fry potato chips and chicken. Very easy to use and clean. The design is very modern, I like the programming feature~"},{"reviewerName":"Snow","rating":"5.0 out of 5 stars","reviewTitle":"Love it so far","reviewDate":"October 2, 2019","reviewText":"Amazing technology, this fryer works very well, I used it for fish and fries, I should try more stuff, it is bigger than what I thought it was, so I can do big portion of food. Love it so Far."},{"reviewerName":"jiewan","rating":"5.0 out of 5 stars","reviewTitle":"Good air fryer","reviewDate":"October 1, 2019","reviewText":"The product looks very good and is very convenient to use"},{"reviewerName":"Ivan G Castillo","rating":"1.0 out of 5 stars","reviewTitle":"Do not recomend to buy !!!","reviewDate":"October 27, 2019","reviewText":"Does not cook as advertised. Very, very disappointed!!"},{"reviewerName":"Lisa Sander","rating":"5.0 out of 5 stars","reviewTitle":"Absolutely Love!!!","reviewDate":"October 17, 2019","reviewText":"Absolutely love this air fryer. Large basket, easy to use. Cooks food perfectly! If these go on sale, I would buy one for each of our 7 kids for Christmas!!!"},{"reviewerName":"Zeng","rating":"5.0 out of 5 stars","reviewTitle":"No oil","reviewDate":"October 7, 2019","reviewText":"Very simple to use. No oil needed. Stay healthy. I like it very much."},{"reviewerName":"Karina","rating":"5.0 out of 5 stars","reviewTitle":"Easy to clean","reviewDate":"October 23, 2019","reviewText":"I used it for few days. It’s very easy to use and clean. Very good quality!"},{"reviewerName":"chunmei song","rating":"5.0 out of 5 stars","reviewTitle":"Good product","reviewDate":"September 24, 2019","reviewText":"Quality, very good product"},{"reviewerName":"Utsav","rating":"5.0 out of 5 stars","reviewTitle":"All in one( For healthy life)- Air Fryer, Toaster , Oven","reviewDate":"September 30, 2019","reviewText":" This is by far one of the most economical air fryer in the market. Its very easy to use and you can make variety of stuff in it. In past few days, i made cheese sandwich, apple chips, and potato fingers. Great thing is it comes with a cooking book which tells you how much time each recipe takes. I am impressed by this product and would recommend this product to the people who are foodie and likes oily food but our health conscious.This is the right product for you. I have also posted a video and which will help you see how to start this product, it is super easy to use and clean. You can do also the things which you do in OVEN or TOASTER too! It’s all in one product"},{"reviewerName":"Jay19patel","rating":"5.0 out of 5 stars","reviewTitle":"Less oil - helpful for vegetarians","reviewDate":"September 9, 2019","reviewText":"Initially thought how much helpful it would be for a vegetarian. But the realize this is so handy for dry frying Indian recipes. Oil free or less oil cooking.\nIt is easy to clean and very user friendly.\nThe white color matches will with the kitchen."},{"reviewerName":"Benno","rating":"5.0 out of 5 stars","reviewTitle":"Eat healthier, live longer!","reviewDate":"September 22, 2019","reviewText":"Had this machine for over 2 weeks now and been using it for my everyday cooking. Is so easy to use and made my live so much better. No more messy fying pan and kitchen utensils. Just marinate and the machine will do the job. Although the wire is not retractable it has a hollow are where u can tuck it in for easy storage when u need to put it away."},{"reviewerName":"Nauman Iqbal","rating":"5.0 out of 5 stars","reviewTitle":"Love this airfryer.","reviewDate":"September 15, 2019","reviewText":" I was looking for an affordable airfryer which can meet needs of my family. The size is good enough for our family. Since I bought the airfryer I use it every day and fully satisfied with the result and taste of cooked food. I like that cooking basket is separable from the main part. I prefer don't use dishwasher, it will let me use it much longer, this is what I think. May be I am wrong. But it is dishwasher safe. I love that I can set different temperatures and time for the various ingredients, but I don't have to because can set it as recommended. But I shake french fries during of preparation time, it gives better result and cooks evenly. I like that it turns off automatically when I take out container with a preparing food. I prefer to use air fryer then my huge oven which gives a lots of heat in our house. I don't like to use much oil in my meals so love this one for giving me this opportunity. So far I love it and enjoying to prepare food for my lovely family."},{"reviewerName":"gene cross","rating":"5.0 out of 5 stars","reviewTitle":"Nice Design and Good Quality","reviewDate":"August 29, 2019","reviewText":" I'm a fan of deep fried foods. I even have a restaurant quality double deep fryer in my kitchen. So the thought of frying food without oil made me skeptical. This Air Fryer completely threw me for a loop and changed my mind. The unit is really great and easy to use. No more waiting for the oil to come up to temperature or gettingsplattered with hot oil.. There's presets already programmed into it to speed things up and make cooking certain things easier. Things like steak and fries (even frozen fries) are just the push of a button. The basket is large enough to cook for an average family. The unit is 1,500 watts and has a temperature range of 180 to 380 degrees. It comes with a cook book which is helpful, especially if Air Frying is new to you. When your finished clean up is easy because nothing sticks to the basket. It's even dishwasher safe. If you're looking to eat healthy and have been considering an Air Fryer, I absolutely recommend getting one of these."},{"reviewerName":"Chris and bre Hudson","rating":"5.0 out of 5 stars","reviewTitle":"Absolutely love this !","reviewDate":"September 2, 2019","reviewText":"I have to say I was skeptical on getting an air fryer but surly I am so glad I did. Cooking time is very quick and also you have to pay almost no attention to it. So far I have cooked two things.\n1. Chicken legs\nThese came out cooked well and tasted great. Dash on a small bit of olive oil for that crispy taste.\n2. Steaks\nThis is the part that got me. The steaks were cooked to perfection. Cooked evenly medium rare steaks. It beeps half way through, this will allow you to turn your food over.\nThis thing is convenient. Wish I had this in college!"},{"reviewerName":"Savannah Leigh Mathis","rating":"5.0 out of 5 stars","reviewTitle":"My new favorite toy","reviewDate":"September 15, 2019","reviewText":"I previously purchased an air fryer and fell in love with it. However it’s a bit of an odd shape it’s a circle. And I know my grandparents and mom both want air fryers so I purchased this one to give to them but I might keep it for myself because it looks so cool and works really well. I like the temperature control options and the shape of the rack more. I also find it’s easier to clean if you place parchment paper in the bottom but don’t do that if it’s empty because it will burn. Definitely recommend if you’re wanting to try one."},{"reviewerName":"Melissa and Andrew","rating":"5.0 out of 5 stars","reviewTitle":"Loving this","reviewDate":"September 3, 2019","reviewText":" I've wanted an air fryer since I saw a video channel I used to watch using one,but they're pricey so I didn't buy one for awhile. I finally caved in,and I am loving it. It is a bit bulky so it may not be on the countertop when we move,since the kitchen is super tiny,but it will get plenty of use nonetheless. The first use was just some frozen fries so I could test the features button,and they came out great. The photos & video are my cinnamon sugar donuts I made for the first time,the fryer did an excellent job. I really like that the baskets are dishwasher safe,they're easy to clean with just soap and water as well,I've done both. Today I'm going to be making cauliflower bites and fried pickles,but I do plan on making healthier meals and sides afterwards,the whole house is excited about & have been using this fryer,which is great since at first they were skeptical of how stuff would turn out with a 'new cooking method.' This is also perfect for hot days when the stove and oven really aren't a viable option,and it saves on utility bills compared to a stove/oven as long as you unplug it when finished,would be a great college or apartment item."},{"reviewerName":"J","rating":"5.0 out of 5 stars","reviewTitle":"Jump on the airfryer bandwagon guys 🤣","reviewDate":"November 4, 2019","reviewText":"Yep, totally jumped on the airfryer bandwagon. Over the years I’ve usually stuck to mainly cooking Chinese food and with Chinese food we don’t have a lot of fried food but after living on my own for a few years I’ve started to learn how to cook other types of food. So far I’ve only made a few things in it like hash browns but they turned out great and I love that it didn’t feel so heavy and greasy like when you fry it. I loaded my hash browns with some sour cream, cheese, avocado and a little meat and it was super good ! I also have made salmon in it but not with the fish preset function since I don’t like my salmon too cooked so I changed the time but kept the temp the same as the fish preset. My only issue is that the airfryer takes up quite a bit of counter space so I hope you have some extra cabinet space to put this bad boy away when not in use. I’m excited to try different stuff with my new gadget !"},{"reviewerName":"Anna Glezina","rating":"5.0 out of 5 stars","reviewTitle":"Very helpful","reviewDate":"September 11, 2019","reviewText":"I rated it 5 stars because it is a great asset for my kitchen. I also ordered additional air fryer accessories, and now experimenting with fixing different delicious and healthy meals. We are a family of 3, and it's a perfect size for us.\nDesign is also very stylish, and looks like a spaceship in my kitchen. I am glad I gave it a try. Highly recommend if you're looking into healthier options for your diet. It really takes so much less oil!\nIt is also so much faster than a traditional skillet cooking. I overcooked things at first because I thought \"there is no way this meat can be ready in 10 minutes, let me put it at least on 15\", guess what, it was DRY then, and the best time actually was 7 minutes! But I figure my way out as I go, and it's okay.\nI also appreciate how it is odorless (my house is small so it's important) and mess free. No more oil squirting all around my counter!"},{"reviewerName":"Jenna S.","rating":"5.0 out of 5 stars","reviewTitle":"Fried food without the guilt","reviewDate":"September 3, 2019","reviewText":"This cooks like a dream, in about half the time of what it takes in the oven! Those minutes add up to so much time saved! The tater tots, fries, and hush puppies came out so very crispy but tender inside. It was never that crispy straight from the oven.\n\nI've always been intrigued about air fryers, but I didn't feel like I needed one when I already have an oven. That is, until I finally tried it myself. And boy, now I understand why everyone loves it! :)\n\nAlso, this Bagotte air fryer is a cut above the rest because of a number of things: it has clear instructions and a bonus recipe book! A lot of products online never have decent instructions, and I'm glad this one does.\n\nThe only con I can think of is it's bigger than I imagined and takes up a lot of counter space, but we definitely made room for it. Very happy with this purchase."},{"reviewerName":"Nathan Kim","rating":"5.0 out of 5 stars","reviewTitle":"Crisp and good","reviewDate":"September 10, 2019","reviewText":"I placed manual airfyer to this one. The previous airfryer did not have this many options. This one has a one-button system where you can easily use the presets to cook certain popular dishes. I love doing wontons in this airfryer. They come out crisp, and absolutely delicious. The clean-up was pretty easy. Just take out the bottom holder and wash. Healthy is the new sexy, and this airfryer helps us make healthier choices. The container is pretty big, so we are able to fit more food in this one without having to do multiple"},{"reviewerName":"Yeok K Chew","rating":"5.0 out of 5 stars","reviewTitle":"Great addition to kitchen appliances!","reviewDate":"September 19, 2019","reviewText":"I love my Bagotte air fryer! This versatile appliance still air fry, reheat, roast and dehydrate your foods. For me, the most useful functions are frying and dehydrating. I made chicken drumsticks the first day I got it and they were really delicious and crispy but not greasy at all. Also dehydrated some mushrooms and they were wonderful when added to a soup I made.\nThe unit is well constructed, rugged but not too heavy to move around. Very easy to operate with very clear instructions included. A very nice cookbook was included with lots of good recipes and clear cooking instructions. Overall, this is nice addition to our kitchen."},{"reviewerName":"Kitty Bernardo","rating":"5.0 out of 5 stars","reviewTitle":"Great buy. Saved us lots of money , don't need to buy lunch","reviewDate":"September 26, 2019","reviewText":"So my boss asked me to purchase an air fryer for our pantry. Lot of choices but I picked this one as it compliments the color of the pantry counter. There's a lot of cheaper ones than this but I went ahead and bought it. I have bought cbaby cameras from this brand - (gift incentive requested by employees) and so far the quality is ok. So the brand is quite familiar on our office.\nOverall worked as expected. Did its job, we also saved a lot not buying lunch outside. cooks meals without being very messy. Very very good buy, now we need another one because everyone wants to use it at the same time. It is also very easy to clean"},{"reviewerName":"Enyi","rating":"5.0 out of 5 stars","reviewTitle":"This Air Fryer is a Life Changer!!","reviewDate":"August 27, 2019","reviewText":"This product is one of the best investments ever! It has a big compartment for food that allows you to put in more than enough food for yourself and others. It has settings that have automatic times and temperatures, that can be adjusted manually, for easy cooking! It helps save so much time! It comes with a recipe book that gives you many ways to cook with it! The best part about it is that it its compartments can be put in the dishwasher! Tip: Do not press the eject button when taking the compartment out! 20/10 product!"},{"reviewerName":"Mika","rating":"5.0 out of 5 stars","reviewTitle":"Great air fryer","reviewDate":"September 9, 2019","reviewText":" I was a bit skeptical at first, especially worrying about the taste.\n\nSince it came, we’ve really changed our diet. It’s amazing how easy it is to use, and in particular clean. Without the added oil, it’s just a quick wash and done! It’s hard to imagine our kitchen without it anymore, especially after trying a few potato varieties.\nI love that has already some options I o set and is very silence\nHighly recommended!"},{"reviewerName":"Angeli","rating":"5.0 out of 5 stars","reviewTitle":"The best for frozen fries!","reviewDate":"September 16, 2019","reviewText":"Ever tried cooking frozen fries in an oven? It takes forever! And they don't crisp up. The air fryer is amazing for crispy and delicious frozen fries. It only takes about 20 minutes and there you have it - deep fried like fries but without the oil.\n\nWe love our new air fryer, it is easy to use and has lots of different settings. We also cook chicken drumsticks in the air fryer and they come out perfect with crispy skin. Definitely recommend!"},{"reviewerName":"Olena Negovielova","rating":"5.0 out of 5 stars","reviewTitle":"Easy to cook and clean","reviewDate":"September 19, 2019","reviewText":" I try to eat a healthy foods, but I really like fried potatoes and chicken and my son love fries. but in fried foods a lot of oil and chalesterol is not good for us. When I bought air frier it became our favorite subject in the kitchen😂. we cook with air frier every day. and it is very tasty! even tastier than with oil! And it’s easy to cook and clean. I am really happy with my new air frier."},{"reviewerName":"Cindy","rating":"5.0 out of 5 stars","reviewTitle":"Love it !","reviewDate":"August 29, 2019","reviewText":"Very happy with my new air fryer. I had wanted one of these for years and finally got the chance to find this really good one, here on Amazon. I can cook up French fries, make mozzarella sticks, I can even dehydrate meat for my husband and all kinds of other recipes simple and easy. It came with a recipe book and all the parts that I needed to have a really good air frying experience. It cleans up nice too. Very satisfied with my purchase."},{"reviewerName":"Aliya Mosavi","rating":"5.0 out of 5 stars","reviewTitle":"Oil free!","reviewDate":"September 23, 2019","reviewText":" This air fryer is great kitchen addition. I have cooked bacon , steak,chicken and potato with this and I haven’t had any issues with it. I also have tried some of recipes and they all came out great.\nIt is easy to use and wash . It cook quickly and it is not noisy; you can just hear the air moving. It works like convenient oven. I am very happy with this air fryer."},{"reviewerName":"Cindy","rating":"5.0 out of 5 stars","reviewTitle":"Highly recommend","reviewDate":"September 22, 2019","reviewText":"I always wanted a air fryer and now I finally got one, I love this product, I love how easy it is to use it and to clean it. It came with instructions and it was really easy to follow. The food does turns out better in the air fryer , it’s more crispy, less oil, and it’s more healthier. I thought I would be too small when I came through the mail but it turns out to be the perfect size! Highly recommend this product!!"},{"reviewerName":"Em","rating":"5.0 out of 5 stars","reviewTitle":"Awesome!","reviewDate":"September 2, 2019","reviewText":"I was so excited to finally get an air fryer and it's great! I just have it for myself but if you're using it to cook for a family you might need a bigger size. Easy to use and works really well. I made some awesome tempura fish tacos and the fish turned out great - I'd probably use more battery next time but it came out brown and crispy and not overdone. Very excited to try other stuff in the air fryer"},{"reviewerName":"Dennys Daniel","rating":"5.0 out of 5 stars","reviewTitle":"Very good quality, I recommend it","reviewDate":"September 29, 2019","reviewText":"I can cook anything with this, and it's also great for cooking french fries and nuggets in fast food places. I love the touch screen function, it makes it look very high tech! It's easy and using it heats up very fast and what I love about using this is that I'm pretty sure my hands are safe from oil splashes.\nI will definitely use this as a healthier way to cook food too."},{"reviewerName":"Cloudblue","rating":"5.0 out of 5 stars","reviewTitle":"Great electric air fryer","reviewDate":"September 20, 2019","reviewText":"Since everyone is talking about how great the electric air fryer it is, and I saw my sister's electric air fryer is really nice. I get this 3.7 QT air fryer. I love it! I can cook my hashbrowns, fries, bacon, Mozzarella sticks and more with less oil. I also tried to cook the shrimps, steaks, pork chops and it all working great. I don't need to smell the oil smell in my bedroom anymore."},{"reviewerName":"Ab Rao","rating":"5.0 out of 5 stars","reviewTitle":"Sleek | Modern | Works!","reviewDate":"September 3, 2019","reviewText":" This is a 3.4 quart air fryer which actually works!\nAir fryer is a device which basically acts like a small electric oven and uses forced air to speeden up the process.\nThis one is stylish and comes with 6 preset options which can be used to substitute similar items.\nAir fryer works best for frozen food which needs deep frying!"},{"reviewerName":"Crystle","rating":"5.0 out of 5 stars","reviewTitle":"Healthy fried foods","reviewDate":"September 9, 2019","reviewText":"This is such a nice air fryer! I love the crispyness of food when it’s fried but it’s so unhealthy and hurts my stomach to the point it’s just not worth it. This gives me the crisp and crunch I’m craving but without all the fatty unhealthiness of deep frying so I can have some of my favorite foods again. I can’t wait to cook even more with it and find new recipes on Pinterest!"},{"reviewerName":"Christina","rating":"5.0 out of 5 stars","reviewTitle":"Great product","reviewDate":"September 1, 2019","reviewText":" Great product, cooks evenly and proficient. I love how sleek this looks and it's comparable in price to other air fryers. Easy to use and my son can use it too. We have another that you turn the knob for temp and then for time, this is digital and much easier to use and see what you are doing. We live this abdbit bigger than the one we had."},{"reviewerName":"Cristy","rating":"5.0 out of 5 stars","reviewTitle":"Great air fyer","reviewDate":"August 26, 2019","reviewText":" It's really good size and heats up fast. I bought for my mom and I'm hoping she loves it because she wanted one. So this is the simplest I can do for her and shes a elderly so I think this is perfect and easy for her to understand. Simple to clean. Might get another for my sister. But overall this is great 😁"},{"reviewerName":"YaniK","rating":"5.0 out of 5 stars","reviewTitle":"Very convenient and easy to use","reviewDate":"October 3, 2019","reviewText":"My friend recommended me this air fryer and I am really happy with the purchase. Frankly I'm not a very good cook, so it's really important to me that this product makes cooking fast and easy. So far so good. The little cook book is a good bonus. Made chicken breast and banana bread today and it took maybe an hour all together"},{"reviewerName":"Lawrence","rating":"5.0 out of 5 stars","reviewTitle":"Great air flyer","reviewDate":"September 15, 2019","reviewText":"This air flyer is so easy to operate. Modern design with led touchscreen display. Oil free and healthy cooking still can cook quickly and crispy. Really time saver and does frozen food really well. Enough long wire and detachable nonstick basket made it easy to clean and convenient. Work perfectly. Price reasonable."},{"reviewerName":"Toni Allison","rating":"5.0 out of 5 stars","reviewTitle":"Love This Product!","reviewDate":"September 3, 2019","reviewText":"I ordered this Air Fryer so I can start cooking healthier. I so wish I has ordered sooner! This Air Fryer is so easy to use. The instructions are complete which is great. I have fried chicken and zucchini, plus much more. The chicken legs only took 15 minutes and the outside was as crispy as frying in a skillet. Love it!"},{"reviewerName":"Amy","rating":"5.0 out of 5 stars","reviewTitle":"Healthy","reviewDate":"September 25, 2019","reviewText":"I read a lot of comments before I decided to buy it! Really didn't let me down! It is so amazing! Just spray a little oil on the surface. So fast! Save fuel and save time! My chicken and chips are so crisp! Just a little oil or even not needed! Super healthy! I am very enjoyable! Absolutely five stars!"},{"reviewerName":"JESUSFREE","rating":"5.0 out of 5 stars","reviewTitle":"Great deal for a large air fryer","reviewDate":"September 23, 2019","reviewText":"this air fryer has very big capacity, can cook meals for 2 people. Digital display looks nice and hopefully it can functioning as long as those mechanical buttons. The bottom pan tray has two pieces and easy to separate them for cleaning. It can be dishwashed but I am comfortable with hand wash."},{"reviewerName":"MINH","rating":"5.0 out of 5 stars","reviewTitle":"Working like a Champ","reviewDate":"September 8, 2019","reviewText":"The air fryer is easy to use. All the instructions and times are on the display screen. Pretty easy to set up and the bucket is large so you can do a big amount of food. I have done chicken, potato, and fish and the heat is working very well. Food is already done perfectly and cook thoroughly."},{"reviewerName":"Go Vols","rating":"3.0 out of 5 stars","reviewTitle":"Mine came what appeared to be used","reviewDate":"October 20, 2019","reviewText":"I havent decided whether I am going to send this back. It came opened up, the basket itself is scratched, no cookbook or instructions, and the top was dirty with fingerprints.\n\nHaving said that, it does make pretty good fries. But I am a bit ticked so might get another brand."},{"reviewerName":"JLH","rating":"5.0 out of 5 stars","reviewTitle":"My new best friend","reviewDate":"August 31, 2019","reviewText":" I can't believe it took me this long to get an air fryer. Not only did my food cook much faster than it ever has in the oven, but it is a lot more crispier. This was a great investment and it is much healthier than frying food in grease."},{"reviewerName":"Ella","rating":"5.0 out of 5 stars","reviewTitle":"Really fancy fryer","reviewDate":"September 21, 2019","reviewText":"Really fancy fryer. I used it to make french fries. They came out good. I used the recipe book which came with it and I followed exact instructions.\n\nI also like design and touch panel, really looks cool!! Not stick inside side was very easy to clean."},{"reviewerName":"Ehab Abdellatif","rating":"5.0 out of 5 stars","reviewTitle":"Like it","reviewDate":"September 18, 2019","reviewText":" It’s very good air fryer really I like it and my wife loves it , takes little oil to frying 2 pounds of potatoes , able to frying whole chicken, so easy to clean it , not heavy if wanna to change their place."},{"reviewerName":"Meimei","rating":"5.0 out of 5 stars","reviewTitle":"Healthy cooking device","reviewDate":"September 11, 2019","reviewText":"After doing lots of research, I purchased this product and the meat it cooked was DELICIOUS and healthy as well! From the bottom of the pan you can definitely tell how much oil it squeegee out from the meat itself! I love this product so much!"},{"reviewerName":"Sara","rating":"5.0 out of 5 stars","reviewTitle":"Excellent air fryer","reviewDate":"September 22, 2019","reviewText":"I have used this air fryer several times and everything I have made comes out perfect. Fully cooked on the inside and crispy on the outside. Receipe provided along with the product is simply best. It comes apart easily and clean up is a snap"},{"reviewerName":"SYDNEY NGUYEN","rating":"3.0 out of 5 stars","reviewTitle":"It was not non-stick frying-pan!","reviewDate":"November 2, 2019","reviewText":"Firstly, I really like this one, it is very easy to use and very quickly. However, it was not non-stick frying-pan. After using 3 times, it became like this. I dont know if air fryer has a same problem but I have to return it. So sad!"},{"reviewerName":"comfyshoes","rating":"5.0 out of 5 stars","reviewTitle":"OMG, Literally the Best Pork Chop I’ve Ever Had.","reviewDate":"October 23, 2019","reviewText":"Just got my Baggotte today. I came home from work super tired but wanted to try out this baby! So I made pork chops in it. I seasoned them and lightly floured 3 large pork chops (no oil at all) at 360 degrees for 30 minutes—perfection!\n\nWhere have y’all been all my life?"},{"reviewerName":"Tinmap","rating":"5.0 out of 5 stars","reviewTitle":"Easy to use.","reviewDate":"September 5, 2019","reviewText":"I am surprised at this product. Its so easy to use, not complex like other electronic products. I have my seafood, bread or meat grilled just very fast and no fat left. It is also easy to clean. Love it!"},{"reviewerName":"Kimberly Craven","rating":"5.0 out of 5 stars","reviewTitle":"The Perfect Air Fryer","reviewDate":"October 8, 2019","reviewText":"I love how easy it is to use, and I use it on a daily basis. Whether I'm making chicken nuggets or french fries, it works perfectly every time. I put everything in this. Works well for veggies too."},{"reviewerName":"Anastasiia","rating":"5.0 out of 5 stars","reviewTitle":"Very nice.","reviewDate":"September 23, 2019","reviewText":" So useful thing! I’m so happy to have such amazing helper. Very good quality and easy to use! Really safe my time and health.\nAlso great modern design."},{"reviewerName":"Kiki","rating":"5.0 out of 5 stars","reviewTitle":"Best air fryer ever","reviewDate":"September 8, 2019","reviewText":"I have owned many air fryers and this one is the best so far. I can make very crispy chicken wings, fries,... very easily. I love that it's also very easy to clean and use. Perfection!"},{"reviewerName":"MUSTAFA E.","rating":"5.0 out of 5 stars","reviewTitle":"Healthy and practical","reviewDate":"October 12, 2019","reviewText":"This is the first time i used air fryer. I liked it because i can fry fries with a little amount of oil so i can eat healthy fries. The taste and flavor is also satisfactory."},{"reviewerName":"Rosa","rating":"5.0 out of 5 stars","reviewTitle":"A very good item","reviewDate":"August 26, 2019","reviewText":" This is a magical item for the kitchen. My hubby loves a lot. He loves eating healthy and this has been his health keeper. He just loves it."},{"reviewerName":"syonelove","rating":"5.0 out of 5 stars","reviewTitle":"Easy to use","reviewDate":"September 19, 2019","reviewText":"This is my first time using air fryer and I like it so far. I made some chicken dumplings and they came out great. I used 1st setting and just watched them."},{"reviewerName":"Miss Daisy","rating":"5.0 out of 5 stars","reviewTitle":"Mess free healthier crunch","reviewDate":"September 5, 2019","reviewText":"This works so well! All my friends were raving about how wonderful it is to have that fried texture without all the gross oil and this machine does the trick!"},{"reviewerName":"Olivia lan","rating":"5.0 out of 5 stars","reviewTitle":"stylish and practical kitchen appliance.","reviewDate":"October 1, 2019","reviewText":"I really like this stylish and practical home kitchen appliance. It does not use oil for fried foods. It can save cooking oil and is good for health."},{"reviewerName":"Jay","rating":"5.0 out of 5 stars","reviewTitle":"Fast cook and easy to usr","reviewDate":"September 20, 2019","reviewText":"This air fry is very easy to set up and make the food ready very quickly. We have used it to make chicken wings and it is so delicious with this air fry."},{"reviewerName":"EEY","rating":"5.0 out of 5 stars","reviewTitle":"I love it","reviewDate":"August 25, 2019","reviewText":"I have one at home and this one is for the office. I just received it today and could not wait to have some chicken nuggets. Huge capacity. It is beautiful."},{"reviewerName":"Nathan Mahon","rating":"5.0 out of 5 stars","reviewTitle":"Awesome air fryer","reviewDate":"September 16, 2019","reviewText":"This air fryer is awesome! Until now we used it twice. We have cooked French fries and nuggets. It is great. The programmed options, the ease of using and cleaning."},{"reviewerName":"hulya","rating":"5.0 out of 5 stars","reviewTitle":"It came right on time","reviewDate":"August 25, 2019","reviewText":"The design is really nice. It is so useful. Only one spoon of oil is enough. It is much healthier than fried stuff. I loved it. I would really recommend it."},{"reviewerName":"Fizza Ijaz","rating":"5.0 out of 5 stars","reviewTitle":"Amazing fryer!","reviewDate":"September 12, 2019","reviewText":" Love it! Really healthy and does a great job. Love the color and sleek look !"},{"reviewerName":"atl1dxg","rating":"5.0 out of 5 stars","reviewTitle":"Whaaaattttt!","reviewDate":"October 21, 2019","reviewText":"Absolutely awesome! Made perfect fries...Made unbelievable wings!"},{"reviewerName":"Mindy","rating":"5.0 out of 5 stars","reviewTitle":"Easy to use","reviewDate":"September 23, 2019","reviewText":"This air fryer is great. It easy to maintain and use than a traditional deep fryers. It save my time to cooking. Love it."},{"reviewerName":"Linda Xie","rating":"5.0 out of 5 stars","reviewTitle":"Love this Air Fryer! Great for seafood and vegetables","reviewDate":"November 6, 2019","reviewText":"Made a lot of great meals with this – all super fast and easy."},{"reviewerName":"VBraziel","rating":"1.0 out of 5 stars","reviewTitle":"Not really good quality","reviewDate":"November 10, 2019","reviewText":" I have had this for less than a year and it’s not working anymore.... also the basket is all rusted already. And I paid more that what is selling for now, save your money"},{"reviewerName":"GotCats?","rating":"3.0 out of 5 stars","reviewTitle":"Seemed good, now not too sure.","reviewDate":"November 10, 2019","reviewText":"The first use was amazing. Made wings and they were so crispy and delicious.\nA few days later, went to use it for the second time and the metal fan inside started making a horrible metal on metal rubbing sound.\nWill update on function as we continue to use it."}],"qAndA":[{"question":"Is the basket stainless steel or metal?","answer":"It's not stainless steel, becareful not to damage the non-stick coating."},{"question":"Does anybody know the measurements? Thanks.","answer":"14” high and diameter"},{"question":"Is this oilless? is it mean I don't need to put any oil to make it fry?Can I use this product to reheat leftover pizza, wings or any other fried f","answer":"Dear customer\nWe are happy to assist you with your inquiry about Bagotte 3.7QT White Air Fryer.\n… see more"},{"question":"How much food does it cook at once? Anyone have examples? I have a family of 3.","answer":"three large potatoes, three pieces of fish, about 2 lg stake cut in pices. overall very good size for family of 3"},{"question":"Is the any warranty on this air fryer?","answer":"I think so."},{"question":"How loud is this unit?","answer":"It's comparable to the low fan vent setting on our stove. We are just fine with it, but this is our first air fryer so can't say how it compares with other units."},{"question":"what are the dimentions of the fryer's basket?","answer":"I don’t know, but is big for a family of four"},{"question":"Does the basket get stuck when cooking? Ive had a problem in the past that when I'm cooking and pull out the drawer, it sticks when pushing back in.","answer":"Nope. No issue with that thus far!"},{"question":"How much food does this hold ?","answer":"A lot"},{"question":"How long is warranty on air fryer? Return policy?","answer":"I think 18 months"},{"question":"Should the basket be seasoned like you would a non-stick pan?","answer":"You can if you want, but you don’t have to if you don’t want to."},{"question":"can i fry 2 burgers at one time?","answer":"small ones, yes. not the super burgers but ones bun sized before cooking yes"},{"question":"Does the taflon peel off on the basket??","answer":"Not yet"},{"question":"Can this cook frozen food like chicken and beef?","answer":"it can, it comes with a book with some setting but I find blogs with recommended times for different meats. I can put chicken tenders straight into it, on the higher time for chicken and don't have any issues."},{"question":"Does Bagotte air fryer come with recipes?","answer":"Yes,with a recipe book."},{"question":"Is the outside white or stainless? Thank you.","answer":"Mine is white outside."},{"question":"Do you need to season the basket with coconut oil before using the first time?","answer":"I don’t see that being a requirement anywhere."},{"question":"how many chicken wing sections can it cook at a time?","answer":"You can stick a lot in there, but usually you only want around 8 - 10 at a time. Otherwise, they don't cook evenly because they're stacked on top of each other.\n\nIt really depends on the size of the wings/drums. Get the party wings, if possible."},{"question":"How many minutes can you cook foods using this?","answer":"Depends on what you are cooking, raw meats (fish, chicken) 15-20 mins. Finger foods take about 10 to 15 mins."},{"question":"Can this do breaded foods? like if I make a batter and fry up some fish or cheese curds?","answer":"so far I have only used frozen battered food, and it works great, I would lightly freeze what I was cooking if it is battered first. I have make boneless chicken thighs that were not frozen and they were really good, but they were not battered. I think if the batter isn't partially frozen it would me very messy."},{"question":"How does it compare in cooking times with a deep fryer?","answer":"It's much healthier and taste better"},{"question":"Is there any plastic on the interior of the fryer that?","answer":"Not that I see"},{"question":"can you open the basket to check the food in the middle of cooking cycle?","answer":"Yes, the fryer will actually beep at the halfway point indicating that you should shake the basket and you can also open the basket at any time and it will resume whee it left off."},{"question":"How easy is it to clean?","answer":"Very"},{"question":"Is it easy to clean？ Is it dishwasher safe?","answer":"Thank you for this question! Yes, Bagotte 3.7QT Air Fryer is easy to clean,dishwasher safe. If you add much sauce and oil, you can layer the foil on the basket, which will make cleaning a lot easier.\nHope this helps! If any further question you have, feel free to contact us through Amazon Message."},{"question":"Can I roast a whole chiken with a few potatoes in it?","answer":"probably not"},{"question":"Will raw, french fried cut potatoes get the crispy finish or only the frozen ones?","answer":"Yes delicious!"},{"question":"For a family of three, what size would you recommend?","answer":"The 3.5L is a great size for a family of three. Cooked it for three on several occasions with plenty of room to spare."},{"question":"How many chicken wings can you cook at once ?","answer":"Haven’t cooked wings only legs"},{"question":"Does it leave oil smell?","answer":"no"},{"question":"Is it noisy?","answer":"Actually it does made some noisy! Like Bibi sound!"},{"question":"Has anyone cooked shrimp or fish with this? I live in Mississippi and seafood is a staple.","answer":"yes"},{"question":"Is it easy to clean？ Is it dishwasher safe?","answer":"Don,t know, I don’t use the dishwasher"},{"question":"Can you fry fish in this air fryer?","answer":"The first time I tried breaded fish it didn’t work well. It stuck to the lightly sprayed surface. I think if I had pre-heated it would work better. I tried fresh trout , unbreaded with a light spray of Olive Oil and seasoning and it was delish."}]}